{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-950a5746320338933f77ee67f04c39e5d4c40144f8c92626c879d6e287c1655c-10",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603739E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED ELECTRONICS TECHNOLOGIES"
        },
        "R1LineNumber": {
            "val": "56"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "78.984"
            },
            "CurrentYear": {
                "val": "49.807"
            },
            "BudgetYearOne": {
                "val": "79.173"
            },
            "BudgetYearOneBase": {
                "val": "79.173"
            },
            "BudgetYearTwo": {
                "val": "81.110"
            },
            "BudgetYearThree": {
                "val": "126.359"
            },
            "BudgetYearFour": {
                "val": "165.172"
            },
            "BudgetYearFive": {
                "val": "165.172"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Electronics Technologies program element is budgeted in the Advanced Technology Development Budget Activity because it seeks to design and demonstrate state-of-the-art manufacturing and processing technologies for the production of various electronics and microelectronic devices, sensor systems, actuators and gear drives that have military applications and potential commercial utility.  Introduction of advanced product design capability and flexible, scalable manufacturing techniques will enable the commercial sector to rapidly and cost-effectively satisfy military requirements.\n\nThe MicroElectroMechanical Systems (MEMS) and Integrated Microsystems Technology project funded a broad, cross-disciplinary initiative to merge computation, power generation, sensing, and actuation to realize new technologies for perceiving and controlling weapons systems and battlefield environments. Using fabrication processes and materials similar to those used to make microelectronic devices, this project applied the advantages of miniaturization and integrated microelectronics to the design and construction of integrated electromechanical and electro-chemical-mechanical systems. The project addressed issues that ranged from the scaling of devices and physical forces to new organization and control strategies for distributed, high-density arrays of sensor and actuator elements. The resulting technologies will be applied to microscale precision, navigation, and timing systems; microscale components that survive harsh environments; and tactically-relevant MEMS systems that operate in a variety of thermal and vibration environments.\n\nThe Mixed Technology Integration project funds the advanced development and demonstration of selected basic and applied electronics research programs. Examples of technologies with funded development and demonstration activities include, but are not limited to: (1) self-contained laser weapon systems to protect airborne platforms from emerging surface-to-air missiles; (2) integrated photonic-electronic components for positioning, navigation and timing in GPS-denied environments; (3) flexible, software-defined cameras that enable real-time image analysis of complex scenes to provide more actionable information; and (4) component programs that integrate mixed signal (analog and digital) or mixed semiconductor technology to substantially improve the capability of existing components and\/or reduce their size, weight and power. Funding under this project is intended to advance transitioning novel technologies to use, providing advanced components compatible with mid-term\nand other future warfighting requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "76.021"
                },
                "CurrentYear": {
                    "val": "49.807"
                },
                "BudgetYearOne": {
                    "val": "74.033"
                },
                "BudgetYearOneBase": {
                    "val": "74.033"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.984"
                },
                "CurrentYear": {
                    "val": "49.807"
                },
                "BudgetYearOne": {
                    "val": "79.173"
                },
                "BudgetYearOneBase": {
                    "val": "79.173"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.963"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.140"
                },
                "BudgetYearOneBase": {
                    "val": "5.140"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "6.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.038"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "5.140"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.140"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.  \nFY 2017:  N\/A\nFY 2018:  Increase reflects Rapid Array Development (RAD), Radio Frequency Collaborative Unmanned Distributed System (RF CLOUDS), and Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID) new start programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MT-12"
                    },
                    "ProjectTitle": {
                        "val": "MEMS AND INTEGRATED MICROSYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.470"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The MicroElectroMechanical Systems (MEMS) and Integrated Microsystems Technology project funded a broad, cross-disciplinary initiative to merge computation, power generation, sensing, and actuation to realize new technologies for perceiving and controlling weapons systems and battlefield environments.  Using fabrication processes and materials similar to those used to make microelectronic devices, this project applied the advantages of miniaturization and integrated microelectronics to the design and construction of integrated electromechanical and electro-chemical-mechanical systems.  The project addressed issues that ranged from the scaling of devices and physical forces to new organization and control strategies for distributed, high-density arrays of sensor and actuator elements.  The resulting technologies could be applied to microscale precision, navigation, and timing systems; microscale components that survive harsh environments; and tactically-relevant MEMS systems that operate in a variety of thermal and vibration environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Micro-Technology for Positioning, Navigation, & Timing (micro-PNT)"
                                    },
                                    "Description": {
                                        "val": "The Micro-Technology for Positioning, Navigation, & Timing (micro-PNT) program developed low-cost, size, weight, and power (CSWaP) sensors and timing devices for navigation in GPS-degraded environments.  The program primarily focused on improving microelectromechanical systems (MEMS) sensors, which currently display limited performance but excellent CSWaP, and miniaturizing atomic gyroscopes and clocks, which are currently limited to laboratory experiments because of their complexity and high CSWaP.  To enhance MEMS sensor performance and realize low-CSWaP atomic sensors, the program developed novel microfabrication processes, investigated new material systems, and contributed to the understanding of error sources.  Innovative microfabrication techniques development allowed co-fabrication of dissimilar devices on a single chip that enabled the required clocks, gyroscopes, accelerometers, and calibration components to integrate into a small, low-power architecture.  Ultimately, low-CSWaP inertial sensors and clocks enabled ubiquitous guidance and navigation on all platforms, including guided munitions, unmanned aerial vehicles (micro-UAVs), and mounted and dismounted soldiers.  Service labs have been actively involved throughout the program and are facilitating transition of micro-PNT technology to Service-led programs for further development and testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.470"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated an atom interferometer gyroscope meeting the Phase 2 angle random walk milestone in a package smaller than 200 cm3 (approximately smartphone-sized).\n-  Demonstrated a 3D birdbath resonator with ringdown time > 100 seconds and developed control electronics to implement a rate-integrating micro-gyroscope.\n-  Demonstrated MEMS gyroscopes and accelerometers, in a single-chip MEMS inertial measurement unit, with tactical-grade performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MT-15"
                    },
                    "ProjectTitle": {
                        "val": "MIXED TECHNOLOGY INTEGRATION"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "76.514"
                        },
                        "CurrentYear": {
                            "val": "49.807"
                        },
                        "BudgetYearOne": {
                            "val": "79.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "79.173"
                        },
                        "BudgetYearTwo": {
                            "val": "81.110"
                        },
                        "BudgetYearThree": {
                            "val": "126.359"
                        },
                        "BudgetYearFour": {
                            "val": "165.172"
                        },
                        "BudgetYearFive": {
                            "val": "165.172"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Mixed Technology Integration project funds the advanced development and demonstration of selected basic and applied electronics research programs.  Examples of technologies with funded development and demonstration activities include, but are not limited to: (1) self-contained laser weapon systems to protect airborne platforms from emerging surface-to-air missiles; (2) integrated photonic-electronic components for positioning, navigation and timing in GPS-denied environments; (3) flexible, software-defined cameras that enable real-time image analysis of complex scenes to provide more actionable information; and (4) component programs that integrate mixed signal (analog and digital) or mixed semiconductor technology to substantially improve the capability of existing components and\/or reduce their size, weight and power.  Funding under this project is intended to advance transitioning novel technologies to use, providing advanced components compatible with mid-term and other future warfighting requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Endurance"
                                    },
                                    "Description": {
                                        "val": "The Endurance program aims to develop laser technology to protect airborne platforms from emerging and legacy electro-optical\/infrared (EO\/IR) guided surface-to-air missiles.  Endurance is planned to have an open architecture, granting the flexibility to integrate different subsystems with varying capabilities.  Endurance is an early application of technology developed through DARPA's Excalibur program and is planned to transition to the Services.  The advanced technology component of the program will focus on developing and field testing various subsystems for laser beam generation, command and control, threat missile warning, target acquisition and tracking, beam control, energy storage and delivery, and thermal management.  It will also develop subsystem interfaces and integrate the components into a packaged system for field testing.  An applied research component of the program, which focuses on miniaturizing and reducing the weight of subsystems, is budgeted in PE 0602702E, Project TT-06."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Built and tested critical subsystems; all subsystems met or exceeded required specifications.\n-  Completed integration of subsystems into the pod structure and ran initial connection checks.\n-  Completed test plan for field testing at White Sands Missile Range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.307"
                                            },
                                            "Text": {
                                                "val": "-  Test the brassboard laser weapon system at outdoor test ranges against a representative set of static and live-fire threat targets.\n-  Assess brassboard system performance in live-fire testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a preliminary engineering design for a flight-prototype of a pod-mounted laser weapon system.\n-  Perform environmental testing to assess performance under stressing vibrational and temperature conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program aims to develop inertial sensor technologies for positioning, navigation, and timing (PNT) in GPS-denied environments.  These inertial sensors can provide autonomous PNT information when GPS is unavailable.  The program will exploit recent advances in integrating photonic (light-manipulating) components into electronics and in employing microelectromechanical systems (MEMS) as high-performance inertial sensors for use in extreme environments. Whereas conventional MEMS inertial sensors suffer from inaccuracies due to factors such as temperature sensitivity, photonics-based PNT techniques have demonstrated the ability to reject these inaccuracies.  PRIGM will focus on two areas: (1) By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms; and (2) By 2030, it aims to develop Advanced Inertial MEMS Sensors (AIMS) that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances should enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power (SWaP) inertial sensors with high bandwidth, precision and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service Laboratories to perform TRL-7 field demonstrations.  The ultimate goal is to develop a complete MEMS-based NGIMU with a mechanical\/electronic interface identical to existing DoD-standard tactical-grade MEMS IMUs, providing a drop-in replacement for existing DoD systems.  Service laboratories have been actively involved throughout program development and remain engaged to facilitate transition of NGIMU prototypes, which will be delivered at the program conclusion.  This program has basic research efforts funded in PE 0601101E, Project ES-01 and applied research efforts funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed preliminary design, fabrication, and characterization of MEMS gyroscopes meeting stability and repeatability specifications consistent with navigation-grade performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform, fabrication and characterization of MEMS inertial sensors meeting stability and repeatability specifications consistent with navigation-grade performance.\n-  Demonstrate and deliver five MEMS gyroscopes meeting stability and repeatability specifications consistent with navigation-grade performance.\n-  Demonstrate and deliver five MEMS accelerometers meeting stability and repeatability specifications consistent with navigation-grade performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Deliver five MEMS gyroscopes meeting environmental requirements (vibration, shock survivability, operation over temperature).\n-  Deliver five MEMS accelerometers meeting environmental requirements (vibration, shock survivability, operation over temperature).\n-  Commence development of MEMS-based, navigation-grade, integrated IMU meeting program-defined SWaP and performance metrics, excluding environmental requirements and shock survival."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Imaging (ReImagine)"
                                    },
                                    "Description": {
                                        "val": "The Reconfigurable Imaging (ReImagine) program aims to create multi-functional readout integrated circuits (ROICs) that fundamentally change the way camera systems collect, process and relay image information. ReImagine builds upon the multifunctional imager concept in the Pixel Network (PIXNET) program which is budgeted in PE 0602716E, Project ELT-01. Where PIXNET focused on multiple functions in the detector layer, ReImagine adds multifunctional flexibility in the ROIC. Today, most cameras are designed to capture high quality imagery at standard frame rates.  These traditional camera architectures collect a single type of data across the full image frame.  Specialty cameras can be used to capture different spatial, spectral or temporal data but are rarely deployed because of the cost and complexity of adding imaging subsystems for niche measurements.  Although these measurements are typically only desired for specific features or regions of interest (ROIs) in a scene, the cameras collect the specialized data over the full image frame.  The ReImagine architecture, conversely, would enable a single, real-time reconfigurable, software-defined camera system with the ability to collect different data in different ROIs.  Depending on the need, a ReImagine imager would be able to selectively collect and simultaneously process data from specific ROI, for example, at a higher resolution (i.e., foveated imaging), at a higher frame rate or with 3-D depth information.  The system would interface with virtually any sensor and could therefore be used in any spectral band.  By demonstrating more efficient data collection and computation across ROIs, ReImagine ROICs should enable real-time analysis of much more complex scenes and provide more actionable information than has ever been possible.  Technologies from this program are intended for transition to the Air Force, Navy and Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.042"
                                            },
                                            "Text": {
                                                "val": "-  Completed the preliminary study phase that will develop application requirements, as well as the design of a prototype camera."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.500"
                                            },
                                            "Text": {
                                                "val": "-   Design, and deliver the GFE digital ROIC configuration software to industry performers.\n-   Successfully map multi-function processing algorithms to the ROIC layer using custom software tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.173"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.173"
                                            },
                                            "Text": {
                                                "val": "-  Begin initial development of the 2nd generation ReImagine chip, which will expand functionality of the data flow options off of the ROIC while providing in-sensor processing options.\n-  Begin process development for 3-D integration of the ReImaging prototype camera.\n-  Demonstrate the benefits of multifunctional capability, particularly showing the ability to change from time sensing to spatial sensing dynamically and focusing on only relevant regions of interest within the camera view."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Array Development (RAD)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Array Development (RAD) program seeks to leverage recent developments in flexible and adaptive radio frequency (RF) hardware, access to a larger variety of more powerful computing platforms, and advances in software virtualization to radically change the development and deployment cycle for electromagnetic (EM) arrays. EM arrays, which enable communications, radar and electronic warfare (EW), are currently high performance but slow and costly to create.  In contrast, they must evolve rapidly in order to adapt to new modes of operation and changing operating parameters associated with modern military threats.  However, the available design and test infrastructure is not flexible enough to support testing and fielding new EM array algorithms across a wide variety of military platforms.  Furthermore, EM software and hardware are often developed in separate silos; as a result, implementing new EM applications in hardware tends to require a lengthy and expensive development process with extended cycles of iteration between the two areas.  RAD will therefore focus on three core areas: (1) making ultra-flexible testbeds for existing and future EM arrays accessible to the DoD community; (2) reducing the complexity of phased array hardware through high level abstraction; and (3) speeding up EM system development time through hardware\/software co-design.  In light of changing requirements, the resulting technologies would also enable DoD greater reuse of its available hardware resources while minimizing the need to modify specialized EM systems, leading to improved and simplified upgrade cycles.  Technologies developed under the RAD program are planned for transition to the services through a series of demonstrations proving the radically shorter time scale of development."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of a flexible array testbed that will be the common hardware platform for an applications development environment.\n-  Initiate development of a processing platform capable of executing EM algorithms, array configuration, data flow and end-user interactions.\n-  Initiate development of cloud-based applications to facilitate rapid re-configuration of an array platform without having to modify existing hardware. \n-  Explore use of toolchains and toolsets for programming on heterogeneous computing systems.\n-  Explore new models of machine learning and supervisory controls to manage complex allocation of processing resources."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID)"
                                    },
                                    "Description": {
                                        "val": "The Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID) program aims to significantly reduce the size of laser diode pump modules (DPMs) while increasing their electrical-to-optical efficiency.  DPMs are a critical component of fiber-laser array weapons systems, which combine light from many lower-power lasers to engage targets at tactically-relevant distances.  Commercial DPMs, which cater to the laser manufacturing industry, feature large cooling systems and are too cumbersome for integration into many small DoD platforms.  EUCLID plans to leverage advances in thermal management components to design, build, test, and demonstrate densely packageable, prototype DPMs that are less than half the size of their commercial counterparts.  The program will also pursue improved optical components that can more efficiently focus light from individual laser diodes.  The resulting EUCLID DPMs are intended to be available for procurement and integration into ultra-low size, weight, and power fiber-laser array weapons systems, enabling integration into a variety of Air Force, Navy, Army, and Missile Defense Agency platforms."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete critical design of a >650 Watt, >60% efficiency DPM with less than 0.31 cm3\/Watt and 0.31 grams\/Watt, including integrated thermal management and improved optical designs.\n-  Model and simulate thermal management systems to demonstrate laser diode operation at a designated temperature, given appropriate coolant temperature, flow rate, and pressure drop values. \n-  Model optical designs to demonstrate that coupling efficiency from the laser diode bars to the delivery fiber is within the overall system's electrical-to-optical efficiency budget."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Collaborative Unmanned Distributed System (RF CLOUDS)"
                                    },
                                    "Description": {
                                        "val": "The Radio Frequency Collaborative Unmanned Distributed System (RF CLOUDS) program aims to significantly reduce the size, weight and power (SWaP) of RF components to enable electronic warfare (EW), communications, and radar for next-generation unmanned autonomous systems (UAS).  High-performance RF components enable the DoD to deploy sophisticated payloads on high-value platforms.  However, new DoD concepts of operation require a significant reduction in RF hardware power consumption and size.  RF CLOUDS will develop the components required for swarms of small autonomous systems.  These RF components would work together across a swarm of nodes, sharing measurements of the electromagnetic spectrum, combining radiated energy to transmit signals, and managing unwanted energy emissions to avoid detection.  This node-based, collaborative approach is expected to allow for enhanced RF system performance while lowering the performance requirement and cost for each individual node.  These improvements would allow DoD to transition from placing high-performance RF hardware on a few high-value platforms to deploying a large number of low-cost autonomous nodes for pervasive stand-in electromagnetic access of denied areas."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the combining of distributed receiver data from COTS hardware to increase the sensitivity, dynamic range and geolocation estimation accuracy over single node performance.\n-  Demonstrate non-signal assisted distributed beamforming to inform design of chip-scale transmitter with integrated node-to-node time transfer.\n-  Design chip-scale real-time spectrum analyzer with direction finding capability and <1 W power consumption."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLASH - Scaling Fiber Arrays at Near Perfect Beam Quality"
                                    },
                                    "Description": {
                                        "val": "The FLASH program aims to demonstrate an ultra-low-size, weight, and power (SWaP) high energy laser system suitable for integration onto a range of military platforms, including unmanned aerial vehicles (UAVs) and 4th and 5th generation aircraft.  The laser system would significantly enhance the platforms defensive capabilities against electro-optical\/infrared (EO\/IR) guided missiles.  With its modular, scalable architecture, future systems could be built with output power levels in the hundreds of kilowatts, enabling a broad set of offensive mission capabilities, many of which are not possible with current technology.  To accomplish its program goals, FLASH will pursue two major thrusts.  First, FLASH aims to greatly reduce the size and weight of high-power fiber laser amplifiers, increase their power efficiency and improve their resistance to shock, vibration and acoustic stresses found on military platforms.  Second, FLASH aims to fabricate an array of these amplifiers and integrate them into a transportable system with advanced battery power, thermal management and coherent-beam combination sub-systems.  Technologies from this program are intended for transition to the Air Force, Navy, Army and Missile Defense Agency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed a critical design for a >40 kW transportable, packaged laser system.\n-  Built and tested coherent beam combining subsystem and achieved high power with excellent beam quality and combining efficiency.\n-  Built and tested line-replaceable battery unit powering a line-replaceable fiber amplifier assembly, successfully combining 4 fiber amplifier outputs with high efficiency and excellent beam quality. \n-  Began assembly of line-replaceable battery units and line replaceable amplifier units after successful testing of first production units.\n-  Integrated thermal subsystem, primary electronic control, and low power signal fibers into mechanical assembly."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete line-replaceable fiber amplifier units and integrate into >40 kW transportable, packaged laser system.\n-  Test and demonstrate the >40 kW transportable, packaged laser system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diverse & Accessible Heterogeneous Integration (DAHI)"
                                    },
                                    "Description": {
                                        "val": "The Diverse Accessible Heterogeneous Integration (DAHI) program is developing the design and manufacturing capabilities required to seamlessly integrate various semiconductors, microelectromechanical systems, photonic (light-manipulating) devices and thermal management structures into true systems-on-a-chip (SOC).  This capability would enable dramatic size, weight and volume reductions and higher performance for DoD electronic warfare, communications and radar systems.  Historically, chip designers have had to decide between the availability, development and low cost of silicon circuits or the high performance of compound semiconductor (CS) materials.  DAHI, however, builds on previous DARPA and commercial efforts, which demonstrated that heterogeneously integrating CS and silicon can yield significant performance improvements over silicon or CS alone.  DAHI's advanced technology development effort focuses on establishing a technologically mature manufacturing path for integrating a wide array of materials and devices, including CS, on a common substrate.  Relevant manufacturing processes would be made available to a wide variety of designers from the DoD laboratories, federally funded research and development centers, academia and industry.  DAHI will also support demonstrating increasingly complex circuits that leverage heterogeneous integration.  DAHI technologies are intended for transition to national security and semiconductor manufacturing partners.  This program has applied research efforts funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.472"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of a high-yield, high-reliability accessible manufacturing process flow which will be transitioned to a self-sustaining foundry activity providing heterogeneously integrated circuits with four materials\/device technologies.\n-  Completed demonstration of capability for supporting multi-project wafer runs using the heterogeneous foundry service under development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Finalize refinements of yield and reliability and coordinate with self-sustaining foundry activity to ensure successful transition of heterogeneous integration technology.\n-  Finalize the development of seamless process design kits and integrated design flows to facilitate the use of the foundry service by external users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Direct SAMpling Digital ReceivER (DISARMER)"
                                    },
                                    "Description": {
                                        "val": "The Direct SAMpling Digital ReceivER (DISARMER) program aimed to design, fabricate and test a digital wideband receiver which captures and digitizes electromagnetic (EM) spectrum signals with potential applications for electronic warfare and signals intelligence.  The hybridized receiver would integrate photonic (light-manipulating) and electronic components in a standard form factor.  Conventional digital wideband receivers are limited in their dynamic range, which determines their resilience to jammers and drives their ability to detect and record faint signals.  DISARMER sought to overcome this limitation by employing an ultra-stable optical clock, which would allow systems to sample the spectrum with greater precision.  The DISARMER receiver would improve spur-free dynamic range 100x over the state of the art and prove capable of coherently sampling the entire, tactically-relevant, X-band (8-12 GHz) portion of the spectrum.  Such a wide-bandwidth, high-fidelity receiver would also have the potential to drastically reduce the cost, size and weight of electronic warfare and signals intelligence systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Conducted a demonstration of direct sampling of a 4 GHz-wide bandwidth signal at 10 effective bits of fidelity.\n-  Tested system performance across both baseband and the entire X-band (8-12 GHz)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}