{
    "id": "2018-AirForce-PB-3600-JBOOK-857e7c42b5cd67f362a388822cdc6c6374be2f224d8defe4fb4e7b5bd4bdcb7c-5",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602202F"
        },
        "ProgramElementTitle": {
            "val": "Human Effectiveness Applied Research"
        },
        "R1LineNumber": {
            "val": "6"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "108.784"
            },
            "CurrentYear": {
                "val": "111.647"
            },
            "BudgetYearOne": {
                "val": "108.784"
            },
            "BudgetYearOneBase": {
                "val": "108.784"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "111.326"
            },
            "BudgetYearThree": {
                "val": "114.615"
            },
            "BudgetYearFour": {
                "val": "116.718"
            },
            "BudgetYearFive": {
                "val": "121.505"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program conducts applied research in the area of airmen training, airmen system interfaces, bioeffects, and understanding and shaping adversarial behavior.  The Learning and Operational Readiness project conducts research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  The Human Dynamics Evaluation project conducts research to advance machine intelligence and operator-aiding technologies by developing and applying airman-focused research for advanced intelligence, surveillance, and reconnaissance (ISR) capabilities and detecting and exploiting human signatures.  The Sensory Evaluation and Decision Science project conducts research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including remotely piloted aircraft (RPA) and adaptive teams of airmen and machines.  The Bioeffects project conducts research on the effects of human exposure to potentially toxic, operational and advanced chemicals and materials (including nanomaterials), electromagnetic (EM) energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons.  Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication. \n\nIn FY 2018, a portion of HQ AFRL S&T civilian manpower in PE 0602202F, Human Effectiveness Applied Research, was transferred to PE 0602298F, Science and Technology Management - Major Headquarters Activities, to provide increased transparency to Congress on personnel in Major Headquarters Activities (MHA).\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "110.221"
                },
                "CurrentYear": {
                    "val": "111.647"
                },
                "BudgetYearOne": {
                    "val": "114.704"
                },
                "BudgetYearOneBase": {
                    "val": "114.704"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "108.784"
                },
                "CurrentYear": {
                    "val": "111.647"
                },
                "BudgetYearOne": {
                    "val": "108.784"
                },
                "BudgetYearOneBase": {
                    "val": "108.784"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.437"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.920"
                },
                "BudgetYearOneBase": {
                    "val": "-5.920"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.436"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.920"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.920"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 due to realignment of funds for autonomy and Laser Weapon System priorities and transfer of some HQ AFRL civilian manpower to PE 0602298F, Science and Technology Management - Major Headquarters\nActivities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "621123"
                    },
                    "ProjectTitle": {
                        "val": "Learning and Operational Readiness"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "24.034"
                        },
                        "CurrentYear": {
                            "val": "23.329"
                        },
                        "BudgetYearOne": {
                            "val": "23.840"
                        },
                        "BudgetYearOneBase": {
                            "val": "23.840"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "21.986"
                        },
                        "BudgetYearThree": {
                            "val": "22.738"
                        },
                        "BudgetYearFour": {
                            "val": "22.170"
                        },
                        "BudgetYearFive": {
                            "val": "23.220"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to measure, accelerate, and expand the cognitive skills necessary to improve airmen training and mission performance.  Research is conducted in two focus areas:  continuous learning and cognitive modeling.  The continuous learning effort creates live, virtual, and constructive (LVC) environments for use in developing revolutionary simulation technologies to increase training capabilities and enhance training effectiveness and efficiency by using learning theory to improve military training and mission performance.  Cognitive modeling creates realistic models and simulations of human behavior to advance the understanding of how airmen perform complex tasks."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.334"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-Directed Effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Continuous Learning"
                                    },
                                    "Description": {
                                        "val": "Research enhances distributed mission operations (DMO) and LVC environments and identifies technology requirements for training in live and immersive environments.  Continuous learning strategies improve mission training, command and control (C2), ISR, and cyber missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.700"
                                            },
                                            "Text": {
                                                "val": "Began to implement multiple agents as synthetic white forces for cost reduction in Air Support Operations Center training. Demonstrated adaptive ISR training in training research exercise. Completed evaluations and developed specifications for in-theater C2 trainer. Demonstrated integrated RPA, C2, and joint terminal attack controller (JTAC) training and assessment in routine DMO events. Demonstrated autonomous agents for asset management in RPA operations. Continued development of the Distributed Common Ground Station (DCGS) Weapons System Trainer (DWST). Continued research to create autonomous cognitive models to function in contested environments. Completed development of common scenario generation and readiness assessment methods for joint and coalition distributed training and exercise."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.102"
                                            },
                                            "Text": {
                                                "val": "Continue development of multiple agents as synthetic white forces to support Air Support Operations Center training.  Develop, test, and validate a moderate fidelity F-35 non-proprietary simulator. Establish a baseline to evaluate first responder training gaps and support exercises to garner baseline data to quantify gaps and engineer and develop training curriculum. Complete the development of the Distributed Common Ground Station Weapons Systems Trainer. Conduct initial training effectiveness study to evaluate the transfer of training using the DWST. Begin a Fighter Integration evaluation and study to address future JSF training challenges. Develop innovative solutions for multi-level security. Support the development of cross domain solution for F-35. Demonstrate LVC in a five-eyes coalition environment.  Continue to develop specifications for secure fifth generation LVC operations to include executing a fourth and fifth generation platform study. Execute scalable studies to focus on the individualized learning and adapting the learner to the training environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.708"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.708"
                                            },
                                            "Text": {
                                                "val": "Transition automated scenario authoring tool set for Joint Theater Air Ground Simulation System (JTAGSS).  Demonstrate cross domain solution ruleset in F-35 for secure fifth generation LVC operations.  Continue to develop designs for outyear studies to execute fourth to fifth generation realistic, secure training and rehearsal events.  Conduct evaluations of identified training gaps and potential solutions to gaps for the integration of the fifth generation aircraft into a close air support environment.  Continue cyber intelligence training testbed into training research exercises.  Continue development of the Distributed Immersion Global Intel Trainer (DIGIT)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Modeling"
                                    },
                                    "Description": {
                                        "val": "Research explores application of cognitive science for performance improvement by enhancing training in mission-relevant environments (e.g., flight simulators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.227"
                                            },
                                            "Text": {
                                                "val": "For FY 2015 and FY 2016, the work for this effort was originally performed in the Continuous Learning effort.  \n\nApply predictive performance optimization to more complex warfighter training contexts.  Evaluate robustness and stability of autonomous operations in mission-relevant simulations.  Further develop mechanisms for effectiveness in human-machine teaming.  Rapidly validate complex models through massively parallel computing architectures.  Enhance constructive entities through infusion of intelligent agent technologies.  Develop personalized learning through scheduling of learning events in intelligent tutors.  Support career-wide continuous learning through development of persistent personalized learner models that may allow individual airmen training to be followed from accession to retirement.  Refine and validate integration of intelligent agents into existing training testbeds.  Apply vigilance research to long-duration missions to improve warfighter performance at the edges of human performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.132"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.132"
                                            },
                                            "Text": {
                                                "val": "Conduct studies in autonomous operations in mission-relevant simulations.  Validate autonomous training agents in LVC testbeds.  Continue to validate complex cognitive models through in computing architectures.  Initiate studies in multi-level models for performance assessment.  Continue development of personalized learning through scheduling of learning events in intelligent tutors.  Continue work in computational analysis for agent training and assessment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625328"
                    },
                    "ProjectTitle": {
                        "val": "Human Dynamics Evaluation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "26.536"
                        },
                        "CurrentYear": {
                            "val": "26.174"
                        },
                        "BudgetYearOne": {
                            "val": "24.338"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.338"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "24.718"
                        },
                        "BudgetYearThree": {
                            "val": "25.544"
                        },
                        "BudgetYearFour": {
                            "val": "26.313"
                        },
                        "BudgetYearFive": {
                            "val": "27.359"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to advance machine intelligence, information operations, and operator-aiding technologies for advanced ISR capabilities. Research is focused in the following areas: human analyst augmentation, human trust and interaction, and human signatures. The human analyst augmentation area develops, integrates, and evaluates human-centric analyst technology to develop cognitive systems engineering solutions for airman data overload, work integration, and mission performance, enhancing operationally effective ISR for the Air Force. The human trust and interaction area seeks to advance human language technologies to benefit military linguists and analysts as well as to understand, quantify, and calibrate trust factors influencing airman interaction with autonomous systems that can be applied to airman-machine teaming in future weapon systems. The human signatures area develops and applies S&T to detect and exploit a variety of human-centered signatures, including behavioral and anthropometric aspects of existing and emerging adversaries as well as nano, bio, and molecular signatures of airman performance."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.333"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-Directed Effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Human Analyst Augmentation"
                                    },
                                    "Description": {
                                        "val": "Conduct research to enhance human components of ISR.  Develop ability to improve human analytic efficiency and effectiveness with fewer personnel and in increasingly complex mission space.  Develop the ability to improve human cognitive performance of the ISR weapon system through improved data exploitation and intelligence content synthesis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.904"
                                            },
                                            "Text": {
                                                "val": "Applied cognitive systems engineering research methods to airman-centered challenges surrounding contested environments to develop solutions for Air Force ISR analysts. Explored approaches to integrate semiautonomous machine analysis technologies into airman ISR analyst performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.269"
                                            },
                                            "Text": {
                                                "val": "Conduct research to understand factors that enable the Air Force's goal of full spectrum analysis, transitioning from individual analysts working a single intelligence source to exploiting multiple sources.  Develop new human-centered methodologies and analyst processes integrating semiautonomous analysis technologies to create robust analytic capacity."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.339"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.339"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies and techniques for enabling individual analysts to exploit multiple intelligence sources.  Investigate verbal communication with semiautonomous analysis agents for aiding intelligence analysts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Trust and Interaction"
                                    },
                                    "Description": {
                                        "val": "Conduct research in cross-cultural communication and automated speech translation tools for Air Force missions.  Conduct research to address important aspects of trust in airman-machine teams including investigating how an airman knows an autonomous or semiautonomous system is safe to use and whether the system, data, conclusions, and decision recommendations can be trusted."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.266"
                                            },
                                            "Text": {
                                                "val": "Experimented with guidelines for calibrated trust for symbiotic airman-machine teaming.  Identified and studied appropriate levels of transparency between airmen and automated systems.  Experimented with multiple language processing algorithms simultaneously to optimize system performance.  Evaluated current advances in machine processing for new, militarily-relevant languages."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.188"
                                            },
                                            "Text": {
                                                "val": "Investigate trust between airmen and automation and airmen and robots to determine the appropriate levels of transparency in automatous and robotic systems.  Implement emerging machine processing approaches for militarily-relevant languages including mission and domain specific applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.063"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.063"
                                            },
                                            "Text": {
                                                "val": "Evaluate trust for robotics and automated systems in degraded visual environments and develop trust guidelines for Line In-The-Sky Auto Ground Collision Avoidance System.  Study multilingual deep neural networks for automatic speech recognition and adapt Asian languages machine translation models for information search and retrieval."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Signatures"
                                    },
                                    "Description": {
                                        "val": "Develop databases of human motion and features collected from air\/space platforms.  Identify human threat signatures across diverse populations for ISR and force protection applications.  Develop nano, bio, and molecular signatures of airman performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.033"
                                            },
                                            "Text": {
                                                "val": "Developed advanced molecular and genetic diagnostic methodologies to better assess airman performance.  Developed algorithm capable of reliably detecting and characterizing anthropometric signatures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.717"
                                            },
                                            "Text": {
                                                "val": "Exploit novel, non-invasive biomarkers in sweat and exhaled breath, develop selective capture elements for detection of these markers, and incorporate and test these to provide real-time feedback to operators.  Develop durable algorithm to provide persistent human detection and tracking throughout a single full motion video mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.936"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.936"
                                            },
                                            "Text": {
                                                "val": "Develop methodologies for integrating near real-time performance assessment algorithms using physiological and non-invasive biomarkers and individualized learning algorithms.  Continue development of durable algorithm to provide persistent human detection and tracking throughout a single full motion video mission."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625329"
                    },
                    "ProjectTitle": {
                        "val": "Sensory Evaluation and Decision Science"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "31.923"
                        },
                        "CurrentYear": {
                            "val": "31.539"
                        },
                        "BudgetYearOne": {
                            "val": "29.476"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.476"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.487"
                        },
                        "BudgetYearThree": {
                            "val": "31.183"
                        },
                        "BudgetYearFour": {
                            "val": "32.103"
                        },
                        "BudgetYearFive": {
                            "val": "33.374"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research to revolutionize the manner in which airmen optimize the capabilities of Air Force systems, including RPA and adaptive teams of airmen and machines.  Research optimizes airman situational awareness and cognitive performance, improves the airman-machine interface, and seamlessly integrates warfighters with their weapon systems across air, space, and cyber domains.  Research is conducted in four focus areas:  applied neuroscience; human role in semiautonomous systems; battlespace visualization; and battlespace acoustics.  The applied neuroscience area develops technologies to enhance airman-airman and airman-machine collaborations and system interactions in distributed decision-making environments.  The human role in semiautonomous systems area develops new control\/display concepts and technologies to optimize Air Force platform capabilities.  The battlespace visualization area advances the S&T associated with collecting, optimizing, displaying, and assimilating sensory information to enhance warfighter decision-making.  The battlespace acoustics area researches human-human and human-machine communications to exploit the use of voice and acoustic data in collaborative, net-centric environments while accounting for the effects of acoustic propagation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.333"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to enhance Airman performance and Airman-machine collaboration in high-stress decision-making environments.  Conduct research to predict physiological impacts of extreme, dynamic environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.108"
                                            },
                                            "Text": {
                                                "val": "Explored novel airman performance sensor and material solutions to increase sensing and assessing capabilities. Matured team workload and trust models for autonomy, increased airman performance monitoring, and performance improvement. Utilized knowledge of stress-driven metrics and processes to optimize airman performance. Applied neurophysiological, psychological, and genetic mechanisms and processes for developing guidelines to enhance airman performance and cognitive resiliency. Explored additional augmentation techniques such as supplementation and physical training for improving performance in operational environments that include airman-machine teaming. Applied interface technologies and exposure design criteria to protect airmen and mitigate injury and performance risks in current and future weapon systems. Refined physiology computational modeling methods to predict high-stress\/extreme environmental effects on airmen. Continued contamination sensor technology development for on-board oxygen generation systems for hypoxia vulnerability risk mitigation. Evaluated new technologies for aircraft next generation on-board oxygen generation system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.642"
                                            },
                                            "Text": {
                                                "val": "Conduct research on sensing and assessment technologies for enhanced Airman performance. Investigate augmentation strategies for enhanced physical and cognitive performance to include non-invasive brain stimulation techniques.  Establish method for use of real-time biomarker sensor technology. Begin development of human response models to enhance aircrew performance in extreme environments.  Explore next generation aircraft injury exposure criteria for improved aircrew protection. Investigate on-board oxygen generating system performance vulnerabilities affecting oxygen production.  Explore new technologies in support of next generation on-board oxygen generating system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.719"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.719"
                                            },
                                            "Text": {
                                                "val": "Refine sensing and assessment technologies for enhanced Airman performance in operationally-relevant environments. Assess applicability of biomarker sensor technologies use in operational environments. Refine augmentation techniques for physical and cognitive performance optimization and stress resilience.  Continue investigation of non-invasive brain stimulation techniques. Complete development of human response models to mitigate injury risks.  Continue development of the next generation aircraft injury exposure criteria for improved aircrew protection.  Continue investigation of on-board oxygen generating system performance vulnerabilities affecting oxygen production.  Develop an on-board oxygen generating system contamination database and susceptibility model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Role in Semiautonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Research new control\/display concepts and technologies (e.g., information portrayal, control devices, decision aiding algorithms) for adaptive human-machine interaction and teamwork."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.016"
                                            },
                                            "Text": {
                                                "val": "Integrated the current states of the platform, mission, environment, and airman operator into a global state database. Developed guidelines for interface design based upon computational problem solving method.  Investigated ways to represent autonomous system competency against the current task\/situation. Explored airman-autonomy teaming methods and metrics for Air Force applications. Performed advanced simulation of adjustable and adaptive automation to support flexible control of autonomous systems depending on mission and environmental context."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.180"
                                            },
                                            "Text": {
                                                "val": "Demonstrate effective deliberative-reactive control interaction methods of dynamic mission planning of heterogeneous multivehicle systems. Integrate agent architecture to perform sense-making of human, vehicle, and environmental factors to enhance task performance and mission effectiveness. Research advanced airman workload measurement technologies integrated with real-time adaptive airman-machine learning and task allocation methods. Demonstrate real time adaptive airman-machine teaming and task allocation methods. Develop and demonstrate distributed control methods for unmanned system concepts in limited communication environments. Research and develop predictive, look-ahead tools for effects-based mission planning and execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.837"
                                            },
                                            "Text": {
                                                "val": "Demonstrate distributed control methods for unmanned system concepts in limited communication environments. Continue research and development of predictive, look-ahead tools for effects-based mission planning and execution. Continue research in advanced airman workload measurement technologies integrated with real-time adaptive airman-machine teaming and task allocation methods. Research and develop human-machine interface methods to for real time machine reasoning and negotiating processes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Visualization"
                                    },
                                    "Description": {
                                        "val": "Research the visualization, interaction and understanding of complex information to enhance warfighter decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.233"
                                            },
                                            "Text": {
                                                "val": "Created cyber operations visualization techniques for transforming numerical data into actionable information. Developed and evaluated cyber operator system interfaces. Designed decision aids for multisource fusion methods. Developed experimental test bed for more effective visualization of current and future sensor technologies. Prototyped 3-D spatial viewers for mobile devices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.474"
                                            },
                                            "Text": {
                                                "val": "Explore alternative analytic strategies with emerging machine learning techniques to develop next generation automated data exploitation.  Initiate data analytics research for human visualization of complex data.  Assess cyber operations visualization techniques for transforming numerical data into actionable information. Continue development and begin performance-based comparisons of new cyber interfaces and visualization work aids for cyber warfare. Evaluate decision aids for multisource fusion imagery analysis. Assess preliminary geospatial viewers on mobile devices for improved operator performance. Initiate human-centric visual target detection and recognition model development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.867"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.867"
                                            },
                                            "Text": {
                                                "val": "Continue exploration of analytic strategies with machine learning techniques to achieve next-generation, automated, data exploitation capability.  Continue data analytics research focused on human visualization of complex data.  Evaluate cyber operator system interfaces for integrated defensive and offensive operations. Develop models to predict visibility of objects viewed by humans under both unaided and aided conditions. Integrate visualizations of threats and their priority, tasks, targets, and courses of action for C2 environments across the space and cyber domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlespace Acoustics"
                                    },
                                    "Description": {
                                        "val": "Conducts research on advanced auditory and communication technologies that mitigate effects of noise and enhance performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.233"
                                            },
                                            "Text": {
                                                "val": "Evaluated auditory interfaces that enable airmen to respond to cyber attacks through persistent auditory displays. Validated the use of multimodal displays and visualizations to communicate time-critical information to distributed teams. Enhanced the combined effectiveness of audio displays and multimodal interaction techniques to support airman decision-making. Developed communication metrics of intent of communicators compared to receivers' understanding. Developed metrics of airman-machine communication to incorporate emotional context."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.243"
                                            },
                                            "Text": {
                                                "val": "Conduct research on the impact of auditory context and synthetic voicing to inform the design of synthetic speech displays for improving communication effectiveness and enhancing decision making in human-machine teams. Examine listener adaptation to non-individualized spatial auditory displays and acoustic information distorted by tactical hearing protection and communication devices. Develop persistent auditory iconography for enhancing situation awareness and develop\/evaluate source-based symbology to enhance auditory displays. Develop standard procedures and metrics for objectively characterizing the loss of situation awareness in tactical operations when wearing hearing protection and communication devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.053"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.053"
                                            },
                                            "Text": {
                                                "val": "Conduct research on auditory processing of complex, multi-source acoustic scenes and develop context-aware auditory displays for optimal delivery of real-time information from synthetic teammates, including verbal communication, spatial location and system state.  Develop electro-acoustic characterization techniques for the prediction of auditory protection and performance requirements.  Examine techniques for real-time augmentation of auditory reality.  Develop and evaluate new biomimic acoustic detection models that employ representations of domain-specific listening environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627757"
                    },
                    "ProjectTitle": {
                        "val": "Bioeffects"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "26.291"
                        },
                        "CurrentYear": {
                            "val": "30.605"
                        },
                        "BudgetYearOne": {
                            "val": "31.130"
                        },
                        "BudgetYearOneBase": {
                            "val": "31.130"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "34.135"
                        },
                        "BudgetYearThree": {
                            "val": "35.150"
                        },
                        "BudgetYearFour": {
                            "val": "36.132"
                        },
                        "BudgetYearFive": {
                            "val": "37.552"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts applied research on the effects of human exposure to potentially toxic chemicals in the operational environment, advanced materials (including nanomaterials), EM energy (radio frequency to optical), scalable directed energy weapons, and non-lethal weapons. This research addresses fundamental physical principles, as well as the psychophysical interaction between directed energy and the individual or groups of individuals.  Research is divided into three core focus areas:  optical radiation bioeffects; radio frequency radiation (RFR) bioeffects; and molecular bioeffects.  Optical radiation bioeffects research enhances combat survivability and systems effectiveness through technologies that enable deployed forces to counter optical threats and exploit optical systems for offensive applications.  The RFR bioeffects research investigates basic biological mechanisms of RFR, conducts theoretical and empirical dosimetry, conducts research of bioeffects from short and long-term exposures, develops methods to counter RFR threats, and performs research for exploitation of directed energy systems for offensive capabilities.  Molecular bioeffects research is conducted to protect Airmen from the effects of toxic chemicals and materials to include nanomaterials and other advanced development products and to discover novel biomarkers and molecular mechanisms to support personalized training, performance and protection of Airman cognitive and physical performance using advanced sense, assess and augment technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Optical Radiation Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research on laser bioeffects, enabling military exploitation of laser technology while providing countermeasures for optical hazards\/threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.181"
                                            },
                                            "Text": {
                                                "val": "Completed development of scalable effects simulation tool. Completed new standardized methodology for evaluation of laser devices that cause glare effects in multiple environments. Integrated probabilistic model of individual observer within overall modeling and simulation architecture for evaluating laser collateral effects. Completed integration of new distributed simulation standard into modeling and simulation components to enable risk-based assessment of personnel effects within real-time weapons concept exercises with other Air Force and DoD research organizations. Completed data collection for currently identified optical radiation damage and transient vision effects for use in next generation of standardized personnel vulnerability models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.991"
                                            },
                                            "Text": {
                                                "val": "Expand research into pulse laser damage mechanisms for collateral hazard assessment of new high energy laser systems under development.  Continue development of scalable effects simulation tool for solid state continuous wave lasers.  Integrate probabilistic assessment using dose-response methodologies for realistic laser exposure scenarios.  Initiate development of glare assessment models that consider retinal pigmentation, dynamic background, and ocular scatter. Conduct studies to define impact of laser eye protection on performance and potential mitigation strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.695"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.695"
                                            },
                                            "Text": {
                                                "val": "Initiate assessment of alternate wavelength bioeffects for use in high-energy lasers.  Complete assessment of effectiveness of novel glare device bioeffects.  Continue pulse laser damage bioeffects assessment to help in assessment of collateral hazards of high energy laser systems.  Initiate investigations of suprathreshold laser damage to allow future probabilistic assessment of full range of bioeffects from collateral exposures.  Validate developing scalable effects simulation tool and dose-response methodologies to assure science-based assessment of high-energy lasers weapons or developing visual glare devices.  Continue development models reflecting the performance impact of laser exposures and develop mitigation strategies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct laboratory experiments and field research to enable safe exploitation of directed energy technologies for communication, target identification, and weapons development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.020"
                                            },
                                            "Text": {
                                                "val": "Determined the impact of fast thermal gradients on neurological cells. Conducted empirical studies to verify computational tool for radio frequency-induced bio-thermal response. Validated radio frequency dosimetry suite for broad power and frequency range to support next generation high peak power dose determinations. Performed empirical and modeling studies to investigate the feasibility of using short pulse radio frequency energy for standoff membrane poration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.131"
                                            },
                                            "Text": {
                                                "val": "Evaluate effects of whole body fast thermal gradients.  Refine bioeffects approach to analyze effects of short pulse radio frequency energy.  Finalize validation of dosimetry suite covering broad power and frequency range to support next-generation counter-electronic weapons and high power microwave smart weapons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.052"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.052"
                                            },
                                            "Text": {
                                                "val": "Parameterize fast thermal gradient bioeffects for whole body application.  Validate targeted energy deposition models.  Explore smart waveform mixing for deep-targeted energy deposition.  Advance whole body molecular beacon technology for advanced radio frequency dosimetry and computer effects model validation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Molecular Bioeffects"
                                    },
                                    "Description": {
                                        "val": "Conduct novel toxicology, nanotechnology and cognitive research to protect Airmen health and to augment Airman performance in diverse operational environments. Conduct studies to assess human responses to non-lethal weapons and effects\/risks of these weapons.  Leverage toxicological\/biological data to improve airman performance and decision-making abilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.090"
                                            },
                                            "Text": {
                                                "val": "Conducted research to define toxicity issues in current and future aircraft environments.  Pursued development and application capabilities of biomarkers for short-and long-term exposure modeling for existing and emerging militarily-relevant chemicals and materials.  Conducted and developed novel research studies to elucidate mechanisms of fundamental interaction of nanomaterials in biological systems. Continued research to identify novel molecular mechanism and predictive biomarkers in connection with Airman state changes under diverse military relevant conditions for Airman health and performance sensing, assessment and augmentation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.483"
                                            },
                                            "Text": {
                                                "val": "Advance knowledge and capability to complete analysis of aerospace fluid(s) toxicity characterization and impacts on high performance aircraft operators to best reduce Airmen health risk and Air Force mission risk.  Characterize and examine novel mechanisms of fundamental interaction of nanomaterials in a biological system to best understand exposure effects on the Airman.  Examine molecular mechanism of cognitive performance in physically or mentally intensive operational environments for the development of effective and safe strategies to protect, optimize and augment Airman performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.383"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.383"
                                            },
                                            "Text": {
                                                "val": "Complete toxicological analysis of several relevant aerospace fluids, such as coolants and jet fuels, that may negatively affect high performance aircraft operators.  Conduct developmental studies to create an organ on chip technology that enables rapid and accurate assessment of potentially toxic aerospace materials, with special emphasis on advanced acquisition materials that includes nanoparticles. Complete definitive analysis of chromium VI toxicity to best protect maintenance Airmen exposed to the surface coating on many current aircraft containing this chemical.  Identify an easily measureable biomarker in Airmen that become hypoxic, to rapidly identify a degraded performance state.  Examine molecular mechanism of cognitive performance in physically or mentally intensive operational environments for the development of effective and safe strategies to protect, optimize and augment Airmen performance."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}