{
    "id": "2018-Navy-PB-1319-MJBOOK-1-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-54",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604292N"
        },
        "ProgramElementTitle": {
            "val": "(U)MH-XX"
        },
        "R1LineNumber": {
            "val": "84"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "3.007"
            },
            "PriorYear": {
                "val": "4.462"
            },
            "CurrentYear": {
                "val": "1.620"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "9.089"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The MH-XX project directs developmental activities in support of the replacement of the current inventory of Navy and Marine Corps helicopters in the 2030+ timeframe through the Joint Future Vertical Lift (FVL) family of systems program. Specific developmental activities will include: capability requirements definition, documentation, and approval; support to the Joint Multi-Role Technology Demonstrator and Joint Future Vertical Lift, including Common Systems Integrated Product Team leadership, open hardware and software reference and objective architectures definition, mission system interoperability, and shipboard compatibility; Analysis of Alternatives planning and execution; and associated affordability studies. These activities will result in completion of all acquisition documentation required for a Material Development Decision in first quarter FY 2017. Follow-on activities support preparation and execution of efforts to develop common systems reference and objective open architectures, and eventual prototype aircraft flight demonstrations in support of the FVL Technology Maturation and Risk Reduction acquisition phase.  Activities and technologies developed also have the potential to be leveraged for sustainment of legacy Navy and Marine Corps helicopters.  These efforts will enable timely development of a system which provides best value and capability to the Joint Warfighter while maintaining effective and efficient war fighting capability in support of the Navy\/Marine Corps 30-year Aviation Plan.\n\nThe MH-XX Program has been terminated in FY 2018 and out pending results of the MH-60S Service Life Assessment Program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.516"
                },
                "CurrentYear": {
                    "val": "1.620"
                },
                "BudgetYearOne": {
                    "val": "1.537"
                },
                "BudgetYearOneBase": {
                    "val": "1.537"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.462"
                },
                "CurrentYear": {
                    "val": "1.620"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.054"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.537"
                },
                "BudgetYearOneBase": {
                    "val": "-1.537"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.054"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.537"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.537"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Due to the termination of MH-XX in FY 2018, the schedule has been updated to remove Analysis of Alternatives, Program Planning and Documentation, and Technology Maturation and Risk Reduction and added the delivery of a Business Metrics White Paper and an Reference Architecture White Paper. The development and delivery of the Business Metrics White Paper will inform future software development efforts. This product will provide guidance for defining and measuring software development progress and will identify key cost metrics to capture and forecast software costs. Additionally, the Reference Architecture White Paper will define key architectural parameters to guide the acquisition of Future Vertical Lift (FVL) capabilities. This effort will establish a common technical framework for capability acquisition, representing an opportunity to align Navy FVL investments and inform investments across the Armed Services."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2934"
                    },
                    "ProjectTitle": {
                        "val": "MH-XX"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.007"
                        },
                        "PriorYear": {
                            "val": "4.462"
                        },
                        "CurrentYear": {
                            "val": "1.620"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.089"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The MH-XX project directs Naval Aviation developmental activities in support of the replacement of the Navy H-60 series helicopters, multi-mission medium lift helicopter capability, in the 2030+ timeframe. These aircraft will be used extensively to protect Joint assets from airborne, surface, and sub-surface threats. Other supported mission areas will include Combat Search and Rescue, Naval Special Warfare, Humanitarian Assistance\/Disaster Relief, Logistics, and Medical Evacuation. Specific developmental activities will include: capability requirements definition documentation, and approval; support to the Joint Multi-Role Technology Demonstrator (JMR TD) and Joint Future Vertical Lift  including Common Systems Integrated Product Team leadership, open hardware and software reference and objective architectures definition, common hardware prototyping efforts, mission system interoperability, and shipboard compatibility; Analysis of Alternatives planning and execution; and associated affordability studies. These activities will result in completion of all pre-system acquisition documentation required for a Material Development Decision in first quarter FY 2017. These efforts will enable timely development of a system which provides best value to the Joint Warfighter and Naval Aviation while maintaining effective and efficient war fighting capability in support of the Navy's 30-year Aviation Plan.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under ADVANCED COMPONENT DEVELOPMENT AND PROTOTYPES because it includes efforts necessary to evaluate integrated technologies, representative models or prototype systems in a high fidelity and realistic operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MH-XX Requirements Definition and Acquisition Documentation"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.462"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Support to the JMR TD program to identify key maritime technologies; completion of pre-system acquisition activities which include Joint Requirement Capabilities Board approval of the ICD and Cost Assessment and Program Evaluation approval of the AOA Study Guidance and AOA Study Plan leading to a Material Development Decision in 1QTR FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.620"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support the JMR TD program to identify key maritime technologies. Development of business metrics white paper to inform future software development efforts.  Development of architecture white paper to define key architectural parameters to guide future vertical lift capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Provide research and development support for Pre-Milestone A activities, predominantly government, to enable replacement of the Navy H-60 series helicopters, multi-mission medium lift helicopter capability, in the 2030+ timeframe."
                        },
                        "PerformanceMetrics": {
                            "val": "Completion of business metrics and reference architecture white papers."
                        }
                    }
                }
            ]
        }
    }
}