{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-42",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604294D8Z"
        },
        "ProgramElementTitle": {
            "val": "Trusted and Assured Microelectronics"
        },
        "R1LineNumber": {
            "val": "98"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "83.626"
            },
            "BudgetYearOneBase": {
                "val": "83.626"
            },
            "BudgetYearTwo": {
                "val": "81.712"
            },
            "BudgetYearThree": {
                "val": "79.670"
            },
            "BudgetYearFour": {
                "val": "68.917"
            },
            "BudgetYearFive": {
                "val": "70.858"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) is a continuation of effort from the Trusted Foundry PE 0605140D8Z.  FY18 funds in the amount of $84.200M are being transferred from PE 0605140D8Z for the Verification and Validation (V&V) Capabilities and Standards for Trust and the New Trust Approach Development activities planned across the Future Years Defense Program (FYDP).  \n\nThis PE implements, maintains and updates the DoD’s long-term microelectronics strategy.  Recognizing that a trusted and assured supply of microelectronics is a Government-wide concern, this activity will interface with interagency partners to take into account interagency requirements, opportunities for collaboration, and strategic decisions that can be made to limit the overall cost of these requirements to the government.  Its goal is to eliminate the Department of Defense (DoD)’s reliance on sole source foundries for trusted state-of-the-art (SOTA) microelectronics.  It supports activities to ensure critical and sensitive integrated circuits are available to meet the DoD’s needs.  It refines strategies and management planning activities that will implement three integrated, complementary solutions that (1) provide for Intellectual Property (IP) protection of microelectronics components; (2) improve capability to evaluate and validate trust and assurance of microelectronic parts and advance standards to incentive the commercial marketplace to recognize trust as a competitive design standard; and (3) develop and demonstrate alternative approaches to assuring the trust of the microelectronics supply chain in order to enable broader DoD access to commercial SOTA microelectronics technology.\n\nApproximately 30 percent of the DoD’s Major Defense Acquisition Programs rely on the Trusted Foundry, the only Trust-accredited SOTA foundry, to build critical and sensitive integrated circuits for the DoD, Intelligence Community and Defense contractors.\n\nThis activity is being led by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)).  Naval Surface Warfare Center (NSWC) Crane is responsible for day-to-day management and execution of the DoD long-term trusted and assured microelectronics strategy.  This activity will include performers from the Joint Federated Assurance Center (JFAC) Steering Committee and a new Science and Technology (S&T) Advisory Board, and include performers, such as the JFAC service providers, Defense Microelectronics Activity (DMEA), the Defense Advanced Research Programs Agency (DARPA), and other DoD and Intelligence Community S&T organizations and laboratories in the area of hardware assurance (HwA) and software assurance (SwA).  It will integrate and support the functions of the DoD Trusted Foundry Program, the Trusted Supplier accreditation program, JFAC, and the related HwA and SwA S&T actions.  This activity is also expected to maintain and update the DoD long-term microelectronics strategy based on feedback from the execution of this PE and enable and leverage commercial and academic relationships as necessary to fulfill this mission."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "83.626"
                },
                "BudgetYearOneBase": {
                    "val": "83.626"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "83.626"
                },
                "BudgetYearOneBase": {
                    "val": "83.626"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Funds realigned from Trusted Foundry Program in BA 5"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "84.459"
                                },
                                "BudgetYearOneBase": {
                                    "val": "84.459"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Funding realigned to offset other priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.833"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.833"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 funds in the amount of $84.200M are being transferred from PE 0605140D8Z for the initiation of the Verification and Validation (V&V) Capabilities and Standards for Trust and the New Trust Approach Development activities planned across the Future Years Defense Program (FYDP)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P645"
                    },
                    "ProjectTitle": {
                        "val": "V&V Capabilities and Standards for Trust"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "41.524"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.524"
                        },
                        "BudgetYearTwo": {
                            "val": "41.649"
                        },
                        "BudgetYearThree": {
                            "val": "39.934"
                        },
                        "BudgetYearFour": {
                            "val": "39.112"
                        },
                        "BudgetYearFive": {
                            "val": "39.892"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project improves microelectronics test and verification methodologies in support of verifying the trust and assurance of parts and develops standards and practices to foster commercial development of secure, trusted and assured parts.  Verification and test technologies are required to provide direct program support for microelectronics assurance verification when DoD Trusted Foundry Program options are not available.  Core technical laboratories and other HwA and SwA capabilities are chartered as a JFAC to provide this support.  Out-year demands will require an increase in capacity, which will take the form of additional personnel and\/or equipment to permit scaling of microelectronics assessment capabilities.  Challenges have been identified, to include the ability to analyze leading-edge technology nodes (<45 nanometers (nm)), throughput\/time required for analysis, ability to analyze third-party IP contained in microelectronic components, and analysis of non-application specific integrated circuit (ASIC) components that are increasingly being used for agility, e.g., Field-Programmable Gate Arrays (FPGAs).  This project addresses these gaps in current technical capabilities, in coordination with the JFAC, which prioritizes this investment as required to meet the realized and projected out-year demand for JFAC services.  Three capability areas core to microelectronics analysis and verification will be improved:\n\n•\tPhysical verification, i.e., destructive analysis of integrated circuits and printed circuit boards \n•\tFunctional analysis, i.e., non-destructive screening\/verification of select, critical parts\n•\tDesign verification, i.e., verification\/assurance of designs, IP, netlists, bitstreams, firmware, etc.\n\nThese improvements will address two primary attributes: (1) technical capability including laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) the capacity to perform microelectronics assessments.\n\nThis project develops and matures assurance mitigations, evaluates the effectiveness of protections of IP in support of integrity, and develops and validates obfuscation and disaggregation technologies.  The project will address physical validation tool and capability development, design software validation tool development, counterfeit detection and imaging techniques, and system vulnerability assessments and testbeds.\n\nThis project also develops standards and practices in support of trustworthy designs and supply chains and formal relationships with industry to foster commercial development of secure, trusted, and assured parts and for acquisition of government access to proprietary designs, software, development, and quality assurance processes and test procedures to develop practices that minimize security flaws in designs and facilitate verification.  Two capability areas that are core to improved commercial designs will be improved, i.e., trustworthy designs and supply chains.\n\nThis project was previously funded in PE 0605140D8Z BA 5 and has been transferred to this BA 4 PE to correctly align funding in support of the mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "V&V Capabilities and Standards for Trust"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.524"
                                            },
                                            "Text": {
                                                "val": "The JFAC will:  (1) improve its microelectronics test and verification methodologies in support of verifying trust and assurance of parts and (2) develop standards\/practices to foster commercial development of secure, trusted and assured parts.\n\nVerification and test technologies will include:\n• Improvements to the core JFAC’s (1) technical capability, through the procurement of laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) capacity to perform microelectronics assessments.  FY18 and out-year demands will require an increase in capacity supporting weapon system program engagement, which will take the form of additional personnel and\/or equipment to permit scaling of assessment capabilities.\n• Enhancement of automation and standard processes needed to increase the throughput of information produced by individual JFAC laboratory tools as well as to facilitate information sharing across the families of tools used for analysis and testing.\n• Development of common subject matter expert (SME) training and protocols based on the existing tool base, to include both commercial and government-developed tools.\n• Funding for additional SME support in each core laboratory in support of the microelectronics trust verification and other JFAC-related work.\n• Increased direct program support focused on addressing technical gaps and trust-related findings.\n\nStandards and practices will include:\n• Development of standards and best practices, and relationships with industry, to foster commercial development of secure, trusted and assured parts.\n• Establishment of formal relationships with FPGA vendors and other key commercial suppliers to improve device and IP security.\n• Acquisition of government access to proprietary designs, software, development, and quality assurance processes and test procedures to develop design practices that minimize security flaws and facilitate verification. \n• Establishment of government and industry working groups to develop test procedures to validate the trust of designs.\n• Documentation and promulgation of security-enhancing design practices across government, industry, and academia.\n• Development of industry-wide standards and practices to establish a common understanding of what constitutes verified and trusted hardware\/software\/firmware at both the component and systems level.\n• Development of a common lexicon for secure hardware\/software\/firmware in collaboration with the Committee for National Security Systems, National Institute of Standards and Technology, and the broader United States Government, industry, and academia.\n• Definition of supply chain controls for assured chain of custody for critical and other microelectronics devices and IP.\n• Development of security training and education of government and industry system security engineers and material managers on supply chain and life-cycle management best practices using agreed-upon language, standards, and practices.\n• Alignment of DoD Instruction 5200.44 (Protection of Mission Critical Functions to Achieve Trusted Systems and Networks (TSN)), related policies, and NIST 800-161 (Supply Chain Risk Management Practices for Federal Information Systems and Organizations) with industry standards identifying and addressing gaps in definition and criteria and establishing accepted levels of supplier and part trustworthiness."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "NA"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n- Increases in throughput in current JFAC laboratories, and stand-up of additional capability and capacity as required, so that at least two laboratories will have capability in physical verification, functional analysis, and design verification to increase the DoD’s overall microelectronics trust verification and test capacity for analysis of state-of-the practice parts.\n- Increased Probability of Detection of malicious insertion and\/or counterfeit parts.\n- Decreased cost to evaluate components.\n- Decreased time to evaluate components."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "V&V Capabilities and Standards for Trust"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (Air Force, Army, Navy, NSA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "41.524"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "41.524"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "V&V Capabilities and Standards for Trust"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Joint Federated Assurance Center (JFAC) Hardware Assurance (HwA) Technical Working Group Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC HwA capability gap analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC Subject Matter Expert (SME) training"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC technical capability improvements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC assessments"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC direct program support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics trust and supply chain standards and best practices development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Intellectual Property (IP) access\/acquisition"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics trust and supply chain training for Government and industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics trust and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P646"
                    },
                    "ProjectTitle": {
                        "val": "New Trust Approach Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "42.102"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.102"
                        },
                        "BudgetYearTwo": {
                            "val": "40.063"
                        },
                        "BudgetYearThree": {
                            "val": "39.736"
                        },
                        "BudgetYearFour": {
                            "val": "29.805"
                        },
                        "BudgetYearFive": {
                            "val": "30.966"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds a program of research to develop the next generation, technology-driven approach to microelectronics trust and assurance, to include SOTA microelectronics, to ensure continued access to SOTA microelectronic technologies while maintaining the required level of trust in all environments.  DoD’s ability to access commercial technology for its custom secure, trusted and assured needs is diminishing as SOTA suppliers become fewer and more focused on serving the global commercial market.  DoD’s technology needs are broad, and relying on a single source supplier is not feasible.  Alternative, advanced manufacturing methods, technologies, and design tools are needed to produce secure, trusted and assured SOTA parts from commercial sources and to preserve access to these advanced nodes while protecting DoD and Defense Industrial Base IP from exploitation.  It also is intended to dramatically improve the capabilities of the JFAC with regard to verification and validation of microelectronics trust and assurance.\n\nThis program of research will develop innovative design, manufacturing, imaging, tagging, and control and assessment approaches for protecting DoD’s microelectronics supply chain and IP, including alternatives for trusted, strategic radiation-hardened electronics in advanced technology nodes for next-generation strategic systems, obfuscation and disaggregation technology development, and other assurance mitigations.  It will develop advanced imaging technologies and forensics, Design for Trust techniques, active hardware trust control, electronic component markers, and a data and analysis capability to enable auditing and independent verification and validation of commercial designs.   It also develops, demonstrates, and implements concepts for the cost-effective production of custom microelectronics in low volumes and protection of sensitive IP from exploitation.\n\nTechnologies that assure trust and assurance in a broad range of trusted and commercial environments can mitigate the risks associated with sole-source suppliers and increase the Government’s ability to leverage commercial capabilities.  The suite of developed technologies, e.g., alternative manufacturing methods and design tools, will enable DoD to obfuscate the purpose of sensitive devices, verify their origin and function, and protect sensitive IP from exploitation even while using the global supply chain for most hardware.  In cases where the risk involved precludes that level of commercial collaboration, low-volume manufacturing technologies developed under this project would permit DoD to more cheaply produce low volumes of sensitive microelectronics in trusted environments.  The project would also support using a repository of third-party IP to expedite circuit design and transition promising technologies to use.\n\nFunding for this project has been transferred from BA 5 PE 0605140D8Z."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Development"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.102"
                                            },
                                            "Text": {
                                                "val": "FY18 activities will mature and evaluate trust technologies and techniques through efforts that may include the conduct of studies and Broad Agency Announcements (BAAs) and other efforts to coordinate research programs across government research and development (R&D) organizations, academia and industry.\n\nThe JFAC will initiate the conduct of identified acquisition program pilots and technology demonstrations in coordination with research programs across government R&D organizations, academia and industry.\n\nInitiate or support at least one research program in each of the following technical areas:\n• Design-For-Trust techniques   \n• IP protection \n• Low-volume SOTA  manufacturing\n• Electronic component markers                                    \n• Imaging technologies and forensics                                   \n• Computing infrastructure and processing methods. \n\nPrimary efforts will include reducing-to-practice technologies enabling trusted (1) design, (2) access, (3) component integrity and (4) IP protection.  FY18 and FY19 primary activities include development of these technologies, followed by transition of these capabilities to new programs in the following fiscal years under PE 0605140D8Z. \n \nThis project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n- Enhanced capability in physical verification, functional analysis, and design verification.\n- Increased Probability of Detection of malicious insertion and\/or counterfeit parts.\n- Effectiveness of developed technologies, as measured by:  \n  o The speed and reliability of new validation and verification techniques in identifying known microelectronics issues (e.g., tampering) in laboratory and non-laboratory situations; \n  o Successful testing of advanced, alternative manufacturing techniques, such as disaggregated manufacturing; and\n  o Resilience of microelectronics protected by new trust approach technologies in red teaming exercises.\n- Adoption of next-generation trust technologies, as measured by:  \n  o The number of DoD and other government programs employing these trust technologies, design approaches, or best practices, possibly as facilitated by the provision of use models;\n  o The volume and criticality of components employing these technologies, design approaches, or best practices; and\n  o Promulgation in DoD guidance and program protection plans.\n- Commercial partnerships established for or enhanced by the development and manufacture of DoD microelectronics using next-generation trust technologies."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "New Trust Approach Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (DARPA, Air Force, Army, Navy, NSA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "42.102"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "42.102"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Third Party Intellectual Property (IP) Repository development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC technical capability improvement development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics trust and supply chain technology maturation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics trust and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}