{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-15",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604713A"
        },
        "ProgramElementTitle": {
            "val": "Combat Feeding, Clothing, and Equipment"
        },
        "R1LineNumber": {
            "val": "95"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.694"
            },
            "CurrentYear": {
                "val": "2.054"
            },
            "BudgetYearOne": {
                "val": "3.702"
            },
            "BudgetYearOneBase": {
                "val": "3.702"
            },
            "BudgetYearTwo": {
                "val": "4.141"
            },
            "BudgetYearThree": {
                "val": "5.993"
            },
            "BudgetYearFour": {
                "val": "4.693"
            },
            "BudgetYearFive": {
                "val": "3.737"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This project supports the development and demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance soldier efficiency and survivability, and to reduce food service logistics requirements for all four services. The project supports multi-fuel, rapidly deployable field food service equipment initiatives and engineering and manufacturing development to improve equipment, enhance safety in food service, and decrease fuel and water requirements. This project develops critical enablers that support the Joint Future Capabilities and Joint Expeditionary mindset, by maintaining readiness through fielding and integrating new equipment; by enhancing the field soldier's well-being; and providing soldier usable equipment. They also reduce sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding programs for all the services."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.763"
                },
                "CurrentYear": {
                    "val": "2.054"
                },
                "BudgetYearOne": {
                    "val": "2.225"
                },
                "BudgetYearOneBase": {
                    "val": "2.225"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.694"
                },
                "CurrentYear": {
                    "val": "2.054"
                },
                "BudgetYearOne": {
                    "val": "3.702"
                },
                "BudgetYearOneBase": {
                    "val": "3.702"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.069"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.477"
                },
                "BudgetYearOneBase": {
                    "val": "1.477"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.069"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "1.477"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.477"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2018 funding request of $1.135 million was increased to fully fund a critical RDT&E requirement on the Battlefield Kitchen (BK) program. Funding was required to maintain an accelerated developmental effort focused on getting the BK into production in FY 2019 (Project EL2). The remainder of the FY 2018 increase (project 548)  is due to an RDTE Civilian  Pay raise."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "548"
                    },
                    "ProjectTitle": {
                        "val": "Mil Subsistence Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.374"
                        },
                        "CurrentYear": {
                            "val": "0.759"
                        },
                        "BudgetYearOne": {
                            "val": "0.700"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.700"
                        },
                        "BudgetYearTwo": {
                            "val": "0.962"
                        },
                        "BudgetYearThree": {
                            "val": "1.786"
                        },
                        "BudgetYearFour": {
                            "val": "1.828"
                        },
                        "BudgetYearFive": {
                            "val": "1.705"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the development and demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance Soldier efficiency and survivability, and to reduce food service logistics requirements for all four services. The project supports multi-fuel, rapidly deployable field food service equipment initiatives and engineering and manufacturing development to improve equipment, enhance safety in food service, and decrease fuel and water requirements. This project develops critical enablers that support the Joint Future Capabilities and Joint Expeditionary mindset, by maintaining readiness through fielding and integrating new equipment; by enhancing the field Soldier's well-being; and providing Soldier usable equipment. They also reduce sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding programs for all the services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fielded Individual Ration Improvement Project (FIRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project for the Meal Ready to Eat (MRE). Integrate prototype components\/technologies into the MRE menu systems to improve operational effectiveness. Demonstrate system integration and producibility, develop component specifications and transition to Defense Logistics Agency – Troop Support (DLA-Troop Support) for procurement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.277"
                                            },
                                            "Text": {
                                                "val": "Finalized MRE procurement documents and standards for verification for MRE (2018 date of pack) and initiated transition to DLA-Troop Support based on Budget Activity 4 (BA4) Joint Service approvals.  Obtained Surgeon General approval of revised MRE menus. Executed production testing with industry to ensure consistent ration quality, understand PCR requirements, resolve vendor\/supplier issues, and conducted confirmatory sensory, chemical, physical and shelf life testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.130"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies into MRE menu system to improve quality, acceptability, nutrition and expand variety. Will plan and complete field testing of new ration menus for MRE (2020 date of pack) in an operationally relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.075"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Based on field test results, will present recommendations to Joint Services (2Q18) for continued product improvement of ration components\/packaging\/technologies for MRE (2020 date of pack). Will finalize MRE procurement documents and initiate transition to DLA-Troop Support. Will obtain Surgeon General approval of revised MRE menus. Will execute production testing with industry to ensure consistent ration quality, understand Performance Contract Requirements (PCR), and resolve vendor\/supplier issues. Will obtain selected new items for field test. Will conduct field evaluation of new candidate ration components for MRE (2021 date of pack) to improve quality, acceptability, nutrition and expand variety."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assault\/Special Purpose Ration Improvement Project (ASPIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement of special purpose rations by the integration of new technologies in nutrition, processing and packaging. Special purpose rations include the Meal, Cold Weather\/Long Range Patrol (MCW\/LRP), First Strike Ration (FSR), and Modular Operational Ration Enhancement (MORE)."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.056"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies (e.g., commercial brick pack packaging, Multi- Purpose Individual Heating Technology (MIT)) into First Strike Ration (FSR), MCW\/LRP and\/or MORE menu systems to improve quality, acceptability, nutrition and expand variety. Plan and complete field testing of new ration menus in an operationally relevant environment. Continue to populate Combat Rations Database with nutritional\/menu data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.039"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.039"
                                            },
                                            "Text": {
                                                "val": "Will integrate prototype components\/technologies into FSR, MCW\/LRP and\/or MORE menu systems to improve quality, acceptability, nutrition and expand variety. Will execute production testing with industry to ensure consistent ration quality, understand Performance Contract Requirements (PCR), and resolve vendor\/supplier issues. Will continue to populate Combat Rations Database with nutritional\/menu data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fielded Group Ration Improvement Project (FGRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project to update\/improve group ration components, menus, and packaging by integrating state-of-the-art military\/commercial packaging and technology base transitions. The family of Unitized Group Rations (UGRs) includes the Unitized Group Ration - Heat & Serve (UGR-H&S), Unitized Group Ration - Express (UGR-E), Unitized Group Ration - A (UGR-A), and Unitized Group Ration - M (UGR-M)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.348"
                                            },
                                            "Text": {
                                                "val": "Finalized UGR (A, H&S, E) procurement documents and standards for verification and initiate transition to DLA-TS based on BA4 Joint Service approvals. Obtained Surgeon General approval of revised UGR menus. Supported DLA-Troop Support Limited First Article production testing of new H&S and E items with industry to ensure consistent ration quality, understand PCR requirements, resolve vendor\/supplier issues, and conduct confirmatory sensory, chemical, physical and shelf life testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.122"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies into UGR-H&S, UGR-E, UGR-M and UGR-A menu systems to improve quality, acceptability, nutrition and expand variety. Complete field testing of new ration menus in an operationally relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.078"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.078"
                                            },
                                            "Text": {
                                                "val": "Will finalize UGR (A, H&S, E) procurement documents and standards for verification and initiated transition to DLA-Troop Support based on BA4 Joint Service approvals. Will obtain Surgeon General approval of revised UGR menus. Will support DLA-Troop Support Limited First Article production testing of new H&S and E items with industry to ensure consistent ration quality, understand PCR requirements, resolve vendor\/supplier issues, and conducted confirmatory sensory, chemical, physical and shelf life testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Group Ration Airdrop Survivability Project (GRASP)"
                                    },
                                    "Description": {
                                        "val": "Quantify baseline airdrop performance characteristics for current group combat ration (UGR-H&S\/M\/E) configurations\/designs; identify survival rates (based on caloric loss and packaging damage\/loss) under defined operational conditions; provide knowledge base and supporting data to generate executable load configuration changes; identify capability gaps that might warrant product\/package\/assembly configuration redesign and reengineering."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.039"
                                            },
                                            "Text": {
                                                "val": "Conduct review\/analysis of airdrop test data on additional UGR configurations\/versions. Will re-test\/assess data and recommend packing\/rigging changes. Transition updated technical data\/rigging changes to DLA - Troop Support and Airdrop partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Shipboard Galleys"
                                    },
                                    "Description": {
                                        "val": "Provide continuous Research and Development (R&D) for Navy Shipboard Galleys for state-of-the-art Galley designs and equipment technologies; support Naval Supply Systems Command (NAVSUP) foodservice equipment standardization plan; integrate automated technology such as, prognostics, diagnostics, and reliability tracking."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.439"
                                            },
                                            "Text": {
                                                "val": "Conducted preliminary Design Review\/Critical Design Review (PDR\/CDR) reviews. Instrumented equipment for Condition-Based Maintenance. Conducted test & evaluation of modified COTS equipment in accordance with Naval Sea Systems Command (NAVSEA) test criteria. Completed at-sea user evaluations and technical data package for transition to Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block Upgrades and Operational Improvements for Expeditionary Field Feeding Equipment"
                                    },
                                    "Description": {
                                        "val": "Eliminate the sole sourcing of tray ration heater component parts. Reduce overall water consumption through the use of non-immersive cooking technologies and more efficient ware-washing equipment. Increase Kitchen flexibility through appliance upgrades. To reduce the overall fuel consumption of Expeditionary Field Feeding Equipment through enhanced combustion technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.079"
                                            },
                                            "Text": {
                                                "val": "Develop reports, Engineering Change Proposals (ECPs) and logistical data to facilitate integration of cooking appliances into United States Marine Corp (USMC) Expeditionary Field Kitchen (EFK), Enhanced Tray Ration Heating System (ETRHS), and\/or Tray Ration Heater (TRH). Transition prototype equipment and technical data to USMC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.154"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.154"
                                            },
                                            "Text": {
                                                "val": "Will develop reports, ECPs and logistical data to facilitate integration of cooking appliances into USMC EFK, ETRHS, and\/or TRH. Will transition prototype equipment and technical data to USMC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support to Air Force Field Feeding Modernization Efforts"
                                    },
                                    "Description": {
                                        "val": "Provide continuous R&D efforts for all Expeditionary Air Force squadrons. Modernize and standardize field foodservice equipment to reduce labor, maintenance, pack-out volume and cost. Increase reliability, efficiency and sustainability. Develop comprehensive specifications and technical data packages for recommended Food Service Equipment (FSE) items; test and evaluate newer commercial FSE items for expeditionary use and smaller transportation footprint; develop total overall life cycle cost of each system; test Energy Star certified FSE items that use less power; and investigate\/develop appliances that use less water, increase competition on standardized designs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Completed preliminary design review (PDR). Initiated Basic Expeditionary Airfield Resources (BEAR) Kitchen Final Design Review. Conducted user Test & Evaluation of proposed equipment. Drafted technical test reports and provided to Air Force for review."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.158"
                                            },
                                            "Text": {
                                                "val": "Conduct Energy Management System (EMS) Critical Design Reviews and in-house test and evaluation. Complete the development of the Joint Service Expandable Refrigerated Container System (JSERCS). Integrate JSERCS into the BEAR kitchen system to conduct operational testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.147"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.147"
                                            },
                                            "Text": {
                                                "val": "Will complete T&E of Energy Management System prototype. Transition performance results to the Basic Expeditionary Airfield Resources (BEAR) Program Management Office.  Will integrate heat recovery system technical data into the BEAR Kitchen System Technical Data Package."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Food Storage Analysis Tool (NFSAT)"
                                    },
                                    "Description": {
                                        "val": "Software analysis tool for Navy Foodservice that will automatically calculate all storage space factors and requirements for naval vessels based off the specific Navy Standard Core Menu (NSCM), crew size, Naval Ship's Technical Manual 096, Weights and Stability, Naval Vessel Requirements Food Service Facility Design Manual, Build Specifications 671, 672, and Type Commander established endurance levels. Develop automated subsistence inventory management, tracking and storeroom locations for all storage areas with mobile scanning technology capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.050"
                                            },
                                            "Text": {
                                                "val": "Completed Alpha version of Navy subsistence inventory management software and conduct test and evaluation of Alpha version of the software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.175"
                                            },
                                            "Text": {
                                                "val": "Complete development of updated software, which will provide automated subsistence inventory management, tracking, and storeroom locations for all storage areas with mobile scanning technology capabilities. Conduct operational testing and will transition Technical Data Package, Commercial Item Descriptions, and equipment to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Integrated Kitchen System (MIKS)"
                                    },
                                    "Description": {
                                        "val": "Design a standardized mounting system for all Galley equipment to significantly reduce technical labor skills required to complete deck modifications. MIKS will standardize electrical and water requirements, enhance procurement options, decrease operating and support (O&S) costs, and increase the speed of installing new technologies into the Galley\/Scullery areas."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.207"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.207"
                                            },
                                            "Text": {
                                                "val": "Will conduct land-based user evaluation of new integrated mounting system, prepare technical data package (TDP), and provide documentation to Navy (USN) for procurement."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603747A 610"
                                    },
                                    "Title": {
                                        "val": "RDTE Soldier Support and Survivability - Food Adv Development 610"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.020"
                                        },
                                        "CurrentYear": {
                                            "val": "5.299"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.548"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.548"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.648"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.158"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.273"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.225"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603747A EL1"
                                    },
                                    "Title": {
                                        "val": "RDTE Soldier Support and Survivability - Army Field Feeding Programs EL1"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.108"
                                        },
                                        "CurrentYear": {
                                            "val": "1.948"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.992"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.504"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.246"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.421"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604713A EL2"
                                    },
                                    "Title": {
                                        "val": "RDTE Combat Feeding, Clothing, and Equip - Army Field Feeding Equip EL2"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.320"
                                        },
                                        "CurrentYear": {
                                            "val": "1.295"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.002"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.002"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.179"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.207"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.865"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.032"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "M65806"
                                    },
                                    "Title": {
                                        "val": "OPA - Assault Kitchen, Field Feeding M65806"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.964"
                                        },
                                        "CurrentYear": {
                                            "val": "7.750"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.608"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.608"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.129"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.565"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.145"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.268"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete Engineering and Manufacturing Development (EMD) and Demonstration of food items and equipment for transition into competitive procurement contract. Complete advanced research efforts to support Engineer Change Proposals for previously developed equipment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL2"
                    },
                    "ProjectTitle": {
                        "val": "Army Field Feeding Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.320"
                        },
                        "CurrentYear": {
                            "val": "1.295"
                        },
                        "BudgetYearOne": {
                            "val": "3.002"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.002"
                        },
                        "BudgetYearTwo": {
                            "val": "3.179"
                        },
                        "BudgetYearThree": {
                            "val": "4.207"
                        },
                        "BudgetYearFour": {
                            "val": "2.865"
                        },
                        "BudgetYearFive": {
                            "val": "2.032"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the development and demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance soldier efficiency and survivability, and to reduce food service logistics requirements for the Army. The project supports multi-fuel, rapidly deployable field food service equipment initiatives and engineering and manufacturing development to improve equipment, enhance safety in food service, and decrease fuel and water requirements. This project develops critical enablers that support the Army's Strategic Planning Guidance by developing and integrating critical expeditionary capabilities that maintain readiness; provide effective solutions that reduce the resource and operational energy footprint; provide modernized equipment; and enhance the field Soldier's well being. This project also reduces sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\nThis PE\/Project supports Field Feeding programs for the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ice Making System"
                                    },
                                    "Description": {
                                        "val": "Develops an add-on ice making capability that automatically dispenses and seals 10 pound(lbs) bags at a rate of a minimum of 3,600 pounds of ice per day. This capability is based upon Army current operational requirements for ice which is four pounds per Soldier per day. This capability enables support for up to 900 personnel. Current operations require external support to provide personnel with ice for cooling drinking water in extremely arid environments. This capability will reduce the sustainment risk and cost associated with transporting this commodity from external sources. The objective requirement enables stockage of ice to assist with surge operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.320"
                                            },
                                            "Text": {
                                                "val": "Awarded contract for development of prototype Containerized Ice Making Systems and required Developmental Testing (DT)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlefield Kitchen (BK)"
                                    },
                                    "Description": {
                                        "val": "Provide replacement of the obsolete Mobile Kitchen Trailer (MKT) system. The BK shall replace the MKT with a kitchen that provides fuel efficient, thermally controlled, closed combustion appliances within an environmentally controlled workspace. The BK shall provide rations for up to 300 Soldiers within 4 hours of setup. The BK provides refrigeration, running water and a heated serving line using the same off-road prime mover as the MKT as well as transportability by rail, sea, fixed and rotary wing aircraft."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.295"
                                            },
                                            "Text": {
                                                "val": "Oversee contractor integration of developmental components and mature government supplied components into working BK prototype. Maintain concurrent development of Integrated Logistics Support (ILS) documentation and provisioning of government supplied mature components and subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.002"
                                            },
                                            "Text": {
                                                "val": "Complete integration of BK systems. Conduct production prove out testing and limited user testing in accordance with Test and Evaluation Master Plan (TEMP). Complete required logistical support documentation. Prepare Milestone C documentation and preparation for production decision."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E 643747.EL1"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.108"
                                        },
                                        "CurrentYear": {
                                            "val": "1.948"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.992"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.504"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.246"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.421"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPA R62830"
                                    },
                                    "Title": {
                                        "val": "Battlefield Kitchen, Field Feeding"
                                    },
                                    "Funding": {
                                        "BudgetYearThree": {
                                            "val": "6.071"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.665"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.309"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete System Development and Demonstration of food items and equipment for transition into competitive procurement contract. Complete advanced research efforts to support Engineer Change Proposals for previously developed equipment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}