{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-2",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604759A"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "154"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "65.059"
            },
            "CurrentYear": {
                "val": "84.777"
            },
            "BudgetYearOne": {
                "val": "102.901"
            },
            "BudgetYearOneBase": {
                "val": "102.901"
            },
            "BudgetYearTwo": {
                "val": "108.632"
            },
            "BudgetYearThree": {
                "val": "111.437"
            },
            "BudgetYearFour": {
                "val": "82.994"
            },
            "BudgetYearFive": {
                "val": "85.508"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds the development and acquisition of major developmental test instrumentation for the United States (US) Army Test and Evaluation Command's (ATEC) test activities: White Sands Test Center (WSTC), NM; Yuma Test Center, (YTC), AZ; Aberdeen Test Center (ATC), MD; Electronic Proving Ground (EPG), AZ; Redstone Test Center (RTC), AL; and for the Reagan Test Site (RTS) at the US Army Kwajalein Atoll (USAKA), which is managed by the Space and Missile Defense Command.  This PE also funds development and acquisition of Operational Test Command's (OTC) major field instrumentation.  Requirements for instrumentation are identified through a long range survey of project managers, Research Development and Engineering Centers (RDECs), and Battle Laboratories developing future weapon systems and the test programs that support these systems.  Army testing facilities are also surveyed to determine major testing capability shortfalls."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "66.580"
                },
                "CurrentYear": {
                    "val": "84.777"
                },
                "BudgetYearOne": {
                    "val": "71.037"
                },
                "BudgetYearOneBase": {
                    "val": "71.037"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "65.059"
                },
                "CurrentYear": {
                    "val": "84.777"
                },
                "BudgetYearOne": {
                    "val": "102.901"
                },
                "BudgetYearOneBase": {
                    "val": "102.901"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.521"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "31.864"
                },
                "BudgetYearOneBase": {
                    "val": "31.864"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.321"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.800"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "31.846"
                                },
                                "BudgetYearOneBase": {
                                    "val": "31.846"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "CivPay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.018"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Net FY18 funding increase of $31.864 million from previous submission reflects: a realignment of Range Radar Replacement Program (RRRP) funding in the amount of $35.506 million from Other Procurement, Army (OPA) to Research, Development, Test & Evaluation (RDTE) to align with the Acquisition Strategy; civilian pay adjustments ($0.018 Million); and non-RRRP reductions totaling $3.66 Million. Since RRRP provides equipment to the test community, all procured equipment will be appropriately resourced in the RDT&E appropriation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "983"
                    },
                    "ProjectTitle": {
                        "val": "Reagan Test Site (RTS) T&E Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.231"
                        },
                        "CurrentYear": {
                            "val": "7.032"
                        },
                        "BudgetYearOne": {
                            "val": "7.213"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.213"
                        },
                        "BudgetYearTwo": {
                            "val": "7.391"
                        },
                        "BudgetYearThree": {
                            "val": "7.431"
                        },
                        "BudgetYearFour": {
                            "val": "7.623"
                        },
                        "BudgetYearFive": {
                            "val": "7.849"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Programs ending in Fiscal Year (FY) 2017: Transmitter Reliability, Multiple Simultaneous Engagement (MSE) Flight Safety, Legacy Servo Upgrade Program Phase 2, Target Resolution Discrimination Experiment (TRADEX) L-Band Modulator, Net Centric Operations Upgrade."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds improvement and modernization (I&M) for the Ronald Reagan Ballistic Missile Defense Test Site (RTS).  Funds modernization of the radar, telemetry, optics, range safety, communications, command\/control and other equipment essential to meet test and evaluation requirements of the Services and Department of Defense (DoD) agencies.  Without modernization these instrumentation systems face obsolescence or degraded capability.  The RTS instrumentation is required to support data collection for test & evaluation assessments and operational decisions for the Army; Navy; Air Force; United States Strategic Command (STRATCOM); Missile Defense Agency (MDA); Defense Advanced Research Projects Agency (DARPA); National Aeronautics and Space Administration (NASA); and other customers. RTS, located in the Republic of the Marshall Islands, is a remote, secure activity of the Major Range and Test Facility Base (MRTFB). \n\nFunding will enable RTS to continue to meet customer objectives and sustain the required instrumentation suite."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Radar Open Systems Architecture (ROSA) Refresh"
                                    },
                                    "Description": {
                                        "val": "The ROSA Refresh plan is to incorporate subsystem technologies at GBR-P, then transition those technologies to the other RTS sensors. Much of the testing and integration lessons will be learned ahead of time, providing a drop-in updated solution for legacy ROSA components at the other radars identified as having long-term sustainability issues. In this approach, the ROSA refresh effort is coupled with the GBR-P modernization leading to a cleaner and more cost-effective program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Continue design and development of open systems with a focus on extending the design to work with phased array radar systems in addition to the Kiernan Reentry Measurement System (KREMS) radar sites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.900"
                                            },
                                            "Text": {
                                                "val": "Integrate and test new ROSA sub-systems at GBR-K radar."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radar Reliability Improvement Program (RRI)."
                                    },
                                    "Description": {
                                        "val": "The Radar Improvement and Sustainment (RIS) Project is an Improvements and Modernizations (I&M) Umbrella Program to push technology into the radar systems. RIS is a group of complimentary I&M Projects that mitigate annual O&M risks. Projects initiated address the following needs: Enhancing the Reliability of the Sensor; Technology Refresh; Obsolescence; Commonality of Design across Sensors; Enhanced Monitoring; Fault Detection – Fault Isolation (FD\/FI); Enable Remoting Operation and Monitoring; Enhanced Capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.278"
                                            },
                                            "Text": {
                                                "val": ".Continue execution of projects to increase reliability and lower operating costs of RTS radars by incorporating modern commercially available parts into radar systems when legacy parts are obsolete and a drop in replacement is not available."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Will continue execution of projects to increase reliability and lower operating costs of RTS radars by incorporating modern commercially available parts into radar systems when legacy parts are obsolete and a drop in replacement is not available."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Initiate new projects to address Operations and Maintenance (O&M) concerns and increase radar reliability"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Telemetry (TM) Modernization Study."
                                    },
                                    "Description": {
                                        "val": "This Project will develop the technology required to modernize the telemetry systems using an innovative software defined radio approach designed to vastly improve the ability to adapt to future telemetry changes and requirements quickly with lower cost. In addition, this approach will enable centralized command and control of the telemetry equipment increasing efficiency in mission preparation and execution. The telemetry backend processing chain is currently comprised of discrete frequency-specific hardware components that are replicated for each telemetry channel required for a test event. This project will develop a scalable frequency agnostic software based solution that runs on commodity computer servers. More complex missions (e.g., Over-the-air (OTA) operational testing of the Ballistic Missile Defense Systems (BMDS)) will continue to require more telemetry channels, which this project will avoid much of that future cost. This project will provide enough hardware to increase capacity of the telemetry system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.506"
                                            },
                                            "Text": {
                                                "val": "Implement software defined radio design with a modernized frequency agile receiver on one antenna at RTS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.310"
                                            },
                                            "Text": {
                                                "val": "Extend implementation to multiple antenna sites at RTS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.427"
                                            },
                                            "Text": {
                                                "val": "Extend implementation to additional antenna sites at RTS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multiple Simultaneous Engagement (MSE) Flight Safety."
                                    },
                                    "Description": {
                                        "val": "RTS has an aging land-based command destruct range safety system that can communicate with and activate the Flight Termination System onboard a test missile. This Project will modernize the existing command destruct system, providing multiple improvements, and satisfying newly mandated requirements.\n\nThis Project will also add the capability to control the flight termination systems on up to 4 missiles simultaneously. This Project will upgrade the failing Roi-Namur command destruct transmitters. Limited distributed operations will be extended to Huntsville. This Project will upgrade all safety hardware to support Enhanced Flight Termination System standards. Display capabilities and recording capabilities will be greatly enhanced. IA (information Assurance) compliant equipment will be used to replace non-compliant components and commonality with other ranges will be achieved."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Complete implementation of RTS safety control system replacement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Legacy Servo Upgrade Program."
                                    },
                                    "Description": {
                                        "val": "This Project will design, upgrade, and replace the radar and optics servo systems.  The custom-hardware based legacy systems will be replaced with commercially supportable commercial off the shelf (COTS) hardware. Where possible, common components will be used across all range sensors to minimize ongoing maintenance costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Continue development of TRADEX antenna upgrade and begin upgrade of additional radar or optics servo systems"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.272"
                                            },
                                            "Text": {
                                                "val": "Complete TRADEX servo upgrade and continue upgrade of additional radar or optics servo systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Data Network (MDN) Modernization."
                                    },
                                    "Description": {
                                        "val": "The MDN Modernization Program ensures sustained seamless, high speed intra-range data\/voice\/video transfer capabilities for mission critical operations. Specifically, this program will procure up-to-date, high speed fiber optic network and communications equipment for the intra-range network at RTS. This equipment will meet the demands of future communication requirements that enable remote mission operations. Equipment will be installed to connect the sensors located on the remote islands, leveraging the previous Army Installation Information Infrastructure Modernization Program (I3MP) investment. Additionally, new information assurance requirements (DIACAP) will be accommodated and improvements made to reduce sustainment cost."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.084"
                                            },
                                            "Text": {
                                                "val": "Complete new network architecture changes to improve on-atoll bandwidth to support increasing custom requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RTS Automation and Decision Support."
                                    },
                                    "Description": {
                                        "val": "As missions become more complex and challenging, the operator workload increases significantly. This Project improves automation and decision support to reduce human operator workload and operator errors associated with a higher workload. There will be additional capabilities to operate the range as a cohesive meta-sensor and capabilities to program contingencies, react with a priori information and decision algorithms and resource brokers. This will improve mission assurance. The RTS radar control software will be upgraded to automate processes that computers do better than humans, and reduce the need for labor intensive tuning efforts. The human computer interface (HCI) for the radars will be improved to allow operators to interact with the RTS sensor suite more intuitively with a small set of high-level commands. The control center data fusion algorithms will be improved and streamlined to reduce complexity and decrease operator workload."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.222"
                                            },
                                            "Text": {
                                                "val": "Complete radar automation and begin work on displays and control center automation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Will continue work on displays and control center automation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Complete displays and control center automation scoped in FY17."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Net Centric Operations Upgrade"
                                    },
                                    "Description": {
                                        "val": "Net-Centric Operations is a DoD mandate to enable agility through sharing of data across mission areas and components. Sharing of data is enabled by using standards where appropriate, forming communities of interest (COI) to agree on common vocabularies, common computing services infrastructure on a single network, and robust dynamic security access control.  This Project will improve on how RTS interacts to receive Inter-range vectors (IRVs) from other ranges (e.g., Pacific Missile Range Facility (PMRF), Vandenberg Air Force Base (VAFB)) to establish the connectivity and messaging required to avoid antiquated point-to-point connections over Secure Telephone Equipment (STE). This would leverage Terrorist Explosive Device Analytical Center (TEDAC) and Joint Mission Environment Test Capability (JMETC) networks and RTS Distributed Operations (RDO) and Test Enabling Network Architecture (TENA) based data messages, but will also consider operational systems that are needed for RTS to participate more fully in real world events by sharing data and cues. A prototype TENA gateway will be the first phase in connecting RTS to other ranges with this new paradigm."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.366"
                                            },
                                            "Text": {
                                                "val": "Complete development of software to allow communication between the RDO software and Net Centric enterprises such as TENA."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optics Focal Plane Technology Replacement Study"
                                    },
                                    "Description": {
                                        "val": "This study leverages the Massachusetts Institute of Technology (MIT) Lincoln Laboratory and external sponsor investments to build and integrate a Digital Focal Plane Array (DFPA) based long-wave infrared (LWIR) camera system and telescope onto an existing Super Recording Automation Digital Optical Tracker (RADOT) mount at RTS. The major efforts in this study are: DFPA Camera assembly and test, telescope procurement and test, software development, and on-site integration and test at RTS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.175"
                                            },
                                            "Text": {
                                                "val": "Complete DFPA camera\/telescope and integrate onto the Super RADOT-5 mount on Roi-Namur"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Statics for Radars and Telemetry - Prototype"
                                    },
                                    "Description": {
                                        "val": "This development will enable all the existing KREMS radars to be used as illuminators and the RTS telemetry systems to be used as receivers in a multi-static array that will increase the sensitivity of the systems, reduce the need for high power operation in the systems, and in conjunction with the software radio radar project and the solid state transmitter project will allow the radars to be operated at a lower O&M cost."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "This development will enable all the existing KREMS radars to be used as illuminators and the RTS telemetry systems to be used as receivers in a multi-static array that will increase the sensitivity of the systems, reduce the need for high power operation in the systems, and in conjunction with the software radio radar project and the solid state transmitter project will allow the radars to be operated at a lower O&M cost."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.486"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.486"
                                            },
                                            "Text": {
                                                "val": "Continue design of a multi-static prototype and procure hardware to support the prototype."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Based Discrimination Radar"
                                    },
                                    "Description": {
                                        "val": "The Ground Based Discrimination Radar Project will provide the RTS with an instrumentation-quality, X-band phased array radar to more robustly support customer mission requirements and provide a relatively cost-effective phased array technology testbed capability. To control costs, the existing Ground Based Radar Prototype (GBR-P), provided by the Missile Defense Agency and initially developed as the prototype fire control radar, will be upgraded."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Requirements definition and preliminary design for the Ground Based Radar (GBR) upgrade. The GBR is being transferred from the Missile Defense Agency (MDA) to the Space and Missile Defense Command (SMDC) in FY16."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.150"
                                            },
                                            "Text": {
                                                "val": "Development, integration, and testing of the GBR upgrade"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Integrate new sub-systems and backend processing onto the GBR-K radar on Kwajalein."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "984"
                    },
                    "ProjectTitle": {
                        "val": "Major Developmental Testing Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.394"
                        },
                        "CurrentYear": {
                            "val": "31.741"
                        },
                        "BudgetYearOne": {
                            "val": "29.692"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.692"
                        },
                        "BudgetYearTwo": {
                            "val": "36.567"
                        },
                        "BudgetYearThree": {
                            "val": "39.187"
                        },
                        "BudgetYearFour": {
                            "val": "40.007"
                        },
                        "BudgetYearFive": {
                            "val": "41.250"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops and acquires major test instrumentation to perform developmental testing of weapon systems at U. S. Army Test and Evaluation Command's (ATEC) activities which include: Yuma Test Center (YTC), AZ; Aberdeen Test Center (ATC), MD; Electronic Proving Ground (EPG), AZ; White Sands Test Center (WSTC), NM; Redstone Test Center (RTC), AL.\n\nProjects are designated as a major test program based on their visibility, assessed relative technical risk (medium-high), schedule risk, cost (greater than $1.5 Million per year or $7.5 Million for the total Project) and applicability to other mission areas or services.  These projects are technically demanding, state-of-the-art, unique instrumentation assets or suites to meet the technology shortfalls, and generally result from development programs managed by a professional project management team.  FY18 funds will be used for modernization of outdated instrumentation in support of developmental testing for Army Department of Defense programs.\n\nElectromagnetic Environmental Effects (E3) Electromagnetic Radiation Effects (EMRE) Systems Modernization will upgrade equipment at the White Sands Missile Range (WSMR) EMRE site where E3 testing is performed to evaluate survivability and vulnerability of military systems.  Project will upgrade and replace signal transmitters, refurbish an anechoic test chamber, replace data acquisition equipment and install a new turntable to support test items. Nuclear Effects Test Capabilities Modernization acquires and upgrades Special Test Equipment for nuclear facilities located at WSMR.  These acquisitions and upgrades include the Pulse Current Injection Simulator, Prompt Gamma Simulator, Gamma Range Facility, Linear Electron Accelerator (LINAC), Semi-Conductor Test Lab, Electromagnetic Pulse and the Solar Furnace. Common Range Integrated Instrumentation System (CRIIS) Objective Program provides precision location instrumentation which will significantly increase the Test and Evaluation (T&E) ranges' capability to meet the test instrumentation needs of the tri-service range users.  Test Network Modernization (TNM) will upgrade existing test data networks to ensure infrastructures are capable of providing reliable and secure transport of data and communications for ATEC test activities.  Applied Environments Modernization (AEM) program will upgrade antiquated Environmental labs for climatic and dynamic testing with new cascade refrigeration units, climatic chambers, vibration test systems, x-ray cameras, a real-time radiography system and full spectrum solar lights. Telemetry Systems Modernization (TSM) program will upgrade\/replace mobile and fixed site telemetry equipment and telemetry data processing equipment thereby gaining spectrum efficiency at RTC, ATC, WSMR and Yuma Proving Ground (YPG).  Future Wireless Network program (FWN) will procure and integrate wireless network technologies across ATEC test activities which will provide near real-time data collection support for Developmental Test and Operational Test events.  Robotics\/Unmanned Aerial Systems (UAS) Instrumentation Suite to develop and procure instrumentation for testing controlled and autonomous ground and aerial robotic systems.  System of Systems Cooperative Engagement Test Infrastructure (SCETI) for the development of systems to conduct systems level Manned-Unmanned Teaming (MUM-T) testing for both aircraft and ground systems in a distributed environment."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add for Cyber Vulnerabilities Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.000"
                                        },
                                        "Text": {
                                            "val": "Congressional Add for Cyber Vulnerabilities Research provided comprehensive cyber data analytics and fusion instrumentation capabilities including response times, actions, levels of difficulty and visualization for both Red and Blue actors in live and high fidelity virtual environments during developmental and operational test, evaluation and assessments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Electromagnetic Environmental Effects (E3) Systems Modernization (EMRE) project."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activities for the EMRE project.  This effort will upgrade 27 instrumentation test facilities as WSMR."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.978"
                                            },
                                            "Text": {
                                                "val": "Funds for EMD for the EMRE 14 Test Facility Characterization Studies and 9 Site Surveys, Upgrade of support equipment and integration of four transmitter facilities, one turntable replacement and upgrading support equipment of two instrumentation vans, Electromagnetic Interface (EMI) test facility, Data Acquisition Software, and Radiation Hazard Testing Facilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Text": {
                                                "val": "Funds for EMD for the E3 Systems Modernization (EMRE) and acquire the Electromagnetic Interference (EMI) and Peak Pulse Power systems and Electronic Discharge Test Facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.769"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.769"
                                            },
                                            "Text": {
                                                "val": "Will continue the EMD phase E3 Systems contract activity. Funds will procure the Electronic and Electromagnetic Interference Test facilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Nuclear Effects Test Capability Modernization."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activity for the Nuclear Effects Test Capability Modernization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.974"
                                            },
                                            "Text": {
                                                "val": "Continue the EMD phase contract activity for the Nuclear Effects Test Capability Modernization. Program to upgrade Special Test Equipment for nuclear facilities located at WSMR.  Funds acquisition and upgrades of Linear Accelerator, Pulsed Current Injection capability, Gamma Radiation Facility, Vertical Electromagnetic Pulse Facility, High-Altitude Electromagnetic Pulse Facility, Enhanced Low Dose Rate Sensitivity capability, Dosimetry Laboratory, and Solar Furnace."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.986"
                                            },
                                            "Text": {
                                                "val": "Will continue the Engineering and Manufacturing Development (EMD) phase contract activity for the Nuclear Effects Test Capability Modernization. Funds acquisition and upgrades of Special Test Equipment for Prompt Gamma Simulator facility and Rapid Response Laboratory.  Funding adjusted in FY17 to accommodate program acquisition lead time for competitive procurement of Prompt Gamma Simulator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.835"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.835"
                                            },
                                            "Text": {
                                                "val": "Will continue the EMD phase contract activity for the Nuclear Effects Test Capability Modernization. Funds acquisition and upgrades of Special Test Equipment for Prompt Gamma Simulator facility and Rapid Response Laboratory."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity of the Common Range Integrated Instrumentation System (CRIIS) Objective Program."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activities of the CRIIS Objective Program. This is a replacement system for the Advanced Range Data System (ARDS). This system will meet the critical need for measuring the precision location of units under test within the Time-Space domain. It provides a significant increase to the Test & Evaluation ranges' capability to meet the test instrumentation needs of the tri-service range users. The improvements are the data link, TSPI accuracy, miniaturization, standard interfaces, and system encryption of high dynamic instrumentation tracking pods  CRIIS instrumentation upgrades will be delivered to WSMR."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.104"
                                            },
                                            "Text": {
                                                "val": "Continued EMD of the CRIIS Objective Program.  Funds acquisition of CRIIS support equipment:  Two Instrumentation Pods, and associated remote ground stations and support equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.785"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD of the Common Range Integrated Instrumentation System (CRIIS) Objective Program. Funds acquisition of CRIIS support equipment:  Ten Instrumentation Pods, and associated remote ground stations and support equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.475"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD of the CRIIS Objective Program. Funds acquisition of CRIIS Lot 3 support equipment comprised of five Instrumentation Pods, and associated remote ground stations and support equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity of the Test Network Modernization Program."
                                    },
                                    "Description": {
                                        "val": "Engineering and Manufacturing Development phase contract activity for the Test Network Modernization. This program will provide a modern test infrastructure capable of reliable, secure transport of test data and test communications for all ATEC developmental test ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Text": {
                                                "val": "Starts the EMD phase contract activity for the Test Network Modernization. This program will provide a modern test infrastructure capable of reliable, secure transport of test data and test communications for all ATEC developmental test ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.032"
                                            },
                                            "Text": {
                                                "val": "Will continue the Engineering and Manufacturing Development (EMD) phase contract activity for the Test Network Modernization. This program will provide a modern test infrastructure capable of reliable, secure transport of test data and test communications for all ATEC developmental test ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.307"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.307"
                                            },
                                            "Text": {
                                                "val": "Will continue the EMD phase contract activity for the Test Network Modernization. This program will provide a modern test infrastructure capable of reliable, secure transport of test data and test communications for all ATEC developmental test ranges.  Funds will procure and install End of Life network hardware for five Test Centers (Aberdeen, Electronic Proving Grounds, Redstone, White Sands, and Yuma), replacing existing obsolete hardware that no longer meets Risk Management Framework (RMF) requirements for operational availability.  Includes procurement of a standardized Network Monitoring System across five Test Centers (Aberdeen, Electronic Proving Grounds, Redstone, White Sands, and Yuma) to allow operators the ability to monitor and track network traffic and trouble shoot network failure points."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for Robotics\/UAS Instrumentation Suite"
                                    },
                                    "Description": {
                                        "val": "Robotics\/Unmanned Autonomous System (UAS) Instrumentation Suite for testing controlled and autonomous ground and aerial robotic systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Starts the EMD phase contract activity for the Robotics Unmanned Autonomous System (RUAS) Instrumentation Suite.  This program will develop and procure instrumentation for testing controlled and autonomous ground and aerial robotic systems at four (4) ATEC Test Centers (Aberdeen, Redstone, White Sands and Yuma)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.030"
                                            },
                                            "Text": {
                                                "val": "Leveraging requirements analysis conducted by ATEC Test Centers, project will begin EMD Phase to develop and procure instrumentation for testing controlled and autonomous ground and aerial robotic systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.247"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.247"
                                            },
                                            "Text": {
                                                "val": "Will continue Engineering and Manufacturing Development (EMD) phase contract activity for the Robotics\/UAS Instrumentation Suite. This program will procure instrumentation to be installed on aerial and ground platforms to collect performance test data.  Initial instrumentation acquisition will focus on Global Position System (GPS) tracking and accuracy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Applied Environments Modernization program."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activity for the  Applied Environments Modernization program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.394"
                                            },
                                            "Text": {
                                                "val": "Started the EMD phase contract activity for the Applied Environments Modernization program. This program will upgrade antiquated Environmental labs for climatic and dynamic testing with new cascade refrigeration units, climatic chambers, vibration test systems, x-ray cameras, a real-time radiography system and full spectrum solar lights."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.061"
                                            },
                                            "Text": {
                                                "val": "Will continue the Engineering and Manufacturing Development (EMD) phase contract activity for the Applied Environments Modernization program. This program will upgrade antiquated Environmental labs for climatic and dynamic testing with new cascade refrigeration units, climatic chambers, vibration test systems, x-ray cameras, a real-time radiography system and full spectrum solar lights."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.621"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.621"
                                            },
                                            "Text": {
                                                "val": "Will continue the EMD phase contract activity for the Applied Environments Modernization program. This program will upgrade antiquated Environmental labs for climatic and dynamic testing with new cascade refrigeration units, climatic chambers, vibration test systems, x-ray cameras, a real-time radiography system and full spectrum solar lights."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for System of Systems Cooperative Engagement Test Infrastructure (SCETI)"
                                    },
                                    "Description": {
                                        "val": "System of Systems Cooperative Engagement Test Infrastructure (SCETI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.206"
                                            },
                                            "Text": {
                                                "val": "Leveraging requirements analysis conducted by ATEC Test Centers, project will begin the EMD phase of System of Systems Cooperative Engagement Test Infrastructure (SCETI) for the development of systems to conduct systems level Manned-Unmanned Teaming (MUM-T) testing for both aircraft and ground systems in a distributed environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.973"
                                            },
                                            "Text": {
                                                "val": "Leveraging requirements analysis conducted by ATEC Test Centers, project will begin the EMD phase of System of Systems Cooperative Engagement Test Infrastructure (SCETI) for the development of systems to conduct systems level Manned-Unmanned Teaming (MUM-T) testing for both aircraft and ground systems in a distributed environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.438"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.438"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD phase contract activity for the SCETI program. This program will design and develop a test chamber to replicate degraded visual environments for various environmental conditions (i.e. rain, dust, snow, etc.) for helicopters."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Future Wireless Network program."
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activity for the Future Wireless Network program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.606"
                                            },
                                            "Text": {
                                                "val": "Start the EMD phase contract activity for the Future Wireless Network program. This program will procure and integrate wireless network technologies across ATEC test activities which will provide near real-time data collection support for developmental test and operational test events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.574"
                                            },
                                            "Text": {
                                                "val": "Will continue the Engineering and Manufacturing Development (EMD) phase contract activity for the Future Wireless Network program. This program will procure and integrate wireless network technologies across ATEC test activities which will provide near real-time data collection support for developmental test and operational test events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Telemetry Systems Modernization program"
                                    },
                                    "Description": {
                                        "val": "EMD phase contract activity for the Telemetry Systems Modernization program"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.443"
                                            },
                                            "Text": {
                                                "val": "Start the EMD phase contract activity for the Telemetry Systems Modernization program. This program will upgrade\/replace mobile and fixed site telemetry equipment and telemetry data processing equipment RTC, ATC, WSMR and YPG."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Will continue the Engineering and Manufacturing Development (EMD) phase contract activity for the Telemetry Systems Modernization program. This program will upgrade\/replace mobile and fixed site telemetry equipment and telemetry data processing equipment Redstone Test Center (RTC), Aberdeen Test Center (ATC), White Sands Missile Range (WSMR) and Yuma Proving Ground (YPG)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "986"
                    },
                    "ProjectTitle": {
                        "val": "Major Operational Test Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.713"
                        },
                        "CurrentYear": {
                            "val": "17.971"
                        },
                        "BudgetYearOne": {
                            "val": "18.990"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.990"
                        },
                        "BudgetYearTwo": {
                            "val": "15.660"
                        },
                        "BudgetYearThree": {
                            "val": "15.843"
                        },
                        "BudgetYearFour": {
                            "val": "16.073"
                        },
                        "BudgetYearFive": {
                            "val": "16.559"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the development, acquisition, and integration of major operational test instrumentation for the United States (U.S.) Army Test and Evaluation Command's (ATEC) Operational Test Command and supporting test activities at test and training ranges. Requirements for instrumentation are identified through a long range survey of project managers, Research Development and Engineering Centers (RDECs), and Battle Laboratories developing future weapon systems and the test programs that support these systems.  Program focus is to address Director Operational Test and Evaluation (DOT&E) identified Army test realism shortfalls.\nFY18 funds will be used for Follow-On Operational Test and Evaluation (FOT&E) in support of PM Apache, Joint Light Tactical Vehicle (JLTV) and Rifleman Radio. \n\nProjects are designated as a major test program based on their visibility, assessed relative technical risk (medium-high), schedule risk, cost (greater than $1.5 Million per year or $7.5 Million for the total project) and applicability to other mission areas or services. These projects are technically demanding, state-of-the-art, unique instrumentation assets or suites to meet the technology shortfalls, and generally result from development programs managed by a professional project management team.\n\nDirector Operational Test and Evaluation (DOT&E) annual report to Congress identified shortfalls in the Army’s abilities to create realistic operational environments. The Integrated Live-Virtual-Constructive (LVC) Test Environment (ILTE) project will address multiple shortfalls identified by DOT&E. ILTE is a portfolio of related development efforts that will deliver a system of systems to provide a Real-Time Casualty Assessment (RTCA) and instrumentation suite  that delivers a high fidelity, realistic, real-time capability to measure hardware and personnel performance in modern combat environments. ILTE will enable testing under tactical conditions for small and large-scale operations while integrating network operations and effects in support of the Army Equipment Modernization Plan. ILTE also allows the U.S. Army to test all Current-to-Future, weapon systems in a realistic operational environment. ILTE will transition Research, Development, Test and Evaluation (RDTE) developed performance enhancements and technology upgrades to the operational test command, control, and communications, communications network, weapons system interfaces, vehicle and dismounted-troop kits and peripherals, Global Positioning Systems (GPS), encryption components, and integrates operational realistic digital battlefield data collection and analysis tools. These tools will collect, store and analyze data from the digital battlefield. Improvements will enable the ILTE system of systems to measure and record accrued damage, levels of exposure, effects of countermeasures, evasive action, and instrument threat vehicles. This capability is required by the operational test community to integrate digital battlefield data collection and analysis tools into the Network Integration Evaluation (NIE), M1A2, M2A4, Stryker, Armored Multi-Purpose Vehicle (AMPV), AH-64E, Gray Eagle and other operational tests."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrated Live-Virtual-Constructive (LVC) Test Environment (ILTE) - formerly \"Real-Time Casualty Assessment (RTCA)\""
                                    },
                                    "Description": {
                                        "val": "Transition from Technology Maturation and Risk Reduction (TMRR) Phase to Engineering, Manufacturing, and Development (EMD) Phase and acquisition of ILTE capabilities required to conduct Operational Tests."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.713"
                                            },
                                            "Text": {
                                                "val": "Materiel development decision approved Feb 2016. Project office has been established.  Concept of Operations (CONOPS), Use Cases, and derived requirements have been identified and documented.  Applicable technology maturation efforts have been identified for monitoring and transition into ILTE.  Gaps have been identified for Science and Technology (S&T) development.  Projects have been initiated for low risk solutions to critical capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.971"
                                            },
                                            "Text": {
                                                "val": "ILTE project transitions from Technology Maturation and Risk Reduction (TMRR) to Engineering and Manufacturing Development (EMD) Phase. Project ramps up to provide capabilities in direct support of Operational Test of the Joint Light Tactical Vehicle and Armored Multi-Purpose Vehicle. Will continue to fund the development of hardware, software, interfaces, and new capabilities to ensure RTCA\/ILTE requirements for upcoming operational tests are satisfied. Will fund integration of improved representation of unmanned aerial system in operational test environments. Will continue to develop capability to provide a realistic operational test environment.  Funds will continue to be allocated for RTCA instrumentation and simulation systems to be used to support Force-on-Force Operational Tests which support a more comprehensive operational test.  New development efforts will include integration of classified and unclassified simulations into a common environment.  Continued development efforts include, integration with new tactical systems under test, integration with Live, Virtual, and Constructive simulation environments, RTCA capabilities for active protection systems and countermeasures, RTCA capabilities for communications\/sensor kills and degradations, development, integration, and testing of mission command effects and degradations, communications upgrade, new communications sub-systems, new encryption and RTCA capabilities for electronic warfare and countermeasures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.990"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.990"
                                            },
                                            "Text": {
                                                "val": "ILTE project transitions from TMRR to EMD Phase. Project ramps up to provide capabilities in direct support of Operational Test of the AH-64E, Joint Light Tactical Vehicle (JLTV), and Armored Multi-Purpose Vehicle (AMPV). Will continue to fund the development of hardware, software, interfaces, and new capabilities to ensure Real-Time Casualty Assessment(RTCA)\/ILTE requirements for upcoming operational tests are satisfied. Will fund integration of improved representation of unmanned aerial system in operational test environments. Will continue to develop capability to provide a realistic operational test environment. Funds will continue to be allocated for Real-Time Casualty Assessment (RTCA) instrumentation and simulation systems to be used to support Force-on-Force Operational Tests which support a more comprehensive operational test infrastructure. New development efforts will include integration of classified and unclassified simulations into a common environment. Continued development efforts include, integration with new tactical systems under test, integration with Live, Virtual, and Constructive simulation environments, RTCA capabilities for active protection systems and countermeasures, RTCA capabilities for communications\/sensor kills and degradations, development, integration, and testing of mission command effects and degradations, communications upgrade, new communications sub-systems, new encryption and RTCA capabilities for electronic warfare and countermeasures."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EY9"
                    },
                    "ProjectTitle": {
                        "val": "Range Radar Replacement Program (RRRP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.721"
                        },
                        "CurrentYear": {
                            "val": "26.333"
                        },
                        "BudgetYearOne": {
                            "val": "42.006"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.006"
                        },
                        "BudgetYearTwo": {
                            "val": "49.014"
                        },
                        "BudgetYearThree": {
                            "val": "48.976"
                        },
                        "BudgetYearFour": {
                            "val": "19.291"
                        },
                        "BudgetYearFive": {
                            "val": "19.850"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In Fiscal Year (FY) 2017 Range Radar Replacement Program (RRRP) was realigned within this Program Element from Project 984\/Major Developmental Testing Instrumentation to Project EY9\/RRRP.  RRRP transferred to Program Executive Office (PEO) Missiles and Space (M&S) for completion of mission.  Prior development effort was funded in Army Program Element (APE) 0604756 \/ Project 984."
                        },
                        "ProjectMissionDescription": {
                            "val": "The RRRP develops modern instrumentation radars to replace obsolete tracking and surveillance radars at United States (U.S.) Army Test and Evaluation Command's (ATEC) Developmental Test Command (DTC) activities which include: Aberdeen Test Center (ATC), MD; Redstone Test Center (RTC), AL; White Sands Test Center (WSTC), NM; and Yuma Test Center (YTC), AZ.  The acquisition of modern instrumentation radar systems will provide the Army critical testing data essential for the development of complex next generation technology and advanced system capabilities.  The RRRP provides the test centers with improved radar resolution, sensitivity, accuracy, clutter suppression, and reliability.  The planned solution for the program requirements is a modular open architecture system consisting of four primary items: a Long Range Radar (LRR), a Medium Range Radar (MRR), a Short Range Radar (SRR), and a Radar Operations Console (ROC).  The resulting system will not only reduce operation and sustainment costs for the ranges, but improve data collection, thus enhancing development of Army systems being tested at these ranges. The current fleet of instrumentation radars located at ATC, RTC, WSTC, and YTC has become antiquated to the extent that they are not able to support the test needs of the test centers.\n\nThe Project will procure Commercial-Off-The-Shelf (COTS) radars for both the MRR and SRR solutions along with a COTS replacement for the FPS-16 LRR.  Also, the program will conduct EMD for upgrading three MPS-39 LRRs and the ROC.\n\nFY18 funds the Engineering and Manufacturing Development (EMD) for the RRRP Block One (I) LRR and ROC systems in preparation for replacement of equipment at ATC, RTC, WSTC and YTC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) Phase Contract Activity"
                                    },
                                    "Description": {
                                        "val": "EMD phase contracts activities for RRRP"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.721"
                                            },
                                            "Text": {
                                                "val": "Engineering Manufacturing Development (EMD) continued for the RRRP with adjustments for the Long Range Radar (LRR) and the Medium Range Radar (MRR) systems in preparation for replacement of equipment at Aberdeen Test Center (ATC), Redstone Test Center (RTC), White Sands Test Center (WSTC) and Yuma Test Center (YTC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.333"
                                            },
                                            "Text": {
                                                "val": "Continue Engineering and Manufacturing Development (EMD) for the RRRP for the Long-Range Radars (LRR).  Procure Commercial-Off-The-Shelf (COTS) Medium Range Radars (MRR) and Short Range Radars (SRR) systems in preparation for replacement of equipment at Aberdeen Test Center (ATC), Redstone Test Center (RTC), White Sands Test Center (WSTC) and Yuma Test Center (YTC)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.006"
                                            },
                                            "Text": {
                                                "val": "Conduct EMD for the RRRP LRR (MPS-39 Radar Upgrade) and Radars Operations Console (ROC).  Results of the Business Case Analysis (BCA) completed in FY17 have refocused\/realigned the program to procure Commercial Off-The-Shelf (COTS) radars for the remaining SRR and MRR systems; COTS for replacement of the remaining FPS-16 Radar system; Recapitalize\/Upgrade three MPS-39 Radar systems as replacements of equipment at ATC, RTC, WSTC, and YTC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FA4"
                    },
                    "ProjectTitle": {
                        "val": "Warrior Injury Assessment Manikin (WIAMan)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "1.700"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "New Start for Fiscal Year (FY) 17: Warrior Injury Assessment Manikin (WIAMan) Anthropomorphic Test Device (ATD). Project FA4 is a New Project in Army Program Element 0604759A, created for WIAMan."
                        },
                        "ProjectMissionDescription": {
                            "val": "WIAMan ATD will develop and produce Warrior-representative ATDs that incorporate associated biomechanically-validated injury assessment tools to better characterize dynamic events and injury risks measured in Live Fire Test & Evaluation (LFT&E) and vehicle development efforts. This capability is comprised of an ATD system purpose built for the Title 10 live fire test and evaluation environment and associated biomechanics data and analysis tools."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Warrior Injury Assessment Manikin (WIAMan) Anthropomorphic Test Device (ATD)"
                                    },
                                    "Description": {
                                        "val": "Will begin the transition from Technology Maturation and Risk Reduction (TMRR) phase for WIAMan ATD."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "Will begin the transition from Technology Maturation and Risk Reduction (TMRR) phase with Warrior Injury Assessment Manikin (WIAMan) Anthropomorphic Test Device (ATD) prototype refinement to source selection activities preparing for entry into EMD phase."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Will continue the transition from an RDECOM conducted science and technology research akin to Technology Maturation and Risk Reduction (TMRR) phase with WIAMan ATD prototype refinement to source selection activities and entry into the Engineering and Manufacturing Development (EMD) phase.  FY18 increased funding covers additional costs associated with testing, engineering and procurement of a prototype."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}