{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-17",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603606A"
        },
        "ProgramElementTitle": {
            "val": "Landmine Warfare and Barrier Advanced Technology"
        },
        "R1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.425"
            },
            "CurrentYear": {
                "val": "17.451"
            },
            "BudgetYearOne": {
                "val": "17.948"
            },
            "BudgetYearOneBase": {
                "val": "17.948"
            },
            "BudgetYearTwo": {
                "val": "13.097"
            },
            "BudgetYearThree": {
                "val": "13.232"
            },
            "BudgetYearFour": {
                "val": "13.908"
            },
            "BudgetYearFive": {
                "val": "14.095"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates sensors, subsystems and neutralization technologies that can be used by dismounted forces as well as ground and air platforms to detect, identify and mitigate the effects of landmines, improvised explosive devices, minefields, and other explosive hazards. This PE also conducts modeling and simulation activities to assess the effectiveness of detection and neutralization concepts. Project 608 supports the maturation and demonstration of enabling component and subsystems for counter explosive hazards and countermine technologies in the areas of countermine and barrier development and Project 683 funds efforts on area denial sensors.\n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602712A (Countermine Systems), PE 0602784A (Military Engineering Technology), PE 0603004 (Weapons and Munitions Advances Technologies), PE 0603270 (Electronic Warfare Technology) and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the United States (U.S.) Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.966"
                },
                "CurrentYear": {
                    "val": "17.451"
                },
                "BudgetYearOne": {
                    "val": "18.659"
                },
                "BudgetYearOneBase": {
                    "val": "18.659"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.425"
                },
                "CurrentYear": {
                    "val": "17.451"
                },
                "BudgetYearOne": {
                    "val": "17.948"
                },
                "BudgetYearOneBase": {
                    "val": "17.948"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.541"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.711"
                },
                "BudgetYearOneBase": {
                    "val": "-0.711"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.541"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.750"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.750"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.039"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.039"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "608"
                    },
                    "ProjectTitle": {
                        "val": "Countermine & Bar Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.518"
                        },
                        "CurrentYear": {
                            "val": "15.465"
                        },
                        "BudgetYearOne": {
                            "val": "15.957"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.957"
                        },
                        "BudgetYearTwo": {
                            "val": "11.104"
                        },
                        "BudgetYearThree": {
                            "val": "11.238"
                        },
                        "BudgetYearFour": {
                            "val": "11.873"
                        },
                        "BudgetYearFive": {
                            "val": "12.018"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for finding and neutralizing explosive hazards in varying vegetation, soil, and weather conditions at varying times of day. Activities include standoff and close-in detection and neutralization of explosive threats with technology integrated onto both air and ground platforms and in dismounted operations. Efforts are supported by modeling and simulation assessments to define potential system effectiveness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (U.S.) Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Ft. Belvoir, VA. Minefield neutralization efforts are closely coordinated with Navy\/Marine Corps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This project improves detection, marking, and defeat of low metal\/low contrast explosive threats buried in the road and along the sides of roads, Improvised Explosive Devices (IEDs) and antitank landmines. It also matures technologies to increase standoff detection and defeat distances, both in roads and off routes, enabling faster rates of advance and safer operations for early entry and route clearance missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.518"
                                            },
                                            "Text": {
                                                "val": "Matured target detection algorithms for digital ground penetrating radar (GPR) array for identification of explosive hazards in roads and for precision marking; matured forward looking electro-optical \/ infrared (EO\/IR) sensor suite with optimized spatial and spectral resolutions, multi-step target detection algorithms and automated decision making tools to provide integrated capabilities; integrated EO\/IR and GPR sensors data and analysis architectures to fuse target nominations from the standoff and localization sensors into a Graphical User Interface (GUI); demonstrated Light Detection and Ranging (LIDAR) sensor to image and identify side attack targets and threats and base lined target detection algorithms to detect road side explosive hazards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.465"
                                            },
                                            "Text": {
                                                "val": "Will integrate optimized forward looking EO\/IR sensor suite with multi-step target detection algorithms and automated decision making tools to provide a robust vehicle mounted technology demonstrator; finalize forward looking EO\/IR to down looking GPR sensor cueing architectures and software to fuse target nominations from the standoff and localization sensors into a GUI; integrate LIDAR sensor to image and identify side attack targets and threats onto vehicle testbed; and optimize target detection algorithms to detect road side explosive hazards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.957"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.957"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and evaluate an integrated forward looking EO\/IR sensor suite with multi-step target detection algorithms and automated decision making tools in relevant outdoor environments; demonstrate real-time on-the-move forward looking EO\/IR to down looking GPR sensor cueing with integrated graphical user interface; demonstrate and evaluate LIDAR sensor capability to identify side attack targets using vehicle test bed; validate optimized target detection algorithms to detect in-road and road side explosive hazards."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "683"
                    },
                    "ProjectTitle": {
                        "val": "Area Denial Sensors"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.907"
                        },
                        "CurrentYear": {
                            "val": "1.986"
                        },
                        "BudgetYearOne": {
                            "val": "1.991"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.991"
                        },
                        "BudgetYearTwo": {
                            "val": "1.993"
                        },
                        "BudgetYearThree": {
                            "val": "1.994"
                        },
                        "BudgetYearFour": {
                            "val": "2.035"
                        },
                        "BudgetYearFive": {
                            "val": "2.077"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates surveillance and command, and control technology components for anti-access area denial systems that inform maneuver elements and minimize the risk to non-combatants from exposure to anti-personnel landmines (APLs). The technology includes distributed personnel surveillance systems and command and control systems to be used with human-in-the-loop threat confirmation. This Project uses modeling and simulation to evaluate new concepts and doctrine. This Project also fabricates components and system architectures, and it conducts evaluations in field settings.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States (U.S.) Army Communications-Electronics Research, Development and Engineering Center (CERDEC)\/Night Vision and Electronic Sensors Directorate (NVESD), Fort Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Area Denial Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates networked sensor and sensor fusion technology efforts to provide detection, identification, and classification of remotely delivered sensor systems and area denial munitions. Key technologies to be matured and demonstrated include deployable multi-mode sensors, fused sensor information, and local area network communications to meet requirements for human-in-the-loop command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.907"
                                            },
                                            "Text": {
                                                "val": "Matured deployable multi-mode sensor architecture that can be integrated into remote delivery munitions, focusing on harsh shock environments; and matured sensor fusion technologies to provide operator management of many remotely employed multi-mode sensor nodes to provide situational awareness and area denial effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.986"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a hand emplaced sensor system that captures relevant threat signatures to increase probability of detection and decrease false alarms; will optimize sensor fusion technologies to provide operator management of multiple remotely employed sensor nodes to provide situational awareness and area denial effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.991"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.991"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate scatterable deployed sensor fields, develop image and data processing techniques to improve data management to decision cycle time; demonstrate sensor target data connection to fire control, optimize sensor performance and coordinate interfaces with Fires elements."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}