{
    "id": "2018-Army-PB-2040-JBOOK-f1761bc1f23ae76d2187ded682cf43dd42d72ebbea356f89412a95fa51a35f27-19",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604746A"
        },
        "ProgramElementTitle": {
            "val": "Automatic Test Equipment Development"
        },
        "R1LineNumber": {
            "val": "99"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.636"
            },
            "CurrentYear": {
                "val": "8.813"
            },
            "BudgetYearOne": {
                "val": "8.344"
            },
            "BudgetYearOneBase": {
                "val": "8.344"
            },
            "BudgetYearTwo": {
                "val": "14.464"
            },
            "BudgetYearThree": {
                "val": "12.085"
            },
            "BudgetYearFour": {
                "val": "11.060"
            },
            "BudgetYearFive": {
                "val": "11.245"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) provides for development and testing of general-purpose test equipment, state-of-the-art diagnostics and prognostics technologies, and software and systems to support the increasingly complex electronic components of the Army's new and upgraded weapon systems.  It focuses on implementation of commercial test and diagnostic technologies across multiple weapon platforms to minimize the cost of troubleshooting and maintenance of Army equipment in the field.  \n\nModular, reconfigurable automatic and semi-automatic systems are being developed under this program to satisfy weapon system test and diagnostics requirements.  The Next Generation Automatic Test System (NGATS) provides state-of-the-art test and diagnostic capabilities to support current and future weapon systems.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) technologies into the Army weapon system support structure, and it will replace several aging automatic test systems (ATS) that are becoming prohibitively expensive to operate and maintain.  \n\nThis PE also provides for continued development and improvement of general-purpose test equipment and calibration standards with emphasis on the incorporation of digital electronics and tailoring of configurations to improve deployability, mobility and survivability of the support equipment.  It includes development, demonstration and testing of calibration standards and techniques to support new Army test equipment requirements.  It provides for feasibility studies, market research, inventory analyses, bid sample testing and prototyping to support acquisition of calibration systems and general-purpose test and diagnostics equipment. \n\nFY 2018 Base funding for this program continues incremental development of the Army's standard NGATS which will improve deployability and mobility of test and diagnostic equipment.  The NGATS provides state-of-the-art test and diagnostic capabilities and a means for reducing the Army's test equipment operating and support costs and the costs for supporting a number of the Army's vital warfighting systems.  The FY 2018 funding will develop or significantly modify test equipment to satisfy modular force and homeland security support requirements that cannot be accommodated with test equipment currently available in the commercial marketplace such as radio frequency (RF) and electro-optic (EO) testing capability.  It will also provide for technology enhancements to the Army's standard at-system tester to meet test and diagnostic requirements of the supported weapon systems, develop\/redesign test program sets and hardware for support of legacy and emerging weapon systems, develop a network centric software framework for NGATS, and develop and test general-purpose test equipment and calibration standards to meet Army weapon system support requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.960"
                },
                "CurrentYear": {
                    "val": "8.813"
                },
                "BudgetYearOne": {
                    "val": "10.362"
                },
                "BudgetYearOneBase": {
                    "val": "10.362"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.636"
                },
                "CurrentYear": {
                    "val": "8.813"
                },
                "BudgetYearOne": {
                    "val": "8.344"
                },
                "BudgetYearOneBase": {
                    "val": "8.344"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.324"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.018"
                },
                "BudgetYearOneBase": {
                    "val": "-2.018"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.324"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.018"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2016 - $0.324 million reprogrammed to meet higher priority requirements\nFY2018 - $2.018 million realigned to meet higher priority requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L59"
                    },
                    "ProjectTitle": {
                        "val": "Diagnost\/Expert Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.544"
                        },
                        "CurrentYear": {
                            "val": "6.034"
                        },
                        "BudgetYearOne": {
                            "val": "5.883"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.883"
                        },
                        "BudgetYearTwo": {
                            "val": "8.514"
                        },
                        "BudgetYearThree": {
                            "val": "7.312"
                        },
                        "BudgetYearFour": {
                            "val": "6.903"
                        },
                        "BudgetYearFive": {
                            "val": "6.961"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds development of and system enhancements for the Next Generation Automatic Test System (NGATS) and the Maintenance Support Device (MSD).  The NGATS is a general-purpose automatic test system (ATS) that provides test and diagnostic capabilities required to support current and future weapons and combat support systems and will facilitate retirement of aging and obsolete test equipment that is imposing increasing logistics and operations and support cost burdens.  It is the platform for transitioning Agile Rapid Global Combat Support System (ARGCS) Advanced Concept Technology Demonstration (ACTD) technologies into the Army weapon system support structure.  The ARGCS ACTD initiative was sponsored by the Department of Defense, and all Services are expected to transition demonstrated technologies into their ATS programs.  The MSD is the Army's standard at-system tester and requires continuing upgrades to support technology advancements in the supported weapon systems.  This project funds development projects to incorporate the most current relevant technology into the next generation MSD, supports capability enhancement of a wireless at-platform test set (WATS) connectivity, develops capabilities to minimize or eliminate Army dependency on expensive proprietary software to support tactical vehicles, and maintains compatibility with emerging platform hardware bus technology and software interface requirements.  This project also provides for continuing efforts in the development and testing of common procedures utilizing existing test program sets and software applications, and market surveys of commercially available test equipment, methods and procedures to determine applicability to Army requirements.  The test and diagnostic systems and procedures developed under this project are essential for ensuring the operational readiness, accuracy and effectiveness of the Army's warfighting systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NGATS Radio Frequency (RF) Test Capability"
                                    },
                                    "Description": {
                                        "val": "Develop and integrate NGATS RF test capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiated RF Interface Unit development, prototyping and integration of the entire RF test asset into the NGATS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue prototyping and integration of RF subsystem into the NGATS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Continue prototyping and integration of RF subsystem into the NGATS, specifically the RF Interface Unit and the full-rate production NGATS configuration.  Develop RF software libraries to support programs such as Counter Radio-Controlled Improvised Explosive Device (RCIED) Electronic Warfare (CREW)\/Duke, TPQ-53 Radar and other emerging weapons systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Increment 2"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS Increment 2 support capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.730"
                                            },
                                            "Text": {
                                                "val": "Continued development and testing of hardware and software for support of Increment 2 systems (Avenger, Multiple Launch Rocket System, TOW Missile System, Paladin and Common Remotely Operated Weapons Station II (CROWS II))."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of additional Increment 2 systems (Counter RCIED (Radio-Controlled Improvised Explosive Device) Electronic Warfare (CREW) Duke, Precision Fires, Armored Multi-Purpose Vehicle (AMPV), Stryker Mobile Gun System (MGS), and Joint Assault Bridge (JAB))."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.382"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.382"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of hardware and software for support of emerging required capabilities such as high-speed digital, fiber channel, high-speed Ethernet and serial busses, and high power test (600V).  Develop new software libraries to utilize instrument functions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Electro-Optics (EO) Subsystem"
                                    },
                                    "Description": {
                                        "val": "Develop and test hardware and software for NGATS electro-optics (EO) subsystem (to include the capability to support new ground and aerial sensors for unmanned air and ground vehicles)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Initiated hardware and software integration\/testing of the EO subsystem into the NGATS for use by test program set (TPS) developers and depots."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue integration\/testing of EO subsystem into NGATS to include redesign for production and optimal logistic support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Complete integration\/testing of EO subsystem."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Developmental and Operational Follow-on Testing of NGATS Increment 1 Capability (provides Abrams\/Bradley\/Stryker support capability)"
                                    },
                                    "Description": {
                                        "val": "Complete developmental and operational follow-on testing activities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Initiated developmental and operational follow-on testing activities to include Reliability Testing, Logistics Demonstration\/TM Verification and Transportability Testing in support of a production decision.  Included also the assessment\/verification of the development of remaining, needed capability of existing systems to operate with all existing test program sets used with legacy automatic test equipment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Continue and complete remaining required testing, assessment and verification events."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additional Software Capabilities for Use with NGATS"
                                    },
                                    "Description": {
                                        "val": "Develop software capabilities to incorporate common logistics operating environment\/netcentric and embedded diagnostics data collection and analysis for closed loop diagnostic maintenance in support of condition-based maintenance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continued development of a network centric software framework to facilitate configuration status accounting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.270"
                                            },
                                            "Text": {
                                                "val": "Continue development of a network centric software framework to facilitate data exchange with other components of the global information grid (GIG)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.127"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.127"
                                            },
                                            "Text": {
                                                "val": "Develop new and emerging netcentric architecture.  Develop software architecture that will define the transport protocol to interface to DoD common logistics environments and Logistics Modernization Program (LMP).  Develop and improve data packages to include health management information."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Performance Enhancement"
                                    },
                                    "Description": {
                                        "val": "NGATS core instrument\/software modifications to increase NGATS performance"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Continued development of NGATS core instrument\/software modifications to increase NGATS performance to include redesign of the ATE interface perimeter engagement system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.730"
                                            },
                                            "Text": {
                                                "val": "Complete prototype and evaluation of the redesigned perimeter engagement system and initiate development of increased processor speed with NGATS controller to add additional capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Continue obsolescence identification and mitigation; continue analysis of system reliability and performance; identify bad actors and propose and integrate upgrades to increase readiness.  Analyze new requirements from emerging weapons systems and implement system upgrades through hardware and software to meet platform testing requirements.  Implement and test controller upgrade to increase processor speed to support Win10 implementation.  Redesign cables for better logistic support and cost savings."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Abrams\/Bradley Test Program Set (TPS) Design"
                                    },
                                    "Description": {
                                        "val": "Design, test and evaluate Abrams\/Bradley TPSs to utilize modern core NGATS instrumentation vice continuing to execute on single-purpose instrumentation specifically developed to emulate Abrams\/Bradley legacy test equipment (i.e., Direct Support Electrical System Test Set (DSESTS))"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Redesign Abrams\/Bradley TPSs to execute on core commercial NGATS instrumentation versus continuing to execute on single-purpose instrumentation specifically developed for testing Abrams\/Bradley LRUs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Continue redesign of Abrams\/Bradley TPSs to execute on core commercial NGATS instrumentation versus continuing to execute on single-purpose instrumentation specifically developed for testing Abrams\/Bradley line replaceable units (LRU)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electro-Optic (EO) TPS Development"
                                    },
                                    "Description": {
                                        "val": "Develop Increment 2 and 3 EO TPSs for use with NGATS EO asset to utilize (Army standard) core NGATS instrumentation vice legacy automatic test systems such as DSESTS and Base Shop Test Facility (BSTF)(V)5"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Initiated development of re-hosted EO TPSs to include 4 each Abrams\/Bradley."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.750"
                                            },
                                            "Text": {
                                                "val": "Complete development of re-hosted EO TPSs to include 4 each Abrams\/Bradley."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Continue development of re-hosted EO TPSs to include 2 each CROWS and 2 each Stryker Remote Weapons Station."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Logistics Support Products"
                                    },
                                    "Description": {
                                        "val": "Develop NGATS initial logistics support products (including provisioning, technical manuals and calibration)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiated development of initial logistics support products for the NGATS EO and RF subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue development of NGATS EO and RF logistics products and Abrams\/Bradley TPS technical manuals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.200"
                                            },
                                            "Text": {
                                                "val": "Complete development of NGATS EO and RF logistics products for use with the full-rate production NGATS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maintenance Support Device (MSD) Technology Enhancements"
                                    },
                                    "Description": {
                                        "val": "Incorporate current relevant technology into the next-generation MSD and support capability enhancement of the wireless at-platform test set (WATS).  Develop capabilities to minimize or eliminate Army dependency on proprietary software to support tactical vehicles and maintain compatibility with emerging platform hardware bus technology and software interface requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.864"
                                            },
                                            "Text": {
                                                "val": "Completed enhancement of WATS radio technology, the common electronics package augmentation and WATS architectural software shell to provide at-platform wireless test support for Army vehicle and weapon systems platforms.  Continued to devise methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.234"
                                            },
                                            "Text": {
                                                "val": "Incorporate enhanced WATS radio technology, the common electronics package augmentation and new WATS software architecture into WATS prototype, conduct developmental testing, and develop draft Technical Data Package for at-platform wireless testing of Army vehicle and weapon systems platforms.  Continue to investigate new methods to minimize or eliminate Army dependency on proprietary software to support current and future tactical vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.633"
                                            },
                                            "Text": {
                                                "val": "Design a modern vehicle data bus development tool, leveraging the new WATS design.  The development tool will minimize the costs of connecting directly to vehicles.  This tool allows for quicker and more complete functional testing, along with serving as a much more comprehensive tool for new equipment training.  Develop MIL-STD-1553 software enhancements that maintain compatibility with emerging platform hardware bus technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NGATS Simulation Environment"
                                    },
                                    "Description": {
                                        "val": "Develop a simulation environment that will allow development and testing of TPSs on a desktop environment"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Initiate development of an NGATS simulation environment to allow TPS developers and contractors to develop and test TPSs on a desktop environment.  Environment will allow for a cost-effective way to develop, maintain and troubleshoot TPSs off station.  Develop desktop training environment for TPS developers and maintainers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TPS Development Environment"
                                    },
                                    "Description": {
                                        "val": "Develop a standardized TPS development environment for NGATS"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Text": {
                                                "val": "Initiate development on the C-Oriented Test Executive (COTE) TPS development software for NGATS.  Develop test executive that is standard and compliant with DoD initiatives, framework working group and the Automatic Test Equipment Management Board (AMB).  Standardized test executive will promote long-term maintainability of TPSs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Tamper\/Cyber Security"
                                    },
                                    "Description": {
                                        "val": "Develop an Anti-Tamper\/Cyber Security software capability for NGATS"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.191"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.191"
                                            },
                                            "Text": {
                                                "val": "Initiate development of Anti-Tamper\/Cyber Security (AT\/CS) software capability for NGATS.  Continue to upgrade existing hardware and software with constantly changing security and information assurance requirements.  Upgrade to Win10 operating system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "."
                                    },
                                    "Title": {
                                        "val": "OPA3, SSN MB4000, Integrated Family of Test Equipment (IFTE)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "36.187"
                                        },
                                        "CurrentYear": {
                                            "val": "29.781"
                                        },
                                        "BudgetYearOne": {
                                            "val": "37.644"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.144"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "7.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.763"
                                        },
                                        "BudgetYearThree": {
                                            "val": "27.771"
                                        },
                                        "BudgetYearFour": {
                                            "val": "33.878"
                                        },
                                        "BudgetYearFive": {
                                            "val": "40.492"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "None."
                        },
                        "AcquisitionStrategy": {
                            "val": "This developmental project consists of organic and contractual actions.  When the necessary expertise and capability are available within the Department of Defense, services required for the individual development projects are ordered from the government source; otherwise, commercial contracts are used.  Equipment required for developmental projects is obtained by contract from the commercial supplier.  Developmental efforts for the Next Generation Automatic Test System (NGATS) are being completed under a number of contracts awarded to the prime contractor for the Integrated Family of Test Equipment off-platform testers and other contractors with automatic test equipment (ATE) and test program set development capabilities.  NGATS is following an evolutionary acquisition strategy using incremental development to satisfy Army depot and field testing requirements for new and existing systems.  It will replace existing legacy Army ATE (i.e., Base Shop Test Facility (BSTF)(V)3, BSTF(V)5, and Direct Support Electrical System Test Set) as well as Army depot system-specific ATE."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L65"
                    },
                    "ProjectTitle": {
                        "val": "Test Equipment Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.092"
                        },
                        "CurrentYear": {
                            "val": "2.779"
                        },
                        "BudgetYearOne": {
                            "val": "2.461"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.461"
                        },
                        "BudgetYearTwo": {
                            "val": "5.950"
                        },
                        "BudgetYearThree": {
                            "val": "4.773"
                        },
                        "BudgetYearFour": {
                            "val": "4.157"
                        },
                        "BudgetYearFive": {
                            "val": "4.284"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports development and demonstration of state-of-the-art calibration standards and techniques, and it upgrades\/improves existing Army calibration systems.  The project provides feasibility studies, market research, inventory analyses, bid sample testing, and prototyping to support calibration systems and general-purpose test, measurement and diagnostic equipment (TMDE) acquisitions.  The primary effort of this project is development of calibration software; calibration capability for chemical, biological agent, radiation sourcing and detection systems; signal measurement and generation from direct current to microwave ranges; physical and mechanical measurements such as torque, pressure and temperature; and improvements in test and measurement equipment performance envelopes.  This project provides for product improvements and development\/evaluation of advanced technologies to increase reliability of calibration systems and general-purpose TMDE.  The product improvements eliminate gaps in existing organic capabilities and ensure operational readiness, accuracy, effectiveness, and safety of Army weapons and combat support systems.  These improvements employ reconfigurable open-electronics architecture and computer-based instrumentation where feasible and focus on reduced test equipment footprint to improve deployability and mobility in areas of operation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Calibration Sets (CALSETS) Software Environment and Calibration"
                                    },
                                    "Description": {
                                        "val": "Develop and test an Army automated calibration environment and develop calibration procedures.  Test and evaluate automated test equipment software efforts in support of the Army risk management framework (RMF)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.563"
                                            },
                                            "Text": {
                                                "val": "Continued development and evaluation of automated calibration procedures.  Evaluated feasibility of incorporating commercial procedures and calibration system performance monitoring within the software environment.  Tested and evaluated prototype calibration procedure development engine and RMF compliance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.785"
                                            },
                                            "Text": {
                                                "val": "Initiate addition of ISO 17025 accreditation reporting to calibration software environment and calibration procedures.  Develop and evaluate automated calibration procedures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.488"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.488"
                                            },
                                            "Text": {
                                                "val": "Conclude development and evaluation of automated calibration procedures.  Continue development and test of ISO 17025 accreditation reporting capability of the calibration software environment and calibration procedures.  Continue test and evaluation of RMF compliance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop, and test physical parameter calibration instrumentation to support areas such as force, torque, radiological, chemical and biological agent detection systems, night vision testers, small arms gages, pneumatic pressure systems and temperature."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.810"
                                            },
                                            "Text": {
                                                "val": "Continued development and test of prototype small arms gage calibration standards.  Continued development and test of calibration systems for biological agent detectors and protective equipment.  Concluded development of pneumatic standards to support avionic systems.  Performed market research, evaluated commercial equipment, and completed specifications for temperature, force, torque and radiological standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.833"
                                            },
                                            "Text": {
                                                "val": "Continue development and testing of prototype small arms gage calibration standards.  Continue development and test of calibration systems for biological agent detectors and protective equipment.  Complete tests of pneumatic standards to support avionic systems.  Perform market research, evaluate commercial equipment, and complete specifications for acquisition."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.775"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Text": {
                                                "val": "Continue test and evaluation of force, torque, temperature, load sensor and radiological prototype standards.  Conclude development and test of calibration systems for chemical and biological agent detectors and protective equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electrical Instruments"
                                    },
                                    "Description": {
                                        "val": "Research, develop, and test electrical parameter calibration instrumentation to support areas such as deployable recertification set, intrinsic electrical standards, electrical transport standards and electro-optic calibration capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.072"
                                            },
                                            "Text": {
                                                "val": "Performed market research, evaluated commercial equipment and developed performance specifications for acquisition.  Completed development and test of high voltage multiplier for AC intrinsic voltage system.  Developed and tested prototype microwave reference standard.  Initiated research and evaluation of electro-optic calibration capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.776"
                                            },
                                            "Text": {
                                                "val": "Perform market research, evaluate commercial equipment and develop performance specifications for acquisition.  Continue development of prototype microwave reference standards.  Research improvements in reliability, transportability and supportability of DC intrinsic voltage standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.813"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.813"
                                            },
                                            "Text": {
                                                "val": "Perform market research, evaluate commercial equipment and develop performance specifications for acquisition.  Complete development and test of prototype microwave reference standards.  Develop and test prototype systems that provide improvements in reliability, transportability and supportability of electrical voltage and electro-optic standards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test Equipment Modernization (TEMOD)"
                                    },
                                    "Description": {
                                        "val": "Perform market research, bid sample testing, and evaluation of commercial general-purpose electronic test equipment (GPETE) and develop performance specifications for TEMOD acquisitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.647"
                                            },
                                            "Text": {
                                                "val": "Performed market research and evaluation of commercial GPETE and developed performance specifications for equipment to support acquisition program.  Conducted bid sample testing to support acquisition program."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial GPETE and develop performance specifications for improved capability spectrum analysis test equipment.  Conduct bid sample testing to support acquisition program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Perform market research and evaluation of commercial GPETE and validate performance specifications for improved spectrum analysis test equipment.  Conduct bid sample testing to support acquisition program."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "SSN N10000"
                                    },
                                    "Title": {
                                        "val": "Calibration Sets Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.650"
                                        },
                                        "CurrentYear": {
                                            "val": "4.963"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.564"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.564"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.515"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.459"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.964"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.022"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "SSN N11000"
                                    },
                                    "Title": {
                                        "val": "Test Equipment Modernization"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.383"
                                        },
                                        "CurrentYear": {
                                            "val": "7.482"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.771"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.771"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.034"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.758"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.917"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.060"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects focus on commercial and nondevelopmental item technologies.  Department of Defense services provide programmatic, engineering expertise and capability for individual development projects; otherwise, commercial service contracts are used to obtain required capabilities.  Equipment required for development projects is obtained from commercial suppliers.  Candidate commercial equipment and nondevelopmental items are identified and evaluated through market research and government test and evaluation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}