{
    "id": "2018-Navy-PB-1319-JBOOK-9f3a8a749a70cc82edfd97c719da10864aff73adbc85dc3fd54cfc9acba4d6f1-9",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA4-U_RDTE_JustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603512N"
        },
        "ProgramElementTitle": {
            "val": "Carrier Systems Development"
        },
        "R1LineNumber": {
            "val": "39"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "53.431"
            },
            "PriorYear": {
                "val": "8.213"
            },
            "CurrentYear": {
                "val": "7.605"
            },
            "BudgetYearOne": {
                "val": "9.296"
            },
            "BudgetYearOneBase": {
                "val": "9.296"
            },
            "BudgetYearTwo": {
                "val": "5.918"
            },
            "BudgetYearThree": {
                "val": "5.778"
            },
            "BudgetYearFour": {
                "val": "5.904"
            },
            "BudgetYearFive": {
                "val": "6.024"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Navy unique program addresses all technology areas associated with Navy\/Marine Corps aircraft operations aboard ships. The program includes: \n\n- (3216) - The AN\/SQQ-34 Aircraft Carrier Tactical Support Center (CV-TSC) delivers Anti-Submarine Warfare (ASW) and Surface Warfare (SUW) combat capability to the Aircraft Carrier. CV-TSC integrates sensor data from Off-Board Aircraft, Organic Platform Sensors, Link-16 Track Data, Ship Self Defense System (SSDS) Track Data, Global Command and Control System (GCCS) Over-the-Horizon Track Data, and Environmental and Threat Databases to assess the threat and assist the Tactical Action Officer (TAO) and Composite Warfare Commander (CWC) to effectively employ overall CVN self-defense capabilities. CV-TSC generates real-time ASW\/SUW information and recommendations, tactical planning and employment of ASW\/SUW aircraft, ASW\/SUW sensor data processing and analysis, and distribution of tactically significant data.  Aircraft supported include: MH-60R\/S, P-8, Carrier-Based Aerial Refueling System (CBARS), Triton, and future ASW\/SUW aircraft.  \n\nBeginning in FY16, Project 3216 is supporting the design and development of a multi-application, cross-platform boundary defense capability as directed by the Chief of Naval Operations (CNO) and Assistant Secretary of the Navy Research, Development & Acquisition (ASN (RDA)) via the Task Force Cyber Awakening (TFCA) Advisory Board. \n\n- (4005) - The In-Service Carrier Systems Development Demonstration and Validation program exploits available technologies to deliver an affordable, robust, operator-friendly automation control environment for Navy Aircraft Carrier shipboard equipment. The program provides the system architecture, requirements\/specification development, technology selection, software development (including software baseline), as well as land-based and shipboard testing of new technologies to improve shipboard operations and to reduce workload, manpower requirements, and Total Ownership Costs (TOC)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.348"
                },
                "CurrentYear": {
                    "val": "7.605"
                },
                "BudgetYearOne": {
                    "val": "9.283"
                },
                "BudgetYearOneBase": {
                    "val": "9.283"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.213"
                },
                "CurrentYear": {
                    "val": "7.605"
                },
                "BudgetYearOne": {
                    "val": "9.296"
                },
                "BudgetYearOneBase": {
                    "val": "9.296"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.135"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.013"
                },
                "BudgetYearOneBase": {
                    "val": "0.013"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.135"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.013"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.013"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:\nFY 2016: Funding was decreased by $0.135M for SBIR.\n\nProject 3216: CV-TSC Build nomenclature has been updated from Build 8\/9\/10 to Fleet Capability Release (FCR 1\/2\/3\/etc.).\n\nProject 4005: FY 17 projects include: LPAP On-Machine I\/O, LPAP air end redesign, Modular Reefer Unit and PCMS alternate measurement capability. Additional FY18 projects planned include:  completion of LPAP On-Machine I\/O and LPAP air end redesign. Start of C4I networks performance reqmts modeling and analysis, Network Data Logger Device, ICAS SE improvements, Chlorinator\/Dechlorinator Reliability improvements, Portable Navigation\/ship control data analyzer, CVN 78 CL Platform support for JSF."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3216."
                    },
                    "ProjectTitle": {
                        "val": "Tactical Support Center-Integration"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "30.853"
                        },
                        "PriorYear": {
                            "val": "5.996"
                        },
                        "CurrentYear": {
                            "val": "7.032"
                        },
                        "BudgetYearOne": {
                            "val": "7.636"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.636"
                        },
                        "BudgetYearTwo": {
                            "val": "4.348"
                        },
                        "BudgetYearThree": {
                            "val": "4.443"
                        },
                        "BudgetYearFour": {
                            "val": "4.538"
                        },
                        "BudgetYearFive": {
                            "val": "4.629"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The CV-TSC project delivers ASW and SUW combat capability to the Aircraft Carrier. CV-TSC integrates sensor data from Off-Board Aircraft, Organic Platform Sensors, Link-16 Track Data, SSDS Track Data, Global Command and Control System (GCCS) Over-the-Horizon Track Data, and Environmental and Threat Databases to assess the threat and assist the TAO and CWC to effectively employ overall CVN self-defense capabilities. CV-TSC generates real-time ASW\/SUW information and recommendations, tactical planning and employment of ASW\/SUW aircraft, ASW\/SUW sensor data processing and analysis, and distribution of tactically significant data.  Aircraft supported include: MH-60R\/S, P-8, CBARS, Triton, and future ASW\/SUW aircraft. System development is accomplished through the following initiatives: \n1) Maintaining interoperability with the local CVN warfare systems through current and future interfaces; \n2) Continuing to support mission data exchange and tactical control with current and future ASW\/SUW aircraft and their mission systems; \n3) Improving track and sensor processing and analysis techniques as new track and sensor data becomes available; \n4) Improving mission planning support for the ASW\/SUW missions conducted from the CVN; \n5) Improving data recording, reconstruct, and distribution to meet the decreasing timelines associated with getting tactically significant data to other end users both on and off platform;  \n6) Improving embedded simulation and training capabilities to enable operator proficiencies; and \n7) Implementing cyber-security measures. \n\nThis project also provides development of Boundary Defense Capability (Cybersecurity) capabilities: The purpose of this effort is to define and develop enterprise Hull Mechanical & Electrical (HM&E) System cybersecurity solutions that will provide:  protections from cyber-attacks such as boundary defense capabilities that will protect threats entering and leaving HM&E systems, physical protections, message authentication and encryption methods; Detection solutions for system anomalies and attacks at the boundaries, on hosts, networks and backplanes; and provide for operator awareness (e.g. malware detection, file integrity verification, etc.); Reaction solutions that will enable operator and system responses to an attacks; and Recovery methods that will enable for a system to quickly get back to a good known state. Planning will also commence for the integration of cyber solutions into specific HM&E control systems (e.g. Machinery Control, Steering Control, etc.)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CV-TSC Development \/ Integration \/ Test \/ Certification"
                                    },
                                    "Description": {
                                        "val": "CV-TSC's evolutionary acquisition approach to developing, testing, certifying, and fielding system upgrades and cyber-security patches is implemented through phased Fleet Capability Releases (FCR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.040"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Completed development of initial release of CV-TSC Build 8.0 software version FCR-1, which provided architectural changes enabling the phased FCR plan to provide incremental software releases with capability updates and cyber-security patches.\n- Completed certifications required for fielding CV-TSC Build 8.0 software version FCR-1, to include Information Assurance (IA) Accreditation, Integrated Shipboard Network System (ISNS) and Consolidated Afloat Networks and Enterprise Services (CANES) Certifications, and PEO IWS Element Certification.\n- Conducted incremental requirements, design, and test reviews of FCR-1. \n- Conducted Combat System Test (CST) certification event of FCR-1 for CVN-72.\n- Began development of CV-TSC Build 8.0 software version FCR-2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.780"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete development of CV-TSC Build 8.0 software version FCR-2, with a focus on capability improvements to Public Key Enforcement (PKE) compliance, interoperability with multiple variants of SSDS and the Common Data Link System (CDLS). \n- Conduct incremental requirements, design, and test reviews of FCR-2.\n- Complete certifications required for fielding CV-TSC software version FCR-2, to include IA Accreditation, ISNS and CANES Certifications, PEO IWS Element Certification, and CST Certification. \n- Conduct CST event of FCR-2 for CVN-78 (4Q17).\n- Begin development on CV-TSC Build 8.0 software version FCR-3.\n- Conduct incremental requirements, design, and test reviews of FCR-3."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.222"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.222"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development on CV-TSC Build 8.0 software version FCR-3.\n- Continue incremental requirements, design, and test reviews of FCR-3.\n- Update System Engineering Plan (SEP).  \n- Transition requirements into a systems engineering modeling tool.\n- Modify interface requirement specifications for changing interfaces.  \n- Transition Information Assurance (IA) Accreditation to Risk Management Framework (RMF)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NAVSEA Boundary Defense Capability (Cybersecurity)"
                                    },
                                    "Description": {
                                        "val": "The purpose of this effort is to define and develop enterprise Hull Mechanical & Electrical (HM&E) System cybersecurity solutions that will provide: protections from cyber-attacks such as boundary defense capabilities that will protect threats entering and leaving HM&E systems, physical protections, message authentication and encryption methods; Detection solutions for system anomalies and attacks at the boundaries, on hosts, networks and backplanes; and provide for operator awareness (e.g. malware detection, file integrity verification, etc.); Reaction solutions that will enable operator and system responses to an attacks; and Recovery methods that will enable for a system to quickly get back to a good known state. Planning will also commence for the integration of cyber solutions into specific HM&E control systems (e.g. Machinery Control, Steering Control, etc.).\n\nThe development of a cyber-resilient HM&E architecture will include the integration of cybersecurity solutions and system engineering processes to individual HM&E Systems and their Components to ensure a consistent cyber security posture across the entire HM&E Enclave. Development of enterprise HM&E risk management processes will occur, to include the following: a vulnerability assessment and management process across the HM&E Enclave and a methodology to support the execution of the Risk Management Framework and Cybersafe Assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.956"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Designed and developed multi-application, cross-platform boundary defense strategies including a strategy to minimize, consolidate, and disconnect connections between the NAVSEA enclaves (Weapons, HM&E, and NAVSEA Navigation Systems), SPAWAR and NAVAIR enclaves. In support of NAVSEA Commander's Intent requirements, issued technically approved cyber security updates to in-service NAVSEA system tech manuals and developed operating, casualty, and maintenance procedures for systems directly interfacing with the GIG. Commenced development of cyber security Ship Change Documents (SCDs)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue design and development of multi-application, cross-platform cybersecurity solutions for control system enclaves, followed by engineering for CVN 68 Class integration.\n- non-recurring engineering efforts for HM&E Control Systems.   \n- Perform engineering and planning for Boundary Defense Capability Temporary Alterations.\n- Develop infra-structure, processes and procedures in support of Risk Management Framework (RMF) and Cybersafe. \n- Perform system change engineering and analysis for upgrading systems to supported operating systems.\n- Develop Cybersecurity Situational Awareness strategy for CVN 68 Class"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.414"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.414"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue design and development of multi-application, cross-platform cybersecurity solutions for control system enclaves, followed by engineering for CVN 68 Class integration.\n- Initiate non-recurring engineering efforts for HM&E Control Systems.   \n- Perform engineering and planning for Boundary Defense Capability Temporary Alterations.\n- Develop infra-structure, processes and procedures in support of Risk Management Framework (RMF) and Cybersafe. \n- Perform system change engineering and analysis for upgrading systems to supported operating systems.\n- Develop Cybersecurity Situational Awareness strategy for CVN 68 Class"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/2176"
                                    },
                                    "Title": {
                                        "val": "Undersea Warfare Support Equipment (N98\/CV-TSC only)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.336"
                                        },
                                        "CurrentYear": {
                                            "val": "0.315"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.338"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.338"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.341"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.349"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.357"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.364"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "CV-TSC Development\/Integration:\nCV-TSC utilizes an incremental development approach that aims to deliver frequent capability updates to the Fleet. This approach allows required capability to be delivered to address emerging Fleet needs and provides frequent opportunities to ensure interoperability is synchronized with the Ship Self Defense System (SSDS) Advanced Capability Builds (ACBs). The acquisition strategy places heavy emphasis on the use of open architecture best practices to ensure ease of upgrades and to make developed products available to other platforms.\n\nNAVSEA Boundary Defense Capability (Cybersecurity):\nInvestigate, demonstrate, and implement multi-application, cross-platform cybersecurity solutions for HM&E control system enclaves, followed by engineering for CVN 68 Class integration.  Execute non-recurring engineering efforts for HM&E Control Systems.  Perform engineering and planning for Boundary Defense Capability Temporary Alterations."
                        },
                        "PerformanceMetrics": {
                            "val": "CV-TSC Development\/Integration:\n- Achieve Configuration Control Board (CCB) certification for installation of CV-TSC Build 8.0 software version. \n- Achieve Platform Information Technology (PIT) Information Assurance (IA) accreditation of CV-TSC Build 8.0 software version. \n- Achieve Consolidate Afloat Network Enterprise System (CANES) interoperability certification of CV-TSC Build 8.0 software version. \n- Achieve element certification of CV-TSC Build 8.0 software version. - Achieve Combat System test certification of CV-TSC Build 8.0 software version. \n\nNAVSEA Boundary Defense Capability(Cybersecurity):\n- Define and develop cross-platform control system cybersecurity requirements. \n- Define and develop cross-platform control system cybersecurity risk management processes. \n- Define and develop a set of cross-platform control system cybersecurity boundary defense solutions. \n- Define and develop a set of cross-platform, centralized, systems-level cybersecurity solutions. \n- Define and develop a set of cross-platform, element-level cybersecurity protections."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "4005"
                    },
                    "ProjectTitle": {
                        "val": "In-Service Carrier Systems Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "22.578"
                        },
                        "PriorYear": {
                            "val": "2.217"
                        },
                        "CurrentYear": {
                            "val": "0.573"
                        },
                        "BudgetYearOne": {
                            "val": "1.660"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.660"
                        },
                        "BudgetYearTwo": {
                            "val": "1.570"
                        },
                        "BudgetYearThree": {
                            "val": "1.335"
                        },
                        "BudgetYearFour": {
                            "val": "1.366"
                        },
                        "BudgetYearFive": {
                            "val": "1.395"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The In-Service Carrier Systems Demonstration and Validation program exploits available technologies to deliver an affordable, robust, operator-friendly automation control environment for Navy Aircraft Carrier shipboard equipment. The program provides the system architecture, requirements\/specification development, technology selection, software development (including software baseline), as well as land-based and shipboard testing of new technologies to improve shipboard operations and to reduce workload, manpower requirements, and Total Ownership Costs as well as addressing equipment obsolescence issues. Initial technologies include the Ship Control System Governor Software Development, Tank Preservation, Uninterruptible Power Supply (UPS) Replacements, Advanced Damage Control System (ADCS), Weapons Elevator Control Accumulator Replacement, the Integrated Condition Assessment System, the On-Machine I\/O development for LPAPs and LPAP air end redesign, Modular Refrigeration Unit (MRU). Demonstration technologies include Advanced Damage Control System (ADCS) software improvements, Input\/Output Controller (IOC) Replacement, Fleet Wireless Personal digital Assistant (PDA), Weapons Elevator Laser Positioning System, Legacy Steering Interface upgrades, CVN Integrated Topside Design (ITD) location option evaluation tools, Antenna to Antenna coupling analysis tools, and Passive countermeasures System (PCMS) alternate measurement capability.  Wireless systems, smart sensors, lighting systems, knowledge-based systems, automated casualty control, automated technology for workload reduction, linked smart devices, common software tools for interoperability, and self-healing network are technologies being considered for future applications including the following: Integrated Bridge control Data Logger, C4I Network Performance Modeling and Analysis, Network Data Logger Device, Portable Communication System (PCS) proof of concept, Ship Control System (SCS) Onboard trainer, CVN 78 class platform support for Joint Strike Fighter Integration,"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "In-Service Carrier Systems Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.217"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year 2016 plans included support to Aircraft Carrier technologies.  Modifications, upgrades and development of systems and software will be ongoing in support of In-Service aircraft carrier modernization initiatives and TOC reduction initiatives as well as addressing equipment obsolescence issues. Projects completed include Legacy Steering Interface Upgrade and Ship Control System (SCS) Onboard trainer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.573"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year 2017 plans include continued support to Aircraft Carrier technologies.  Modifications, upgrades and development of systems and software will be ongoing in support of In-Service aircraft carrier modernization initiatives and TOC reduction initiatives as well as addressing equipment obsolescence issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.660"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year 2018 plans include continued support to Aircraft Carrier technologies.  Modifications, upgrades and development of systems and software will be ongoing in support of In-Service aircraft carrier modernization initiatives and TOC reduction initiatives as well as addressing equipment obsolescence issues."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Investigate, demonstrate, and implement available technologies to deliver a robust, operator-friendly automation control environment for Navy Aircraft Carrier shipboard equipment to reduce workload, manpower requirements, and Total Ownership Costs (TOC)."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully complete Ship Control System Governor Software Development, AC Plant Model Capacity Optimization, Uninterruptible Power Supply (UPS) Replacements, Advanced Damage Control System (ADCS) Software Improvements,  Automatic Fire Sensing and Suppression System\/Flooding and Casualty Control Software (AFSSS\/FCCS) Software Development Test, Input\/Output Controller (IOC) replacement demonstration, Tank Preservation models, Weapons Elevator Laser Positioning demonstration, Legacy Steering Interface Upgrades, CVN Integrated Topside Design (ITD) location option evaluation tool development, Antenna to Antenna coupling analysis tool development, Universal Portable Command and Control Unit (PCCU) development, Ship Control System (SCS) Trainer, Integrated Bridge Control Data Logger, Weapons Elevator Control Accumulator Replacement, and C4I Network Performance Requirements Modeling and Analysis."
                        }
                    }
                }
            ]
        }
    }
}