{
    "id": "2018-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-950a5746320338933f77ee67f04c39e5d4c40144f8c92626c879d6e287c1655c-2",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602115E"
        },
        "ProgramElementTitle": {
            "val": "BIOMEDICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "120.512"
            },
            "CurrentYear": {
                "val": "115.213"
            },
            "BudgetYearOne": {
                "val": "109.360"
            },
            "BudgetYearOneBase": {
                "val": "109.360"
            },
            "BudgetYearTwo": {
                "val": "153.797"
            },
            "BudgetYearThree": {
                "val": "157.604"
            },
            "BudgetYearFour": {
                "val": "157.360"
            },
            "BudgetYearFive": {
                "val": "148.497"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "114.262"
                },
                "CurrentYear": {
                    "val": "115.213"
                },
                "BudgetYearOne": {
                    "val": "109.817"
                },
                "BudgetYearOneBase": {
                    "val": "109.817"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "120.512"
                },
                "CurrentYear": {
                    "val": "115.213"
                },
                "BudgetYearOne": {
                    "val": "109.360"
                },
                "BudgetYearOneBase": {
                    "val": "109.360"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.250"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.457"
                },
                "BudgetYearOneBase": {
                    "val": "-0.457"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "9.889"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.639"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.457"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.457"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2016:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.  \nFY 2017:  N\/A\nFY 2018:  Decrease reflects minor program repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BT-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOMEDICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "120.512"
                        },
                        "CurrentYear": {
                            "val": "115.213"
                        },
                        "BudgetYearOne": {
                            "val": "109.360"
                        },
                        "BudgetYearOneBase": {
                            "val": "109.360"
                        },
                        "BudgetYearTwo": {
                            "val": "153.797"
                        },
                        "BudgetYearThree": {
                            "val": "157.604"
                        },
                        "BudgetYearFour": {
                            "val": "157.360"
                        },
                        "BudgetYearFive": {
                            "val": "148.497"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element focuses on applied research for medical related technology, information, processes, materials, systems, and devices.  Successful battlefield medical technologies and neural interface technologies developed within this Program Element address a broad range of DoD challenges.  Example battlefield medical technologies include continued understanding of infection biomarkers to lead to the development of detection devices that can be self-administered and provide a faster ability to diagnose and prevent widespread infection in-theater.  Complementary battlefield technologies will be implemented in a predictive platform for forecasting disease outbreak or rapidly developing a medical countermeasure to outpace a disease outbreak, as well as the capability to manufacture field-relevant pharmaceuticals in theater.  New neural architectures and data processing algorithms will be developed to interface the nervous system with multiple devices, enabling control of robotic prosthetic-limb technology.  Advanced evidence-based techniques will be developed to supplement warfighter healthcare and the diagnosis of post-traumatic stress disorder (PTSD) and traumatic brain injury (TBI)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Restoration of Brain Function Following Trauma"
                                    },
                                    "Description": {
                                        "val": "The Restoration of Brain Function Following Trauma program will exploit recent advances in the understanding and modeling of brain activity and organization to develop approaches to treat traumatic brain injury (TBI).  Critical to success will be the ability to detect and quantify functional and\/or structural changes that occur in the human brain during the formation of distinct new memories, and to correlate those changes with subsequent recall of those memories during performance of behavioral tasks.  This program will also develop neural interface hardware for monitoring and modulating neural activity responsible for successful memory formation in a human clinical population.  The ultimate goal is identification of efficacious therapeutics approaches that can bypass and\/or recover the neural functions underlying memory, which are often disrupted as a consequence of TBI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.800"
                                            },
                                            "Text": {
                                                "val": "-  Refined computational model of memory toward distinguishing underlying neural activity related to remembered vs. forgotten memories in three categories and spatial and non-spatial associations.\n-  Investigated and tested optimal stimulation parameters for improving performance on spatial memory tasks.\n-  Utilized defined biomarkers of memory encoding and retrieval to adaptively modulate patterned electrical stimulation to dynamically drive neural networks into states optimized for memory encoding and retrieval processes.\n-  Determined the neural signatures underlying stimulation-induced memory restoration.\n-  Designed, developed and validated both external and implantable hardware and software systems for an integrated memory restoration system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.400"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate improvement of human performance on spatial and semantic memory tasks through the use of real-time, closed-loop, biomarker-driven stimulation.\n-  Utilize clinical data and computational model developments to refine hardware and software components.\n-  Fabricate and test integrated device for memory restoration in clinical patients.\n-  Develop computational model of integrated neural, physiological, and environmental effects on neural replay and subsequent memory recall in the context of task performance relevant to military training and\/or operations.\n-  Develop and use a real-time intervention and an interface system to assess, enable, and improve skill performance in human participants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.386"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.386"
                                            },
                                            "Text": {
                                                "val": "-  Refine stimulation parameters to optimize closed-loop, biomarker-driven stimulation for restoration of verbal and spatial memories.\n-  Use an integrated device to demonstrate facilitation of performance on memory tasks through real-time, closed-loop, biomarker-driven stimulation.\n-  Use a computational model of integrated neural, physiological, and environmental signals to quantify the influence of memory replay parameters on subsequent performance of skills relevant to military training and\/or operations.\n-  Demonstrate use of a closed-loop, non-invasive intervention to facilitate neural replay and subsequent performance of skills."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuro-Adaptive Technology"
                                    },
                                    "Description": {
                                        "val": "The Neuro-Adaptive Technology program will explore and develop advanced technologies for real-time detection and monitoring of neural activity.  One shortcoming of today's brain functional mapping technologies is the inability to obtain real-time correlation data that links neural function to human activity and behavior.  Understanding the structure-function relationship as well as the underlying mechanisms that link brain and behavior is a critical step in providing real-time, closed-loop therapies for military personnel suffering from a variety of brain disorders.  Efforts under this program will specifically examine the networks of neurons involved in post-traumatic stress disorder (PTSD), traumatic brain injury (TBI), depression, and anxiety as well as determine how to best ameliorate these disorders.  The objective for this program is to develop new hardware and modeling tools to better discriminate the relationship between human behavioral expression and neural function and to provide relief through novel devices.  These tools will allow for an improved understanding of how the brain regulates behavior and will enable new, disorder-specific, dynamic neuro-therapies for treating neuropsychiatric and neurological disorders in military personnel.  Technologies of interest under this thrust include devices for real-time detection of brain activity during operational tasks, time synchronized acquisition of brain activity and behavior, and statistical models that correlate neural activity with human behavioral expression."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.478"
                                            },
                                            "Text": {
                                                "val": "-  Developed and applied data co-registration and fusion methods for neural activity, wiring, and behavior. \n-  Generated and annotated first intact neural tissue volumes to elucidate microstructure and connections in three dimensions. \n-  Designed algorithms for automatic cell identification and optical-signal estimation. \n-  Elucidated neural circuit dynamics using structurally-informed network models. \n-  Refined optical techniques for imaging large volumes of neural tissue. \n-  Expanded data curation architecture, databases, and analytical tools to distribute generated data to the neuroscience community. \n-  Developed methods for automatically detecting and removing noise or contamination from datasets. \n-  Delivered a hierarchical computational model of key brain networks that captures features relevant for psychiatric illness and its treatment. \n-  Developed and refined neural state acquisition, classification, and control algorithms to support closed-loop control in an implantable neural device. \n-  Initiated characterization of neural network plasticity during behavioral training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.388"
                                            },
                                            "Text": {
                                                "val": "-  Complete high-resolution large-brain imaging using novel optical tools. \n-  Demonstrate optimized optical protocols for human tissue. \n-  Integrate neural state classification, stimulation parameters, and targeted brain networks into a comprehensive computational model to support disorder-specific closed-loop implantable neural devices. \n-  Demonstrate real-time application of integrated disorder-specific stimulation parameters and targeted brain networks. \n-  Utilize clinical data and computational model determinants to refine hardware and software components of an implantable neural device. \n-  Begin fabrication of updated devices for multi-site brain stimulation. \n-  Initiate submission process for regulatory approval of updated parameters of the novel neural device."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.060"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration of computational model software with prototype device hardware. \n-  Fabricate complete prototype device for use in acute clinical studies. \n-  Submit prototype device design for regulatory approval.\n-  Use prototype device in clinical patients to demonstrate modulation of disorder-specific psychiatric or neurologic behaviors through real-time, closed-loop stimulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX)"
                                    },
                                    "Description": {
                                        "val": "Wounded warriors with amputated limbs get limited benefit from recent advances in prosthetic-limb technology because the user interface for controlling the limb is low-performance and unreliable.  Through investments in the DARPA Reliable Neural-Interface Technology (RE-NET) program, novel interface systems have been developed that overcome these issues and are designed to last for the lifetime of the patient.  The goal of the Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX) program is to create the first bi-directional (motor & sensory) peripheral nerve implant for controlling and sensing advanced prosthetic limb systems.  With a strong focus on transition, the HAPTIX program will create and transition clinically relevant technology in support of wounded warriors suffering from single or multiple limb loss."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.900"
                                            },
                                            "Text": {
                                                "val": "-  Integrated interface and electronic systems technology for use in human amputees to control and receive intuitive sensory feedback from a prosthetic device.\n-  Demonstrated closed-loop control of a virtual prosthesis.\n-  Performed safety and efficacy testing of HAPTIX system components to capture motor control signals and provided electrical sensory stimulation through the peripheral nervous system.\n-  Demonstrated in vivo functionality of next-generation HAPTIX peripheral interface technology.\n-  Finalized HAPTIX system prosthetic limb technology, completed sensorization, and began manufacturing of devices.\n-  Implemented draft version of outcome metrics for quantifying effects of HAPTIX technology and began validation studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.500"
                                            },
                                            "Text": {
                                                "val": "-  Initiate functional validation of input\/output signal transfer and wireless communication of power and data.\n-  Initiate safety studies of HAPTIX system to support submission of investigational device exemption (IDE) application to the U.S. Food and Drug Administration (FDA).\n-  Demonstrate novel nerve stimulation and recording technologies.\n-  Demonstrate closed-loop control of a physical prosthesis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.700"
                                            },
                                            "Text": {
                                                "val": "-  Validate novel outcome metrics for quantifying effects of sensory prosthetic technologies.\n-  Initiate testing of advanced sensorized prosthetic limbs.\n-  Refine models for sensorimotor function in prosthetic technologies.\n-  Submit technology for regulatory approval."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Performance Optimization in Complex Environments"
                                    },
                                    "Description": {
                                        "val": "The Performance Optimization in Complex Environments program focuses on leveraging advances in and integration of sensors, computation, and analytics to enable optimum human performance in complex environments.  Device technology has advanced to the point where human beings can be instrumented with and connected to a broad range of unobtrusive, always-on physiological, cognitive, and contextual sensors and information systems.  At the same time, body-area networks, wearable displays, haptics, and other novel forms of human-computer interfaces have advanced enough that convenient real-time multifactor analysis for neurofeedback and biofeedback are within reach.  The Performance Optimization in Complex Environments program will first focus on developing prototyping and manufacturing techniques necessary to integrate these two advancing areas to enable optimal performance in a wide variety of activities from learning and training to specialized tasking, and to mitigate the effects of physical injury, age, and mental impairment.  Research will also focus on understanding various forms of sensing and actuation to improve outcomes and how biofeedback over time can alter human capability.  Technologies developed through this program will provide a foundation of novel value propositions to the warfighter in terms of restoration of lost capability, situational awareness, resilience, cognitive and physical effectiveness, and force multiplication."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.650"
                                            },
                                            "Text": {
                                                "val": "-  Initiated research on biological interfaces for enabling input-output of information.\n-  Explored and identified scalable technologies for reading and writing biological signals.\n-  Investigated the neural pathways and mechanisms underlying naturalistic perception."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.475"
                                            },
                                            "Text": {
                                                "val": "-  Refine component technologies to increase scale of information input-output.\n-  Identify component technologies to be integrated into a device for reading and writing biological signals. \n-  Investigate novel approaches to reduce the size, weight, and power requirements for the integrated device.\n-  Develop preliminary system architectures for highly-scaled input-output of information.\n-  Develop biological interfaces with the precision to target individual neurons."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.530"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.530"
                                            },
                                            "Text": {
                                                "val": "-  Finalize system designs for highly-scaled input-output of information, and pass a critical design review.\n-  Validate system designs and safety methods against standard regulatory practices.\n-  Conduct a bench demonstration of system components.\n-  Perform in vivo demonstration of input-output techniques for individual neurons.\n-  Produce a neural input\/output platform to monitor and modulate large-scale neural activity for a variety of applications relevant to the central nervous system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Monitoring of Health and Disease"
                                    },
                                    "Description": {
                                        "val": "The overarching goal of the Enhanced Monitoring of Health and Disease program is to leverage advanced data collection methods and prognostic capabilities to predict changes in health and spread of infectious disease from the individual to the population scale.  While new technology platforms have enhanced our ability to respond to illness and disease, there is a need for predictive and pre-emptive technologies that enable us to correctly prepare a response prior to its obvious need.  Research in this thrust will investigate new methods for the collection and detection of multiplexed biological markers as well as the analysis, correlation, and ultimate integration of vast personalized data into the clinical care information technology infrastructure.  Additionally, this thrust will develop new approaches to integrate multi-source data streams to create effective predictive models of disease outbreak and spread.  Technologies developed in this program will enable clinically actionable information, even when an individual has no awareness of symptoms, and extend infectious disease forecasting into a real-time, accurate capability for decision support."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.100"
                                            },
                                            "Text": {
                                                "val": "-  Collect biological samples to assess asymptomatic, symptomatic, and co-infection rates among a research cohort.\n-  Evaluate banked and new samples from clinical cohort or intervention trials to discover candidate prognostic biomarkers for the prediction of contagiousness.\n-  Identify key parameters of robust epidemiological models for predicting disease transmission.\n-  Evaluate the predictive capability of dynamic, ensemble-based epidemiological models for disease forecasting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.280"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.280"
                                            },
                                            "Text": {
                                                "val": "-  Select a minimal set of biomarkers that accurately predict contagiousness.\n-  Develop a prognostic assay that predicts contagiousness using the minimal set of biomarkers.\n-  Evaluate models and prognostic tests for accuracy prospectively."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Generalizing Complex Biological Signals"
                                    },
                                    "Description": {
                                        "val": "Recent advances in neurotechnology have created the ability to interface with the nervous system at high resolution and precision.  To date, sending and receiving data via these interfaces has required researchers to develop new signal processing algorithms for each user.  This program seeks to generalize complex biological signals across users via new architectures and systems, thus producing a flexible neural interface protocol among users that can receive and react to environmental, physiological, and neural information.  Future neurotechnology devices based on this generalized communication protocol may enable human-machine and human-human interaction for communication or distributing tasking to balance workload."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.490"
                                            },
                                            "Text": {
                                                "val": "-  Initialize research to identify multimodal input processing and real-time feedback. \n-  Begin analysis for common signal processing architecture in existing biological signal data.\n-  Conduct preliminary closed-loop studies to understand human-machine and human-human interaction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pandemic Prevention"
                                    },
                                    "Description": {
                                        "val": "Effective pandemic response relies on the ability to anticipate where outbreaks will occur as well as rapidly accelerating medical countermeasure discovery, pre-clinical testing, and manufacturing. This program seeks to advance and integrate newly developed approaches including bioinformatics assessment of genetic sequencing and nucleic acid-based vaccines and to address technology bottlenecks associated with each stage of medical countermeasure development.  Additional research within this program will investigate new methods improving the manufacturability, distribution, and delivery of novel therapeutics.  Technologies developed within this program will enable an integrated therapeutic development platform that leverages state of the art technologies to prevent disease outbreaks."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.914"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.914"
                                            },
                                            "Text": {
                                                "val": "-  Develop high-throughput screening technologies to rapidly identify appropriate medical countermeasures against a diversity of biological threats.\n-  Begin developing tools to scale the manufacturability of medical countermeasures. \n-  Initiate development of a validated system for medical countermeasure production."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The overarching goal of the Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program is to increase our ability to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing centralized laboratory capabilities at non-tertiary care settings.  ADEPT will focus on the development of Ribonucleic Acid (RNA)-based vaccines, potentially eliminating the time and labor required for traditional manufacture of a vaccine while at the same time improving efficacy.  Additionally, ADEPT will develop methods to transiently deliver nucleic acids for vaccines and therapeutics, and kinetically control the timing and levels of gene expression so that these drugs will be safe and effective for use in healthy subjects.  ADEPT will also focus on advanced development of key elements for simple-to-operate diagnostic devices.  A companion basic research effort is budgeted in PE 0601117E, Project MED-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.461"
                                            },
                                            "Text": {
                                                "val": "-  Optimized formulation of transient nucleic acid formats for storage stability at room temperature for at least six months.\n-  Demonstrated continuous production of nucleic acid formats for transient immunity to viral, bacterial, and\/or antibiotic-resistant bacterial pathogens for population-scale use.\n-  Incorporated device optimizations identified as a result of first-generation, integrated diagnostic device testing.\n-  Produced integrated diagnostic device prototypes designed for relevance to physician office, remote clinic, and low-resourced settings.\n-  Measured quantitative performance of integrated diagnostic device prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.441"
                                            },
                                            "Text": {
                                                "val": "-  Initiate regulatory approval submission package for transient nucleic-acid based formats against infectious disease with safety and efficacy data.\n-  Demonstrate production of gene encoded antibodies in human safety trials.\n-  Conduct a dose escalation study of nucleic acid-encoded antibody against antibiotic resistant bacteria."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Biomedical Technologies"
                                    },
                                    "Description": {
                                        "val": "The Tactical Biomedical Technologies thrust will develop new approaches to deliver life-saving medical care on the battlefield.  Uncontrolled blood loss is the leading cause of preventable death for soldiers on the battlefield.  While immediate control of hemorrhage is the most effective strategy for treating combat casualties and saving lives, currently no method, other than surgical intervention, can effectively treat intracavity bleeding.  A focus in this thrust is the co-development of a materials-based agent(s) and delivery mechanism capable of hemostasis and wound control for non-compressible hemorrhage in the abdominal space, regardless of wound geometry or location within that space.  This thrust is also investigating non-invasive techniques and equipment to use laser energy to treat intracranial hemorrhage through the skull and tissues in a pre-surgical environment.  Finally, in order to address logistical delays associated with delivering necessary therapeutics to the battlefield, this thrust will also develop a pharmacy on demand that will provide a rapid response capability to enable far-forward medical providers the ability to manufacture and produce small molecule drugs and biologics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.150"
                                            },
                                            "Text": {
                                                "val": "-  Developed continuous synthesis of Ciprofloxacin (from basic starting materials) in miniaturized integrated manufacturing platform.\n-  Demonstrated end-to-end manufacturing and solid formulation of Ciprofloxacin in miniaturized integrated manufacturing platform.\n-  Designed and developed cell-based and cell-free protein expression of four additional biologics including Insulin, Factor VIIa, Interferon, Hepatitis B Surface Antigen, Tissue Plasminogen Activator, Granulocyte Colony-Stimulating Factor, and Rituxmab.\n-  Optimized miniaturized biologics manufacturing platform components, including bioreactor, purification, and analytical modules, and begin systems integration of components for both cell-based and cell-free protein expression platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.909"
                                            },
                                            "Text": {
                                                "val": "-  Develop continuous synthesis of Lisinopril and Linezolid in miniaturized integrated manufacturing platform.\n-  Demonstrate end-to-end manufacturing and solid formulation of Lisinopril and Linezolid in miniaturized integrated manufacturing platform.\n-  Demonstrate end-to-end manufacturing of four additional biologics in miniaturized integrated platform.\n-  Develop a miniaturized integrated manufacturing platform produce Ciprofloxacin under Good Manufacturing Practices."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dialysis-Like Therapeutics (DLT)"
                                    },
                                    "Description": {
                                        "val": "Sepsis, a bacterial infection of the blood stream, is a significant cause of injury and death among combat-injured soldiers.  The goal of this program was to develop a portable device capable of controlling relevant components in the blood volume on clinically relevant time scales.  Significant advances were made in sensing in complex biologic fluids, complex fluid manipulation, separation of components from these fluids, and mathematical descriptions capable of providing predictive control over the closed loop process.  The developed device could save the lives of thousands of military patients each year by effectively treating sepsis and associated complications.  Additionally, the device may be effective as a medical countermeasure against various chemical and biological (chem-bio) threat agents, such as viruses, bacteria, fungi, and toxins. Applied research under this program applied existing component technologies and integrated these products to create a complete blood purification system for use in the treatment of sepsis.  Included in this effort was development, integration and demonstration of non-fouling, continuous sensors for complex biological fluids; implementation of high-flow microfluidic structures that do not require the use of anticoagulation; application of intrinsic separation technologies that do not require pathogen specific molecular labels or binding chemistries; and refinement of predictive modeling and control (mathematical formalism) with sufficient fidelity to enable agile adaptive closed-loop therapy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.073"
                                            },
                                            "Text": {
                                                "val": "-  Completed fabrication of the first generation of integrated DLT device prototypes.\n-  Completed safety studies of the integrated DLT device in a large-animal model.\n-  Initiated safety studies focused on pathogen removal in large-animal model."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warrior Web"
                                    },
                                    "Description": {
                                        "val": "Musculoskeletal injury and fatigue to the warfighter caused by dynamic events on the battlefield not only impact immediate mission readiness, but also can have a deleterious effect on the warfighter throughout his\/her life.  The Warrior Web program mitigated that impact by developing an adaptive, quasi-active, joint support sub-system that can be integrated into current soldier systems.  Because this sub-system is compliant and transparent to the user, it can reduce the injuries sustained by warfighters while allowing them to maintain performance.  Success in this program required the integration of component technologies in areas such as regenerative kinetic energy harvesting to offset power\/energy demands; human performance, system, and component modeling; novel materials and dynamic stiffness; actuation; controls and human interface; and power distribution\/energy storage.  The final system weighed no more than 9kg and required no more than 100W of external power.  Allowing the warfighter to perform missions with reduced risk of injuries can have immediate effects on mission readiness, soldier survivability, mission performance, and the long-term health of our veterans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Revised full suit design and implementation based on laboratory evaluations.\n-  Continued to evaluate prototype Warrior Web systems via soldier tests in laboratory and field environments.\n-  Continued to pursue research and development of technologies to augment human performance and support rehabilitation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}