{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-8",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605602A"
        },
        "ProgramElementTitle": {
            "val": "Army Technical Test Instrumentation and Targets"
        },
        "R1LineNumber": {
            "val": "160"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.254"
            },
            "CurrentYear": {
                "val": "64.127"
            },
            "BudgetYearOne": {
                "val": "49.242"
            },
            "BudgetYearOneBase": {
                "val": "49.242"
            },
            "BudgetYearTwo": {
                "val": "57.601"
            },
            "BudgetYearThree": {
                "val": "56.541"
            },
            "BudgetYearFour": {
                "val": "58.002"
            },
            "BudgetYearFive": {
                "val": "59.606"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides critical front-end investments for development of new test methodologies; test standards; advanced test technology concepts for long range requirements; future test capabilities; advanced development of modeling and simulation (M&S) and instrumentation prototypes; and the full development of test instrumentation for the United States Army Test and Evaluation Command (ATEC), which includes the Operational Test Command (OTC) at Ft Hood, Texas; Aberdeen Test Center (ATC), Aberdeen Proving Ground, Maryland; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Electronic Proving Ground (EPG), Fort Huachuca, Arizona; Yuma Test Center (YTC) at Yuma Proving Grounds (YPG), Arizona (including the Cold Regions Test Center (CRTC), Fort Greely, Alaska and the Tropics Regions Test Center (TRTC), at various locations); and Redstone Test Center (RTC), Redstone Arsenal, Alabama. OTC consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Integrated Test and Evaluation Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas. These activities support the development and fielding cycle of all Army acquisition programs including rapid fielding initiatives. Sustainment funding maintains existing testing capabilities at all locations by replacing unreliable, uneconomical, and irreparable instrumentation, as well as incremental upgrades of hardware and software for M&S and instrumentation systems to assure adequate test data collection capabilities. This data supports acquisition milestone decisions for all commodity areas throughout the Army including programs such as the Joint Light Tactical Vehicle (JLTV), Advanced Multi-Purpose Vehicle (AMPV),  Network Integration Evaluation (NIE), Patriot Advance Capability Phase 3 (PAC-3), Warfighter Information Network - Tactical (WIN-T), Stryker, Bradley, Abrams, Guided Multiple Launch Rocket System (GMLRS), Joint Tactical Radio System (JTRS),and the Distributed Common Ground System - Army (DCGS-A)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "51.550"
                },
                "CurrentYear": {
                    "val": "52.404"
                },
                "BudgetYearOne": {
                    "val": "49.354"
                },
                "BudgetYearOneBase": {
                    "val": "49.354"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.254"
                },
                "CurrentYear": {
                    "val": "64.127"
                },
                "BudgetYearOne": {
                    "val": "49.242"
                },
                "BudgetYearOneBase": {
                    "val": "49.242"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.704"
                },
                "CurrentYear": {
                    "val": "11.723"
                },
                "BudgetYearOne": {
                    "val": "-0.112"
                },
                "BudgetYearOneBase": {
                    "val": "-0.112"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.912"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "2.616"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.132"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.132"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "11.723"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "CivPay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.020"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Request for Additional FY17 Appropriation includes $10.270 Million in Project 628 and $1.453 Million in Project 62C to meet lethality objectives through improvement of Developmental Test & Evaluation capabilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "628"
                    },
                    "ProjectTitle": {
                        "val": "Developmental Test Technology & Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.783"
                        },
                        "CurrentYear": {
                            "val": "52.782"
                        },
                        "BudgetYearOne": {
                            "val": "33.948"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.948"
                        },
                        "BudgetYearTwo": {
                            "val": "39.096"
                        },
                        "BudgetYearThree": {
                            "val": "37.687"
                        },
                        "BudgetYearFour": {
                            "val": "38.661"
                        },
                        "BudgetYearFive": {
                            "val": "39.687"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides critical front-end investments for development of new test methodologies, test standards, advanced test technology concepts for long range requirements, future test capabilities, and advanced instrumentation prototypes for subordinate commands of the Army Test and Evaluation Command (ATEC). These capabilities are required to support developmental testing requirements of high priority Army systems supporting Army modernization efforts. Where practical, efficiencies will be gained through the common use of developmental instrumentation in operational testing.  A key element is sustaining aging instrumentation which maintains existing capabilities at test facilities by replacing unreliable, uneconomical and irreparable instrumentation, as well as lifecycle replacement and incremental upgrades of instrumentation and software, reducing their average age to assure adequate testing capabilities. This Project develops and sustains developmental test instrumentation and capabilities that provide the data necessary to support acquisition milestone decisions for all commodity areas throughout the Army. Significant examples include new instrumentation for the testing of Command, Control, Communication and Computer (C4) systems, upgrades to existing radars to extend their economic life, common data collection and analysis tools, non-intrusive instrumentation to test Unmanned Ground Vehicles and sensors, high speed - high definition digital imaging systems to capture missile flight events, and automation software to improve data collection of reliability, availability, and maintainability (RAM) testing."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Developmental Test Technology Investment"
                                    },
                                    "Description": {
                                        "val": "Develops, acquires and sustains critical test technology and instrumentation. Provides the necessary test instrumentation, computer and communications systems, data collection, analysis and reporting equipment and other test capabilities to successfully develop and test Army weapons and equipment. Provides the necessary live, virtual and constructive environment, hardware-in-the-loop capabilities and models and simulations needed for testing the Army materiel. Acquires instrumentation to measure performance of C4 systems; RAM data collection on tracked and wheeled vehicles; ballistic transducers for measuring chamber pressures during ammunition tests; supports development of common data collection instrumentation and data management systems used in testing across all test commodity areas and test lifecycles; continues replacement and upgrade of range control instrumentation, radar, optics and telemetry equipment used in missile testing; acquires data recorders, signal conditioning equipment, data processing equipment and other instrumentation for various aircraft tests; upgrades natural environments test instrumentation used for testing weapon systems, vehicles, munitions and support equipment in extreme hot desert environments as well as extreme cold conditions; continues upgrade of survivability\/vulnerability test capabilities in support of live fire testing; upgrades and replaces mobile range communications equipment and digital end devices; and improves test efficiency through the use of smart devices as data collectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.783"
                                            },
                                            "Text": {
                                                "val": "Continued to provide, acquire and upgrade instrumentation for RAM, ballistic, missile, aviation and environmental testing across all test commodity areas and support the test capability of live fire survivability testing.  At the Redstone Test Center (RTC), amplifiers used in testing electromagnetic environmental effects (E3) of Army aviation and missile programs were refurbished to provide the necessary reliability for a system that is utilized extensively.  This refurbishment replaced obsolete equipment that has been in use for the past 40 years to extend the life of the amplifiers.  The Aberdeen Test Center (ATC) continued their development of a complete test capability to support high volume, high-speed production\/acceptance test capability for body armor and vehicle armor plates.  The ATC also continued the improvement and development of methodology for capturing crew survivability data during live fire and fire suppression testing for combat vehicle programs.  Instrumentation, transducers, and other sensing technologies are being developed to measure parameters which my result in crew injuries.  At the Electronic Proving Ground (EPG), instrumentation was developed to increase the capability to test C4ISR tactical networks in support of developmental testing.  The new equipment ensures compliance with customer requirements for speed, capacity, and reliability.  At the White Sands Test Center (WSTC), provided funding to replace obsolete components for existing FPS-16 Monopulse Tracking Radar systems supporting missile defense programs.  The WSTC also acquired the excessed Multiple Object Tracking Radar – 4 (MOTR-4) from Vandenberg Air Force Base to replace two degraded FPS-16s.  At the Yuma Test Center (YTC), a usability life extension effort for the Close-In radar systems (Continuous Wave Doppler\/Pulse Systems) was begun to mitigate obsolescence and a lack of available components from industry.  This effort will result in extended operational capabilities that are supported by the manufacturer with enhancements to support smart munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "52.782"
                                            },
                                            "Text": {
                                                "val": "Request for Additional FY17 Appropriation includes $10.270 Million for minor investment \/ upgrades to Developmental Test capabilities: provides funding to upgrade \/ replace instrumentation and equipment, develop new test technologies, develop and procure new instrumentation systems, and develop modeling and simulation capabilities across ATEC's Developmental Test activities. The majority of the tasks funded by this account involve upgrading or replacing instrumentation and equipment that has met, and often well-exceeded its technological and economic life-span.\n\nContinue to provide, acquire and upgrade instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.948"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.948"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide, acquire and upgrade instrumentation for C4, RAM, ballistics, missile, aviation and environmental testing across all test commodity areas and enhance\/expand the use of common data collectors, smart devices, and enterprise data management tools.  This includes the continuation and completion of previous fiscal year initiatives in addition to the execution of new initiatives to modernize test infrastructure.  The WSTC will complete the development of a secure wireless network to provide internet protocol data and communication connectivity to the Test Support Network (TSN) from “unwired” areas of the test range.  The YTC will replace tape video recorders with hard drive based video recorders due to obsolescence of the technology.  This effort will include procurement of high definition cameras to support missions throughout the range.  The RTC will design, procure, develop, and integrate an end-to-end mobile system to measure the performance of couter-unmanned aircraft systems (UAS) systems under test.  The ATC will develop a common methodology and technology for collection of analog data to support the next generation of instrumentation used for ballistics analysis and automotive instrumentation.  This common methodology will provide a more efficient use of resources and broaden a common understanding of these measurements for evaluator across the command.  The EPG will develop a test data management and control system to provide test personnel and evaluators cloud-like, secure access of current and prior test data allowing for quick analysis and review."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "62C"
                    },
                    "ProjectTitle": {
                        "val": "Modeling and Simulation Instrumentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.471"
                        },
                        "CurrentYear": {
                            "val": "11.345"
                        },
                        "BudgetYearOne": {
                            "val": "15.294"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.294"
                        },
                        "BudgetYearTwo": {
                            "val": "18.505"
                        },
                        "BudgetYearThree": {
                            "val": "18.854"
                        },
                        "BudgetYearFour": {
                            "val": "19.341"
                        },
                        "BudgetYearFive": {
                            "val": "19.919"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The United States (U.S.) Army Test and Evaluation Command (ATEC) plans, conducts and reports on operational tests, assessments and experiments in order to provide essential information for the acquisition and fielding of War Fighting Systems. Operational Test (OT) Instrumentation collects required data from systems under test and the systems which they integrate with to  support effectiveness, survivability, and suitability analysis; these systems also provide real-time position location and status tracking to support test control. The Army's Operations Tempo (OPTEMPO) has reduced the number of tactical units and vehicles available to support OT, making enhancement of live forces through simulation essential for testing in a realistic, operational environment by simulating tactical engagements, additional units, message traffic, effects, and terrain. ATEC OT Modeling, Simulation and Instrumentation (MS&I) funding is used to adapt capabilities from other organizations (including within ATEC), purchase off-the-shelf systems, and develop and sustain OT-unique simulation and instrumentation systems. As required, the Program Executive Office for Simulation, Training, and Instrumentation (PEO STRI) Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) provides development and integration of major simulation and instrumentation systems. The MS&I (Sustainment and Minor Development) program funds the expertise and the adaptation, purchases, minor development and sustainment requirements that support systems undergoing OT. Costs unique to specific systems under test may require Program Manager (PM) funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Modeling, Simulation and Instrumentation"
                                    },
                                    "Description": {
                                        "val": "Develops and enhances ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Improves and sustains Real-Time Casualty Assessment (RTCA) (including Integrated Live, Virtual, Constructive (LVC) Test Environment (ILTE)) capabilities. Also develops, enhances, and sustains Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems together with their associated data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.471"
                                            },
                                            "Text": {
                                                "val": "Continued to sustain and enhance ATEC's simulation\/stimulation of Mission Command, Fire Support, Air Defense, Reconnaissance and Surveillance, and Network systems. Continue to improve our RTCA (including ILTE) capabilities to support future Advanced Multi-Purpose vehicle (AMPV) and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain and develop our Performance Instrumentation Systems and associated data management,Time Space Positioning Information (TSPI) and Telemetry Systems and associated data management, and Imaging Systems and associated data management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.345"
                                            },
                                            "Text": {
                                                "val": "Request for Additional FY17 Appropriation includes $1.453 Million for minor investment \/ upgrades to Developmental Test capabilities: provides funding to upgrade \/ replace instrumentation and equipment, develop new test technologies, develop and procure new instrumentation systems, and develop modeling and simulation capabilities across ATEC's Developmental Test activities. The majority of the tasks funded by this account involve upgrading or replacing instrumentation and equipment that has met, and often well-exceeded its technological and economic life-span.\n\nContinue to sustain ATEC's Fire Support, Air Defense, Reconnaissance and Surveillance, and Network OT tools. Improve our Real-Time Casualty Assessment (RTCA) secure network and tactical engagement capabilities to support future AMPV, AH-64 FOT&E, and the Bradley Performance Improvement Program (PIP), Stryker PIP, and Abrams PIP OTs. Sustain Performance Instrumentation Systems, Time Space Positioning Information (TSPI) and Telemetry Systems, and Imaging Systems and associated data management capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.294"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.294"
                                            },
                                            "Text": {
                                                "val": "Will continue to sustain ATEC's Fire Support, Air Defense, Reconnaissance and Surveillance, and Network OT tools. Improve our RTCA secure network and tactical engagement capabilities to support future AMPV, AH-64 Follow-on Operational Test and Evaluation (FOT&E), and the Bradley PIP, Stryker PIP, and Abrams PIP OTs. Sustain Performance Instrumentation Systems, TSPI and Telemetry Systems, and Imaging Systems and associated data management capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}