{
    "id": "2018-TheJointStaff-PB-0400-MJBOOK-0-0-bc089b85e97abbbc11ea38fc58c96b94903acf8980ac0e2f4ed647500a99c5be-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604826J"
        },
        "ProgramElementTitle": {
            "val": "Joint C5 Capability Development, Integration, and Interoperability Assessments"
        },
        "R1LineNumber": {
            "val": "104"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "21.700"
            },
            "CurrentYear": {
                "val": "23.642"
            },
            "BudgetYearOne": {
                "val": "23.638"
            },
            "BudgetYearOneBase": {
                "val": "23.638"
            },
            "BudgetYearTwo": {
                "val": "23.148"
            },
            "BudgetYearThree": {
                "val": "20.809"
            },
            "BudgetYearFour": {
                "val": "20.809"
            },
            "BudgetYearFive": {
                "val": "20.809"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Lead command, control, communications, computers, and cyber (C5) assessments, analyses, capability development, and Joint Fires Command and Control (C2) interoperability efforts required to achieve an effective, integrated, and interoperable Joint Force.  Efforts include C5 requirements determination, C5 architectures development and integration, C5 data standardization, Joint Fires C2 interoperability, and C5 integration and interoperability assessments. This was a new PE for FY 2016 and consolidates legacy U. S. Joint Forces Command (JFCOM) PEs that transitioned to the Joint Staff in FY 2013 after JFCOM disestablishment. The following PEs are no longer used:  0604828J - Joint Fires Integration and Interoperability Team (JFI), 0604787J - Joint Systems Integration Command (JSI), and 0607828J - Joint Integration and Interoperability (JII)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.700"
                },
                "CurrentYear": {
                    "val": "23.642"
                },
                "BudgetYearOne": {
                    "val": "23.638"
                },
                "BudgetYearOneBase": {
                    "val": "23.638"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.700"
                },
                "CurrentYear": {
                    "val": "23.642"
                },
                "BudgetYearOne": {
                    "val": "23.638"
                },
                "BudgetYearOneBase": {
                    "val": "23.638"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Prior Year Carryover"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in funding for FY 2019 thru FY 2022 is a result of mandated 25% Management Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "C5 Assessments and Analyses"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "10.196"
                        },
                        "CurrentYear": {
                            "val": "12.898"
                        },
                        "BudgetYearOne": {
                            "val": "12.898"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.898"
                        },
                        "BudgetYearTwo": {
                            "val": "12.361"
                        },
                        "BudgetYearThree": {
                            "val": "10.022"
                        },
                        "BudgetYearFour": {
                            "val": "10.022"
                        },
                        "BudgetYearFive": {
                            "val": "10.022"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Conduct analysis and assessment activities to inform and enhance Joint warfighter capabilities in support of U.S. National Security requirements. Provide timely, facts-based findings and recommendations for action through the formal DoD decision-making processes used to validate operational requirements and apply funding to field effective, interoperable capabilities. Conduct interoperability assessments and analyses that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), and systems in response to operational issues and shortfalls.  Conduct integration and integration assessment efforts focused on emerging capabilities in wireless devices and security, tactical command and control and networking, satellite communications, advanced secure digital datalinks, and coalition data exchanges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C5 Assessments and Analyses"
                                    },
                                    "Description": {
                                        "val": "Conduct analysis and assessment activities to inform and enhance Joint warfighter capabilities in support of U.S. National Security requirements. Provide timely, facts-based findings and recommendations for action through the formal DoD decision-making processes used to validate operational requirements and apply funding to field effective, interoperable capabilities. Conduct interoperability assessments and analyses that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), and systems in response to operational issues and shortfalls.  Conduct integration and integration assessment efforts focused on emerging capabilities in wireless devices and security, tactical command and control and networking, satellite communications, advanced secure digital datalinks, and coalition data exchanges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.196"
                                            },
                                            "Text": {
                                                "val": "Conducted eight (8) integration initiatives of new capabilities; twenty-five (25) interoperability assessments of joint and coalition systems; thirty-four (34) Coalition Interoperability Assurance and Validation (CIAV) events that provided eighty-five (85) recommendations and one hundred-ten (110) findings or observations; eight (8) exercises and events conducted in the field; and provided C2 Systems and Persistent C4 Environment support by leveraging training events for capability development efforts.  FY 2016 assessment, analysis and integration initiatives were focused on: Joint C2 Capability Development, Mission Partner Environment (MPE)\/NATO\/Multinational Engagement, Joint Fires Combat Identification, Counter Unmanned Aerial Systems, Data and Services Standards, and Cyber Capability Development.  The most important projects included:\n\n(1)\tFriendly Force Tracking (FFT) Ground to Air (G2A) Situational Assessment – Conducted an operational assessment of US and Coalition partner ground to air situational awareness systems.  Validated that the systems received correct information data, processed a high volume of data, and the data management\/processing capability correctly sorted track data to reduce risk of fratricide.\n\n(2)\tJoint Operational Long Term Evolution Deployable (JOLTED) Tactical Cellular System (TACTICS) Joint Capability Technology Demonstration (JCTD) Technical Manager – JOLTED TACTICS is an Internet Protocol (IP) based system designed to provide secure cellular communications to tactical users at much higher data rates than other tactical networks.  This system leverages innovations in Fourth Generation (4G) LTE Cellular technologies and mobile Ka band spread spectrum satellite communications to deliver megabits of data to mobile and dismounted teams armed with mobile devices such as smartphones or netbooks.   As the JCTD Technical Manager C4AD conducted the operational assessments to prove the system's validity.  The successful JCTD resulted in transition agreements to field the system being executed with PM WIN-T, NAVAIR, and PdM Nett Warrior as program managers. \n\n(3)\tAir Operation Center (AOC) and Joint Operations Center (JOC) C2 Information Systems (C2IS) Capability Integrations (six (6) events) – Provided a persistent operational cyber environment to USPACOM where Blue Teams and Red Teams interacted with operational command and control systems and networks.\n\n(4)\tAutomated NATO Database Interface Interoperability Assessments – Assessed the automated exchange of targeting data between the US Joint Targeting Toolbox (JTT) and the NATO Joint Targeting System (JTS) which enables faster joint and coalition targeting by automating the transfer of targeting data, reducing manpower requirements, and data entry errors.\n\n(5)\tC17 Hatch Mount Satellite Antenna (HMSA) Operational Assessment – The C-17 HMSA provided enhanced bandwidth to support on-board mission commander’s requirement for communications capable of enroute mission planning during forcible entry operations.  The successful operational assessment resulted in operational commanders recommending that the system be fielded, but there has not yet been a fielding decision.\n\n(6)\tCommercial Solutions for Classified (CSFC)\/Secure Wireless Local Area Network (SWLAN) Integration Assessments - Assisted the National Security Agency in the development, assessment, and fixed site deployment of a Suite B software encryption solution. This capability supports communicating over classified wireless networks without encryption hardware.\n\n(7)\tCoalition Warrior Interoperability Exercise 2016 (CWIX16) – Supported the technical validation of eleven (11) Federated Mission Networking (FMN) specifications, participating countries use of them, and the interoperability of these networked services in a federated environment.  Conducted an assessment of FMN Spiral Specifications as an extension of CIAV and related them to US Mission Partner Environment (MPE) networking.\n\n(8)\tExecutive Command and Control-Generation Next (EC2 GenNext) Data at Rest Technical Solution – Provided Senior Leadership with an e-reader solution that uses a Windows Surface Pro tablet running an NSA approved data at rest security solution.  The capability provides Executive\/Senior Leaders with access to classified material on a device that is NSA approved secure and unclassified when powered down.\n\n(9)\tDistributed Assured and Dynamic Configuration (DADC) Support – Assessed DADC’s capability to detect\/repair equipment misconfigurations and C2 system’s version incompatibilities to optimize network performance in USPACOM.    \n                                                               \n(10)\tUSPACOM Targeting and ISR Interoperability Assessment – Conducted an initial PACOM HQ and Service\/Coalition assessment of joint targeting and command\/decision systems. \n\n(11)\tBlack Dart – Led data collection and analysis on the integration of counter-UAS (C-UAS) operational architectures, operational concepts, and tactics, techniques, and procedures (TTPs) during BLACK DART event.  Evaluated current and proposed operational concepts for C-UAS operations, providing recommendations based on qualitative\/quantitative findings to stakeholders.  Supported organizations include JS, all Services, Combatant Commands, DHS, and select U.S. and foreign acquisition programs (both fielded & emerging technologies).\n\n(12)\tSquad-X – Provided quantitative\/qualitative data collection and analysis to baseline current U.S. small unit mission command technologies in support of DARPA’s Squad-X project.  This baseline objectively describes the accuracy, completeness, and timeliness of current capabilities, as well as their interoperability with current\/future Mission Partner Environments.  Technologies injected in follow-on phases of the project will be measured against this baseline, supporting future development and procurement decisions based on measurable improvements in effectiveness and interoperability. \n\n(13)\tCAS JT&E – Leading DOT&E effort for Digitally-Aided Close Air Support (DACAS) Tactics, Techniques, and Procedures (TTPs) Standardization development. The nomination, endorsed by all Services and USSOCOM, resulted in implementation of the DACAS TTP Standardization Joint Test with Joint Deployable Analysis Team (JDAT) tasked to direct and support these efforts.\n\n(14)\tBold Quest Technical Demonstration – Designed, built, accredited, and managed the Bold Quest exercise networks for US and coalition partners.  Enabled actions include establishment of transport nodes, institution of quality of service policies, cross domain services, sustainment of network core services, data collection from remote and field nodes, Voice over IP services, joining procedures, and all required documentation.\n\n(15)\tBOLD Quest Exercise Analysis – Conducted evaluations of demonstrated Joint\/Coalition capabilities, resulting in detailed analysis of interoperability gaps and integration shortfalls relating to the following:  Joint Fires Capabilities, Coalition Intelligence, Surveillance, and Reconnaissance (CISR), Digitally Aided Close Air Support (DACAS), and Joint Close Air Support (JCAS).  Results inform U.S. Joint, all Services, and Coalition (to include NATO) partner decisions to field interoperable and integrated capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.898"
                                            },
                                            "Text": {
                                                "val": "Conduct interoperability assessments and analysis in both field and persistent environments that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), systems in response to operational issues and shortfalls.  FY 2017 focus areas include: Command and Control, Counter UAS, Joint Fires, Mission Partner Environment, and operations in Cyberspace Capability Development. This includes the impact of technology advances in wireless devices, modem technology, RF communications, and small secure digital capabilities on warfighter command and control capabilities to match emerging requirements with near-term technology solutions. \n\nProjects include:  \n(1)\tBold Quest 2017 Technical Demonstration – Design, build, accreditation, assessment, and management of the exercise networks for US and coalition partners. \n(2)\tCounter-UAS (C-UAS) – Data collection and analysis during BLACK DART or similar events. \n(3)\tSmall Unit Joint C2 Capabilities – Quantitative\/qualitative data collection and analysis of DARPA’s Squad-X project. \n(4)\tJoint Expeditionary Integration C5ISR Integration Kit Assessments – Integrate and assess emerging technologies, respond to issues reported from operating forces, and support the transition of SOF “best practices” to conventional forces and acquisition programs.  \n(5)\t4G LTE Security as a Commercial Solutions for Classified (CSfC) Security Layer 4G LTE CSfC Pilot – In partnership with the NSA, integrate and demonstrate the viability of using the native security of LTE as a security layer for the transmission of classified information.\n(6)\tAutomated NATO Database Interface (ANDI) Interoperability Assessment – Continue to assess the automated exchange of targeting data between the US Joint Targeting Toolbox (JTT) and the NATO Joint Targeting System (JTS) which reduces manpower requirements and data entry errors by automating the transfer of targeting data.\n(7)\tHAMMERHEAD JCTD (P) and Mounted Long-Term Evolution (LTE) Node Technical Integration Assessment (MOLTEN Dragon) – Conduct a technical assessment of multi-purpose airborne pods supporting tactical and SATCOM communications, tactical datalinks, and intelligence sensors.\n(8)\tClassified Reconfigurable Operational Wireless Network (CROWN) Capability Integration – Develop and assess a deployable secure “Campus” wireless architecture based on layered software encryption in partnership with the National Security Agency (NSA).\n(9)\tProximity Lock Technology (PLT) Integration Assessment – Assess a proximity and heart beat dependent data-at-rest automatic locking capability for classified tactical mobile devices, partnership with NSA.\n(10)\tVirtual Enterprise Mobile Security (VEMS) Integrated Solutions – Assess the usability\/functionality of the Hypori Virtual Mobile Infrastructure (VMI) as a way to enable classified tactical communications on unclassified end-user devices, partnership with NSA.\n(11)\tCoalition Interoperability Assurance  and Validation (CIAV) – Resolute Support Mission – Afghanistan (RSMA) Assessments – Support ongoing overseas operations through continued interoperability assessments of coalition systems supporting coalition mission threads."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.898"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.898"
                                            },
                                            "Text": {
                                                "val": "Conduct interoperability assessments and analysis in both field and persistent environments that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5) systems in response to operational issues and shortfalls. A comprehensive Joint Task Force (JTF) environment will support the integration and operational assessment process and support cyber training, capability development and assessments, separately and in coordination with the Department of Defense Cyber Range Environment (DECRE). This is achieved by maintaining a persistent C5 laboratory environment that allows for a rapidly reconfigurable joint, coalition, and inter-agency interoperability assessments, including participation in the Coalition Interoperability and Assurance Validation (CIAV) which supports on-going war efforts. In a live setting, a deployable capability allows the collection and analysis of decision quality data for command and control operations from the operational to lowest tactical echelons of command.  This objective, joint analysis supports capability development, acquisition, and systems employment decisions based on quantifiable performance in replicated operational environments.  FY 2018 focus areas include: Capability development in Command and Control, Mission Partner Environment (Federated and Virtual), Joint Fires Support, and operations in Cyberspace, plus Joint Test and Evaluation of Digitally Aided Close Air Support (DACAS). C5 Assessments and Analyses activities are conducted through both: persistent, reconfigurable C5 laboratories that connect joint and coalition system of systems operational environments to other virtual, constructive, and live environments across national and multi-national operational, research, and test networks leveraging operational venues\/exercises; and, a deployable assessment capability (including contested joint environments) that allows range instrumentation and the collection and analysis of quantitative data in replicated operational environments. \n\n Projects include:\n\n(1)\tCoalition Interoperability Assurance Validation (CIAV) Assessments – Conduct interoperability assessments of coalition systems supporting coalition mission threads.  CIAV assessments validate complete and timely exchange of critical information and improve overall interoperability allowing Coalition forces to fight more effectively and efficiently.\n(2)\tAdvanced Tactical Wireless Integration Capability (ATWIC) – Perform technical integration and assessments of advanced communication systems hardware, software, and security solutions to identify capabilities that address warfighter requirements.\n(3)\tJoint Fires Support Joint Mission Thread (JFS JMT) Interoperability Assessment – Assess Joint and Coalition fire support command and control systems digital (machine-to-machine) interoperability and provide findings and observations.\n(4)\tAdvanced Wide Area Network Security (AWANS) Capability Integration – Demonstrate an integrated wide area network security solution using NSA approved Commercial Solution for Classified virtual private networks between two or more sites.\n(5)\tCyber Guard (CG)\/Cyber Flag (CF) 2018 Assessment and Technical Support – Provide C2 systems, a common operational picture, and conduct assessment of cyber effects on these systems integrated into the Navy Defensive Cyber Operation DoD Information Network (DoDIN) Simulation, Training, and Exercise Platform (STEP) environment.\n(6)\tBold Quest 2018 Technical Demonstration – Design, build, accreditation, assessment and management of the exercise networks for U.S. and coalition partners.\n(7)\tCounter-UAS (C-UAS) – Data collection and analysis during BLACK DART or similar FY18 events.\n(8)\tC2 Systems Support to DoD Enterprise Cyber Range Environment – Provide a persistent and distributed cyber environment for cyber mission forces development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Conduct a minimum of fifteen (15) interoperability assessments designed to identify Joint and Coalition interoperability issues and recommend fixes\/solutions to Program Managers, Combatant Commands, all Services, and Agencies.\n\n(2) Conduct a minimum of one (1) broad-spectrum Counter-UAS (C-UAS) analysis event; providing data collection, analysis, and recommendations that directly address identified C-UAS capability gaps and interoperability shortfalls for partners including: Joint, all Services, Intergovernmental, and Coalition stakeholders.\n\n(3) Provide C2 Systems and Persistent command, control, communications, and computers (C4) Environment supporting at least two (2) Combatant Command Exercises to satisfy Combatant Command training objectives, including the cyber threat to mission systems.\n\n(4) Support up to four (4) Squad-X experiment events, providing objective analysis on performance and interoperability that directly informs the acquisition of improved C2 capabilities for U.S. small units. \n\n(5) Support a minimum of thirty (30) Coalition Interoperability Assurance and Validation (CIAV) events and provide a minimum of one hundred (100) observations\/findings to resolve end-to-end mission based interoperability issues, validate Tactics, Techniques, and Procedures, and support NATO Future Mission Networking (FMN) and U.S. Mission Partner Environment (MPE) implementation plans.\n\n(6) Provide analyses for at least six (6) field assessments\/demonstrations in the areas of Joint Fires Capabilities, C2, CISR, DACAS, and FMN\/MPE.  Analyses results will inform continued development of evaluated capabilities, including acquisition\/fielding decisions and system TTPs.  \n\n(7) Provide C2 Systems and Persistent C4 Environment supporting at least four (4) individual\/team training events per year to meet Cyber training and certification objectives.\n\n(8) Provide C2 Systems and Persistent C4 Environment to support at least four (4) Cyber Assessments promoting Cyber capability development.\n\n(9)  Integrate at least two (2) new capabilities per year supporting Combatant Command, Service, Agency, and Commercial Solutions for Classified and Mobile Computing program requirements."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Management and Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, Suffolk, Eglin"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.196"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.898"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "12.898"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "12.898"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint C5I"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "C5 Assessments and Analyses"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "C5 Capability Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "7.079"
                        },
                        "CurrentYear": {
                            "val": "6.594"
                        },
                        "BudgetYearOne": {
                            "val": "6.590"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.590"
                        },
                        "BudgetYearTwo": {
                            "val": "6.637"
                        },
                        "BudgetYearThree": {
                            "val": "6.637"
                        },
                        "BudgetYearFour": {
                            "val": "6.637"
                        },
                        "BudgetYearFive": {
                            "val": "6.637"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Lead C2 capability development and integration in order to achieve an interdependent joint force. This will be accomplished through four focus areas:\nCapability Development, C4 Architectures, Data and Services, and Interoperability and Integration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C5 Capability Development"
                                    },
                                    "Description": {
                                        "val": "Lead C2 capability development and integration in order to achieve an interdependent joint force. This will be accomplished through four focus areas: \nCapability Development, C4 Architectures, Data and Services, and Interoperability and Integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.079"
                                            },
                                            "Text": {
                                                "val": "Led C2 capability development and integration to achieve an interdependent joint force. This was accomplished through four focus areas:\n\n(1) Capability Development – Joint Staff lead and Requirements Working Group lead for DoD CIO & OSD\/AT&L – directed Business Case Analysis (BCA) for a proposed $99M recapitalization of the Global Command and Control System – Joint (GCCS-J) – a cyber enhanced Enterprise Common Operational Picture to facilitate globally integrated operations. Led Combatant Command (CCMD) command and control (C2) Integrated Priority List Capability Gap Analysis review and Operational Priorities analysis for FY18-22 identifying key warfighter requirements resulting in JROC approval. Executed CJCSI 3265.01 – directed requirements and validation duties for Joint C2 Governance and Management.  Results included:  additional DoD-compliant web browsers for Navy – Marine Corps Internet (NMCI); COP overlays for Google Earth users; consolidated management of Deployable Joint C2 kits; JROC validation of Air Operations Center Weapons System (AOC WS) modernization efforts; Combatant Command and Service collaboration on structural changes to targeting databases; formalized requirements management for Situational Awareness Services in the Joint C2 portfolio; and a warfighter assessment of the Defense Collaboration Services (DCS).\n\n(2) C4 Architectures - Expanded the scope of Joint Information Environment (JIE) and DoD CIO architecture content on the Warfighting Mission Area (WMA) Architecture Portal by 30% and increased the user base by 30% from 5200 to 7000+ users. Staffed, analyzed and validated 51 JIE Architectures ranging from solutions architectures, Engineering Design Specifications and reference architectures in collaboration with CCMDs. Developed selected architectures and design specifications in support of JIE capability objectives.  Assisted in the development of the JIE Security Classification Guide to provide classification guidance for DoDIN architecture and engineering practices. Produced six mission thread architectures, enabling the definition and evaluation of System of System architecture attributes, covering Cyberspace Operations, Joint Suppression of Enemy Air Defense (2 threads), Homeland Security Border Security Operations, Humanitarian Assistance\/Disaster Relief, and Intelligence Enabling. Conducted three analytical studies related to Joint Suppression of Enemy Air Defense. Supported NATO in the creation of guidelines and methodology for development of mission threads.\n\n(3) Data and Services - Developed an updated Federal Government vetted and approved National Information Exchange Model Military Operations Domain that was successfully demonstrated and used by DOD, Department of Homeland Security and NATO member nations for increased Command and Control interoperability.  Established and began execution of a DOD campaign plan to align and provide warfighter interoperability across five different existing command and control tactical and messaging data standards now in operational use by DOD and mission partners. Developed and submitted for formal DOD vetting and approval, a command and control cyber symbology Military Standard to provide standardized C2 Common Operational Picture representations in a transregional threat environment across Combatant Commands.\n\n(4) Interoperability and Integration - Led the development and implementation of improved Combatant Command (CCMD) unity of effort and speed of command with mission partners known as Mission Partner Environment (MPE) by developing requirements and standards for Unclassified Information Sharing Services (UISS), development of the annual MPE Action Plan, and integration of MPE into Senior Leader and Joint Professional Military Education (JPME) programs, Joint Doctrine and Joint Training. Shaped NATO’s Federated Mission Networking (FMN) implementation to maintain alignment with MPE, through participating as the Flag\/General Officer\/SES level U.S. representative to the FMN Management Group and providing U.S. representatives to the FMN working groups that coordinate FMN capability development, Coalition Interoperability Assurance and Validation (CIAV), Joining, Membership and Exit Instructions (JMEI) development, cyber security, training, and other interoperability activities across 27 NATO and 6 non-NATO nations which are implementing FMN."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.594"
                                            },
                                            "Text": {
                                                "val": "(1) Capability Development – Continue to serve as direct liaison between operational users and materiel developers throughout the capability lifecycle, to include prioritization of requirement and development efforts.  Manage the Net-Enabled Requirements Identification Database (NRID) and the Decision Support Tool (DST) to provide accessibility and visibility into C2 capability needs and potential solutions.  Develop and seek JROC approval of FY 2019\/2020 Joint C2 Operational Requirements based upon top-down Integrated Priorities List and bottom-up warfighter requirements.  Host three Joint C2 Integration Workshops to synchronize Joint C2 materiel development efforts.  Coordinate with the warfighter community, to include multinational and other mission partners, to identify common requirements and priorities, as well as materiel and non-materiel solutions to address similar\/common needs and capability gaps.  Produce\/coordinate an Information System-Capability Development Document (IS-CDD) for an Enterprise Common Operational Picture capability for JROC approval.  Further, produce Capability Definition Packages and subordinate Capability Packages for Targeting and Geospatial Intelligence, Maritime Tactical C2, Unified Action Plan COP, Operational Design and Joint Planning Process, Joint Friendly Force Tracking, and Enterprise Force Structure.  Coordinate assessment of newly developed Command and Control of the Operational Environment capabilities. Facilitate collaboration between GCCS-J and AOC WS program offices to ensure synchronized release of capabilities with effective data exchanges.  Facilitate warfighter prioritization of GCCS-J Global COP requirements for incremental capability development and release.\n\n(2) C4 Architectures - Improve WMA Architecture Portal usability and develop a basic set of architecture analysis and visualization tools and services. Continue to improve the quality of and expand the amount of the C4\/Cyber portfolio architecture information available on the WMA Architecture Portal.  Establish and populate Joint Staff Protection and Force Application Functional Capability Board (FCB) portfolio architecture content on the WMA Architecture Portal to facilitate architecture information sharing, integration, analysis, and re-use. Validate JIE architectures, functional requirements documents and engineering design specifications to increase compliance with JIE architecture standards and metrics across DOD. Assist in the analysis of FYDP 2019 - 2023 Capability Gap Assessment (CGA), specifically the FCB IPL Review and the CGA gaps. Revise the Joint C2 Reference Architecture in conjunction with DISA Services Development Directorate. Align Joint Mission Thread guidance\/governance\/production priorities to Chairman’s priorities. Provide analytical support to the Chairman’s Joint Military Net Assessment and the Chairman’s Net Assessment. Support coalition partner efforts to define and develop mission threads.\n\n(3) Data and Services - Develop, promote and integrate data and services requirements, standards, technical specifications, and policy to support improved warfighter interoperability and information sharing with joint, mission partners and other U.S. Government departments and agencies. Collaborate with Allied Command Transformation (NATO) to develop the NATO Core Data Framework as a means to achieve coalition interoperability. Align and standardize emerging Tactical Data Link and Messaging standards with enterprise information sharing.  Develop and promulgate a major release of the National Information Exchange Data Model, Military Operations domain. Refine and mature enterprise IT service lifecycle management processes and procedures with the DoD CIO and Services.\n\n(4) Interoperability and Integration – Support emergent cyber priorities throughout all Department focus areas by performing analysis and assessments and support the development of the Persistent Training Environment (PTE) to emulate the C4\/cyberspace domain. Support C4\/cyber system developers with operational\/developmental Cyber Security testing and assessment, including integration of data collection and analysis instrumentation. Continue to lead the implementation of improved Combatant Command (CCMD) unity of effort and speed of command with mission partners through enhanced information sharing with partner nations by leading the continuing implementation of the JROC approved Future Mission Network 90 Day Study recommendations (known as Mission Partner Environment (MPE)). Facilitate use of force development events as operational environment opportunities to further explore and validate the potential for MPE concepts (e.g. virtualization of CENTRIX networks in exercises STEADFAST COBALT and JUDICIOUS RESPONSE). Support the deployment of a federated enduring MPE capability within the CCMDs. Lead the development and maturation of DoD MPE Joining Instructions providing the joint force a baseline technical document for establishing federated mission networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.590"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.590"
                                            },
                                            "Text": {
                                                "val": "1) Capability Development – Continue to sustain and utilize the Net-Enabled Requirements Identification Database (NRID) and the Decision Support Tool (DST) to provide accessibility and visibility into C2 capability needs and potential solutions for C2 stakeholders and materiel developers.  Develop\/coordinate the annual Joint C2 Operational Priorities for JROC approval, and host four Joint C2 Integration Workshops. Align capability requirements and JCIDS documentation to enable material solution development, and ensure warfighter equities are represented through Joint C2 Governance and Management forums and formal processes. Develop Capability Definition Packages and Capability Packages to support on-going Enterprise COP, Command and Control Information Exchange (C2IE), and Joint Planning Services capabilities, and develop warfighter assessment criteria for same. Update CJCSI\/M 3265.01, “Joint C2 Governance and Management,” to strengthen requirements management for enterprise-level, globally integrated operations.  Ensure requirements development efforts include architecture, data, cross-functional, cyber, and Joint Information Environment capability areas and equities. Implement plans and schedules to assess Enterprise COP incrementally developed capabilities.\n\n(2) C4 Architectures – Update the WMA Architecture Development Standards to meet emerging JCIDS process improvements. Provide foundational components of the WMA Enterprise Architecture by populating the WMA Architecture Portal with all relevant and available FCB portfolio Areas\/Communities of Interest architecture content. Improve the WMA Architecture Portal for the Combatant Command, services and DoD agencies by broadening access, integration, reusability and information sharing of architecture artifacts and data sets through federation and standardized data exchanges National Information Exchange Model (NIEM).  Provide architecture development and analysis efforts as required to support the Chairman's directed focus areas and Lines of Operations.\n\n(3) Data and Services – Continue to develop, promote, and integrate data and services requirements, standards, technical specifications, and policy to support improved warfighter interoperability and information sharing with joint, mission partners and other U.S. Government departments and agencies. Socialize and perform proof of concept activities of the NATO Core Data Framework, to achieve coalition interoperability and demonstrate operational effectiveness. Continue to align and standardize emerging Tactical Data Link and Messaging standards with enterprise information sharing. Support the implementation of NIEM as the common interoperability information exchange standard for new IT services. In coordination with the DoD CIO, implement IT enterprise service lifecycle management processes, procedures, and capabilities.\n\n(4) Interoperability and Integration – Support cyber priorities throughout all Department focus areas by performing analysis, assessments and supporting materiel developers. Review and monitor the continued development of the MPE-Information System (MPE-IS) to ensure it meets the operational requirements of the CCMDs and Services. Continue to shape FMN implementation to ensure it remains aligned with MPE, including related capability development (e.g. Spiral 2.0 specifications and risk mitigation activities that leverage CIAV and the BOLD QUEST capability demonstration) and FMN Framework JMEIs that are complementary to DoD MPE Joining Instructions. Support development and maturation of DECRE C2IS to support US and Coalition cyber force readiness, cyber defense of coalition networks, integration, interoperability, and survivability of Mission Partner Environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort, and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        },
                        "PerformanceMetrics": {
                            "val": "1) Secure JROC approval of the FY 2019 Joint C2 operational priorities defining C2 capability needs\/gaps providing senior level oversight and direction to Joint C2 capability development.\n\n(2) Secure DoD approval for seven (7) JCIDS requirements documents to support materiel development of Joint C2, Adaptive Planning\/Execution, Global-Theater Security Cooperation, Readiness, and Cross Functional information technology capabilities enabling timely delivery of materiel solutions to meet warfighter capability needs\/gaps.\n\n(3) Ensure Joint C2 requirements development supports the DoD-directed Better Buying Power 100% by continuing the rapid development and fielding of virtualized C2 system capabilities to CCMDs and Services, i.e., GCCS-J Global (COP & I3), Agile Client – an x86 (PC-based) infrastructure, Enterprise Widget Storefront for web access of Joint C2 data and applications, Joint Planning and Execution Services to replace legacy systems.  \n\n(4) Provide two (2) planned releases of Global-Theater Security Cooperation Management Information System (G-TSCMIS) capability on both NIPRnet & SIPRnet for CCMDs\/Services allowing G-TSCMIS use in a disconnected, intermittent, or limited bandwidth (DIL) environment, as well as providing an initial cross domain data exchange capability between security levels.\n\n(5) Validate the architectures and engineering design specifications for twenty-seven (27) JIE and MPE projects.\n\n(6) Conduct three (3) National Information Exchange Model Military Operations Domain Configuration Control Board sessions to improve and increase information sharing via promulgation of one Domain content update.\n\n(7) Lead a minimum of six (6) Enterprise Service and Data Panels (ESDP) with the goal to improve and increase the interoperability and reusability of DOD Enterprise Services and Authoritative Data Sources.\n\n(8)  Include mission partnering concepts in four (4) Combatant Command and Service exercises.\n\n(9)  Establish at least two (2) new or enhanced information\/sharing and collaboration areas NLT 30 Jun 18.\n\n(10) Establish and refine processes and procedures to ensure FMN implementation is included in two (2) NATO exercises."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Joint Fires C2 Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.425"
                        },
                        "CurrentYear": {
                            "val": "4.150"
                        },
                        "BudgetYearOne": {
                            "val": "4.150"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.150"
                        },
                        "BudgetYearTwo": {
                            "val": "4.150"
                        },
                        "BudgetYearThree": {
                            "val": "4.150"
                        },
                        "BudgetYearFour": {
                            "val": "4.150"
                        },
                        "BudgetYearFive": {
                            "val": "4.150"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Lead interoperability efforts across DoD and partner nations at the operational and tactical level for mission partner operations, fire support, Combat Identification (CID), and Friendly Force Tracking (FFT) capabilities. Conduct Joint Fire Support (JFS)\/Joint Close Air Support (JCAS) and CID-FFT action plans to fulfill CJCSI-directed, General Officer\/Flag Officer (GOFO) level responsibilities. Conduct JFS Executive Steering Committee (ESC) standardization team accreditation visits to U.S. and partner nation schoolhouses to ensure Memorandum of Agreement (MOA) signatories are accomplishing schoolhouse training in compliance with the Memorandas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Fires C2 Interoperability"
                                    },
                                    "Description": {
                                        "val": "Execute Joint Staff-sponsored Bold Quest systems-of-systems interoperability assessment, including integration of Cyber capabilities with command and control of Conventional and Special Operations Force missions from a multinational perspective at the tactical level. These efforts directly support 2014 Quadrennial Defense Review and 2016 National Military Strategy goals to increase interoperability with allies and partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.425"
                                            },
                                            "Text": {
                                                "val": "Conducted Joint Staff sponsored Bold Quest Coalition Capability Demonstration and Assessment involving fourteen (14) nations, all U.S. Services and U.S. Special Operations Command successfully expanding utility of Mission Partner Environment concepts; the integration of ground-to-air situational awareness capabilities; integrated air & missile defense threads; and digitally enhanced call-for-fire and close air support operations through live, virtual, construction dismounted operations at Ft Stewart, GA and Savannah, GA.\n\nLed accreditation visits to ten (10) Joint Terminal Attack Controller (JTAC); 1 Forward Air Controller (Airborne); and 7 Joint Fires Observer (JFO) Schoolhouses. Accreditation of U.S. and partner nation schoolhouses ensured trained and qualified personnel meet standardized performance metrics, enabling enhanced trust and interoperability during current and future combat operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "Execute Joint Staff-sponsored Bold Quest systems-of-systems interoperability assessment, including integration of Cyber and ISR capabilities with command and control of Conventional and Special Operations Force missions from a multinational perspective at the tactical level. Continue incorporating Mission Partner Environment concepts to increase Allied and coalition interoperability. These efforts directly support the 2016 National Military Strategy and the CJCS’ focus areas. Continue leading accreditation visits of current JFS ESC member programs and provided staff assistance for development of new start close air support-related training and certification programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "Plan and execute Joint Staff-sponsored Bold Quest 2018 systems-of-systems interoperability assessment, including integration of Cyber and ISR capabilities with command and control of Conventional and Special Operations Force missions from a multinational perspective at the tactical level. These efforts directly support the 2016 National Military Strategy and the CJCS’ focus areas. Continue leading accreditation visits of current JFS ESC member programs and provided staff assistance for development of close air support-related training and certification programs."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        },
                        "PerformanceMetrics": {
                            "val": "1) Lead development of situational awareness and cooperative\/non-cooperative identification capabilities that enable U.S. and NATO\/Coalition warfighters to identify friendly, enemy, and neutral forces for “shoot\/don’t shoot” decisions.\n\n(2) Synchronize Service testing, acquisition and fielding of Mode 5 IFF capability, with focus on Full Operational Capability (FOC) in 2020. Monitor Service fielding progress of one hundred sixty-nine (169) platform types.\n\n(3) Complete Definition Package for Block 2 of Digitally Aided Close Air Support (DACAS) coordinated implementation in conjunction with participating Service programs of record. Effort will enable over twenty (20) U.S. and partner nation systems to be more interoperable in the CAS mission area.\n\n(4) Expand digital call-for-fire solution development to include enhanced multi-national interoperability with six (6) partner nations.\n\n(5) Conduct Accreditation Assessments for fourteen (14) of thirty current signatory schoolhouses (8 Joint Terminal Attack Controller (JTAC), 2 Forward Air Controller (Airborne), and 4 Joint Fires Observer (JFO) Schoolhouses).\n\n(6) Lead development and refinement of four (4) U.S. and NATO joint fires-related doctrine and Tactics, Techniques, and Procedures (TTP) publications.\n\n(7) Lead planning, coordination and execution of two (2) Bold Quest systems of systems interoperability assessment to facilitate U.S. and coalition integration.\n\n(8) Plan and conduct quarterly Joint Fire Support and Combat ID-Friendly Force Tracking Executive Steering Committee and working group meetings to address identified shortfalls in those mission areas."
                        }
                    }
                }
            ]
        }
    }
}