{
    "id": "2018-AirForce-PB-3600-MJBOOK-0-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-15",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603199F"
        },
        "ProgramElementTitle": {
            "val": "Sustainment Science and Technology (S&T)"
        },
        "R1LineNumber": {
            "val": "16"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "17.323"
            },
            "CurrentYear": {
                "val": "20.636"
            },
            "BudgetYearOne": {
                "val": "22.811"
            },
            "BudgetYearOneBase": {
                "val": "22.811"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "23.217"
            },
            "BudgetYearThree": {
                "val": "23.680"
            },
            "BudgetYearFour": {
                "val": "24.154"
            },
            "BudgetYearFive": {
                "val": "24.637"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.378"
                },
                "CurrentYear": {
                    "val": "20.636"
                },
                "BudgetYearOne": {
                    "val": "22.811"
                },
                "BudgetYearOneBase": {
                    "val": "22.811"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "17.323"
                },
                "CurrentYear": {
                    "val": "20.636"
                },
                "BudgetYearOne": {
                    "val": "22.811"
                },
                "BudgetYearOneBase": {
                    "val": "22.811"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.055"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.496"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.559"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635351"
                    },
                    "ProjectTitle": {
                        "val": "Technology Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.323"
                        },
                        "CurrentYear": {
                            "val": "20.636"
                        },
                        "BudgetYearOne": {
                            "val": "22.811"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.811"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "23.217"
                        },
                        "BudgetYearThree": {
                            "val": "23.680"
                        },
                        "BudgetYearFour": {
                            "val": "24.154"
                        },
                        "BudgetYearFive": {
                            "val": "24.637"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates mature Air Force Research Laboratory (AFRL) sustainment technologies such as: materials, corrosion, maintenance\/repair techniques, state awareness\/non-destructive inspection, health management, life prediction, low observable materials and processes, composite materials and logistics for transition into fielded Air Force systems to reduce life cycle sustainment costs and increase readiness. Technologies matured and demonstrated impact affordability and availability of fielded aerospace weapon systems by reducing sustainment costs, extending service life, and maintaining  mission readiness and capability. This project develops and demonstrates maintenance, life cycle management, and system\/fleet decision making technologies that can be implemented to address operational sustainment issues and could influence future system sustainability decisions via risk reduction to support inclusion into new systems. Studies are conducted to analyze processes and methodologies for application of technologies to address sustainment issues across the force, identifying cross cutting applications for fielded systems, and opportunities for building in sustainability into future applications. This project also develops and demonstrates affordable advanced composites for aircraft structures of fielded and emerging systems.  This includes studies, analysis, and tests for application of composites to address sustainment and affordability issues across the force. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) process to harmonize efforts and eliminate duplication.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Health Management\/Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition state awareness\/system health management technologies. Conduct studies and analyses to design sustainability into future applications. The short-term efforts in this project are selected based on warfighter needs identified via a bi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.722"
                                            },
                                            "Text": {
                                                "val": "Continued development of diagnostic technology to monitor\/assess health of airframe\/engines and components, for example: completed passive fuel bladder leak detection development, integration, and demonstration. Continued health assessment capability development for fielded systems and components. Continued development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine and components such as aircraft electrical systems maintenance testing capability and converting a text and media analysis system into a sustainable, web-based application which will make the tools sustainable for the next ten years or more."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.952"
                                            },
                                            "Text": {
                                                "val": "Continue development of diagnostic technology to monitor\/assess health of airframe\/engines and components. Continue health assessment capability development for fielded systems and components. Continue development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine and components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Text": {
                                                "val": "Continue health assessment capability development for fielded air\/space\/cyber systems and components. Continue development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine, launch vehicle, spacecraft, intercontinental ballistic missiles (ICBMs), and components.  These efforts are in Air Force Air, Space, and Cyber mission areas.  Initiate new efforts based on competitive selection processes in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prevention\/Enhanced Maintainability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden. The short-term efforts in this project are selected based on warfighter needs identified via a bi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.998"
                                            },
                                            "Text": {
                                                "val": "Continued development of materials and processes to reduce low observable (LO).  Continued efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continued airframe\/engine subsystem technology efforts including honeycomb structures. Continued solid state amplifier replacement for B-1B. Continued enhanced ester oil and integrally bladed rotor repair modeling. Initiated thermal spray coating process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.024"
                                            },
                                            "Text": {
                                                "val": "Complete first LO articles. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas. Continue development and transition of technologies that simplify training for maintainers and improving their performance. Continue airframe\/engine subsystem technology efforts. Continue solid state amplifier replacement for B-1B. Continue enhanced ester oil and integrally bladed rotor repair modeling. Continue thermal spray coating process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.325"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas. Continue development and transition of technologies that simplify training for maintainers and improving their performance. Complete enhanced ester oil and integrally bladed rotor repair modeling. Initiate new efforts based on competitive selection processes in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management\/Improved Reliability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition technologies to improve existing and new components, fleet management\/ decision-making tools, and supply chain\/sustainment infrastructure to decrease downtime and costs, and increase reliability. The short-term efforts in this project are selected based on warfighter needs identified via a bi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.476"
                                            },
                                            "Text": {
                                                "val": "Completed data visualization tool expansion to depot maintenance data. Continued efforts to develop system fleet management decision-making tools, repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. Continued durable structure demonstrations. Continued C-5 corrosion project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.649"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to develop system fleet management decision-making tools, repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. Continue durable structure demonstrations. Continue C-5 corrosion project."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.144"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.144"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to develop system fleet management decision-making tools, repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs.  Develop, demonstrate, and transition technologies to improve existing and new components to decrease repair\/sustainment costs and increase reliability.  These efforts span Air Force Air, Space, and Cyber mission areas.  Complete durable structure demonstrations. Complete C-5 corrosion project.  Initiate new efforts based on competitive selection processes in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Composite Certification"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate and transition reliability-based design of advanced composites for aircraft structures.\nThis includes studies and analysis of processes and methodologies for application of composites to address sustainment and affordability issues across the force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.127"
                                            },
                                            "Text": {
                                                "val": "Completed demonstration of accurate prediction of the probability of failure and life of bonded and unitized composite structures. Continued demonstration of manufacturing processes and manufacturing process control of composite primary structures. Completed testing of the feasibility of implementing a damage tolerant design approach for composite structures. Continued demonstration of the feasibility and benefits of a robust process for predicting and addressing the risk elements for safe and affordable certification of composite structures. Continued demonstration of life extension of a composite primary structure beyond that of the original certified service life. Initiated assessment and designs of affordable low cost composite manufacturing methods and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.011"
                                            },
                                            "Text": {
                                                "val": "Continue demonstration of manufacturing processes and manufacturing process control of composite primary structures.\nComplete demonstrating the feasibility of implementing a damage tolerant design approach for composite structures. Continue demonstration of the feasibility and benefits of a robust process for predicting and addressing the risk elements for safe and affordable certification of composite structures. Continue demonstration of life extension of a composite primary structure beyond that of the original certified service life. Complete assessment and designs of affordable low cost composite manufacturing methods and processes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.017"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.017"
                                            },
                                            "Text": {
                                                "val": "Complete demonstration of manufacturing processes and manufacturing process control of composite primary structures.  Complete demonstration of the feasibility and benefits of a robust process for predicting and addressing the risk elements for safe and affordable certification of composite structures. Complete demonstration of life extension of a composite primary structure beyond that of the original certified service life.  Initiate a service life extension demonstration on a legacy fleet aircraft composite part. Initiate flight demonstration of a composite compliant trailing edge on a legacy fleet aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}