{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-16",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605718A"
        },
        "ProgramElementTitle": {
            "val": "Army Modeling & Sim X-Cmd Collaboration & Integ"
        },
        "R1LineNumber": {
            "val": "168"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.901"
            },
            "CurrentYear": {
                "val": "7.959"
            },
            "BudgetYearOne": {
                "val": "1.829"
            },
            "BudgetYearOneBase": {
                "val": "1.829"
            },
            "BudgetYearTwo": {
                "val": "3.336"
            },
            "BudgetYearThree": {
                "val": "2.556"
            },
            "BudgetYearFour": {
                "val": "2.604"
            },
            "BudgetYearFive": {
                "val": "2.699"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Program Element (PE) 0605718A promotes the Army's Modeling and Simulation (M&S) strategy, defined by five guiding priorities: (1) formulate Army M&S policies; (2) develop and employ management processes for models, simulations and data; (3) develop M&S standards, architectures, networks and environments; (4) develop\/employ new M&S tools and simulation technology; (5) develop an M&S workforce.  PE 0605718A focuses on priorities 3 and 4.\n\nM&S Standards, Architectures, Networks and Environments: The consistent use of standards, architectures, networks and environments advances the goal of interoperability.  The Army coordinates with Joint, Interagency, Intergovernmental, and Multinational (JIIM) partners along with industry and academia to develop\/employ standards that promote collaboration and facilitate the sharing of tools, data and information.  The Army oversees procedures and processes for the appropriate use of standards to foster common formats and increase M&S and data reuse.  The Army ensures these standards, architectures, networks and environments are readily accessible and can be reliably applied by users.\n\nM&S Tools and Simulation Technology: The Army must have credible M&S tools and data to support the full range of Army organizational missions and functional responsibilities.  M&S results that are timely and credible enhance decision making.  The Army must develop and accredit reliable M&S tools so that decision makers and senior leaders benefit from the results and thus support the continued development, integration and use of such tools.  To ensure credibility and reliability of results, M&S managers, developers and users must make the capabilities, constraints, limitations and assumptions of their M&S tools readily accessible.  PE 0605718A provides for the development and employment of tools in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  Moreover, these tools can be documented, verified, validated and accredited for their intended purpose in order to provide timely, credible results."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.938"
                },
                "CurrentYear": {
                    "val": "7.959"
                },
                "BudgetYearOne": {
                    "val": "1.654"
                },
                "BudgetYearOneBase": {
                    "val": "1.654"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.901"
                },
                "CurrentYear": {
                    "val": "7.959"
                },
                "BudgetYearOne": {
                    "val": "1.829"
                },
                "BudgetYearOneBase": {
                    "val": "1.829"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.037"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.175"
                },
                "BudgetYearOneBase": {
                    "val": "0.175"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.037"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.175"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.175"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S03"
                    },
                    "ProjectTitle": {
                        "val": "Analysis M&S Tools and Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.901"
                        },
                        "CurrentYear": {
                            "val": "7.959"
                        },
                        "BudgetYearOne": {
                            "val": "1.829"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.829"
                        },
                        "BudgetYearTwo": {
                            "val": "3.336"
                        },
                        "BudgetYearThree": {
                            "val": "2.556"
                        },
                        "BudgetYearFour": {
                            "val": "2.604"
                        },
                        "BudgetYearFive": {
                            "val": "2.699"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project has two functions:\n\nFunction 1 (priority 3 of the \"Army Modeling and Simulation (M&S) Strategy\") -- Develop M&S standards, architectures, networks and environments that promote sharing, interoperability, access, and reliable application of tools, formats, data and information among\/for users.\n\nFunction 2 (priority 4 of the \"Army M&S Strategy\") -- Develop and improve tools and technology in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  These tools can be documented, verified, validated and accredited for their intended purpose.  \n\nResources under Project S03 support the six M&S communities (Acquisition, Analysis, Experimentation, Intelligence, Test & Evaluation, Training) at the enterprise level through enabling efforts. These efforts include the following: (a) design models, simulations, data and tools that are resident within one organization but reusable and trusted by M&S users and specialists across the Army M&S enterprise; (b) leverage industry and academia; (c) promote interoperability within M&S and between M&S and operational capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Develop M&S standards, architectures, networks and environments"
                                    },
                                    "Description": {
                                        "val": "Develop M&S standards, architectures, networks and environments that promote sharing, interoperability, access, and reliable application of  tools, formats, data and information among\/for users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.298"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2016 funds are distributed among activities that promote the third priority of the Army M&S strategy: develop M&S standards, architectures, networks and environments.  Specific FY16 accomplishments include a.) integration of current Army and Joint cyber capabilities into USCYBERCOM's primary test and training environment and b.) development (along with coalition partners United Kingdom and Australia) of a persistent M&S fires environment (e.g. artillery, air-\/ground-delivered munitions).  These efforts maximize reuse of M&S capabilities across the Army's six M&S communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.625"
                                            },
                                            "Text": {
                                                "val": "Fiscal Year (FY) 2017 funds are distributed among activities that promote the third priority of the Army M&S Strategy: develop M&S standards, architectures, networks and environments.  Specific FY17 plans include a.) establishment of a high fidelity scalable M&S network framework to facilitate cyber and network analyses and b.) development of an M&S cyber capability. The latter entails development of an environment that denies the Global Positioning System (GPS); development of a scalable, standards-based cyber emulation prototype that provides cyber effects in M&S environments; development of improved Army cyber effects for inter-service simulations for use in Army and Joint studies.  These efforts maximize reuse across the six Army M&S-enabled communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.605"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.605"
                                            },
                                            "Text": {
                                                "val": "FY18 funds will be distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology.  The specific distribution will be based on requirements and priorities established prior the start of (and during) FY18."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Develop M&S tools and technology"
                                    },
                                    "Description": {
                                        "val": "Develop and improve tools and technology in the form of models, simulations and data that support the full range of Army interests and deliver timely information to enhance effective decision making.  These tools can be documented, verified and validated for their intended purpose."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.603"
                                            },
                                            "Text": {
                                                "val": "FY16 funds are distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology.  Specific FY16 accomplishments include\na.) development of operational scenarios and validated network models that improve the Army's network modeling capability and b.) development of an M&S model that represents Chemical, Biological and Nuclear (CBRN) effects on personnel and material.  These efforts maximize reuse of M&S capabilities across the Army's six M&S communities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.334"
                                            },
                                            "Text": {
                                                "val": "FY17 funds are distributed among activities that promote the fourth priority of the Army M&S Strategy: develop M&S tools and technology. Specific FY17 plans include 1.) development of a network traffic model to emulate a wide range of Army communication-system platforms for network analysis, b.) development of an Intelligence, Surveillance and Reconnaissance (ISR) M&S platform dynamic tasking and re-tasking rule-set tool along with an M&S ISR authenticated database and c.) establishment of an unclassified Decisive Action Training Environment (DATE) force structure and performance database for the M&S Enterprise along with a common Mission Command (MC) to M&S linkage from a single data build.  These efforts maximize reuse across the six Army M&S enabled communities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.224"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.224"
                                            },
                                            "Text": {
                                                "val": "FY18 funds will be distributed among activities that promote the fourth priority of the Army M&S strategy: develop M&S tools and technology.  The specific distribution will be based on requirements and priorities established prior the start of (and during) FY18."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}