{
    "id": "2018-AirForce-PB-3600-MJBOOK-1-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V3A-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603260F"
        },
        "ProgramElementTitle": {
            "val": "Intelligence Advanced Development"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.032"
            },
            "CurrentYear": {
                "val": "5.598"
            },
            "BudgetYearOne": {
                "val": "5.652"
            },
            "BudgetYearOneBase": {
                "val": "5.652"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "5.611"
            },
            "BudgetYearThree": {
                "val": "5.715"
            },
            "BudgetYearFour": {
                "val": "5.814"
            },
            "BudgetYearFive": {
                "val": "5.934"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Intelligence Advanced Development (IAD) develops and demonstrates technology required to support warfighter needs for timely all source intelligence information. IAD supports global awareness, consistent battlespace knowledge, precision information, and the execution of time critical missions. IAD focuses on enhancing defense intelligence capabilities by exploring new and innovative ways to develop software tools which support the Anti-Access\/Area Denial (A2\/AD) Contested\/Congested Degraded Operations (CDO) problem set. IAD projects provide improved on-time information to the warfighter using new and existing data sources, streamlining data analysis, thus reducing the footprint required, and enhancing performance.  The Air Force Research Lab, Rome Research Site, Information Intelligence Systems and Analysis Division (AFRL\/RIE), works directly with users, employing evolutionary approaches and integrating finished modules directly into the field. The programs are oriented toward specific shortfalls and deficiencies as documented by the Major Commands (MAJCOMS), unified commands, and Intelligence organizations in their mission and functional area plans. This PE expedites technology transition from the laboratory to operational users via rapid prototyping. It is focused on technology insertion to correct AF intelligence deficiencies at the tactical and operational levels. The PE bridges the transition of new technologies from Advance Technology Demonstrations (ATDs) and Integrated Technology Thrust Programs (ITTPs) into current\/new systems, and supports the associated Defense Technology Objectives (DTOs). IAD may also reallocate existing resources to support out-of-cycle new\/updated warfighter requirements. \n\nRequirements for this PE are identified and prioritized by Air Combat Command (ACC). Development of new\/improved capabilities to meet the requirements is managed by AFRL\/RIE. Prototype products, usually in the form of software, are provided to users in incremental capability spirals for operational environment evaluation.\n\nThis program is Budget Activity 4, Advanced Component Development and Prototypes (ACD&P) because efforts are necessary to evaluate integrated technologies, representative modes or prototypes systems in a high fidelity and realistic operating environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.032"
                },
                "CurrentYear": {
                    "val": "5.598"
                },
                "BudgetYearOne": {
                    "val": "5.636"
                },
                "BudgetYearOneBase": {
                    "val": "5.636"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.032"
                },
                "CurrentYear": {
                    "val": "5.598"
                },
                "BudgetYearOne": {
                    "val": "5.652"
                },
                "BudgetYearOneBase": {
                    "val": "5.652"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.016"
                },
                "BudgetYearOneBase": {
                    "val": "0.016"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.016"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.016"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18: $16K inflation rate increase"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "64536A"
                    },
                    "ProjectTitle": {
                        "val": "INTELLIGENCE EXPLOITATION TOOLS (IET)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.991"
                        },
                        "CurrentYear": {
                            "val": "4.442"
                        },
                        "BudgetYearOne": {
                            "val": "4.488"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.488"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.455"
                        },
                        "BudgetYearThree": {
                            "val": "4.537"
                        },
                        "BudgetYearFour": {
                            "val": "4.615"
                        },
                        "BudgetYearFive": {
                            "val": "4.710"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission is to develop prototypes which encompass several areas of intelligence exploitation including the advancement of all source correlation and fusion for the intelligence analyst.  The intent is to enhance the overall situational awareness for Air Force, DoD, and Coalition groups which have requirements to correlate various sources of intelligence information, including Communications Intelligence (COMINT), Electronics Intelligence (ELINT), Imagery Intelligence (IMINT), Geospatial Intelligence (GEOINT), Measurement and Signature Intelligence (MASINT), Signals Intelligence (SIGINT),Open-source Intelligence (OSINT) and others, in a timely manner. IET may reallocate existing resources to support out-of-cycle new\/updated warfighter requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence Exploitation Tools (IET)"
                                    },
                                    "Description": {
                                        "val": "IET addresses the accurate and timely interpretation of various Intelligence data sources (such as digital imagery, video, documents, and signals) by developing and evaluating methods to manipulate and overlay the disparate products using various imagery, visualization and timeline techniques. This provides the analyst with the ability to fuse multiple intelligence sources for improved situational awareness and to better detect anomalies. Cross domain tools are explored as a means to view and provide data at multiple classification levels. In addition, methods to improve analysis of current and future foreign weapon systems are developed. IET provides enhanced warning and accuracy to allow national and military authorities a greater range of options to avert, diminish or control a crisis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.991"
                                            },
                                            "Text": {
                                                "val": "- Continued development of software focused on improving the way computers and application services supports intelligence analysts through the use of cognitive systems\n\n- Continued development of capability to enable the detection, geo-location, and tracking of complex wideband and low probability of intercept emitters; improved reporting timeliness and accuracy of worldwide ELINT intercept data\n\n- Continued development of capability to enable the intelligence analyst to conduct search and discovery either by visual pattern recognition\/feature extraction or text-based using queries; this effort created structured content from the recognition of objects, features and patterns contained within images\/video\n\n- Continued development of software currently deployed on RIVET JOINT processor to enable collecting current and future SIGINT metadata\n\n- Continued development of a framework designed to expose media tools, data, products, workflow and analytical services to the DoD and Intelligence Community (IC)\n\n- Continued development of a capability for quantitative mission assessment and integrating future ISR and combat mission capabilities\n\n- Continued development of automated methods that aid in the systematic, continuous, and comprehensive assessment of technical topic, concepts and emergence using information found in the published scientific, technical, and patent literature, message traffic, gray literature, conference papers, etc.\n\n- Continued enabling Distributed Common Ground Station (DCGS) enterprise support of high-altitude SIGINT missions and execution on NSANet\n\n- Completed FY16 user evaluations and prototype releases"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.442"
                                            },
                                            "Text": {
                                                "val": "- Continuing development of software focused on improving the way computers and application services supports intelligence analysts through the use of cognitive systems\n\n- Continuing development of capability to enable the detection, geo-location, and tracking of complex wideband and low probability of intercept emitters; improve reporting timeliness and accuracy of worldwide ELINT intercept data\n\n- Continuing development of capability to enable the intelligence analyst to conduct search and discovery either by visual pattern recognition\/feature extraction or text-based using queries  \n-- This effort creates structured content from the recognition of objects, features and patterns contained within images\/video\n\n- Completing development of software currently deployed on RIVET JOINT processor to enable collecting current and future SIGINT metadata\n\n- Continuing development of a framework designed to expose media tools, data, products, workflow and analytical services to the DoD and IC\n\n- Completing development of a capability for qualitative mission assessment and lays a framework for integrating future ISR and combat mission capabilities into the assessment framework\n\n- Continuing development of automated methods that aid in the systematic, continuous, and comprehensive assessment of technical topic, concepts and emergence using information found in the published scientific, technical, and patent literature, message traffic, gray literature, conference papers, etc.\n\n- Continuing to enable DCGS enterprise support of high-altitude SIGINT missions and execution on NSANet\n\n- Initiating development of a software capability to exploit and fuse open source information with DCGS related sources\n\n- Initiating development of a Feature Extractor to assist automation of Tech ELINT screening\n\n- Initiating development and integration of space based modeling capabilities into the Integrated Many on Many mission planning tool\n\n- Initiating implementation of operational metadata capability for DCGS SIGINT\n\n- Continuing user evaluations and prototype releases"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.488"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.488"
                                            },
                                            "Text": {
                                                "val": "- Will complete development of software focused on improving the way computers and application services supports intelligence analysts through the use of cognitive systems\n\n- Will complete development of capability to enable the detection, geo-location, and tracking of complex wideband and low probability of intercept emitters; improve reporting timeliness and accuracy of worldwide ELINT intercept data\n\n- Will complete development of capability to enable the intelligence analyst to conduct search and discovery either by visual pattern recognition\/feature extraction or text-based using queries.  \n-- This effort will create structured content from the recognition of objects, features and patterns contained within images\/video\n\n- Will complete development of a framework designed to expose media tools, data, products, workflow and analytical services to the DoD and IC\n\n- Will complete development of automated methods that aid in the systematic, continuous, and comprehensive assessment of technical topic, concepts and emergence using information found in the published scientific, technical, and patent literature, message traffic, gray literature, conference papers, etc.\n\n- Will continue enabling DCGS enterprise support of high-altitude SIGINT missions and execution on NSANet\n\n- Will continue development of a software capability to exploit and fuse open source information with DCGS related sources\n\n- Will continue development of a Feature Extractor to assist automation of Tech ELINT screening\n\n- Will continue development and integration of space based modeling capabilities into the Integrated Many on Many mission planning tool \n\n- Will continue implementation of operational metadata capability for DCGS SIGINT collection systems\n\n- Will continue user evaluations and prototype releases"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Requirements for new\/improved techniques for operational employment of simulation models are identified and prioritized by ACC.  Development of the new\/improved capabilities to meet these requirements is managed by Air Force Research Laboratory (AFRL) Rome Research Site.  Prototype products (usually software), once evaluated by the users, are transitioned from the laboratory to the operational community in spirals.  All major contracts within this project are awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "64537A"
                    },
                    "ProjectTitle": {
                        "val": "INTELLIGENCE ANALYSIS CAPABILITIES (IAC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.041"
                        },
                        "CurrentYear": {
                            "val": "1.156"
                        },
                        "BudgetYearOne": {
                            "val": "1.164"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.164"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.156"
                        },
                        "BudgetYearThree": {
                            "val": "1.178"
                        },
                        "BudgetYearFour": {
                            "val": "1.199"
                        },
                        "BudgetYearFive": {
                            "val": "1.224"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission is to provide continuing development and upgrades of threat analysis capabilities to produce integrated, predictive air and space intelligence to enable military operations, force modernization decisions, and policy making. Products from IAC allow the Intelligence Analyst to accelerate and increase the accuracy of threat estimates and system descriptions to deployed operational forces. Each of the development projects within the IAC program portfolio transition technologies to the operational communities through the incremental release of upgraded versions over a period of years as development projects progress towards the final configuration. IAC may reallocate existing resources to support out-of-cycle new\/ updated warfighter requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence Intelligence Analysis Capabilities (IAC) Development"
                                    },
                                    "Description": {
                                        "val": "IAC develops tools and algorithms for Intelligence Analysts with the ability to produce accurate, predictive, relevant, and timely intelligence that supports client processes, operational planning, and mission execution. IAC develops new and upgraded analysis, modeling and simulation tools focused on intelligence production supporting AF operational and developmental all source analysis functions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.041"
                                            },
                                            "Text": {
                                                "val": "- Released first prototype and initiated development of second prototype of an enterprise level solution (tools and procedures) that will allow the intelligence analyst to perform predictive intelligence analysis on new areas of interest\n\n- Released second prototype and initiated development of third prototype of capability to add a space communications modeling capability to the previously fielded terrestrial communications focused TEL-SCOPE tool\n\n- Completed user evaluations and prototype releases"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.156"
                                            },
                                            "Text": {
                                                "val": "- Continuing development of an enterprise level solution (tools and procedures) that will allow the intelligence analyst to perform predictive intelligence analysis on new areas of interest\n\n- Continuing development of capability to add a space communications modeling capability to the previously fielded terrestrial communications focused TEL-SCOPE tool\n\n- Continuing user evaluations and prototype releases"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.164"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.164"
                                            },
                                            "Text": {
                                                "val": "- Will continue development of an enterprise level solution (tools and procedures) that will allow the intelligence analyst to perform predictive intelligence analysis on new areas of interest\n\n- Will continue development to add a space communications modeling capability to the previously fielded terrestrial communications focused TEL-SCOPE tool\n\n-  Will initiate development of query adaption tools for multimodal (i.e. text, images, video, audio, etc.) and multilingual searches\n\n-  Will initiate development of tools for integrated air defense systems to perform passive detection and tracking\n\n- Will continue user evaluations and prototype releases"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "N\/A"
                                    },
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Requirements of new\/upgraded intelligence analysis tools are identified and prioritized by the ACC.  Development of capabilities to meet these requirements is managed by AFRL Rome Research Site.  Prototype products (usually software), once evaluated by the users, are fielded in incremental capability spirals.  All major contracts within this project are awarded after full and open competition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}