{
    "id": "2018-Army-PB-2040-JBOOK-4d642436f65ddc83c084fdb1d917f4809eff5a3f2d9cca01c78cf59a8dd3a26e-18",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602782A"
        },
        "ProgramElementTitle": {
            "val": "Command, Control, Communications Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "34.749"
            },
            "CurrentYear": {
                "val": "37.803"
            },
            "BudgetYearOne": {
                "val": "33.123"
            },
            "BudgetYearOneBase": {
                "val": "33.123"
            },
            "BudgetYearTwo": {
                "val": "37.798"
            },
            "BudgetYearThree": {
                "val": "36.530"
            },
            "BudgetYearFour": {
                "val": "37.010"
            },
            "BudgetYearFive": {
                "val": "34.227"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) researches and investigates communications, mission command (MC), and electronics components, sub-components, software and protocols that provide the Army with enhanced capabilities for secure, mobile, networked communications, assured information delivery, and presentation of information that enables decision-making. Commercial technologies are continuously investigated and leveraged where possible. Project 779 researches and develops MC software, algorithms, protocols, architectures, and devices that enable management of information across the tactical and strategic battle space; provides automated cognitive reasoning and decision making aids; allows timely distribution, presentation\/display and use of MC data on Army platforms; and researches alternatives to Global Positioning System (GPS) for positioning, navigation and timing.  Project H92 supports research in communications components, software, algorithms and protocols, which allow field commanders to communicate on-the-move to\/from virtually any location, through a seamless, secure, self-organizing, self-healing network.\n\nWork in this PE complements PE 0601104A (University and Industry Research Centers), PE 0602270A (Electronic Warfare Technology) , PE 0602705A (Electronics and Electronic Devices), PE 0603270A (Electronic Warfare Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), and PE 0603794A (Command, Control and Communications Advanced Technology), and is coordinated with PE 0601104A (University and Industry Research Centers), PE 0602120A, (Sensors and Electronic Survivability), PE 0602783A (Computer and Software Technology), and PE 0602874A (Advanced Concepts and Simulation).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.160"
                },
                "CurrentYear": {
                    "val": "37.803"
                },
                "BudgetYearOne": {
                    "val": "39.092"
                },
                "BudgetYearOneBase": {
                    "val": "39.092"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.749"
                },
                "CurrentYear": {
                    "val": "37.803"
                },
                "BudgetYearOne": {
                    "val": "33.123"
                },
                "BudgetYearOneBase": {
                    "val": "33.123"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.411"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.969"
                },
                "BudgetYearOneBase": {
                    "val": "-5.969"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.411"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.079"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.079"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.110"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.110"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2018 funding decreased to support higher priority efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "779"
                    },
                    "ProjectTitle": {
                        "val": "Command, Control And Platform Electronics Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.190"
                        },
                        "CurrentYear": {
                            "val": "16.444"
                        },
                        "BudgetYearOne": {
                            "val": "12.837"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.837"
                        },
                        "BudgetYearTwo": {
                            "val": "13.148"
                        },
                        "BudgetYearThree": {
                            "val": "13.426"
                        },
                        "BudgetYearFour": {
                            "val": "13.959"
                        },
                        "BudgetYearFive": {
                            "val": "12.228"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project researches moveable and mobile command post hardware and other components, software and algorithms that enable commanders at all echelons to have more accurate, useful, and timely information and allows them to execute mission command (MC) from anywhere on the battlefield.  Emphasis is on advancements to MC computing platforms, with a specific emphasis on positioning, navigation, and timing (PNT); user\/computing platform interaction and cognitive burden reduction; informed operations; and commander-centric capabilities, including using automation to augment or supply staff capabilities. This Project researches technologies that support multi-modal man-machine interaction, battle space visualization, positioning and navigation in degraded environments (poor Global Positioning System (GPS) performance), automated cognitive decision aids, real-time collaborative tactical planning tools, open system architectures, and integration concepts which contribute to more efficient expeditionary and uninterrupted operations.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assured Positioning, Navigation, and Timing (A-PNT)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates positioning, navigation and timing sensor and sensor integration technologies to provide position, velocity, and time information to support operational and training requirements, especially in GPS denied\/degraded environments. This effort also designs PNT modeling and simulation (M&S) architectures, frameworks and models, Work being accomplished under Program Element (PE) 0603772A\/Project 101 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.532"
                                            },
                                            "Text": {
                                                "val": "Investigated microelectromechanical systems (MEMS) sensors, anti-jam\/anti-spoof antennas, multi-frequency Global Navigation Satellite System (Multi-GNSS) receivers that incorporate M-code capability; researched the application of laser-based light detecting and ranging (LIDAR) as an improvement over visible light vision systems; investigated a common interface for PNT applications to enable the seamless incorporation of new sensors; researched the application of atomic sensors for gyros, accelerometers and clocks for independent location information using no external signals; explored the feasibility of integrating star trackers with terrestrial PNT systems; researched performance effects on navigation solutions when incorporating a variety of emerging PNT technologies such as cameras with rolling vs. global shutters; matured Blue Force Electronic Attack (BFEA) models and simulations to emulate and account for M-code enabled GPS receivers; conducted experiments with various technologies to provide PNT for autonomous vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.690"
                                            },
                                            "Text": {
                                                "val": "Will design and develop software tools to support the location and adjustment of pseudolite and autonomous navigation assets on the battlefield to maximize PNT information availability; expand upon research in celestial navigation to include tow-way time transfer techniques for independent localization and time for pseudolites in GPS denied environments; conduct research involving LIDAR odometry, visual navigation, and map building to help aid integrated navigation systems and improve the PNT solution accuracy and jam resistance for mounted, dismounted, and autonomous applications; investigate new anti-jam antenna designs for anti-spoofing capabilities; continue research in and fabrication of new and emerging inertial sensors in collaboration with the Army Research Laboratory and the Defense Advanced Research Projects Agency to reduce the size and increase the accuracy of these devices, allowing them to provide accurate position information for longer periods of time when GPS signals are lost or jammed; mature radio frequency (RF) ranging and positioning sensor components and algorithms to further augment GPS signals, provide precise position information and shorten time to first fix; design a PNT simulation architecture and framework; design and code models with selectable fidelity for PNT components, devices, and systems of the Army and other Services; perform analyses and studies using PNT models to assess their usefulness to support Army and other Service science and technology efforts and acquisition decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.313"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.313"
                                            },
                                            "Text": {
                                                "val": "Will investigate includes new methods of time transfer and novel ways to reduce size, weight and power for micro autonomous pseudolites to create expendable pseudolites that minimize the risks resulting from compromised assets; conduct research on machine learning concepts applied to navigation of autonomous vehicles to improve an autonomous vehicle’s localization and movement through a complex environment over time; continue investigation through an iterative process of design, fabrication, and test for size and performance improvements to miniature inertial sensors to augment PNT in GPS denied environments; complete validation of the use of Multi Global Navigation Satellite Systems signals (signals from foreign nation navigation satellite systems) in military applications; investigate new signals of opportunity for augmenting positioning and timing solutions on the battlefield; research dismounted anti-jam (AJ) technologies, such as wearable fabric antenna systems; explore potential applications for leveraging the new M-Code GPS signal for offensive and defensive navigation warfare operations; and develop models of PNT sensors, systems, and platforms and conduct simulations of operational scenarios to support Department of Defense (DoD) analysis of the behaviors of PNT devices and the effects these sensors have on the capabilities of United States (U.S.) forces, especially under GPS challenged conditions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Mission Command Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes software to enable a uniform MC capability and experience for the commander in the command post, on the move in vehicles, or dismounted, increases the situational awareness through software data architectures and algorithms that intelligently share data across low bandwidth networks and across dismounted, mounted and command post platforms, and improves decision making capacity across the battlefield by using software knowledge representation to model mission, enabling artificial intelligence techniques to use the model to automate staff tasks, correlate and analyze information and provide recommendations.  Work being accomplished under PE 0603772A\/Project 101 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.658"
                                            },
                                            "Text": {
                                                "val": "Designed and validated an infrastructure and software architecture that permits a single source code base to deploy MC applications across different platforms in the command post, mounted and dismounted environments; investigated a virtual staff capability to supply staff-like functionality to the commander; matured software that enables small unit commander-centric operations by helping the commander to drive the operations process and assist in unit to unit and cross coalition interaction; investigated how to include human factors engineering early into MC software designs in order to simplify user interactions with the software and reduce cognitive load on the Soldiers; designed software to perform MC of teams of humans and multiple autonomous systems to augment unit effectiveness and unburden Soldiers by eliminating multiple complex interfaces with the autonomous systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.754"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop software that will help the commander and staff define what MC tasks must be performed in order to insure mission success, help to optimally assign those tasks to resources such as Soldiers, track how the tasks are being completed, and support any needed adjustments to the mission tasks; develop software to display what is known about enemy actions in easy to understand ways and show how those actions will impact the current mission; develop software to process the needed mission tasks and enemy actions and generate recommendations suggesting courses of action that were successful in similar circumstances in the past; develop software that will help the commander and staff to interoperate more effectively by enabling the commander to easily make and track staff assignments and to quickly access staff reports, estimates, and recommendations regardless of the commanders physical location; continue to investigate how to determine which mission tasks can be given to unmanned systems (robots) to execute; investigate technologies to limit needed human involvement in unmanned system task execution; develop software to help planners to integrate multiple and different types of unmanned systems into a team with shared tasks in order to achieve mission success."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.524"
                                            },
                                            "Text": {
                                                "val": "Will further research in the second of a three year effort to develop a software model that is a knowledge representation of a mission to enable automation of tasks such as developing course of action and staff assignment recommendations; research and develop a framework with standard interfaces that allows externally developed software to communicate with the mission model and leverage the data to perform real time analytics such as continuous power predictions for the mission; research and refine business process modeling technologies to assist users with dynamic and reusable workflows that align with the military decision making process or a unit’s standard operating procedures; and complete research and investigation of several artificial intelligence techniques including machine learning and intelligent agents that will be down selected and implemented in Fiscal Year (FY) 2019 and FY 2020 to assess the mission objectives and current situation to help with situational understanding by providing visualizations of how the situation is deviating from intent with continuous running estimates and an on-going analysis of risks and opportunities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H92"
                    },
                    "ProjectTitle": {
                        "val": "Communications Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.559"
                        },
                        "CurrentYear": {
                            "val": "21.359"
                        },
                        "BudgetYearOne": {
                            "val": "20.286"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.286"
                        },
                        "BudgetYearTwo": {
                            "val": "24.650"
                        },
                        "BudgetYearThree": {
                            "val": "23.104"
                        },
                        "BudgetYearFour": {
                            "val": "23.051"
                        },
                        "BudgetYearFive": {
                            "val": "21.999"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and applies advanced communications and network devices, software, algorithms and services by leveraging and adapting commercial research and new communications and network sciences work by the Army Research Lab, Network Science Collaborative Technology Alliance or other Basic Research efforts. This Project leverages developments in wireless transport (e.g. mobile radio based communications systems) to design new techniques for improving communications in high radio frequency (RF) interference environments, such as in the presence of electronic warfare (EW), and to increase the communications capacity of terrestrial and satellite communications (SATCOM) systems. This Project also investigates antenna components, materials, designs and configurations to reduce the visual signature of antennas on Soldier, vehicular and airborne platforms and to reduce co-site interference on platforms with multiple transceivers, such as radios and jammers. Additionally, this Project investigates cyber electromagnetic activities (CEMA), cyber security devices, software and techniques to harden wireless communications networks against cyber attacks and new mobile networking protocols to make wireless, on-the-move (OTM) communications networks more responsive to user needs. This Project also investigates software and techniques that improve the ability of the Soldier to manage and maintain complex, dynamic networks; and it design and develops spectrum management software tools to make more efficient use of the congested RF spectrum. This Project also provides new capabilities to lower the size, weight, power and cost of networking systems deployed on Army platforms.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the Army Research, Development, and Engineering Command (RDECOM), Communications-Electronics Research, Development, and Engineering Center (CERDEC), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Antenna and Hardware Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates low cost, power efficient, conformal and directional antenna technologies for terrestrial, airborne, and tactical SATCOM ground terminals to enable them to operate OTM over multiple frequency bands, and itfurther investigates armor embedded antenna and distributed array technologies. Together these efforts will improve ground forces electronic protection, increase signal power and range and provide greater connectivity for both mounted and dismounted forces. Work being accomplished under Program Element (PE) 0602270A\/project 906, PE 0603270A\/project K15 and PE 0603794A\/Project EL4 complements this effort.  In Fiscal Year (FY) 18 a majority of these efforts, along with several efforts currently under Future Communications and Networking Technologies, will be reported under a new thrust, entitled “Networking to Improve Maneuver and Expeditionary Operations”, in order to better focus efforts in related and evolving technologies.  A few of the efforts herein will be reported in another new thrust area entitled “Uninterrupted Communications”."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.568"
                                            },
                                            "Text": {
                                                "val": "Completed and demonstrated in a lab environment a smart switch for distributed antenna arrays enabling higher output power, interoperability and improved link connectivity for SATCOM; completed and demonstrated in a lab environment antennas and antenna arrays that provide improved communications performance and reliability through electronic warfare (EW) jammed environments; and designed and developed a government standard architecture to provide standard form-fit and electronic interfaces for distributed terrestrial antenna systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.425"
                                            },
                                            "Text": {
                                                "val": "Will finalize a Government standard architecture to provide standard form-fit and electronic interfaces for distributed terrestrial antenna systems for ground vehicle and command post application; explore architecture approaches and potential benefits of upgrading conventional analog intermediate frequency (IF)-based SATCOM terminal designs to digital IF systems for enhanced flexibility and performance, reduced footprint and cost and improvement of features such as monitoring, alarms and built in test capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networking to Improve Maneuver and Expeditionary Operations"
                                    },
                                    "Description": {
                                        "val": "This effort formulates new capabilities to provide a range of robust, reliable, scalable, interoperable and resource efficient communications capabilities to expeditionary forces on the move. These capabilities allow forces to conduct early entry operations, develop situational understanding, and sustain operations while maintaining freedom of movement.  Starting in FY18 the “Antenna and Hardware Technologies” and “Future Communications and Networking Technologies” efforts are reorganized into this new thrust area and the new “Uninterrupted Communications” thrust area."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Will research, brassboard, and conduct laboratory experiments on new short range wireless transmission technologies to improve performance and robustness of secure wireless personal area networks for on-Soldier sensors and ancillary devices; conduct studies, simulations, laboratory experiments and provide incremental enhancements to commercial wireless technologies, such as cellular Long Term Evolution (LTE), to adapt them for use in the tactical environment as a low cost and rapidly adaptive capability to the warfighter; conduct research, simulations and lab experiments for  next generation terrestrial and SATCOM radios and code waveform protocols to conduct reliable communications in austere environments; conduct analysis, simulations and lab experiments to design and code networking protocols for network relays to be carried by autonomous systems and to optimize networking capabilities rsulting from autonomous maneuvering of these relays on the battlefield; and conduct research, simulations and lab experiments to minimize the burden of network configurations and to visualize, gather information from and control all networked devices in the battlefield."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Information Assurance (IA) and Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, codes and fabricates software, algorithms and devices to protect wireless tactical networks against computer network attacks. Effort includes technologies that are proactive rather than reactive in countering attacks against tactical military networks. Work being accomplished 0603794A\/Project EL5 complements this effort, and is fully coordinated with the Army Research Lab Cyber Security Collaborative Research Alliance, PE 0601104A\/Project EA6. In FY18 these efforts will be organized under a Cyber Electromagnetic Activity (CEMA) thrust area entitled “Cyber \/CEMA Operations” in order to better focus related and evolving technology developments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.442"
                                            },
                                            "Text": {
                                                "val": "Designed and coded software that employs techniques for data sharing and collaboration between offensive and defensive operations and across security boundaries to enable advanced warning and response actions; designed and coded a software based encryptor that meets National Security Agency (NSA) formal requirements to eliminate the need for physical encryption devices; matured design of security for network protocols; researched, designed and developed algorithms to identify, protect, and prevent insider threat, negligence and-or malicious actions; researched and designed software tools and a framework for independent software assessments to easily and quickly identify vulnerabilities during development and integration with third party software to detect potential vulnerabilities well prior to the software being used on Army networks; researched, designed and coded software that incorporates cyber risk assessment, threat detection, cyber response agility and psycho-social behavior prediction to improve network security; and designed and developed an NSA Type 1 reprogrammable logic single chip cyptographic engine which includes anti-tamper and security boundary technology (both information security functions) and cryptographic engine within the chip design, emphasis was to develop a capability that can be reused, scaled, and-or repackaged to satisfy the particular constraints of different platform developments (e.g., hand held devices, unmanned sensors, satellite systems, key load devices, etc.) without significant redevelopment and recertification efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.180"
                                            },
                                            "Text": {
                                                "val": "Will design models and algorithms in support of computer network defense and counter attack models; design software to address cyber risk detection, agility and human psychosocial elements as they relate to cyber defense; design, develop and validate new defensive cyber metrics; run defensive cyber operation experiments to assess tactical applicability of new cyber theories\/models; make determinations on how new validated cyber theories impact other on-going cyber research and how those programs should shift their technical implementations to incorporate these theories; design a robust software solution to identify, prevent and protect role-based tactical systems from insider threats and malicious behaviors and\/or negligence; design experiments for detection of insider threats based on biometric identification; identify tactical environmental roles to compare, group and generalize roles, identify system critical points and variables as part of a behavioral study, coordinate and collaborate with the Program Executive Offices (PEOs) and Program Managers (PMs) to gather necessary information on roles in the tactical environment; identify operational cases and insider threat scenarios, calculate risks and effects for each case type to identify solutions from commercial and government off the shelf or develop new solutions; design software and algorithms comprised of user behavioral components to identify and prevent insider, adversary and negligent action threats in existing tactical systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communications Security"
                                    },
                                    "Description": {
                                        "val": "This effort researches technologies to improve the security posture of wired and wireless communications components, software and algorithms. Work being accomplished under 0603794A\/ Project EL5 complements this effort. In FY18 these efforts will be organized under a new thrust area entitled “Cyber \/CEMA Operations” in order to better focus related and evolving technology developments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.866"
                                            },
                                            "Text": {
                                                "val": "Will design an advanced processing technique to reduce interference in SATCOM waveforms; design a means to monitor spectrum for wideband SATCOM and design and document situational awareness parameters, protection through diversity and interference mitigation for Army tactical SATCOM Networks; perform a detailed study to analyze wideband SATCOM interference suppression for both enterprise applications utilizing digital IF and tactical multi-frequency, time division multiple access waveform applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber\/CEMA Operations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and applies robust cyber security techniques and applications to advanced communications and networking devices, software, algorithms and protocols utilized within wireless tactical networks to protect against nation state level cyber effects and maintain Warfighter confidence in network information, resources, identities and mission partners by hardening the blue force attack surface. These capabilities will harden the attack surface by ensuring trustworthy software (SW), hardware (HW), information systems, communications and networks.  This effort affords resilience within our networks to autonomically ‘fight through’ and\/or evade hostile cyber effects and provide situational awareness (SA) and situational understanding (SU) to enable effective mission planning and execution. Work being accomplished under 0603794A\/Project EL5 complements this effort, and this effort is fully coordinated with the Army Research Lab Cyber Security Collaborative Research Alliance, PE 0601104A\/Project EA6. Starting in FY18 efforts under “Tactical IA and Cyber Defense” and “Communications Security” are consolidated into this effort."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.596"
                                            },
                                            "Text": {
                                                "val": "Will research and design cyber security technologies to improve SA and SU of cyber threat correlated to mission impact across CEMA elements to enable actionable decisions, and enable self-defending qualities within Army networks that can absorb, deflect, evade, and deceive adverasrial cyber actions; research and conduct experiments on robust wearble 2 factor (i.e., token plus personal identification number) identity and network access capabilities to improve identity verification and authentication processes; research and develop anomalous behavior and insider threat detection techniques to apply to tactical radio waveforms to improve communications security against cyber threats; research and experiment with mechanisms to track data flows, monitor data modification, and ensure trusted pedigree of the information flowing across tactical networks; develop models and algorithms to reason on cyber adversary intent and predict next action; research and code intelligent algortims to efficiently pin point potentially exploitable areas within software; design and code models and techniques utilizing a software defined networking architecture to improve tactical network resilience; design and code spectrum awareness models and algorithms to detect denied spectrum conditions from jamming or other interference; and design a security architecture that supports convergence across the intelligence, network operations, cyber, electronic warfare, Fires, and information operations functions within a tactical Command Post."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Collaborative Research Alliance  (CRA)"
                                    },
                                    "Description": {
                                        "val": "This effort will take innovative basic research theories from the Cyber CRA and experimentally validate the hypothesis and create proof-of-concept defensive cyber software implementations. This effort is fully coordinated with the Army Research Lab Cyber Security Collaborative Research Alliance, PE 0601104A\/Project EA6."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.916"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.916"
                                            },
                                            "Text": {
                                                "val": "Will validate new defensive cyber theories in stealthy virtual machine migration, advanced persistent threat detection,  malware communication detection, port scanning attack detection, and evidence collection for cyber-attacks; design models and algorithms in support of computer network defense and counter attack technologies; develop software to address cyber risk, detection, agility, and human psychosocial elements as they relate to cyber defense; develop and validate new defensive cyber metrics; run defensive cyber operation experiments to assess tactical applicability of new cyber theories\/models; make determinations on how new validated cyber theories impact other on-going cyber research and how those programs should shift their technical implementations; and mature cyber theories into software capabilities that can transition into ongoing and future Cyber\/CEMA Operations programs of record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Communications and Networking Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and fabricates components and codes software for radios and network management systems to enable access to spectrum that is unavailable because of current inefficient spectrum management methods. This includes new management and visualization modalities as well as improved RF modulation techniques, devices and software. This effort investigates technologies for networking protocol development as well as networking technologies for routing and disruption tolerant networks. This effort also investigates RF signal processing, signal transmission and codes software to detect and overcome the interference of SATCOM due to jamming or atmospheric conditions. Work being accomplished under 0603794A\/ Project EL4 complements this effort. In FY18 a majority of these efforts, along with several efforts currently under Antenna and Hardware Technologies, are organized under a thrust entitled “Uninterrupted Communications” in order to better focus related and evolving technology developments. A few of the efforts herein will migrate to a new companion thrust entitled “Networking to Improve Maneuver and Expeditionary Operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.549"
                                            },
                                            "Text": {
                                                "val": "Continued to develop and mature network and physical layer models for tactical networking waveforms to overcome RF interference; developed digital signal processing and adaptive interference cancellation algorithms to enable efficient utilization of spectrum; investigated and matured a waveform architecture to define interfaces between the various RF, networking and signal processing components; developed directional networking and disruption tolerant networks to protect the network from electronic warfare systems while using spectrum efficiently; continued to perform modeling, simulation and emulation of networks to assess network performance to quantify the efficacy of the various techniques being developed to improve the network capacity and robustness; developed network protocols for operations in contested electromagnetic environment using techniques such as interference cancellation, multifunction waveform and coordinated scheduling algorithms for electronic protection optimization; developed software defined networks for tactical applications; matured and began implementation of feasible architectures and technologies for increasing tactical network capacity and performance in a dynamic spectrum environment; developed the framework for an adaptive media access code physical layer to evolve the tactical network while improving capacity; developed resilient core and routing protocols to increase performance of the tactical network; began development of protocols to support mission and user-aware routing and content based networking; began development of networking frameworks and network abstraction layer for interoperable end to end voice over internet protocol; researched feasible approaches to enable networking in Global Positioning System denied environment; and developed security framework by investigating multi layer security routing and conduct high assurance internet protocol encryptor bypass study."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.888"
                                            },
                                            "Text": {
                                                "val": "Will develop spectrum efficient multifunctional waveforms that enable coordination of multiple command, control, communications, computing, intelligence surveillance and reconnaissance (C4ISR)\/EW RF functions without cosite interference within a common RF converged chassis; mature common scheduling techniques to optimize electronic protection for tactical communication systems; implement digital RF interference cancellation algorithms for laboratory assessment; mature disruption tolerant network algorithms to make wireless networks more resilient against EW jamming while using spectrum efficiently; design and mature algorithms for forecasting and detecting anomalous network events (such as jamming, interference, congestion, network partitions) to improve network performance in a spectrum congested environment; develop a methodology to evaluate constrained application protocol management software interface to improve network management capability; design terrestrial communications waveform concept for a frequency-agile system that will support flexible resource allocation and noncontiguous channels to enable coexistence of terrestrial, SATCOM and other communications systems in congested spectrum; design standards, software, management protocols and data models for coordinated management of EW and Communications; mature end-to-end standard based combat voice architecture that is spectrum efficient and easy to set up and maintain; mature disruption tolerant network transport service that can provide robustness against disruptions and reliable delivery of critical data over Army tactical radio based networks; mature routing protocols and supporting framework that is mission- and user-aware to provide data delivery most efficiently in a multi-waveform environment; mature routing algorithms that support multiple network routes by coordinating multiple routing protocols for network transactions; mature software defined networking (SDN) architecture for the Army tactical edge networks and mature SDN waveforms that will identify and mitigate network vulnerabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Uninterrupted Communications"
                                    },
                                    "Description": {
                                        "val": "This effort designs and matures components, software and algorithms that enable Army tactical wireless networks to provide assured uninterrupted access to critical communications and information links so that they operate more robustly in congested, contested and competitive electromagnetic environments. These capabilities will result in robust, reliable and secure terrestrial and SATCOM networks with greater survivability in austere, congested and hostile electromagnetic environments while ensuring that the capabilities are interoperable and resource efficient and will allow forces to develop SU and conduct operations to support mission command networks even under adverse operational conditions. Work accomplished under PE 0603794A\/Project EL4 complements this effort.  Starting in FY18 the Future Communications and Networking Technologies and Antenna and Hardware Technologies efforts are reorganized and split into this new thrust area and the new Networking to Improve Maneuver and Expeditionary Operations thrust area."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.266"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies, simulations and laboratory experiments to mature low-cost integrated directional networking (DN) capability to enable operation in Global Positioning System (GPS)-denied environments; construct DN algorithms to implement adaptive antenna nulling techniques to direct emissions only in the desired direction for robust and undetectable communications while maintaining a robust tactical networking capability; conduct studies, simulations and laboratory experiments to develop efficient techniques to maintain capacity across multiple networks while providing low probability of interception (LPI) and  low probability of detection (LPD) capability for individual users; and leverage techniques resulting from earlier efforts to make blue force EW and communications more interoperable and provide spectrum SA in real time to develop techniques for improved LPI\/LPD while maintaining robust tactical communications."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}