{
    "id": "2018-AirForce-PB-3600-JBOOK-857e7c42b5cd67f362a388822cdc6c6374be2f224d8defe4fb4e7b5bd4bdcb7c-7",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602204F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Sensors"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "151.264"
            },
            "CurrentYear": {
                "val": "155.174"
            },
            "BudgetYearOne": {
                "val": "152.782"
            },
            "BudgetYearOneBase": {
                "val": "152.782"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "151.000"
            },
            "BudgetYearThree": {
                "val": "156.290"
            },
            "BudgetYearFour": {
                "val": "159.190"
            },
            "BudgetYearFive": {
                "val": "165.280"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops the technology base for Air Force aerospace sensors and electronic combat.  Advances in aerospace sensors are required to increase combat effectiveness by providing anytime, anywhere surveillance, reconnaissance, precision targeting, and electronic warfare capabilities.  To achieve this progress, this program pursues simultaneous advances in:  1) generating, controlling, receiving, and processing electronic and photonic signals for radio frequency (RF) sensor aerospace applications; 2) electro-optical (EO) and infrared (IR) aerospace sensor technologies for a variety of offensive and defensive uses; 3) RF antennas and associated electronics for airborne and space surveillance, together with active and passive EO\/IR sensors; 4) technologies to manage and fuse on-board sensor information for timely, comprehensive situational awareness;  5) technology for affordable, trusted, and reliable, all-weather surveillance, reconnaissance, and precision strike RF sensors and electronic combat systems; and 6) technologies that aid in the discovery and mitigation of cyber vulnerabilities in avionics systems.  This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.  \n\nStarting in FY 2017 to improve reporting to Congress, Project 622005, Cyber Technology was created to capture all cyber activity that was previously performed in this program.\n\nIn FY 2018, a portion of HQ AFRL S&T civilian manpower in PE 0602204F, Aerospace Sensors, was transferred to PE 0602298F, Science and Technology Management - Major Headquarters Activities, to provide increased transparency to Congress on personnel in Major Headquarters Activities (MHA).\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their technology performance parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "152.175"
                },
                "CurrentYear": {
                    "val": "155.174"
                },
                "BudgetYearOne": {
                    "val": "162.992"
                },
                "BudgetYearOneBase": {
                    "val": "162.992"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "151.264"
                },
                "CurrentYear": {
                    "val": "155.174"
                },
                "BudgetYearOne": {
                    "val": "152.782"
                },
                "BudgetYearOneBase": {
                    "val": "152.782"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.911"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-10.210"
                },
                "BudgetYearOneBase": {
                    "val": "-10.210"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.565"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.476"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-10.210"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-10.210"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2018 is due to realignment for autonomy and laser weapons systems priorities and transfer of some HQ AFRL civilian manpower to PE\n0602298F, Science and Technology Management - Major Headquarters Activities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "622002"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Component Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "37.851"
                        },
                        "CurrentYear": {
                            "val": "41.326"
                        },
                        "BudgetYearOne": {
                            "val": "38.522"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.522"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "37.679"
                        },
                        "BudgetYearThree": {
                            "val": "39.576"
                        },
                        "BudgetYearFour": {
                            "val": "40.557"
                        },
                        "BudgetYearFive": {
                            "val": "41.479"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project focuses on the electronics and optoelectronics to generate, control, receive, and process electromagnetic spectrum for aerospace sensor and electronic warfare applications. The enabling technologies developed under this project will be used for intelligence, surveillance, reconnaissance (ISR), electronic warfare, battlespace access, and precision engagement capabilities. The technologies developed include exploratory electronic and optoelectronic device concepts; solid state power devices and amplifiers; low noise and signal control components; photonic components; high-temperature electronics; signal control and distribution; signal processing; multi-function monolithic integrated circuits; high-speed analog-to-digital and digital-to- analog mixed mode integrated circuits; reconfigurable electronics; power distribution; multi-chip modules; and high density packaging and interconnect technologies.  This project also designs, develops, fabricates, and evaluates techniques for integrating combinations of these component technologies. The project aims to demonstrate significantly smaller size, lower weight, lower cost, lower power dissipation, higher reliability, trustworthiness and improved performance. The device and subsystem technology developments under this project are military unique; they are based on Air Force and other Department of Defense weapon systems requirements in the areas of radar, communications, electronic warfare, navigation, and smart weapons."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multifunction Sensor Subsystems"
                                    },
                                    "Description": {
                                        "val": "Develop, analyze, demonstrate, and perform engineering trade studies for technologies for compact, affordable, multi-function microsystems and subsystems for aerospace sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.130"
                                            },
                                            "Text": {
                                                "val": "Completed baseline and advanced microsystem and subsystem models for use in trade space simulations. Initiated prototype multi-function microsystem and subsystem demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.961"
                                            },
                                            "Text": {
                                                "val": "Continue microsystem and subsystem simulations to quantify performance versus cost, size, weight, power, trusts trades. Continue to develop and optimize multi-function prototypes. Refine fidelity of models for multifunction subsystem concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.284"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.284"
                                            },
                                            "Text": {
                                                "val": "Complete first demonstration of affordable, miniature multifunction prototype. Continue to refine models and simulations through updated technology and microsystem\/subsystem performance and cost models. Initiate development of microsystem\/subsystem prototypes for attritable platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Microelectronic\/Optoelectronic Technologies"
                                    },
                                    "Description": {
                                        "val": "Assess, mature and demonstrate advanced electronic and optoelectronic material, device and fabrication technologies for next generation imaging, precision strike, and battlespace access across all Air Force domains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.043"
                                            },
                                            "Text": {
                                                "val": "Identified and evaluated several innovative concepts for generation-after-next, compact, high performance devices and circuits and microsystems. Demonstrated prototype of a highly integrated microsystem. Refined tools and methods to design, build and analyze game changing component technologies. Initiated evaluation of emerging component technologies against device concept baseline for multi-use applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.987"
                                            },
                                            "Text": {
                                                "val": "Continue to refine tools and methods to design, build, and analyze game changing component technologies. Continue evaluation of emerging component technologies against device concept baseline for multi-use applications. Initiate exploration and identification of emerging device concepts exploiting breakthrough materials discovery."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.242"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.242"
                                            },
                                            "Text": {
                                                "val": "Continue to refine tools and methods to design, build, and analyze game changing component technologies. Continue evaluation of emerging component technologies against device concept baseline for multi-use applications. Initiate development of prototype from identified emerging device concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Apertures (was Antennas)"
                                    },
                                    "Description": {
                                        "val": "Design and develop aperture subsystems and components for airborne and space-based surveillance. Develop novel and advanced optoelectronic and infrared technologies for volume, power and cost-constrained platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.363"
                                            },
                                            "Text": {
                                                "val": "Continued development and demonstrations of multi-wavelength, agile and affordable advanced detectors and arrays. Explored and evaluated innovative devices and microsystems for increased multi-wavelength and tunability. Completed characterization and evaluation of novel high-brightness and agile waveform source."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.851"
                                            },
                                            "Text": {
                                                "val": "Continue to explore and evaluate innovative materials and devices for tunability, increased bandwidth and multi-wavelength operation. Continue demonstration of current advanced multi-wavelength, agile and affordable advanced detector and array. Initiate gimbal-less beamsteering prototype."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.454"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.454"
                                            },
                                            "Text": {
                                                "val": "Complete gimbal-less beamsteering prototype. Continue to explore and evaluate innovative materials and devices for tunability, increased bandwidth and multi-wavelength operation. Initiate compact, tunable, laser source prototype."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Systems for ISR and Avionics Systems"
                                    },
                                    "Description": {
                                        "val": "Investigate and develop designs of trusted electronic and optoelectronic systems when integrating commercially available solutions (commercial-off-the-shelf (COTS)) with emerging government-off-the-shelf (GOTS) advanced technologies. Areas of development include: multi-function RF and EO subsystems, advanced electronic and optoelectronic materials, on-board sensor processing, high-frequency power modules, EO\/Infrared (IR) sources, EO\/IR detectors, beam control and waveguides, and trusted and reliable electronics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.128"
                                            },
                                            "Text": {
                                                "val": "Demonstrated preliminary verification and validation tool for integrity and reliability of electronics and integrated circuits. Initiated vulnerability model and simulation capability to assess cost and liability of trust in electronics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.686"
                                            },
                                            "Text": {
                                                "val": "Continue modeling and simulation architecture development to inform and predict system assurance for highly integrated microsystems, devices and materials. Demonstrate current ability to determine trust in design and trust in fabrication of highly integrated microsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.232"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.232"
                                            },
                                            "Text": {
                                                "val": "Continue to refine demonstration of trust in design and trust in fabrication. Continue modeling and simulation architecture development to inform and predict mission assurance for highly integrated microsystems, devices and materials. Initiate development of prototype trustworthiness assessment capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Components for Electronic Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop, mature, and demonstrate critical electronic technologies to enable revolutionary electronic warfare subsytems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.187"
                                            },
                                            "Text": {
                                                "val": "Demonstrated cutting edge electronics technologies for reconfigurable and agile RF front ends. Initiated highly reconfigurable microsystem prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.841"
                                            },
                                            "Text": {
                                                "val": "Continue development of highly reconfigurable microsystem prototype. Initiate reconfigurable and agile RF front end prototype. Initiate investigation and demonstration of integrated photonic circuits."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.310"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.310"
                                            },
                                            "Text": {
                                                "val": "Complete reconfigurable and agile RF front end prototype. Continue development of highly reconfigurable microsystem prototype. Continue investigation and development of integrated photonic circuit prototype."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622003"
                    },
                    "ProjectTitle": {
                        "val": "EO Sensors & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.169"
                        },
                        "CurrentYear": {
                            "val": "21.535"
                        },
                        "BudgetYearOne": {
                            "val": "24.473"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.473"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "24.901"
                        },
                        "BudgetYearThree": {
                            "val": "26.989"
                        },
                        "BudgetYearFour": {
                            "val": "27.509"
                        },
                        "BudgetYearFive": {
                            "val": "28.050"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project determines the technical feasibility of advanced electro-optical (EO) aerospace sensor technologies for a variety of offensive and defensive uses.  The sensor technologies under development range from the ultraviolet (UV) through the infrared (IR) portion of the spectrum.  Related efforts include improvements in avionics integration, digital processing, analysis tools, and sensor architectures.  One of the project's main goals is to improve EO and related technologies for the detection, tracking, and identification of non-cooperative and difficult targets, such as those obscured by camouflage.  This project also develops the passive and active imaging sensors and algorithms needed to enable precision targeting in severe weather. These technologies are critical to future aerospace surveillance and targeting.  Other project goals include advanced EO threat warning and countermeasures."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Passive EO\/IR Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "Develop innovative passive optical sensing technology to support surveillance and reconnaissance in contested environments. Develop high performance focal planes, aperture technologies, sensing architectures, and imaging techniques capable of long range target detection and characterization for ISR and air-to-air sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.038"
                                            },
                                            "Text": {
                                                "val": "Evaluated, via modeling and simulation, innovative sensor concepts to increase long range image quality for high altitude passive EO and IR reconnaissance sensors. Investigated system-level impacts of image restoration technology (hardware and software) using a commercial reconnaissance sensor and platform. Completed prototyping of a flexible, next generation long wave infrared hyperspectral imaging spectrometer. Completed evaluations of prototype Silicon-Gallium (SiGa) long wave infrared detectors at high operating temperatures. Completed investigation of high performance long wave infrared detectors for hyperspectral imaging. Study of computational image restoration and noise reduction continues. Continue to refine and demonstrate candidate component technologies for jitter mitigation and restoration in the presence of deep turbulence.  Initiated technology developments for next generation infrared search and track (IRST) components and systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.178"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate, via modeling and simulation, innovative sensor concepts to increase long range image quality for high altitude passive EO and IR reconnaissance sensors. Conduct laboratory test of prototype systems and subsystems as appropriate to assess progress towards goals. Continue advance demonstrations of the effectiveness of computational image restoration and noise reduction. Refin and demonstrated candidate component (hardware and software) technologies for jitter mitigation and restoration in the presence of deep turbulence. Demonstrate and test system-level impacts of image restoration technology using a relevant reconnaissance sensor and commercial platform. Continue the examination of non-traditional sensor architectures in improving image quality and the operational range of passive imagers. Continue technology and architecture developments for next generation IRST components and systems. Improve passive sensing models to support IRST technology trade analyses. Initiate assessment of technology options for hyperspectral imaging on small uninhabited aerial systems (UAS) for Air Force relevant missions. Initiate systems engineering strategy to examine cross domain EO sensing for Air Force relevant missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.157"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.157"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate, via component and subsystem laboratory testing, innovative sensor concepts to increase long range image quality for high altitude passive EO and IR reconnaissance sensors. Continue and advance demonstrations of the effectiveness of computational image restoration and noise reduction. Assess non-traditional sensor architectures for improving image quality and the operational range of passive imagers for potential prototyping and laboratory test. Demonstrate technologies and components supporting longwave infrared hyperspectral imaging. Select promising technology options for hyperspectral imaging on small uninhabited aerial systems (UAS) and advance their technology readiness level.  Continue next generation IRST architecture and component development to improve system performance in clutter. Test these component prototypes in a laboratory environment.  Improve passive sensing models to support IRST technology trade analyses. Examine potential new capabilities resulting from a systems engineering strategy on cross domain EO sensing for Air Force relevant missions.  Initiate incorporation of sensor-specific modeling and simulation results into larger engagement level and campaign level simulations to explore new concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Radar Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "Develop innovative laser sensing technology for non-cooperative identification of airborne and ground-based targets in contested environments. Develop optical spectrum transmitters, detectors and agile aperture technologies capable of sensing multiple target characteristics for robust non-cooperative target identification and future infrared countermeasure systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.131"
                                            },
                                            "Text": {
                                                "val": "Achieved synthetic aperture ladar (SAL) subsystem performance goal critical to meeting system level performance requirements. Increased emphasis on applications for long range air-to-air ladar updating modeling and simulation, phenomenology measurement capabilities and to support utility analysis and system design and evaluations. Conducted laboratory testing of initial foundry runs of focal planes optimized for three dimensional and holographic imaging. Designed next generation long range holographic aperture ladar imaging testbed focused on progression to platform compatible configurations. Tested prototype hardware for laser vibrometry and range-Doppler sensing technology to aid in target identification and decoy discrimination. Continued research in supporting phenomenology understanding, signature collection, sensor product visualization, and automatic target recognition. Continued development of SAL techniques based on modeling and simulation previously conducted to enhance spatial resolution beyond the diffraction limit of the available aperture. Researched parameters necessary for improving system capabilities to provide high confidence target identification at standoff ranges for both reconnaissance and targeting platforms. Continued fabrication and characterization of critical components for a long range SAL demonstration system. Initiated assessment of technology options for ladar-based 3D imaging on small uninhabited aerial systems (UAS) for Air Force relevant missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.357"
                                            },
                                            "Text": {
                                                "val": "Complete fabrication and characterization of critical components for a long range SAL demonstration system. Complete laboratory testing of initial foundry runs of focal planes optimized for holographic imaging. Continued research in the use of remote laser vibrometry and range-Doppler sensing technology to aid in target identification. Continue research on technologies, architectures, and components needed for improving system capabilities to provide high confidence target. Advance development of SAL techniques to enhance spatial resolution beyond the diffraction limit of conventional optics. Design, fabricate, test, and explor limitations of next-generation long-range holographic aperture ladar imaging testbed focused on progression to platform compatible configurations. Test integrated direct detection ladar prototype and advance its technology readiness level. Increase emphasis on applications for long range air-to-air ladar updating modeling and simulation, phenomenology measurement capabilities and to support utility analysis and system design and evaluations. Initiate assessment of technology options for ladar-based 3D imaging on small uninhabited aerial systems (UAS) for Air Force relevant missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.316"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.316"
                                            },
                                            "Text": {
                                                "val": "Complete testing of next generation long range holographic aperture ladar imaging testbed focused on progression to platform compatible configurations. Complete laboratory testing of initial foundry runs of focal planes optimized for holographic imaging. Continue research on components needed for improving SAL system capabilities to provide target identification at standoff. Test in laboratory integrated direct detection ladar prototype and advance its technology readiness level. Conduct laboratory tests of candidate SAL techniques for enhancing spatial resolution beyond the diffraction limit of conventional optics in a laboratory environment. Conduct laboratory tests of prototype remote laser vibrometry and range-Doppler sensing technology to aid in target identification. Initiate investigation of advanced system architectures and evaluate candidates. This additional emphasis will involve both direction and synthetic aperture ladar approaches. Continue assessment of technology options for ladar-based 3D imaging on small uninhabited aerial systems (UAS) for Air Force relevant missions.  \n\nExplore concepts for multi-function systems which also support electro-optical threat warning and countermeasures functions.  Execute applied research to investigate technologies for improved sensor systems for integration with high-average power laser sources for proactive detection and defeat of EO threats such as search\/track sensors, night vision devices, thermal cameras, missile seekers and other adjunct sensors for integrated air defense systems.  Investigate technologies for cost, size, weight and power (C-SWaP) reduced multi-function systems for unmanned platforms and SWAP constrained platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "622005"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "10.200"
                        },
                        "BudgetYearOne": {
                            "val": "6.428"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.428"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.516"
                        },
                        "BudgetYearThree": {
                            "val": "6.620"
                        },
                        "BudgetYearFour": {
                            "val": "6.735"
                        },
                        "BudgetYearFive": {
                            "val": "6.866"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project 622005, Cyber Technology was new in FY 2017. Work from this effort was previously performed under Project 627622, RF Sensors and Countermeasures Tech, in this program.\n\nThe goal of this activity is twofold.  First, this effort is designed to advance our understanding of avionics cyber vulnerabilities by investigating the fundamental nature of avionics vulnerabilities including: how they come about, how they can be discovered, how they can be quantified and categorized, how they can be exploited, and how they can be removed\/mitigated\/protected. Second, this effort aims to develop adaptable and resilient hardware\/software for real-time avionics cyber-attack pattern recognition and develop a protection system with the capability for autonomous learning, adaptation, and self-protection."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vulnerability Mitigation (was Malware Detection)"
                                    },
                                    "Description": {
                                        "val": "Apply knowledge from computer vulnerability discovery and computer security to investigate capabilities for identifying and mitigating vulnerabilities in U.S. avionics systems resulting from software and\/or hardware deficiencies.  Develop automated and cost effective processes, techniques and technologies to assist in the identification of potential vulnerabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.453"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort was performed in Project 627622, RF Sensors and Countermeasures Tech, under the effort RF Sensor Technologies.\n\nDevelop common classes\/groups of vulnerabilities and characterize advanced hardware (such as multi-core processors and intelligent I\/O interfaces), real time operating systems, and emerging open avionics standards. In parallel develop methods, techniques, and technical tools to enable, assist, and improve the efficiency of assessments and vulnerability discovery processes.  These tools and techniques will be developed to be applied to the assessment of avionics boxes, systems, busses, and components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.806"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.806"
                                            },
                                            "Text": {
                                                "val": "Based on the vulnerabilities discovered in FY17 effort and the characterized hardware: Investigate means to automate and make scalable vulnerability assessment tools and techniques.  Investigate systematic methodologies to achieve repeatable and reliable cyber test to expand our understanding of root causes of avionics vulnerabilities.  Investigate and apply our insights to evaluate feasibility of new capability concepts on next generation avionics architectures designed from a secure foundation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop avionics protection tools and capabilities to enable manned and unmanned aircraft avionics, and related support equipment to automatically adapt to and withstand cyber attacks.  Research and develop  tools, methodologies and architecture guidelines that enable the design of avionics systems with sense, learn and adapt capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.747"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, this work was performed in Project 627622, RF Sensors and Countermeasures Tech, under the effort RF Sensor Technologies.\n\nDevelop testbed to apply and evaluate protection tools and techniques.  Applied knowledge of existing x86 protections to avionics real time operating system (RTOS) environment.  Investigate applicability of existing x86 based protections to avionics. Leverage and enhance existing protection concepts for application in avionics environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.622"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.622"
                                            },
                                            "Text": {
                                                "val": "From knowledge gained in FY17 efforts on protection concepts for application will continue avionics protections research into real-time software\/hardware monitoring tools.  Apply these techniques to next-generation ISR and avionics system architectures to investigate avionics malware detection and response protection system."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "626095"
                    },
                    "ProjectTitle": {
                        "val": "Sensor Fusion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.726"
                        },
                        "CurrentYear": {
                            "val": "35.322"
                        },
                        "BudgetYearOne": {
                            "val": "32.370"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.370"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "32.205"
                        },
                        "BudgetYearThree": {
                            "val": "32.975"
                        },
                        "BudgetYearFour": {
                            "val": "33.566"
                        },
                        "BudgetYearFive": {
                            "val": "36.376"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops the technologies required to perform management and fusion of sensor information for timely, comprehensive situational awareness, automatic target recognition, integrated fire control, and bomb damage assessment.  This project determines the feasibility of technologies and concepts for fire control that help to precisely locate, identify, and target airborne and surface targets.  The project emphasizes finding reduced signature targets and targets of opportunity.  It will enable new covert tactics for successful air-to-air and air-to-surface strikes.  This project also develops the technologies required to create trusted autonomic, distributed, collaborative, and self-organizing sensor systems that provide anticipatory and ISR, situational awareness, and decision support for multi-layered sensing.  This program provides the technologies for:  1) trusted sensors and trusted sensor systems that will deter reverse engineering and exploitation of our critical hardware and software technology and impede unwanted technology transfer, alteration of system capability, and prevent the development of countermeasures to U.S. systems; 2) collaborative tasking of our own distributed heterogeneous sensor networks across a region and co-opted tasking of both traditional and non-traditional adversary sensors; 3) secure sensor web backbone technologies, sensor web physical topologies, and related protocols to assure reliable trusted sensor interactions; and 4) defining architectures for distributed trusted collaborative heterogeneous sensor systems and semantic sensor networks, developing new methodologies for system of systems sensor engineering and analysis, and new techniques for sensor network situation awareness and predictive analytics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Target Signature Modeling"
                                    },
                                    "Description": {
                                        "val": "Develop, evaluate, and demonstrate target signature models to support  sensor exploitation algorithm development and testing for reconnaissance and strike mission applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.726"
                                            },
                                            "Text": {
                                                "val": "Continued development of all-source target models for emerging threat systems in contested environments. Demonstrated maturing methods for validating all-source signature models. Continued maturing promising approaches to develop a single target model for application to all parts of the spectrum. Developed ground clutter modeling and reduced feature-set target signature prediction techniques for radio frequency sensors.  Initiated controlled data collections and high resolution feature database for emerging sensors.  Initiated implementation of advanced theoretical approaches to salient feature extraction from limited sensor data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.919"
                                            },
                                            "Text": {
                                                "val": "Continue development of all-source target models for emerging threat systems in contested environments. Continue to demonstrate maturing methods for validating all-source signature models. Continue efficient target modeling representation to enable more rapid model development and reduced database storage requirements. Continue maturing promising approaches to develop a single target model for application to all parts of the spectrum. Continued ground clutter modeling. Reduce feature-set target signature prediction techniques for radio frequency sensors. Continue controlled data collections and high resolution feature database for emerging sensors. Continue implementation of advanced theoretical approaches to salient feature extraction from limited sensor data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Continue development of all-source target models for emerging threat systems in contested environments. Demonstrate maturing methods for validating all-source signature models. Demonstrate ground clutter modeling and reduced feature-set target signature prediction techniques for radio frequency sensors. Continue controlled data collections and high resolution feature database for emerging sensors. Continue advanced theoretical approaches to salient feature extraction from limited sensor data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technical methods required for algorithm performance models, performance driven sensing, layered sensing and other sensing and exploitation technologies impacted by automated exploitation capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.682"
                                            },
                                            "Text": {
                                                "val": "Initiated analysis of sensor data where the transmitter and receiver are from distinct platforms or sensing devices.  Developed and assessed techniques for near real time extraction, representation, and analysis of multi-dimensional information from image sequences.  Continued development of novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments.  Continued to demonstrate application of sensor and algorithm performance models in Planning and Direction, Collection, Processing and Exploitation, Analysis and Production, Dissemination, Experimental Cell (PCPAD-X).  Continued to enhance development of an integrated, unified ATR methodology through industry and university outreach."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.504"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of sensor data where the transmitter and receiver are from distinct platforms or sensing devices. Develop and assessed techniques for near real time extraction, representation, and analysis of multi-dimensional information from image sequences. Continue development of novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments. Continue to enhance development of an integrated, unified ATR methodology through industry and university outreach. Finish application of sensor and algorithm performance models in PCPAD-X."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.877"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.877"
                                            },
                                            "Text": {
                                                "val": "Continue analysis of sensor data where the transmitter and receiver are from distinct platforms or sensing devices. Develop and assess techniques for near real time extraction, representation, and analysis of multi-dimensional information from image sequences. Continue development of novel techniques for analysis of large sensor data sets to discover, characterize, and identify threatening activities in contested environments. Demonstrate target classification techniques through deep learning methods and state of the art neural network methods. Develop embedded implementations of deep learning methods on small SWaP platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Management for ATR"
                                    },
                                    "Description": {
                                        "val": "Develop multi-platform and multi-sensor control strategies to create advantages for survival, autonomous sensing, and autonomous exploitation in contested environments. Incorporate sensing platform kinematics and external operating conditions into analyses of effective multi-sensor control and multiple intelligence (multi-INT) data fusion capabilities. Assess advantages of multi-sensor closed loop control techniques for platform survival, command and control, ISR, and strike missions. Enhance existing ATR sensor management, and sensor fusion technologies by application of multi-sensor data and distributed data processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.540"
                                            },
                                            "Text": {
                                                "val": "Explored multi-sensor inference and control approaches for autonomous operations. Developed metrics for assessing multi-sensor control techniques with regard to assured threat avoidance and optimal sensor positioning. Initiated size-weight-power-constrained processing assessment approaches for future platform on-board processing of multi-sensor data.   Defined and developed multi-sensor performance assessment approaches for inclusion in PCPAD-X."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.910"
                                            },
                                            "Text": {
                                                "val": "Demonstrate exploration of multi-sensor inference and control approaches for autonomous operations. Continue to develop metrics for assessing multi-sensor control techniques with regard to assured threat avoidance and optimal sensor positioning. Develope size-weight-power constrained processing assessment approaches for future platform on-board processing of multi-sensor data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.413"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.413"
                                            },
                                            "Text": {
                                                "val": "Continue exploration of multi-sensory inference and control approaches for autonomous operations. Continue use of metrics for assessing multi-sensor control techniques with regard to assured threat avoidance and optimal sensor positioning. Continue size-weight-power constrained processing assessment approaches for future platform on-board processing of multi-sensor data. Develop joint inference and control methods for challenging autonomous sensor operations management."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Sensing for ATR"
                                    },
                                    "Description": {
                                        "val": "Develop techniques and metrics for adaptive, penetrating, distributed RF exploitation in contested environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.778"
                                            },
                                            "Text": {
                                                "val": "Developed bi-static phenomenology models. Designed new waveforms to exploit bi-static RF phenomenology.  Developed a systems theory for incorporating identification uncertainty in ATR algorithms. Developed distributed exploitation algorithms. Designed a closed loop sensor mode controller for adaptive transmit and receive."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.989"
                                            },
                                            "Text": {
                                                "val": "Continue to develop bi-static phenomenology models. Continue to design new waveforms to exploit bi-static RF phenomenology. Continue to develop a systems theory for incorporating identification uncertainty in ATR algorithms. Continue to develop distributed exploitation algorithms. Continue to design a closed loop sensor mode controller for adaptive transmit and receive. Collect operationally relevant data for distributed sensing experimentation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.572"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.572"
                                            },
                                            "Text": {
                                                "val": "continue to develop bi-static phenomenology models. Demonstrate new waveforms to exploit bi-static RF phenomenology. Continue to develop a systems theory for incorporating ID uncertainty in ATR algorithms. Demonstrate distributed exploitation algorithms on prior data collections. Continue to design a closed-loop sensor mode controller for adaptive transmit and receive."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "627622"
                    },
                    "ProjectTitle": {
                        "val": "RF Sensors and Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.518"
                        },
                        "CurrentYear": {
                            "val": "46.791"
                        },
                        "BudgetYearOne": {
                            "val": "50.989"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.989"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "49.699"
                        },
                        "BudgetYearThree": {
                            "val": "50.130"
                        },
                        "BudgetYearFour": {
                            "val": "50.823"
                        },
                        "BudgetYearFive": {
                            "val": "52.509"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and assesses affordable, reliable all weather radio frequency (RF) sensing and countermeasure concepts for aerospace applications covering the range of RF sensors including communications, navigation, ISR, and radar, both active and passive, across the air, land, sea, space and cyber domains.  This project also develops and evaluates technology for ISR sensors, fire control radars, electronic warfare, integrated radar and electronic warfare systems, and offensive information operations systems.  It emphasizes the detection and tracking of surface and airborne targets with RF signatures that are difficult to detect due to reduced radar cross sections, concealment and camouflage measures, severe clutter, or heavy jamming.  Techniques exploited include the use of multiple RF phenomenologies, multi-dimensional adaptive processing, advanced waveforms and knowledge-aided processing techniques.  This project also develops the RF warning and countermeasure technology for advanced electronic warfare and information operations applications. Specifically, it develops techniques and technologies to detect and counter the communications links and sensors of threat air defense systems and hostile command and control networks.  The project also exploits emerging technologies and components to provide increased capability for offensive and defensive RF sensors, including radar warning, RF electronic warfare, and electronic intelligence applications."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5.000"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop hybrid sensor solutions to be responsive to needs and detect difficult targets. Develop resilient position, navigation, and time (PNT) sensors.  Explore PNT solutions to enable novel distributed RF sensing and countermeasure techniques."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.025"
                                            },
                                            "Text": {
                                                "val": "Developed technologies to ensure robust and accurate navigation in GPS contested and denied environments. Matured navigation augmentation and GPS resilience technologies, such as taking advantage of signals of opportunity, as well as environmental sensing, such as vision or magnetic sensors, to improve inertial measurement unit aided navigation accuracy in GPS sparse or denied environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.329"
                                            },
                                            "Text": {
                                                "val": "Provide a robust simulation environment to validate GPS receiver operation in sparse and denied environments to ascertain areas which require additional research to maintain accurate geolocation reporting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.256"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.256"
                                            },
                                            "Text": {
                                                "val": "Conduct research to provide optimal frameworks for hybrid navigation sensor integration and modeling and simulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RF Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research and development for the advancement of passive and active RF sensors; including phenomenology, modeling and simulation, algorithm development, and experimentation. Plan, execute, and maintain state-of-the-art RF sensor research and development facilities.\n\nConduct research on sensing, learning, and adapting to enable the countering of emerging adaptive, agile RF threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.940"
                                            },
                                            "Text": {
                                                "val": "Continued research and development of RF sensor technologies, including antennas, electromagnetic structures, propagation in plasma medium, computational electromagnetic modeling & simulation, and prototype experimentation for efficient combat identification capabilities. Developed agile, spectrally efficient, radar waveforms and robust distributed sensing techniques for dominance in non-traditional RF environments. Initiated development of electromagnetics forensics techniques for passive RF sensing and EW applications. Initiated research on fully polarimetric bistatic RF ground target and clutter phenomenology and relevant ground vehicle dynamics for RF sensing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.655"
                                            },
                                            "Text": {
                                                "val": "For FY17 and beyond, advanced cyber technology development research under this effort will be reported in Project 622005, Cyber Technology, under efforts Malware Detection and Adaptive Cyber Protections. The RF and EW efforts will continue under this BPAC.\n \nContinue development of agile, spectrally efficient, radar waveforms and initiate robust distributed sensing techniques for dominance in non-traditional RF environments. Continue development of advanced electromagnetic forensics and illumination selection management techniques for passive RF and EW applications. Validate via exploratory research and development of fully polarimetric persistent representation of critical mobile targets and bistatic phenomenology with realistic low grazing angle experiments. Develop electromagnetics based modeling, simulation, and measurement tools for propagation, scattering, and radiation application to improve RF sensors capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.878"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.878"
                                            },
                                            "Text": {
                                                "val": "Continue to explore novel and advanced sensing technologies for use in demanding electromagnetic environments for future platform capability. Develop methods to electronically attack passive sensing systems used by red forces to degrade this capability."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Band\/Multi-Beam Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop multi-band and multi-beam forming technologies.  Address technologies for antenna array operations in dynamic sensor networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.876"
                                            },
                                            "Text": {
                                                "val": "Developed conformal\/planar RF antenna concepts from X-Band to Ka-Band. Demonstrated advanced geo-location algorithms for single and multiple platform operations. Continued research in advanced RF\/electro-optical (EO) subsystem concepts to support expendable RF systems configurations. Continued research in highly integrated digital microsystems for reconfigurable and tunable capabilities.  Initiated concepts to support expendable and affordable RF ISR sensors (radar, SIGINT, electronic support, and combat ID)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.342"
                                            },
                                            "Text": {
                                                "val": "Continue research and development of conformal\/planar RF antenna concepts from C-Band to Ka-Band. Continue research in highly integrated digital microsystems for reconfigurable and tunable capabilities. Develop test-bed vehicle for static and dynamic testing of RF\/EO sensors and algorithms.  Expand concepts to support expendable RF ISR sensors (radar, SIGINT, electronic support, and combat ID), and demonstrate these capabilities for next-generation attritable platforms. Transition advanced geo-location algorithms for single and multiple platform into operational cases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.181"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.181"
                                            },
                                            "Text": {
                                                "val": "Integrate conformal\/planar RF antenna proof-of-concepts for multi-band(C and Ka-Bands) with select multi-beam technologies for multi-spectral sensing capability. Employ adaptive, reconfigurable and tunable detection methods and techniques as effective optional countermeasures on sensing blue force platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sensor Resource Management"
                                    },
                                    "Description": {
                                        "val": "Develop technology to enable optimization of sensor resources in contested environments on own-ship and multi-ship in manned, unmanned and manned\/unmanned teaming concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.677"
                                            },
                                            "Text": {
                                                "val": "Continued research of advanced electronic support (ES) concepts and exploration of adaptable electronic attack (EA)\/ES capabilities. Developed distributed sensor management techniques utilizing an open mission systems (OMS) context and service oriented architecture (SOA) common set of messages and data models.  Used electronic warfare and communications as first functional disciplines to initiate SOA constructs.  Initiated layered effects analyses on next generation RF based threats, counters and perform vulnerability assessments.  Initiated operational architecture and mission services through common mission control center constructs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.465"
                                            },
                                            "Text": {
                                                "val": "Continue research into effective management of electronic warfare assets in operational environments focusing on a multi-ship strike package employment. Conduct electro-magnetic\/electronic warfare (EW) battle management optimization service research on electronic attack (EA) and electronic support (ES) and asses against current and future integrated air defense systems and RF threats. Develop robust modeling and simulation capability to study the efficiency versus effectiveness of distributed electronic warfare assets. Initiate development of additional functional disciplines (radar, EO\/IR, high energy laser) in the SOA and sensor resource optimization. Initiate bandwidth efficient communication protocol research to support collaborative state estimation techniques to enable common model referencing for positioning navigation and timing (PNT) in GPS denied environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.674"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.674"
                                            },
                                            "Text": {
                                                "val": "Continue demonstration of robust modeling and simulation capability to study the efficiency versus effectiveness of distributed EW assets including ES and EA capabilities. Continue research into effective management of EW assets in operational environments focusing on a multi-ship strike package employment. Validate single and multi-ship sensor resource management under high fidelity modeling and simulation conditions such as AFSIM, and under the construct of an OMS architecture. Continue to develop additional functional disciplines (radar, EO\/IR, high energy laser) in the SOA and sensor resource optimization. Continue bandwidth efficient communication protocol research to support collaborative state estimation techniques to enable common model referencing for PNT in GPS denied environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}