{
    "id": "2018-Navy-PB-1319-MJBOOK-0-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-2",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0601153N"
        },
        "ProgramElementTitle": {
            "val": "Defense Research Sciences"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "488.666"
            },
            "CurrentYear": {
                "val": "422.748"
            },
            "BudgetYearOne": {
                "val": "458.333"
            },
            "BudgetYearOneBase": {
                "val": "458.333"
            },
            "BudgetYearTwo": {
                "val": "469.934"
            },
            "BudgetYearThree": {
                "val": "467.628"
            },
            "BudgetYearFour": {
                "val": "468.910"
            },
            "BudgetYearFive": {
                "val": "478.210"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element (PE) sustains U.S. Naval Science and Technology (S&T) superiority, provides new technological concepts for the maintenance of naval power and national security, and helps avoid scientific surprise. It is based on investment directions as defined in the Naval Science & Technology Strategy approved by the S&T Corporate Board \n(20 Jan 2015). This new strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It exploits scientific breakthroughs and provides options for new Future Naval Capabilities (FNCs) and Innovative Naval Prototypes (INPs).  \n\nThis PE addresses basic research efforts including scientific study and experimentation directed toward increasing knowledge and understanding in national security related aspects of physical, engineering, environmental and life sciences. Basic research efforts are developed, managed, and related to more advanced aspects of research on the order of a hundred technology and capability-related 'thrusts', which are consolidated into about fifteen research areas.  These in turn support the major research areas of the Navy and Marine Corps: Autonomous Systems; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support (Education and Outreach).\n\nS&T investment in basic research also includes the National Naval Responsibilities (NNRs), fields upon which a wide range of fundamental Naval capabilities depend. There are currently five NNRs.\n\nS&T investment in basic research also includes the Basic Research Challenge Program which was established to competitively select and fund promising research programs in new areas not addressed by the current basic research program. The Basic Research Challenge Program stimulates new, high-risk basic research projects in multi-disciplinary and collaborative departmental efforts, and funds topics that foster leading edge science that attract new principal investigators and organizations.  Basic Research Challenge awards are for a period of four years.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "506.553"
                },
                "CurrentYear": {
                    "val": "422.748"
                },
                "BudgetYearOne": {
                    "val": "460.050"
                },
                "BudgetYearOneBase": {
                    "val": "460.050"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "488.666"
                },
                "CurrentYear": {
                    "val": "422.748"
                },
                "BudgetYearOne": {
                    "val": "458.333"
                },
                "BudgetYearOneBase": {
                    "val": "458.333"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-17.887"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.717"
                },
                "BudgetYearOneBase": {
                    "val": "-1.717"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-6.070"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-11.817"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.717"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.717"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 request was reduced by -$34.9 million as required for the Department of the Navy to comply with the Bipartisan Budget Act of 2015.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Defense Research Sciences"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "435.563"
                        },
                        "CurrentYear": {
                            "val": "422.748"
                        },
                        "BudgetYearOne": {
                            "val": "458.333"
                        },
                        "BudgetYearOneBase": {
                            "val": "458.333"
                        },
                        "BudgetYearTwo": {
                            "val": "469.934"
                        },
                        "BudgetYearThree": {
                            "val": "467.628"
                        },
                        "BudgetYearFour": {
                            "val": "468.910"
                        },
                        "BudgetYearFive": {
                            "val": "478.210"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program element (PE) sustains U.S. Naval Science and Technology (S&T) superiority, provides new technological concepts for the maintenance of naval power and national security, and helps avoid scientific surprise. It is based on investment directions as defined in the Naval Science & Technology Strategy. This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It exploits scientific breakthroughs and provides options for new Future Naval Capabilities (FNCs) and Innovative Naval Prototypes (INPs).  \n\nThis PE addresses basic research efforts including scientific study and experimentation directed toward increasing knowledge and understanding in national security related aspects of physical, engineering, environmental and life sciences. Basic research efforts are developed, managed, and related to more advanced aspects of research on the order of a hundred technology and capability-related 'thrusts', which are consolidated into about fifteen research areas.  These in turn support the major research areas of the Navy and Marine Corps: Autonomous Systems; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support. Activities in this area also support maintenance of the Science and Engineering Workforce and STEM Education and Outreach.\n\nS&T investment in basic research also includes the National Naval Responsibilities (NNRs), S&T areas that are uniquely important to maintaining U.S. Naval superiority. With the designation in 2011 of Sea-Based Aviation as an NNR, there are currently five NNRs.\n\nS&T investment in basic research also includes the Basic Research Challenge program which was established to competitively select and fund promising research programs in new areas not addressed by the current basic research program.  The Basic Research Challenge Program stimulates new, high-risk basic research projects in multi-disciplinary and collaborative departmental efforts, and funds topics that foster leading edge science that attract new principal investigators and organizations.  Basic Research Challenge awards are for a period of four years.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AIR, GROUND AND SEA VEHICLES"
                                    },
                                    "Description": {
                                        "val": "Efforts include research in surface\/subsurface reduced signatures; free-surface, subsurface, and propulsor hydromechanics; hull life assurance; advanced ship concepts; distributed intelligence for automated survivability; advanced electrical power systems; air vehicles; air platforms propulsion and power; air platforms survivability and signature control; special aviation projects; Unmanned Air Vehicle\/Unmanned Combat Air Vehicle (UAV\/UCAV); environmental quality; logistics; power generation, energy conversion, and storage; and advancements in naval technology innovations.\n\nFunding increase in 2018 is the result of several increased Department Research Initiatives in the areas of Science of Autonomy, Advanced Naval Power Systems, and Advanced Sea Platform Performance.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.999"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\n- Continued investigations into controlled initiation and recovery from aggressive, non-linear aero-maneuvers conducted by unmanned air vehicles.\n- Continued university research in rotorcraft technology areas such as tilt rotor aeromechanics, rotor flow field\/ship air wake coupling during shipboard operations, flight simulation of advanced ducted fan air vehicles, active rotor control for enhanced shipboard operations, autonomous rotorcraft operations in shipboard environment, and innovative rotor design concepts for naval applications.\n- Continued research in computational simulation of rotorcraft operations in a shipboard environment.\n- Continued investigation of advanced structural concepts, providing a high degree of crew protection during crashes.\n- Continued research into new analytical methods for high-fidelity prediction of rotorcraft performance, loads, and vibration.\n- Continued university and Navy laboratory research in basic rotorcraft science with emphasis on enabling concepts for variable geometry\/variable rotor-speed aircraft.\n- Continued Sea-Based Aviation NNR research in Virtual Dynamic Interface, Advanced Manned\/Unmanned Handling Qualities and Control for Naval Operations, Improved Fixed Wing Launch and Recovery High Lift Aerodynamics and Performance, Enhanced Fixed Wing V\/STOL Operations, and Autonomous Deck Operations.\n\nScience of Autonomy\n- Continued multi-disciplinary research into the science of autonomy, including multi-vehicle collaboration, intelligence, and human interaction.\n- Continued research in scalable and robust distributed collaboration among autonomous systems.\n- Continued research in human\/unmanned system collaboration.\n- Continued research in autonomous perception and intelligent decision-making.\n- Continued research in intelligent architectures for autonomous systems.\n- Continued research in integrated design analysis\/prognosis to optimize airframe structural properties and match material selection to operational requirements.\n- Continued modeling of complex behaviors\/interactions to predict risk, probability and mechanism of failure and forecast lifetime performance.\n\nShip Concepts and Hydrodynamics\n- Continued modeling and optimization techniques for naval design of multi-hulls, optimal functional arrangements for both ship and submarine design, and optimization for semi-displacement craft.\n- Continued implementation of nationwide program to increase interest in naval engineering education.\n- Continued further examination of computational mechanics to address prediction of acoustic signatures in complex structures, modeling of structural failures and optimization, sensitivity analysis and error control.\n- Continued research in propeller tip vortex cavitation and sheet-to-cloud cavitation.\n- Continued computational and experimental investigation into complex, three-dimensional flow separation problems.\n- Continued modeling and understanding of full-scale circulation control bow planes design.\n- Continued validation of Unsteady Reynolds Averaged Navier Strokes (URANS) prediction on maneuvering effects on ship motion in waves.\n- Continued modeling of hydro-acoustics of advanced materials propulsor.\n- Continued program to investigate renewable energy technologies for Navy applications.\n- Continued computational and experimental investigations of wakes in stratified fluids.\n- Continued Large Eddy Simulation (LES) modeling of crashback of underwater vehicle with propulsor.\n- Continued measurement and modeling of unsteady high-speed craft hydrodynamics.\n- Continued high-fidelity fluid-structure interaction program.\n- Continued computational prediction and validation of damaged ship maneuvering.\n- Continued research efforts on multi objective optimization of hull shapes using hybrid hull concepts to achieve high efficiency, reduced slamming loads and hydrodynamic\/structural performance.\n- Continued development of the understanding of shockwave propagation and failure mechanisms of high strain rate, sensitive polymers and their interaction in composites with structural and armor materials.\n- Continued research into the extension of bubble-wake modeling to physical far-field regime.\n\nShip Signatures, Structures, and Materials\n- Continued the structural performance of hybrid ship hulls and hybrid joints subject to sea loads and weapons effects for application to high speed, low signature vessels.\n- Continued modeling of alternating current sources and propagation.\n- Continued Particle Image Velocimetry (PIV)\/Laser Doppler Velocimetry (LDV) studies of multiphase bubble flows and interaction with elastic plates in a small, quiet water tunnel.\n- Continued LDV of scaling effects studies of unsteady elastic duct and propulsor interaction in a wind tunnel.\n- Continued pressure-shear experiments at ultra-high loading rates of Explosion Resistant Coating (ERC) in combination with light weight composites, including glass, acrylics, Poly(methyl methacrylate) (PMMA) and development of computational simulation capability for understanding the behavior and failure effect of ERC on the materials.\n- Continued computational methods for simulation of fragmentation, including tracking interactions of fragments and their interactions with composites of various materials (and fluid fragment interaction).\n- Continued effort on much higher strain rate loading and constitutive behavior of ERC for strain rates appropriate to ballistic events.\n- Continued work on cohesive elements for dynamic fracture under combined mode for application to failure in joints in ship structures under blast loading.\n- Continued work on hybrid ship (non-magnetic stainless steel\/composite) hull concepts.\n- Continued further examination of computational mechanics in order to address prediction of acoustic signatures in complex structures, modeling of structural failures and optimization, sensitivity analysis, and error control.\n- Continued concept for development of photonic band gap waveguide.\n- Continued developing methods to model the mechanisms of interaction between an elastic duct wall and fluid-flow in a duct with a propeller.\n- Continued development of computational mechanics to provide predictive capabilities of acoustics, linear and nonlinear dynamic response and failure mechanisms of structures.\n- Continued efforts developing alternative hull approaches for fast ships and hybrid ship hull structures.\n- Continued efforts to develop a better understanding of explosion resistant coating under extreme loads and its interaction with other armor and structural materials.\n- Continued investigation into methods to control airborne noise transmission using active control methods.\n- Continued development of metamaterial concepts for radio frequency (RF) signature control and photonic and acoustic applications.\n- Continued experimental facility development for sea-slamming loads in fast ships, and consideration for hydro-elasticity and structural details in composites panels and scale effects to support measurements used to develop new theoretical models.\n- Continued performing measurements of sea-slamming loads in fast ships at various sea states and speeds for composite panels on the experimental facility and developed\/verified theoretical\/computational models considering hydro elasticity and structural details and scale effects.\n- Continued study of droplet & volume scattering phenomena.\n- Continued the development of predictive models for infrared emission and reflection from breaking waves.\n- Continued development of computational electromagnetic tools for electromagnetic materials design & optimization.\n- Continued development of a methodology for highly reliable composite to metallic joints.\n- Continued fundamental efforts in multi-scale, time-varying, hull structural reliability models and processes for structural performance analysis.\n- Continued the development and understanding of elastomeric polymers for multi-functionality in protection systems\/armor and structural acoustics, with superior properties against environmental effects and extreme temperature.\n- Continued development of advanced electromagnetic energy absorbing composite materials.\n- Continued efforts to further the physics based understanding of structural acoustics for the next generation submarine.\n- Continued improvements for predictive capabilities of surface ship propulsion systems and underwater acoustic signatures.\n- Continued Sea-Based Aviation NNR structures and materials research in Structural Mode Characterization, High-Loading\/Lightweight Materials, Advanced Structural Concepts, Material Degradation\/Corrosion, and Structural Protection and Maintenance.\n\nShip and Air Platform Machinery and Systems\n- Continued efforts to understand and control the generation and propagation of far-field jet noise.\n- Continued development of Pulsed Detonation Engine (PDE) Technology.\n- Continued development and understanding of control capabilities and distributed intelligence strategies for shipboard systems.\n- Continued propulsion system cost-reduction efforts through vibration reduction, noise and thermal fluctuation at the source by controlling combustion.\n- Continued passive and active high speed noise control.\n- Continued studies of alternate propulsion systems for PDE and generated prediction models.\n- Continued investigation of thermal management approaches for cooling high power electronic devices.\n- Continued research on non-vapor, compression based refrigeration cycles.\n- Continued studies of advanced air-breathing propulsion concepts.\n- Continued study of advanced materials for PDE applications.\n- Continued efforts to expand the model based reasoning control algorithm approach to multiple heterogeneous systems.\n- Continued studies of complexity in heterogeneous distributed control systems.\n- Continued efforts to investigate a market based control approach to distributed control.\n- Continued efforts to perform physics based modeling of fluid actuation systems.\n- Continue Sea-Based Aviation NNR propulsion research in Propulsion Cycles, Subsystems, and Integration, Turbomachinery and Drive Systems with Enhanced Maintainability, Jet Noise Reduction, Hot Section Materials and Coatings, and Small UAV Propulsion.\n\nGeneration, Energy Conversion and Storage\n- Continued evaluation of stability and control of electrical power systems.\n- Continued analyzing synchronization of 19 diode lasers to produce intense beams.\n- Continued efforts in nanostructures, novel electrolytes, and electrode materials to enable new, 3D, power source architectures and to improve the safety and capacity of rechargeable lithium and lithium-ion batteries.\n- Continued exploration and development of materials for high energy density, passive power electronics (Capacitors).\n- Continued expanding the fundamental understanding of direct electrochemical oxidation and the use of logistic fuels in solid oxide fuel cells.\n- Continued development of phase change cooling approaches for high power electronic devices.\n- Continued efforts developing a science base for optimized combustion of alternative fuels.\n- Continued the investigation of the long-term durability effects of coating\/substrate systems from combustion chemistries and products derived from current petroleum-based fuel and from petroleum-based\/synthetic fuel blends that lead to predictive models.\n- Continued effort in energy and power management to include understanding and reliability of high power electronics.\n- Continued investigation into rare earth-free permanent magnet materials.\n- Continued investigating thermodynamic cycle analogy for harvesting waste heat using multiferroic (pyromagnetic & pyroelectric) materials.\n- Continued research into thermionic energy conversion using inter-gap molecular species in a heat cell with low work function materials.\n- Continued research into cyber-physical, real-time distribution and control of power & energy networks, physics-based models, hardware-in the-loop simulation.\n- Continued development of novel approaches to deposition of ultra-high quality SiC epilayers needed to enable high voltage, high frequency, high-power wide bandgap semiconductor devices.\n- Continued study of fault tolerant electromechanical energy converter concepts for naval applications.\n- Continued research to understand new energy conversion methods (pyroelectrics, thermionics, and combustion).\n- Continued basic research in next generation wide bandgap semiconductors.\n- Continued experimental and computational investigation of dynamic response of marine gas turbines for on-demand and flexible power supply.\n- Continued power and energy management science, particularly understanding new magnetic materials and sliding electrical contacts.\n- Continued fundamental research in novel, high temperature superconducting (HTS) material synthesis.\n\nAdvancements in Naval Technology Innovations\n- Continued development of the Centers for Innovative Naval Technology (CINT), which will expand and apply the Center for Innovative Ship Design (CISD) approach to other Navy facilities to dramatically expand participation and the breadth of naval technologies covered."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "52.065"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nScience of Autonomy\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nShip Concepts and Hydrodynamics\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete modeling and optimization techniques for naval design of multi-hulls, optimal functional arrangements for both ship and submarine design, and optimization for semi-displacement craft.\n\nShip Signatures, Structures, and Materials\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete work on hybrid ship (non-magnetic stainless steel\/composite) hull concepts.\n- Complete efforts developing alternative hull approaches for fast ships and hybrid ship hull structures.\n\nShip and Air Platform Machinery and Systems\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nPower Generation, Energy Conversion and Storage\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nAdvancements in Naval Technology Innovations\n- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "57.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "57.160"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Air Vehicles\n\nBasic research investments include fixed-wing, rotary wing, and vertical\/short takeoff and landing (V\/STOL) aircraft, ship\/aircraft dynamic interface, air vehicle management, and control, aerodynamics, and aeromechanics. Additional research investments include airframe structures and materials science address durability, service life, readiness, affordability, and future capabilities development. Most airframe challenges are not platform or design specific; they are fully represented in both current new-build and planned next-generation platform designs. Additional areas of research include metallic structures and materials, composite structures and materials, and advanced concepts related to: design, failure analysis, materials selection, fabrication, and sustainment of air-vehicle structures. Conducting university research supports rotorcraft technology areas such as tilt rotor aeromechanics, rotor flow field\/ship air wake coupling during shipboard operations, flight simulation of advanced ducted fan air vehicles, active rotor control for enhanced shipboard operations, autonomous rotorcraft operations in shipboard environment, and innovative rotor design concepts for naval applications. Continuing Sea-Based Aviation National Naval Responsibility (NNR) research in Virtual Dynamic Interface (VDI), advanced manned\/unmanned handling qualities and control for Naval operations, improved fixed wing launch and recovery high lift aerodynamics and performance, Enhanced fixed wing V\/STOL operations, and autonomous deck operations. Continuing SBA Structures and Materials NNR research for advanced airframes in metallic structures, combined loading mechanics, lightweight advanced polymer and ceramic composites, inspection and repair of composite structures, material coatings and sealants, and advanced concepts in manufacturing and multifunctional structures.\n\nScience of Autonomy\n\nConduct basic research related to critical multidisciplinary autonomy challenges that cut across areas\/domains, including air, sea, undersea and ground. This includes multi-disciplinary research into the science of autonomy focuses on four interrelated areas: scalable and robust distributed collaboration among autonomous systems; human\/unmanned system collaboration; autonomous perception and intelligent decision-making; and intelligent architectures for autonomous systems.\n\nAdvanced Naval Power Systems\n\nConduct basic research related to critical S&T to investigate efforts related to thermal science and engineering; power electronics\/electro-magnetics; and energy conversion, storage and generation. Pursue research in computer-aided material design; scarce materials mitigation strategies; electrochemical materials; and functional polymeric materials.  \n\nAdvanced Sea Platform Performance\n\nConduct basic research related to critical S&T to investigate efforts related to propulsor, surface ship, and subsurface hydrodynamics; platform mobility; alternative hull materials; and structural acoustics. Expand research related to naval engineering and platform design, including Ohio Replacement Program efforts, and centers for innovative naval technology.  \n\nSea Platform Survivability Science\n\nConduct basic research related to critical S&T to investigate efforts related to platform structural reliability; advanced control; acoustic and non-acoustic (electromagnetic) signatures; computational mechanics; metamaterials; and multihull design and optimization.\n\nMaterials, Coatings and Corrosion Control Science\n\nConduct basic research related to critical S&T to investigate corrosion control technologies. Pursue research in identifying new materials and coatings for naval applications.\n\nShip and Air Platform Machinery and Systems\n\nConduct basic research to advance the technical superiority of Sea-Based Aviation Science and Technology NNR in propulsion, power and thermal management related technologies with emphasis on propulsion cycles, subsystems, and integration, turbomachinery and drive systems, jet noise reduction, hot section materials and coatings, and small UAV propulsion. Conduct research to improve the power density, fuel efficiency, range and operating reliability of future large, medium and small engines. Continue studies to obtain a better fundamental understanding of the technologies involved with Rotating Detonation Engines and integration into platforms and weapon systems using thermodynamic models, Computational Fluid Dynamics and sub-scale experiments. Pursue research for better fundamental understanding of the underlying physics of jet noise production from multi-stream, hot, supersonic jets, and control schemes through fundamental modeling of unsteady and turbulent flow fields and development of more accurate and efficient computational tools. Continue basic research to improve jet engine material durability and temperature and temperature rate capabilities in both benign and corrosive environments. Increase the technical maturity of lightweight ceramic heat exchangers for small engines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ATMOSPHERE AND SPACE SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Marine Meteorology and Prediction, and Space Sciences. This program supports innovative basic research on physical process studies, fundamental observations, new sources of data, and modeling in the atmosphere and space with the goal of improving predictive capabilities in the major research area of Operational Environments. Emphasis is placed on the marine atmosphere, the tropics, polar regions, the ionosphere and other areas where new understanding is needed in order to overcome predictability barriers that limit the accuracy of current forecast models. Efforts are underway to understand the interactions of physics between the atmosphere, space, land, ocean and ice, represent these coupled processes in models, and extend them across scales from local to planetary, with the goal extending the skill of predictions to longer timescales (i.e. seasonal to interannual). Recent efforts have also focused on the processes that control tropical cyclone formation, structure and intensity changes and processes that affect electromagnetic and electro-optic propagation in the marine atmosphere. Accomplishments and plans described below are examples for each effort category.\n\nFunding increase in 2018 is the result of several increased Department Research Initiatives in the areas of Extramural Marine Meteorology and Prediction, Intramural Battlespace Environments, Extramural Space Sciences, and Intramural Space Research.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.867"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Marine Meteorology and Prediction\n- Continued the development of next-generation ocean-atmosphere coupled models.\n- Continued effort to investigate and better understand the bulk exchanges, aerosol-cloud interaction, and physical processes that take place at the atmospheric boundary layer interface.\n- Continued theoretical and observational effort to improve understanding of the fundamental dynamics of mountain waves, including generation, propagation, nonlinear interaction, and wave breaking.\n- Continued effort to gain a fundamental understanding of the flow-dependent limits of predictability by combining research in data assimilation and atmospheric instability.\n- Continued investigation into the near-earth environmental effects on electromagnetic propagation.\n- Continued investigation of sub-grid-scale processes that influence marine boundary layer turbulence, aerosol production and removal, and marine stratocumulus cloud and drizzle formation and dissipation with the goal of improving the predictability of these phenomena in high-resolution mesoscale prediction systems.\n- Continued investigation of Western Pacific tropical cyclone dynamics in order to improve the predictability of storm genesis, structure and intensity changes, radii of maximum winds and effects on sea surface waves.\n- Continued effort to assimilate WindSat wind vector, Ozone Mapping and Profiler Suite (OMPS) ozone profiles, and Global Positioning System (GPS) temperature and water vapor profile retrievals into NOGAPS (Navy Operational Prediction System).\n- Continued assessment of the status of aerosol observation, prediction, and understanding for use in slant-range visibility and electro-optical performance prediction models.\n- Continued development of new soil moisture retrieval algorithm that addresses the basic modeling issues pertinent to soil moisture retrieval using passive microwave data from the WindSat instrument.\n- Continued demonstration and validated a new data assimilation capability in NOGAPS ALPHA to generate the first global atmospheric analysis fields that extend from the ground to the edge of space.\n- Continued effort to derive and test advanced nonlinear atmospheric data assimilation algorithms using variational and ensemble techniques that are firmly based on modern inverse problem theory.\n- Continued effort to understand the fundamental physics and dynamics that control cloud and aerosol variability in the marine boundary layer.\n- Continued effort to improve understanding of sub-seasonal, seasonal and intra-seasonal oscillation in a fully coupled (air, sea, land, ice) Model with the goal of developing a seamless, high-resolution earth system prediction capability for extended range forecasts.\n- Continued the effort to understand the impact of skewness on our ability to estimate meteorological variables and their uncertainty.\n- Continued the effort to understand the predictability of weather in future extreme environments by quantifying how these changes impact forecast error growth and energy, non-local errors and tropical cyclone prediction.\n- Continued the study to understand the interplay of deep convective and boundary layer processes in tropical cyclone eye\/eyewall dynamics and symmetric\/asymmetric inner-core variability through a combination of numerical models, observation and improving upon existing theory.\n- Continued investigation of tropical cyclone intensification and structure changes that occur in response to changes in upper level outflow, large scale environmental interactions and\/or internal changes in convection using innovative new observing systems and satellite observations.\n- Continued the effort to understand and diagnose the aspects of a multi-model ensemble prediction system that make it ostensibly superior to a single model ensemble prediction system, with the aim of extending the Navy's ensemble predictive capabilities and providing the Navy with an ensemble prediction system that performs competitively with multi-model ensembles.\n\nSpace Sciences\n- Continued program to advance state-of-the-art specification and prediction of the space environment to improve space system performance and their on-call availability.\n- Continued monitoring of other-agency efforts for 'Naval Harvest' of advanced techniques and algorithms for remote sensing of ocean and atmospheric properties including winds, waves, currents, and surface topography.\n- Continued a focused program to develop a predictive, operational capability for the onset and evolution of equatorial spread-F that limits space-based communications and navigation capabilities.\n- Continued program to extend magneto-hydrodynamic models of solar activity, and related effects on the near-Earth space environment, toward an improved predictive capability on communication and navigation systems, and other related effects on DoD operations.\n- Continued effort to develop a better physical understanding of small-scale atmospheric wave dynamics in the middle and upper atmosphere.\n- Continued effort to develop understanding to forecast the sun's changing extreme ultraviolet (EUV) radiation and the responses of the upper atmosphere and ionosphere one-to-ten days in advance.\n- Continued investigation of the driving mechanisms, mode characteristics, and impact on space plasmas of electromagnetic waves relevant to radiation belt remediation and auroral ionospheric space weather.\n- Continued effort to assemble individual databases and model components of the Sun-Earth System.\n- Continued effort to quantify the evolution of probability density functions for orbiting objects in a crowded space environment, which will help inform orbital debris mitigation and avoidance strategies.\n- Continued investigation into the coupling physics, dynamics, and chemistry from the lower atmosphere, earth surface, and ocean into the upper atmosphere and ionosphere, focusing on processes relevant to ionospheric specification and forecasting.\n- Continued efforts to estimate the probable state of the extended operational environment, from surface to space, in future years-to-decades as a result of natural and anthropogenic influences.\n- Continued efforts to use acoustic wave analysis techniques to produce three-dimensional maps of emerging solar flux below the sun's surface, towards giving longer warning times for geoeffective space weather that is driven by solar disturbances."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.352"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Marine Meteorology and Prediction\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete investigation of Western Pacific tropical cyclone dynamics in order to improve the predictability of storm genesis, structure and intensity changes, radii of maximum winds and effects on sea surface waves.\n- Complete assessment of the status of aerosol observation, prediction, and understanding for use in slant-range visibility and electro-optical performance prediction models.\n\nSpace Sciences\n- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.547"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.547"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Marine Meteorology and Prediction\n\nComplete a research initiative to improve the sub-grid scale parameterization of clouds, radiation and mixing in the marine boundary layer that developed several innovative new \"scale-aware\" parameterizations; transition these to applied research and, in one case, directly into a new version of the Navy's global numerical weather prediction system (NAVGEM), which resulted in a major improvement of several objective measures of predictive skill related to clouds and precipitation over the oceans. Conduct high-altitude airborne field experiments over major hurricanes during which an unprecedented set of high-resolution soundings covering the full depth of the storms will be obtained that allow detailed physical processes to be observed for the first time. These results will be analyzed, applied to existing models and have demonstrated the potential to make a substantial improvement in the ability to predict intensity and structure change in tropical cyclones.\n\nIntramural Battlespace Environments\n\nConduct basic research into the understanding of atmospheric processes ranging from thousands of kilometers down to meters, including interactions of the atmosphere with the land, sea, wave, and ice.  Continue research to improve our ability to exploit environmental observations to help us characterize those processes more accurately. Conduct research in the littoral zone, where complex topography and air-sea-land contrasts affect the environment on very short time and space scales, as well as in the tropics and sub-tropics, where longer time scale oscillations and seasonal signals also affect short-term weather events.  Develop a better fundamental understanding, measurements and predictive models to mitigate shortfalls.  Continue investigation of the interface between the troposphere and stratosphere is gaining increased attention because of its possible effect upon medium term weather prediction.\n\nExtramural Space Sciences\n\nContinue investigation of methods to assimilate these observations into space weather models, with an eventual goal of a prediction system that could provide detection and warnings of tsunamis as a variety of observational systems will be utilized to increase the understanding of the physics of ionospheric irregularities and other space weather phenomena.  Recent observations have shown that a number of phenomena, including tsunamis, can generate acoustic gravity waves that have an airglow signature in the thermosphere\/ionosphere.\n\nIntramural Space Research\n\nConduct basic research integrated across three environmental areas -- geospace, heliospace, and high-energy space -- which underpin, connect, and inform successful operations, with metrics to increase technology readiness and to foster transition.  Initiate geospace efforts to investigate the physical mechanisms responsible for the formation of sporadic ionospheric mesoscale structures that impact ionospheric radiowave propagation, to improve high-frequency (HF) systems performance for operational planning purposes.  Initiate heliospace efforts to develop the science base necessary to forecast geo-effective solar energetic particle (SEP) events that are hazardous to spacecraft operations and human activities in space.  Initiate high-energy space efforts to advance understanding about millisecond pulsars and the physics that underpins their use as space-based clocks for navigation and timing."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE ADDRESSING HYBRID THREATS"
                                    },
                                    "Description": {
                                        "val": "The Sciences Addressing Hybrid Threats (formerly Counter Improvised Explosive Device (IED) Sciences program provides research for Naval Forces to fight hybrid threats, and adversaries in expeditionary operations. Naval Expeditionary Forces need science advances to address a range of Basic Research challenges that result from physical and operational environmental limitations so harsh that solutions push basic discovery and invention. Naval Forces able to operate amphibiously and in the littoral will have all of their capabilities exposed to degrading sea and land physical effects. Expeditionary forces operating austerely must be agile and lethal but will be constrained by size, weight, and power requirements and must be sustained across distributed forces covering large areas. Further complicating the problem context is the nature of hybrid threats, and adversaries. \n\nA hybrid adversary can be state or non-state using a combination of conventional and irregular methods and weapons. For example a hybrid threat could use criminal acts in concert with conventional artillery and IEDs and in turn social media for combined effects greater and broader than the sum of the parts. These coordinated multivariate threats occur across the spectrum of conflict with a dynamic but unified strategy. A hybrid adversary is flexible and adapts quickly, synchronizing advanced state weapons systems, disruptive commercial technologies, cheap expedient homemade weapons, and a variety of tactics. The Sciences Addressing Hybrid Threats program seeks to establish and nurture science to address these threats not covered in more conventional warfare science efforts and in environments not researched elsewhere.\n\nWithin the above threat and environmental context numerous warfighting capability dependencies are considered resulting in a broad range of science research areas. Examples include: physics addressing the electromagnetic spectrum for use in Command and Control and high energy physics addressing Directed Energy Weapons; machine perception, reasoning and collaborative behaviors of autonomy enabling numerous potential expeditionary autonomous systems; artificial intelligence enabling future Intelligence systems; optics, electronics, and photonics research to enable revolutionary spectral awareness in small low power sensors; computer and network science to enable expeditionary computing coupled with Data Science research to conduct data analysis; fundamental chemistry and materials science research to advance technologies to support sustainment; basic materials research to explore and improve armor and structural materials; electrochemical energy conversion and storage research to sustain the force; chemistry and physics to provide disruptive energetics for expeditionary Fires; and biology, physiology, and cognitive sciences addressing the Naval Expeditionary warfighters human abilities.\n\nThe program also seeks to establish and nurture a multidisciplinary Science and Technology community of Government, academic and industry researchers to accelerate the transition of new science and technology into fielded systems.\n\nFunding increase in 2018 is the result of DON increased basic research to include a complex, hybrid adversary consisting of state and non-state actors in order to better reflect the threat environment that Naval Forces will face in the future.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.533"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued effort in the area of Prediction to develop theoretical and technical approaches that permit prediction and analysis of IED emplacement as well as the assembly of IEDs. This included recognition of emplacement patterns, human activity recognition from video and other sensing systems, human intelligence and social network analysis of terrorist networks, modeling and simulation of the full spectrum of IED activities, analysis of communications, and knowledge management systems to combine diverse data sources.\n- Continued effort in the area of Detection to develop concepts that would permit stand-off detection and localization of the explosive, the case materials, the environment in which the device is located, and other components of the IED.\n- Continued effort in the area of Neutralization to develop scientific concepts that may be applied to remotely render an IED ineffective without necessarily having to detect or destroy it.\n- Continued effort in the area of Destruction to develop scientific concepts that may be applied to quickly and remotely destroy IEDs without necessarily having to detect them.\n- Continued creation of new spectroscopy for sensitive characterization of semiconductor nanostructures, ultrathin molecular films and chemical\/biological threat materials and explosives.\n- Continued development of a new chemical explosive detection concept based on pump\/probe ultra-short pulse lasers.\n- Continued research on characterizing background noise in urban and riverine environments in support of IED signature detection.\n- Continued effort to directly observe lattice deformations in explosives under shock impact.\n- Continued investigations into sociological and cultural aspects of defeating insurgent networks.\n- Continued investigations into standoff wide area neutralization and pre-detonation of IEDs.\n- Continued investigations into stronger lightweight armor including nanoparticle designs.\n- Continued investigations into detection of physical and temporal device characteristics.\n- Continued investigations into challenges within the Riverine environment.\n- Continued investigations into challenges in the temporal domain in various land environments.\n- Continued an effort to integrate observable behaviors with social behavior models to provide inputs for predictions and validation.\n- Continued a program to investigate nano-technologies applied to miniaturized remote molecular sensors, with an additional emphasis on low fidelity detection of trace explosive vapor partial-pressures.\n- Continued research into emerging very-broad-band spectroscopic capabilities to achieve a low-fidelity mosaic of partial pressure detections of explosives.\n- Continued study of energy transduction through soft armor.\n- Continued a Neutralize effort to investigate the identification of techniques to deflagrate or detonate explosives by creating hot spots or other localized effects that do not quench.\n- Continued a Neutralize effort to investigate new energy conversion schemes and extraction mechanisms for high-powered microwave sources that have potential to dramatically reduce the size, weight, and power required.\n- Continued a Neutralize effort to research compact wideband metamaterial multifunctional antennas.\n- Continued a Mitigate effort to explore new chemistry techniques to optimize polymer fiber growth and hardening.\n- Continued a Mitigate effort to develop in-situ analytical tools to observe nano to micro structure of materials during fabrication and treatment processes.\n- Continued study of Evaluation of the Dynamic Behavior and Material Parameters of the Human Brain.\n- Continued study of Real-Time Control of NMR Relaxation for Improved Sensitivity and Resolution.\n- Continued research on lightweight flexible materials that can selectively absorb, dissipate, and convert high energy electromagnetic waves or blast waves.\n- Continued research on compact and efficient high voltage pulsed switches that can rapidly charge and discharge at a high repetition rate.\n- Continued an effort to detect a wider variety of homemade explosives.\n- Completed Neutralize effort to investigate new energy conversion schemes and extraction mechanisms for high-powered microwave sources that have potential to dramatically reduce the size, weight, and power required.\n- Completed a Neutralize effort to research compact wideband metamaterial multifunctional antennas\n- Initiated research into the improved biomechanics and physiology of detection dogs for use in the detection of explosive hazards.\n- Initiated research efforts to produce the knowledge and understanding necessary to detect and locate asymmetric explosive threats and their components by exploring combination of their unique passive and active characteristic responses at safe stand-off distances from various expeditionary platforms.\n- Initiated research efforts to explore new lightweight multifunctional material design and techniques to optimize existing materials to improve protection from detonation effects.\n- Initiated research efforts to neutralize or prevent explosive threats with or without direct knowledge of their locations.\n- Initiated research efforts to provide understanding of the human and social elements and their relationships with asymmetric explosive threats to predict and prevent explosive events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.032"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all effort of FY 2016, less those noted as completed above.\n- Complete efforts in the area of Destruction to develop scientific concepts that may be applied to quickly and remotely destroy IEDs without necessarily having to detect them.\n- Complete creation of new spectroscopy for sensitive characterization of semiconductor nanostructures, ultrathin molecular films and chemical\/biological threat materials and explosives\n- Complete effort to directly observe lattice deformations in explosives under shock impact\n- Complete investigations into challenges within Riverine Environment.\n- Initiate research efforts to improve stimulated electromagnetic explosive signature collection efficiencies.\n- Initiate research efforts to explore compact rapid high selectivity spectroscopic detection in distributed unmanned platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.696"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.696"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Sciences Addressing Complex Hybrid Warfare Threats (Formally Known as Counter-Improvised Explosive Device (IED) Sciences)\n\nExtramural SAHT\n\nInitiate Sciences Addressing Complex Hybrid Warfare Threats efforts. S&T efforts will address multi-faceted threats that employ both conventional and unconventional forces. This activity was originally formed to address Counter-Improvised Explosive Device (IED) Sciences, which are a component of Complex Hybrid Warfare Threats. However, there are additional emerging components of complex hybrid threats that must be addressed with these efforts as well as the challenges imposed by Naval Expeditionary Operations and as such the PE will address a broad range of hybrid threats not only IEDs and the science challenges associated with these environments. This activity will also incorporate Expeditionary Operations activities to facilitate the consolidation described above.\n\nContinue all Expeditionary Operations efforts of FY 2017. Complete basic materials research to explore and improve high strain and stress rate performance of high performance fibers, armor inserts, and structural materials. Complete fundamental chemistry and materials science research to advance water purification technologies. Complete basic research to advance electrochemical energy conversion and storage. Initiate Investigations into novel hybrid devices, making use of the optical, electrical, and acoustic regimes. These devices will enable photonic and electronic domain access and manipulation of the electromagnetic spectrum across multiple octaves of bandwidth. Such devices will enable previously-unattainable real-time spectral awareness and performance. Initiate basic research to advance machine perception, reasoning and collaborative behaviors of autonomous systems during Amphibious Operations.\n\nExtramural C-IED Science\n\nContinue efforts of FY 2017. Complete investigations into challenges in the temporal domain in various land environments.  Complete the program to investigate nano-technologies applied to miniaturized remote molecular sensors, with an additional emphasis on low fidelity detection of trace explosive vapor partial-pressures. Complete research on compact and efficient high voltage pulsed switches that can rapidly charge and discharge at a high repetition rate. Complete C-IED mitigation and destruction activities.\n\nIntramural Information Technology\n\nResearch to support the identification of previously unsuspected people caught on camera engaging in hostile acts by developing a robust approach for identifying people given only one or a small number of photos by comparing these photos to images on the Internet and in existing databases.  \n\nIntramural Materials and Chemistry\n\nEvaluate and quantify the changes in electrical signaling, resulting from strain on the neuronal cells subjected to shock and blast waves.  The study is critical to define and understand blast and impact injuries at the cellular level resulting in mild or severe traumatic brain injury.  Study hearing loss from repeated exposure to high levels of acoustic waves created by high performance jet engines operating on ocean platforms.  Develop an understanding of fundamental changes on IR optical standoff and point detection of improvised explosives, chemical warfare agents and toxic industrial chemicals.  Develop and demonstrate a predictive framework of IR spectral signatures based on the fundamental optical properties of materials.  \n\nIntramural Electronics\n\nCreate new knowledge and understanding and explore new concepts, techniques and methods, for the design, growth, and characterization of electronic and electro-optic sensors to counter IED's."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Efforts include: human factors and organizational design; manpower, personnel, and training; integrated avionics, displays, and advanced cockpit; and pattern recognition.\n\n\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.117"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research of social networks for counterterrorism.\n- Continued expansion of the cognitive architectural modeling capability to increase coverage, including spatial reasoning, multitasking, and impact of physiological and stress variables.\n- Continued research of human cognition and performance to create more realistic simulations for training.\n- Continued program to combine cognitive architectures with computational neuroscience to better predict human performance.\n- Continued program on implantable electronics for performance enhancement.\n- Continued investment in natural language interaction capability for artificially intelligent training systems.\n- Continued research of neuro-control of high-lift bio-inspired Unmanned Underwater Vehicles and active vision and cognitive navigation skills in mobile robots.\n- Continued computational neuroscience for novel pattern recognition and sensory augmentation.\n- Continued research of human-robot interaction to support team collaboration.\n- Continued the output human performance usability models with actual human performance results obtained in usability testing on systems under development. These systems include future Naval Combat Systems and Homeland Security Operation Centers.\n- Continued investigation of human sensory performance for optimizing video and audio human-electronic device interfaces.\n- Continued research to create new social modeling tools for understanding the responses of adversaries, determining the best practices for containing and deterring the adversary, and developing effective course of action in non-Western environments for humanitarian and civilian-military operations.\n- Continued research of advanced biometrics such as biodynamic signatures to support spirals 2 and 3 of the Navy Identity Dominance System - Maritime Domain.\n- Continued efforts to extend the representational capabilities of cognitive architectures to accommodate aspects of social cognition and teamwork.\n- Continued efforts to develop an empirical understanding and prediction of the behaviors of individuals and social groups and networks, computational approaches to social network theory and the co-evolution of adversarial tactics and strategies, algorithms for exploring scenarios that take into account socio-cultural factors; political and economic factors; local attitudes, values, and social structure.\n- Continued research of human activity and intend recognition and dynamic biometrics for improved human system interfaces and force protection.\n- Continued research into probabilistic reasoning in computation cognitive architectures.\n- Continued research into computational social neuroscience to provide new models for manpower assignment and incentivization and new social models of cross-cultural interactions.\n- Continued research on models of social dynamics and culture in small scale societies.\n- Continued research to explore the development of algorithms to automate assessment of the information value of Command and Control (C2) related data for next generation C2 systems.\n- Continued research to explore to dynamically provide decision support in support of rapid mission planning, re-planning and execution at command and combatant echelons. Research thrust to include dynamic mapping of decision space and decision-based, dynamic task allocation algorithms.\n- Continued research to explore concepts of operations for the management of information in hybrid autonomous systems.\n- Continued research on social neuroscience of Trust.\n- Continued research on data collection and processing for health surveillance and medical assistance.\n- Continued research on brain-inspired intelligent systems to enable high-level interaction between warfighters and autonomous systems.\n- Continued research on geography, health and disaster for next generation information systems for collaborative humanitarian assistance.\n- Continued socio-culture research of complex humanitarian operations.\n- Continued development of intelligent, embedded assessment for Intelligent Tutoring System (ITS).\n- Continued research on socially guided machine learning. This includes robotic teammates learning from human teachers both by demonstration and verbal instruction.\n- Continued the early exploration of modeling the cognitive basis for human moral judgments.\n- Continued research to explore concepts of operations for the management of information in hybrid autonomous systems.\n- Continued research to improve collaborative systems and trust in computer mediated environments.\n- Continued research into cost effectively adapting current intelligent tutoring technologies to wider dissemination across Navy schoolhouses.\n- Continued research to address visualization and synthesis from multiple data sources to support autonomous systems and small hybrid teams.\n- Continued research on portable, intelligent, computer based expert decision aids for maintenance applications.\n- Continued research on computational models for predicting human error on procedural tasks.\n- Continued research on cognitive modeling for cyber security.\n- Continued research seeking a unified theory of the overall decision process, including the role of judgment with the goal that the unified theory will link currently existing, but isolated, conceptual theories of decision making, judgment, sensing, and detection.\n- Continued research into strategies for and utility of incorporating uncertainty into planning and asset allocation in Naval missions.\n- Continued research on human performance sources of cyber vulnerabilities of unmanned vehicle (UxV) systems.\n- Continued human systems integration research to reduce workload and increase operator situational awareness in command information center.\n- Continued research to understand and dynamically model context in operational decision making.\n- Continued research on statistical language translation for content analysis of threat behaviors and human security issues.\n- Initiated research on training and neuro-cognitive plasticity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.078"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nCommand Decision Making (CDM)\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nSocial Network Analysis\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Initiate research on social cyber-behavior, information operations and hybrid warfare.\n- Initiate research on data visualization, data fusion and novel information streams for understanding novel warfighting problems.\n\nHybrid Human Computer Systems\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nEnhancing Warfighter Cognitive Capability\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nCognitive Science of Learning\n- Initiate research on maintenance skill acquisition and retention."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Human Computer Interaction\/Visualization\n\nConduct basic research in the computer centric environment of today's Navy and Marine Corps. Study human systems integration to reduce workload and increase operator situational awareness in a command information center environment. Investigate human sensory performance for optimizing video and audio human-electronic device interfaces and computational neuroscience for novel pattern recognition and sensory augmentation. Continue research on socially guided machine learning to include robotic teammates learning from human teachers by demonstration and verbal instruction. Conduct research of human-robot interaction to support team collaboration and research to address visualization and synthesis from multiple data sources to support autonomous systems and small hybrid teams. Continue research on brain-inspired intelligent systems to enable high-level interaction between warfighters and autonomous systems.\n\nCommand Decision Making (CDM)\n\nConduct basic research to explore the development of algorithms to automate assessment of the information value of Command and Control (C2) related data for next generation C2 systems. Research strategies to incorporate uncertainty into mission planning and asset allocation in naval missions and to understand and dynamically model context in operational decision making. Explore decision support as it applies to rapid mission planning, re-planning and execution at command and combatant echelons. Research thrust to include dynamic mapping of decision space and decision-based, dynamic task allocation algorithms. Continue research on geography, health and disaster for next generation information systems for collaborative humanitarian assistance. Seek a unified theory of the overall decision process, including the role of judgment with the goal that the unified theory will link currently existing, but isolated, conceptual theories of decision making, judgment, sensing, and detection.\n\nSocial Network Analysis\n\nConduct basic research of social networks for counterterrorism including research to create social modeling tools for understanding the responses of adversaries, determining the best practices for containing and deterring the adversary, and developing effective course of action in non-Western environments for humanitarian and civilian-military operations. Develop an empirical understanding and prediction of the behaviors of individuals and social groups and networks, computational approaches to social network theory and the co-evolution of adversarial tactics and strategies; algorithms for exploring scenarios that take into account socio-cultural factors; political and economic factors; and local attitudes, values, and social structure. Execute research efforts to extend the representational capabilities of cognitive architectures to accommodate aspects of social cognition and teamwork. Investigate social cyber-behavior, information operations and hybrid warfare. Study data visualization, data fusion and novel information streams to understand warfighting problems. Initiate research on competitive narrative and digital media assessment.\n\nHybrid Human Computer Systems\n\nConduct basic research into creating systems in which the functions of a human operator (or a group of operators) and a machine are integrated. Perform research to explore concepts of operations for the management of information in hybrid autonomous systems. Execute research to improve collaborative systems and trust in computer mediated environments.  Investigate statistical language translation for content analysis of threat behaviors and human security issues.  Conduct research of neuro-control of high-lift bio-inspired Unmanned Underwater Vehicles and active vision and cognitive navigation skills in mobile robots. Continue program on implantable electronics for performance enhancement.\n\nEnhancing Warfighter Cognitive Capability\n\nConduct basic research into probabilistic reasoning in computation cognitive architectures and the expansion of the cognitive architectural modeling capability to increase coverage, including spatial reasoning, multitasking, and impact of physiological and stress variables. Extend research into a program to combine cognitive architectures with computational neuroscience to better predict human performance. Research the output human performance usability models with actual human performance results obtained in usability testing on systems under development. These systems include future Naval Combat Systems and Homeland Security Operation Centers. Continue research of human activity and intend recognition and dynamic biometrics for improved human system interfaces and force protection. Conduct research of human cognition and performance to create more realistic simulations for training, including research into cost effectively adapting current intelligent tutoring technologies to wider dissemination across Navy schoolhouses. Extend training scientific study into the development of intelligent, embedded assessment for Intelligent Tutoring System (ITS).  Research cognitive modeling for cybersecurity and research on human performance sources of cyber vulnerabilities of unmanned vehicle (UxV) systems. Develop computational models for predicting human error on procedural tasks.  Investigate training efforts on neuro-cognitive plasticity."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MATHEMATICS, COMPUTER, & INFORMATION SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: Mathematical foundation and computational theory and tools for design, communication, and control of intelligent autonomous systems; theory, algorithms and tools for decision support; decision theory, algorithms, and tools; heterogeneous information integration, management, and presentation; information assurance, computation and information foundation for cyber defense, secure and reliable information infrastructure for command and control; mathematical optimization for optimal resource allocation and usage; modeling and computation of complex physical phenomena; modeling and computation for electromagnetic and acoustic wave propagation and scattering; seamless, robust connectivity and networking; foundations for novel computing hardware, including nanoscale materials, emerging devices and circuits, emerging computational architecture and nanofabrication.\n\nFunding increase in 2018 is the result of increased research initiatives in the area of Extramural Machine Learning, Reasoning and Intelligence.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of mathematical optimization framework and heuristic algorithms that serve as theoretical and computational basis for network design, resource allocation, and logistics.\n- Continued development of improved tactical and battlespace decision aids.\n- Continued to refine techniques for extracting maximum knowledge from multi-modal imagery, text, and multisource signal data.\n- Continued to investigate methods to deal with light dispersion on image formation underwater to enable precise navigation, station keeping, and mapping capabilities for unmanned underwater vehicles.\n- Continued efforts for enabling teams of autonomous systems to work together and work on representations for evolution of cooperative behaviors, including efforts in multi-modal interactions with autonomous systems.\n- Continued developing framework for dealing with effect of variable latencies in communication within teams of humans and autonomous systems.\n- Continued efforts on quantum computing and cryptography.\n- Continued efforts on model checking and automated theorem prover technologies.\n- Continued efforts in mathematical modeling of complex physical phenomena.\n- Continued efforts in mathematical techniques for inverse problems, including reliable approximate solutions in 3-dimensions (3D); adequate representation of the physics of the media and the scatterer; and improved resolution of structural and material properties.\n- Continued focused efforts in development of mathematical foundations for image understanding on a number of key challenges, such as multimodal imagery representation and metrics, object recognition, scene analysis and understanding.\n- Continued development of mathematical, statistical, and computational framework leading to robust underlying approaches for automated information integration of disparate sources of data.\n- Continued research in cognitive radio and networking protocols.\n- Continued research on novel switched mode techniques to overcome radiation efficiency limit in electrically small antennas.\n- Continued research in cross-layer wireless protocols for delay sensitive network traffic.\n- Continued multidisciplinary research efforts to focus on intelligent control systems, cooperative behavior modeling and response, UxV-human interactions and adaptive mission methodologies.\n- Continued development of an interaction model of how users characterize visual content and context to improve video surveillance.\n- Continued development of improved formal foundations, methods, and tools for compositional verification and construction of high assurance software systems.\n- Continued investigation of relational constructive induction, semi-supervised learning, and classifier ensembles to improve collective classification technology and operations based automated decision aids.\n- Continued research aiming to develop principled, trustworthy, yet practical and usable approaches to address the issue of software producibility and the development of complex software systems with ensured interoperability.\n- Continued research into anti-tamper and information assurance: research focused on protection techniques, architectures, algorithms, protocols that allow for security and cyber situational awareness.\n- Continued research to develop mathematical and computational tools for compressive sensing.\n- Continued the development of theory and algorithms for quantum communications.\n- Continued efforts addressing the representation, computation, and analysis of information from large diverse data sets.\n- Continued research efforts to develop tools for proactive information assurance and cyber space security.\n- Continued multidisciplinary research efforts on reasoning for image understanding in uncertain environments.\n- Continued multidisciplinary research efforts to provide information assurance foundations for countering the Botnet threats.\n- Continued research efforts addressing computational complexity arising from network-enabled computing, such as cyber security, information integration, and intelligent autonomy of networked, cooperative systems.\n- Continued mathematical studies to understand the micro-physics of a liquid-solid-gas interaction in turbulent flow conditions.\n- Continued research efforts for mathematical development of physics-based computational and signal processing techniques for understanding and characterizing biological-acoustical coupling in acoustic wave propagation and scattering.\n- Continued effort to optimize quantum communication bandwidth in noisy environments by developing a new mathematical representation of quantum information.\n- Continued research on mathematical and computational building blocks for machine reasoning and intelligence.\n- Continued multidisciplinary research efforts on knowledge representation and reasoning for decentralized autonomy.\n- Continued research efforts on algorithmic solutions and explicit measurement schemes for networks inference and monitoring.\n- Continued research on novel techniques for interference mitigation.\n- Continued efforts to develop computer sciences foundation for quantum information sciences leading to new ways of computing and communication.\n- Continued research to develop a theory of trust-based traffic security by creating models of trust, network structure and dynamics, and incentives and economics.\n- Continued research to develop the foundation for new techniques that enable the adaptive characterization of evolving computer network traffic patterns.\n- Continued research on distributed network synchronization.\n- Continued efforts to extend theory of quantum communication channels beyond completely positive channels.\n- Continued efforts to leverage node cooperation to counteract interference in tactical networks.\n- Continued research into improving the perceptual abilities of autonomous systems by developing a unified theory of perception and context that includes spatial and co-occurrence context to enable autonomous systems to effectively reason about context as part of the perceptual process.\n- Continue studies of analog intelligent nanoelectronics computational architecture (transfer from SEEW).\n- Continued research on optical and plasmonic properties of graphene in infrared (IR) and terahertz (THz) spectral regions (transfer from SEEW).\n- Continued research on 2D materials other than grapheme (transfer from SEEW).\n- Continued research on chemical synthesis of carbon nanostructures (transfer from SEEW).\n- Continued research towards detecting and manipulating Majorana fermions in condensed matter systems (transfer from SEEW).\n- Continued studies of topological insulator materials and novel device concepts exploiting properties of transport in their protected electronic state (transfer from SEEW).\n- Continued research on spin dynamics in Group IV semiconductors and related device concepts (transfer from SEEW).\n- Continued research efforts on non-conventional nanofabrication that hold promise for sub-10nm resolution (transfer from SEEW).\n- Continued research on defect engineering and characterization in grapheme (transfer from SEEW).\n- Completed research on duel-STM characterization of graphene film (transfer from SEEW).\n- Completed studies of chemical vapor deposition (CVD) of graphene on copper (transfer from SEEW).\n- Completed research on spin properties in topological insulators (transfer from SEEW).\n- Initiated tip-based atomic-scale nanofabrication program (transfer from SEEW)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.190"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete research on novel techniques for interference mitigation.\n- Complete research in cross-layer wireless protocols for delay sensitive network traffic.\n- Complete research on novel switched mode techniques to overcome radiation efficiency limit in electrically small antennas.\n- Initiate research on dynamic military communications under spectral, spatial and temporal uncertainty.\n- Initiate research on broadband channel receiver architectures with interference suppression.\n- Initiate research on capacity limits and optimal transmission strategies for heterogeneous networks.\n- Initiate research on prioritization, latency, and end-to-end service level guarantees in heterogeneous networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.391"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Communications and Networking\n\nContinue basic research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, SATCOM performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nExtramural Quantum Information Sciences\n\nContinue basic research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nExtramural Nanoscale Computing Devices and Systems\n\nDiscover and develop novel techniques for synthesis, assembly and characterization of molecular scale (sub-10nm) nanographene structures for their electronic, optical, magnetic and quantum functionalities. Research, assess, test and develop alternative computing architectures (beyond von-Neumann), including but not limited to, various implementations of neuromorphic architectures and quantum information systems.\n\nExtramural Mathematical Data Science\n\nContinue basic research in mathematics, probability, statistics, signal processing, machine learning, data engineering, and information theory. The program aims to develop rigorous mathematical and algorithmic answers to questions that are currently addressed using heuristics or non-principled approaches. Focus is on problems in learning and inference from both big and small data, representation of data, modeling dynamical properties of and determining causal effects in complex networks, multi-modal, multi-scale information integration, and decision making under uncertainty.\n\nExtramural Machine Learning, Reasoning and Intelligence\n\nContinue basic research in the area of building intelligent agents that can function in the environments in which warfighters operate, that is, environments that are unstructured, open, complex and dynamically changing. Agents (cyber or physical) do not yet have the level of intelligence needed to operate in such open, uncertain and unpredictable environments either independently or alongside warfighters. In the area of Intelligence for Autonomous Agents, basic research includes the development of principles for machine intelligence, efficient computational methods, algorithms and tools for building versatile smart agents that can perform missions autonomously with minimal human supervision and collaborate seamlessly with teams of warfighters and other agents. In the area of Image Understanding, basic research includes the development of theory and algorithms for understanding surveillance imagery, for semantic search of visual datasets, and for autonomous agent perception. The main focus is on reconstructing 3D scenes, recognizing object classes and specific objects, recognizing activities and events, inferring intentions, as well as succinct natural language descriptions of images and video.\n\nExtramural Applied and Computational Analysis Program\n\nContinue basic research in modern and classical mathematical analysis with emphasis on mathematical and computational models of physical phenomena. Naval interest in waves, flows, materials, structures, and information processing motivates research in the areas of multi-phase, multi-physics, including analytically rigorous and computationally robust and efficient modeling of fatigue, fracture, dislocation, nucleation, shocks and contact lines; dynamical systems, and oceanic and atmospheric modeling, including fluid transport, mixing, and predictability of models for nonlinear dynamics; and inverse problems arising from acoustic and electromagnetic wave propagation and scattering.\n\nExtramural Cyber Security and Complex Software Systems\n\nContinue basic research in computing systems and complex software systems that meet required assurances for security, safety, reliability and performance to measurably improve the information-processing challenges of future naval systems.  Cyber Security sub-program investigates and develops wide-ranging principles and techniques for continuously maintaining confidentiality, integrity, and availability of information and information infrastructures, focusing on the software, the hardware and the network. The program seeks to establish an autonomic, secure and dependable informational infrastructure toward achieving Information Dominance. Complex Software sub-program investigates principles, algorithms and methods, and develops software engineering tools for achieving efficient, timely, robust and secure software executables, focusing on science for software construction, correctness and efficiency by revisiting software development and deployment methodology. Efficient, timely, robust and secure software is a requirement for secure information infrastructure toward achieving Information Dominance.\n\nExtramural Networked Sensing\n\nContinue basic research in optical components and infrared technologies including lasers and focal plane arrays using narrow bandgap semiconductors for the purpose of imaging through clouds, fog, haze and dust; persistent surveillance for severely size constrained airborne applications; detecting anomalies and targets; and autonomous sensing for UAV platforms and networked sensing over multiple sensors and\/or sensor platforms.\n\nExtramural Mathematical Optimization and Operations Research\n\nContinue basic research in mathematical optimization. The primary focus of the program's basic-research portion is linear, nonlinear, integer and combinatorial optimization. Theoretical development, algorithm design and analysis, computational techniques, and software prototypes for solving large-scale problems are of interest. Techniques that produce provably optimal or near-optimal solutions, as well as techniques applicable to large problem domains are favored.  This includes, but is not limited to, cutting-plane and polyhedral techniques for mixed-integer programming and interior-point and first- order algorithms for conic\/convex optimization. Decentralized optimization is an area of growing interest, as are innovative techniques for dealing with uncertainty, such as stochastic, robust, and online optimization.\n\nIntramural Information Technology\n\nConduct basic research to address the continued need for improving the operational capability of Naval information and communication systems in the areas of: high assurance software; secure tactical connectivity; intelligent autonomy; and the processing, integration, and presentation of information. The expected payoff is: the development of improved methods for producing, analyzing, and securing Naval software systems; new design concepts for future Naval tactical communication systems and networks; intelligent autonomy and improved interaction with autonomous systems; and improved methods for analyzing, integrating, and presenting information to users. Given the pervasiveness of software, the techniques developed in this task area should also reduce cost and increase quality of Naval systems and are expected to be applicable to a wide variety of military and civilian problems.  Accomplishments include:  Developed a machine perception algorithm that detects anomalies with a true positive rate of 91.4% and a false positive rate of 8.71%;  Developed and prototyped several new algorithms for proving security properties of computer code;  Developed and initiated evaluation of a near-real time system (2-10ms lag) for detecting procedural uncertainty which can indicate when a human subject is about to make an error."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MATERIALS\/PROCESSES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: structural materials; functional materials; maintenance reduction; environmental sciences; undersea warfare, materials and chemistry, and manufacturing science. Accomplishments and plans described below are examples for each effort category. This activity also includes Secretary of Defense directed peer-review basic research to develop innovative solutions and enhance the science and engineering base.\n\nFunding increase in 2018 is the result of several increased research initiatives in the area of Extramural Structural Materials.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.182"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Structural Materials\n- Continued development of first-principles based methodologies for predicting the thermodynamics and kinetics controlling microstructural evolution for the design of advanced weldable, naval steels.\n- Continued quantification of the corrosion effects on fatigue to be incorporated into the Unified Damage Model (UDM) and validated in a few environmental cases on P-3 aircraft real loads data.\n- Continued investigating new carbon nanotubes growth methodologies for improved mechanical behavior of advanced composites in next generation ship and aircraft structures.\n- Continued development of theoretical basis for composite materials behavior based on x-ray computed microtomography.\n- Continued development of understanding and constitutive models of dynamic behavior of naval steels.\n- Continued evaluating environmental effects on marine composites and sandwich structures.\n- Continued exploration of composition, processing and microstructural evolution in titanium alloys for marine structures.\n- Continued exploration of multienergy processes for zero maintenance coatings.\n- Continued investigation of a rapid annealing of surface layers and their effects.\n- Continued the investigation of processing science (single crystals, coatings, thermal barrier coatings (TBC), heat treatment, etc.) to materials performance for turbine engine components to develop relevant process protocols to optimize and control quality.\n- Continued to advance the understanding of processing and deformation mechanisms in nanostructured ceramic composites and metal alloys to provide new high strength \/ high toughness materials for Naval platforms.\n- Continued to investigate the use of photorefractive crystals for the demodulation of a distributed fiber optic Bragg gratings structural health monitoring system.\n- Continued research on new hybrid composites that integrate polymers, structural fibers, carbon nanotubes, ceramics and metals, with improved blast, ballistic, fire resistance and mechanical characteristics with special emphasis at the interfacial aspects of the new materials.\n- Continued efforts to understand and predict salt chemistry effects on high temperature coatings and materials in naval gas turbine environments.\n- Continued establishing fundamental understanding of the dynamic response and failure of marine composites for development of modeling tools for enhancing dynamic response and projectile resistance for and sandwich structures, and develop modeling tools.\n- Continued development of new methods for room temperature curing and processing of polymer composites with high temperature thermoxidative stability and fire resistance.\n- Continued assessment of the blast resistance of cellular structures as functions of soil characteristics.\n- Continued materials and fabrication science for fugitive phase processes for engineered topological structures for vehicle blast and fragmentation protection.\n- Continued exploration of fundamental mechanisms and initiate development of physics-based models of electrophoretic deposition of ceramic nanoparticles and subsequent sintering.\n- Continued physics based models for coupled phenomena in marine composite structures (thermo-mechanical loads, environmental effects, and fluid-structure interactions.)\n- Continued Computer-Aided Materials Design (CAMD) for discovery, synthesis and testing of various materials.\n- Continued structure and properties of liquid and glassy metals.\n- Continued first-principles based methodologies for predicting the thermodynamics and kinetics controlling microstructural evolution for the design of advanced weldable, naval steels.\n- Continued scientific basis for the rational engineering design of Al-alloys for Naval applications.\n- Continued development of refractory solid metal carbide composites from metal \/ polymer precursors.\n- Continued establishment of mechanics of crack propagation in aluminum structures, and explore concepts for enhancing fracture resistance.\n\nFunctional Materials\n- Continued research tools design efforts in electromagnetic and acoustic bandgap materials.\n- Continued study of new transduction mechanisms.\n- Continued development of the science and technology base for a highly efficient and stable flexible organic solar cell.\n- Continued investigation into the properties and fabrication of novel ceramics which have potential to combine hardness, strength, and high transmission in the long wave infrared (LWIR) spectral region.\n- Continued effort to synthesize beta-SiC power suitable for subsequent densification into transparent beta-SiC ceramic.\n- Continued meta-materials effort to develop negative index materials with dynamic frequency response.\n- Continued synthesis and property measurement of new sonar materials predicted by first principle methods.\n- Continued expansion of first-principles methods devised to calculate piezoelectric properties of materials for sonar transducers to calculate additional materials properties for other applications.\n- Continued design, processing, and measurements to fashion the new generation of high-strain, high coupling piezoelectric single crystals into high-performance acoustic transducers for naval sonar systems.\n- Continued basic research into material technology associated with the development of active and conventional armor.\n- Continued effort to characterize regenerative bacterial nanowires.\n- Continued effort to synthesize cyclic peptide ring modules and polymerize them into peptide nanotube polymers.\n- Continued efforts to utilize chemically modified virus proteins as a scaffold to assemble nanostructured metamaterials with unique optical properties including negative index of refraction.\n- Continued effort to develop surface electrons on diamond.\n- Continued efforts to develop oxide materials for power management, sensors, and information storage\/processing.\n- Continued effort to use elastic pentamode metafluid materials for acoustic cloaking.\n- Continued effort to develop conjugation strategies that can allow the efficient attachment of multiple biological moieties to nanoparticles (NPs) in a controlled manner.\n- Continued examination of the effects of acoustic perturbations and interactions in reacting flows and determine how they can be used.\n- Continued effort to characterize the properties of chemically reactive flows subject to non-Kolmogorov or non-equilibrium turbulence, or that creates these types of turbulence.\n- Continued exploratory synthesis, electromechanical property evaluation and atomic level analysis of new quaternary piezocrystals in order to optimize materials properties for specific Navy SONAR applications.\n- Continued development of advanced nanostructured magnetic materials for energy applications.\n- Continued study of Actuatable Peptidyl Motifs for the Nanoscale Control of Materials within Biological Systems.\n- Continued study of Nanoscale Measurements of Protein Modification in Live Cells.\n\nMaintenance Reduction\n- Continued development of corrosion models.\n- Continued mechanistic studies of materials deterioration under chemical environment for ship materials and their interfaces.\n- Continued stainless steel carburization study to enhance corrosion performance.\n- Continued the concept study of multiscale corrosion modeling on naval ship materials.\n- Continued corrosion prediction using an integrated deterministic-based model.\n- Continued modeling and simulation of corrosion phenomena.\n- Continued studies of surface microstructure optimization to enhance corrosion properties of navy marine alloys\n- Continued sensor development for monitoring microstructural changes on alloys under thermal and mechanical stresses.\n- Continued research focused on modeling and simulation for platform and system affordability, lifetime materials, shipboard wireless capability, automation to reduce manning.\n- Continued development of ab initio models of corrosion reactions.\n- Continued development of coatings capable of actively responding to environmental stresses.\n- Continued study of coating failure mechanism on coating-substrate interface.\n- Continued research on innovative concepts for effective radiation barrier coatings and ultra-low thermal conductivity barrier coatings.\n- Continued development of environmental corrosivity modeling.\n- Continued development of nanoscale modeling of corrosion kinetics.\n- Continued development of surface tolerant coatings.\n- Completed fundamental theoretical and experimental studies on nanoscale corrosion of metals and alloys.\n- Completed grain boundary engineering to improve corrosion resistance of marine grade aluminum alloys.\n\nEnvironmental Science\n- Continued examination of scientific methods for pollution prevention, waste reduction, and hazardous material reduction for Naval Operations.\n- Continued broad based program in anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy.\n- Continued effort to determine most promising foul-release approaches based on silicones to meet Navy durability requirements.\n- Continued effort to develop Reverse Osmosis (RO) pre-treatment strategies to allow water recycling on ships.\n- Completed efforts on treatment strategies of oily water containing synthetic lubricants.\n\nManufacturing Science\n- Continued a multidisciplinary research task into furthering the sciences associated with advances in manufacturing processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "52.942"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Structural Materials\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete investigation of processing science (single crystals, coatings, thermal barrier coatings (TBC), heat treatment, etc.) to materials performance for turbine engine components to develop relevant process protocols to optimize and control quality.\n- Complete research on new hybrid composites that integrate polymers, structural fibers, carbon nanotubes, ceramics and metals, with improved blast, ballistic, fire resistance and mechanical characteristics with special emphasis at the interfacial aspects of the new materials.\n- Complete structure and properties of liquid and glassy metals.\n- Initiate assessment of materials that incorporate directed energy, ballistic, and blast resistance for structural protection.\n\nFunctional Materials\n- Continue all efforts of FY 2016.\n\nMaintenance Reduction\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nEnvironmental Science\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nManufacturing Science\n- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "56.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "56.980"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Structural Materials\n\nConduct basic research related to critical S&T for structural materials, including, but not limited to, the following: computer-aided materials design (CAMD), structural metals, polymer composite materials, solid mechanics, propulsion materials, sensors & NDE prognostics and structural cellular materials.\n\nExtramural Functional Materials\n\nConduct basic research related to critical S&T for functional materials, including, but not limited to, the following: electronic materials, transduction materials, nanoparticles, bacterial nanowires and oxide materials. Expand research related to acoustic transduction science.\n\nExtramural Maintenance Reduction\nConduct basic research related to critical S&T for maintenance reduction, including, but not limited to, the following: corrosion models, stainless steel carburization, corrosion, and coatings.\n\nExtramural Environmental Science\n\nConduct basic research related to critical S&T for environmental science, including, but not limited to, the following: examination of scientific methods for pollution prevention, waste reduction, and hazardous material reduction for Naval Operations, anti-fouling and fouling release coatings including investigation of effect of new polymers, materials, processes, and novel testing methodologies for coating efficacy, and Reverse Osmosis (RO) pre-treatment strategies. Expand research related to naval environmental science.\n\nExtramural Manufacturing Science\n\nConduct basic research related to critical S&T for manufacturing science, including, but not limited to, the following: multidisciplinary research task into furthering the sciences associated with advances in manufacturing processes.\n\nIntramural Undersea Warfare  \n\nConduct basic research focused on creating new techniques for detecting, visualizing, understanding, predicting, exploiting, and controlling the interactions between acoustic and elastic waves, structures, the fluid in which they are immersed, and other fields; building compliant based multifunctional material platforms for the advancement of acoustic sensors, receivers, and filters in underwater battle space environments; and enabling enhanced capabilities, such as passive signal modulation, larger acoustic attenuation in confined spaces, and structural overlays, that can render an otherwise opaque material transparent to acoustic propagation.  This work strives to control and exploit the \"structural acoustic\" response of underwater structures for both stealth and sensor system applications and relates directly to the Navy's need for acoustic materials having improved performance for shallow water Anti-Submarine Warfare (ASW).\n\nIntramural Materials and Chemistry\n\nConduct basic research in advanced materials which depends on novel synthesis, processing, characterization, and performance. This effort addresses all materials including metals, alloys, ceramics, composites, semiconducting and superconducting material and bimolecular materials.  Studies include, to uncover the mechanisms in the nanometer scale, the effect of coatings on the conductions of iron and electrons. A key part includes developing a better understanding on the performance of spin-polarized electrons for advanced electronic switches and memories.  Develop fundamental understanding of electron transfer pathways in microbial consortia and relate the indefinite power generation in benthic regions.  Continue research into understanding the mechanism of the order of magnitude in advance composites consisting of soft polymers and nanoparticles with an effort to design advanced light weight armor."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL\/BIOLOGY"
                                    },
                                    "Description": {
                                        "val": "Efforts include: This activity comprises efforts within the medical and biological sciences. These efforts are coordinated across the Tri-Service community through joint program reviews and meetings and are complementary, not duplicative. Efforts include: Bio-inspired autonomous and surveillance systems, and bio-inspired processes, materials and sensors; synthetic biology for Naval applications; casualty care and management; casualty prevention; undersea medicine\/hyperbaric physiology; biorobotics; expeditionary operations training; stress physiology and regenerative medicine\n\nFunding increase in 2018 is the result of increased research initiatives primarily in the area of Naval Biosciences and Synthetic Biology for Sensing & Energy Production.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.205"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Medicine-\n- Continued work on stress physiology, hyperbaric physiology, and biological effects of Naval operational exposures.\n- Continued work in understanding the mechanisms of decompression illness and hyperbaric oxygen toxicity.\n- Continued research to explore mechanisms of \"ultrasonic\" hearing in divers.\n- Continued interventions to mitigate underwater sound\/blast effects.\n- Continued research on improved trauma management in submarine Special Forces operators.\n- Continued research on physiological and genetic effects of long-term diving.\n- Continued research on individual susceptibilities in extreme environments to include hypoxic and\/or hypobaric conditions.\n- Continued research to assess the effects of hyperbaric oxygen therapy on blast-induced histopathological changes.\n- Continued research into the effects of hyperbaric environments on cellular biology (metabolism and signaling).\n\nBiomedical Sciences and Environmental Physiology-\n- Continued research in casualty care and management and casualty prevention, including investigations of mechanisms of hemorrhagic shock, blast injury, tissue repair, and the biomedical effects of military operational exposures such as directed energy, hazardous chemicals, and sound.\n- Continued research to explore systematic relationships between cognitive and physiological responses to laboratory tasks under operational conditions.\n- Continued research to explore a novel opioid that will produce analgesia as effective as morphine, with minimal side effects.\n- Continued research in genetic basis of psychological stress.\n- Continued research in mitigation of the effects of sleep deprivation.\n- Continued research in stress effects on the immune system.\n- Continued research with Army, in regenerative medicine (Armed Forces Institute for Regenerative Medicine (AFIRM)).\n- Continued research to discriminate fatigue and stress performance effects.\n- Continued research to evaluate the effects of chronic stress on performance.\n- Continued research on individual susceptibilities on health and human performance in military environments to include heat, cold, enclosed spaces, pressure and acceleration.\n- Continued research on the mechanisms of nitrogen narcosis\/high pressure nervous syndrome.\n- Continued investigations of mechanisms of blast-induced neurotrauma at the cellular level.\n- Initiated research in partnership with the Army to study regenerative medicine (Armed Forces Institute for Regenerative Medicine II (AFIRM II)).\n- Initiated research to investigate novel mechanisms to manage the mammalian circadian system for optimized health and performance.\n- Initiated research to develop strategies for nerve cell regeneration.\n\nBiological Sciences:\n\nNaval Biosciences-\n- Continued efforts focused on microbe-materials interfacial interactions for detection of materials defects\/failures, including corrosion, and for improved energy harvesting.\n- Continued efforts in \"smart cell engineering\" to design microbes that can sense and destroy other microbes through antibiotic production, or can \"sense\" and qualify their surrounding environment and provide information back to the user.\n- Continued research on biofouling with emphasis on barnacle adhesion studies using molecular biology tools.\n- Continued research on invertebrate larval settlement and metamorphosis in response to biofilms and various inhibitors of adhesion.\n- Continued efforts to identify molecular biomarkers for battlefield injuries, and high-fidelity biosensors for detection in vivo.\n- Continued research into biomolecular 'logic controllers' for in vivo biosensor and in vivo drug delivery systems.\n- Continued synthetic biology efforts for designing organisms with non-natural functions (e.g., light detection, electrical 'switch' capability, magnetic field production).\n- Continued research to identify natural product inhibitors of bacterial folate biosynthesis for development as antibiotics.\n- Continued studies to control the synthesis of patterned materials from the nano-scale to the micro-scale using bionanotechnology.\n- Continued research on characterizing\/manipulating human gut microbiome to understand its role in response to behavioral and physical stressors.\n- Continued research to integrate programmable, externally-controlled \"sensor\" cells into micro-robotic devices.\n- Continued research to characterize gut microbiota in real-time, in vivo.\n- Initiated research on tubeworm adhesion science using molecular biology tools.\n\nLife Sciences and Bioengineering-\n- Continued combinatorial chemical screens for bacterial communication pathway inhibitors as potential antibiotics or fouling control agents.\n- Continued work to identify plasma biomarkers of domoic acid toxicosis and leptospirosis in California sea lions, and develop a multiplexed assay to measure those plasma biomarkers.\n- Continued research on stem cells in marine mammals and their potential clinical role.\n- Continued development of a second set of molecular diagnostic tests for recently discovered viral pathogens of marine mammals.\n- Continued efforts to investigate DNA-scaffold-directed assembly of protein nanoarrays for control over orientation and position of proteins, and investigate triggered isothermal assembly of DNA nanostructures.\n- Continued efforts in comparing commensal\/pathogenic microbiomes in to Atlantic bottlenose dolphin and California sea lion, and for the dolphin diagnosed with chronic\/active gastritis.\n- Continued development of new tools and techniques for the engineering and characterization of DNA nanostructures and the control of DNA based nanodevices.\n- Continued the investigation of the material properties of silk proteins in order to facilitate development of applications.\n- Continued development of field portable sensing platforms for explosives detection.\n- Continued studies on environmental effects on marine invertebrate biofouling.\n\nNeural, Sensory and Biomechanical Systems-\n- Continued research efforts focused on developing bio-inspired sensors, vehicles and systems for local Intelligence, Surveillance and Reconnaissance (ISR), Weapons of Mass Destruction (WMD) detection, personnel protection and affordability. Research elements include advances in microfabrication, biological materials, processing techniques, robustness and efficiency of systems.\n- Continued research in elucidation of mechanisms of fish electric sense and near field low frequency acoustic perception.\n- Continued research on bacterial\/cellular controllers for nano\/micro-systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.283"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Medical Sciences\n\nUndersea Medicine-\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nBiomedical Sciences and Environmental Physiology\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Initiate research to investigate novel mechanisms to manage the mammalian circadian system for optimized health and performance.\n\nCombat and Operational BioMedicine\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Initiate efforts to study injury mechanisms induced by underwater blast.\n- Initiate efforts to study bioderived systems to produce fieldable therapeutics.\n\nBiological Sciences\n\nNaval Biosciences\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Initiate synthetic biology research in bioelectronics and information processing.\n\nLife Sciences and Bioengineering\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nNeural, Sensory and Biomechanical Systems\n- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Medical Sciences: \n\nUndersea Medicine\n\nConduct basic research into stress physiology, hyperbaric physiology, and biological effects of Naval operational exposure. Explore the mechanisms of decompression illness, hyperbaric oxygen toxicity and \"ultrasonic\" hearing in divers. Determine ways to mitigate underwater sound\/blast effects. Improve trauma management in submarine Special Forces operators. Research the physiological and genetic effects of long-term diving including in extreme environments (hypoxic and\/or hypobaric conditions). Assess the effects of hyperbaric oxygen therapy on blast-induced histopathological changes. Continue research into the effects of hyperbaric environments on cellular biology (metabolism and signaling).\n\n\nBiomedical Sciences and Environmental Physiology\nConduct basic research to explore systematic relationships between cognitive and physiological responses under operational conditions. Research the effects of psychological and physiological stress, sleep deprivation and fatigue on the immune system and human performance. Investigate novel mechanisms to manage the mammalian circadian system for optimized health and performance. Research the mechanisms of nitrogen narcosis\/high pressure nervous syndrome. Explore novel opioids with minimal side effects. Study bioderived systems to produce fieldable therapeutics. Develop strategies for nerve cell regeneration. Research regenerative medicine in concert with the Armed Forces Institute for Regenerative Medicine (AFIRM). \n \nCombat and Operations BioMedicine\n\nConduct basic research in casualty care and management and casualty prevention, including mechanisms investigations of hemorrhagic shock, blast injury, tissue repair, and the biomedical effects of military operational exposure such as directed energy, hazardous chemicals, and sound. Explore health and individual performance under various military environments such as heat, cold, enclosed space, pressure and acceleration. Investigate the mechanisms of blast-induced neurotrauma at the cellular level, including underwater blasts. Initiate investigations of multi-scalar mechanisms of military occupational hazard and injury generation, detection, and repair, such as cavitation and directed energy.  \n\nBiological Sciences:\n\nNaval Biosciences\n\nComplete basic research into tubeworm adhesion and marine biofouling. Investigate microbe-materials interfacial interactions for detection of materials defects\/failures, including corrosion, and for improved energy harvesting.  Investigate \"smart cell engineering\" to design microbes that can sense and destroy other microbes and provide feedback to the user. Continue research on invertebrate larval response to biofilms and various inhibitors of adhesion.  Identify molecular biomarkers for battlefield injuries, and high-fidelity biosensors for detection in vivo. Study biomolecular 'logic controllers' for in vivo biosensor and drug delivery systems. Research into synthetic biology to further efforts for designing organisms with non-natural functions (e.g., light detection, electrical 'switch' capability, magnetic field production). Identify natural product inhibitors of bacterial folate biosynthesis for development as antibiotics. Control the synthesis of patterned materials from the nano to micro-scale using bionanotechnology. Understand the role of human gut microbiome to behavioral and physical stressors. Integrate programmable, externally-controlled \"sensor\" cells into micro-robotic devices. Study synthetic biology bioelectronics and information processing. Initiate synthetic biology of gut microbes for warfighter resilience.\n\nLife Sciences and Bioengineering\n\nComplete the development of molecular diagnostic tests for recently discovered viral pathogens in marine mammals.  Conduct basic research into combinatorial chemical screens for bacterial communication pathway inhibitors as potential antibiotics or fouling control agents. Identify plasma biomarkers of domoic acid toxicosis and leptospirosis in California sea lions, and develop a multiplexed assay to measure those plasma biomarkers. Research the potential clinical role of marine mammal stem cells.  Investigate DNA-scaffold-directed assembly of protein nanoarrays for control over orientation and position of proteins, and investigate triggered isothermal assembly of DNA nanostructures. Compare commensal\/pathogenic microbiomes in Atlantic bottlenose dolphin, California sea lion, and in dolphin diagnosed with chronic\/active gastritis. Develop new tools and techniques to engineer and characterize DNA nanostructures and control DNA based nanodevices. Investigate the material properties of silk proteins to facilitate application development. Develop field portable sensing platforms for explosives detection. Study environmental effects on marine invertebrate biofouling.\n\nNeural, Sensory and Biomechanical Systems\n\nConduct basic research into the development of bio-inspired sensors, vehicles and systems for local Intelligence, Surveillance and Reconnaissance (ISR), Weapons of Mass Destruction (WMD) detection, personnel protection and affordability including microfabrication, biological materials, processing techniques, robustness and systems efficiency. Research the elucidation of mechanisms of fish electric sense and near field low frequency acoustic perception. Investigate bacterial\/cellular controllers for nano\/micro-systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OCEAN SCIENCES"
                                    },
                                    "Description": {
                                        "val": "Efforts include: The Ocean Sciences sub activity supports basic research in the ocean domain and the impact that this complex and changing environment has on naval operations. The effort encompasses research over a wide variety of regions, including the open ocean, Arctic, and littorals, and addresses scientific issues relevant to anti-submarine warfare (ASW) including acoustic propagation and the impact of acoustics on marine mammal behavior. The improved understanding of the ocean environment enables the development of fully coupled (ocean-atmosphere-wave-ice) global, regional and local predictive models that can be used for operational planning at tactical, strategic and climate scales. The program is strongly aligned with the Oceanographer of the Navy (N2\/N6E) and the research topics addressed by this sub activity reflects the priorities for improved forecasts of the operational environment and the development and use of autonomous systems for the collection of environmental observations and continuing support to research vessels of the U.S. Academic Research Fleet for operations and maintenance that enable science at sea. Research performed under this Sub Activity includes efforts in the following areas: littoral geosciences and optics, marine mammals and biology, physical oceanography and prediction, and ocean acoustics. Accomplishments and plans described below are representative highlights from these efforts. \n\nIncrease in 2016 is the result of initiation of several Department Research Initiatives in several oceanographic processes impact mission concerns. Decrease in 2017 is reflected by the decrease in investment in core Physical Oceanography.\n\nFunding increase in 2018 is the result of several increased research initiatives in the areas of Ocean Acoustics, Physical Oceanography Processes, Marine Mammals, and Littoral Geoscience and Optics.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "73.443"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Littoral Geosciences and Optics\n- Continued efforts to investigate the effects of oceanic biota on the propagation and inversion of multifrequency acoustical energy.\n- Continued investigations of sources and properties of light scatter within the coastal ocean.\n- Continued to investigate and characterize the impact of riverine sources of optically-important matter on underwater visibility, navigation, and surveillance.\n- Continued effort to understand the extent and intensity of seafloor gas hydrate accumulations and coastal bio-optical response to air-ocean forcing.\n- Continued programs to estimate optical properties of coastal ocean water from above-surface sensing, using in situ data for validation.\n- Continued studies to predict tidal flat evolution in coastal\/riverine\/estuarine systems.\n- Continued incorporation of improved understanding of tropospheric and stratospheric bulk exchanges, air-sea interface, boundary layer interface, coastal ocean dynamics, gas hydrate accumulation, and biological responses into atmospheric and ocean prediction models and tactical aids.\n- Continued development of prediction models for distributaries deltaic coastal environments.\n- Continued field, modeling and remote sensing studies of currents, waves, sediment transport and bathymetric evolution of river mouth and inlet environments.\n- Continued investigations of radar, hyperspectral and electro-optical remote sensing signatures in littoral environments.\n- Continued development of a new method of data assimilation, adjointless 4D-Var through a combination of theoretical analysis and numerical simulations to develop the method and estimate its efficiency with respect to the traditional 4D-Var scheme as well as to use it to generate a sensitivity analysis for targeted observations.\n- Continued the effort to identify and isolate the dynamical processes that control the structure and variability of the Kuroshio and Ryukyu Current using a combination of numerical model simulations and observations and, explore their interactions between the Ryukyu Island passages.\n- Continued studies of Coupled Human-Landscape Interactions in Low-lying Coastal Environments.\n- Continued studies of data-assimilative modeling for coupled nearshore-riverine systems.\n- Continued the effort to understand and quantify the impact of land fluxes of freshwater and dissolved bio-optical constituents upon the diurnal and small-scale (days, meters to microstructure) coastal upper ocean response to atmospheric forcing.\n- Continued research efforts to observe, understand, and predict the many intertwined geophysical processes which are present on the inner shelf.\n\nMarine Mammals and Biology\n- Continued field trials of an integrative ecosystem study to provide environmental predictors of whale presence or absence to reduce impacts of Naval systems to marine mammals.\n- Continued new efforts on tracking of marine mammals using data fusion based on tags and remote sensing.\n- Continued new efforts to examine physiology of marine mammals in situ and to predict consequences of physiological and auditory stress to populations.\n\nPhysical Oceanography and Prediction\n- Continued field studies\/modeling to predict propagation and effect on acoustics of non-linear internal waves in the western Pacific.\n- Continued development of a ship wave radar driven wave model to allow high resolution studies of near surface ocean processes and to support Sea Basing.\n- Continued design evaluation for a persistent mobile sampling network based on autonomous undersea vehicle platform and sensor technologies.\n- Continued field programs that demonstrate persistent monitoring and measurement of environmental structures using gliders.\n- Continued workshops to define science needs for Sea Basing.\n- Continued an integrated modeling and field experiment on determining custom self-learning wave databases and forecast systems\/ship-movement and engineering systems for Sea Basing.\n- Continued an Estuarine-Littoral Processes Interaction field study in muddy and tidal flat dominated regimes including a data assimilative prediction capability.\n- Continued studies of complex ocean currents in the Indian Ocean using gliders and remote sensing methods being developed to support tactical oceanography.\n- Continued studies of internal waves and strait dynamics emphasizing field studies in the Celebes, Philippine, and Sulu Seas.\n- Continued studies to understand how to sample ocean processes with gliders and other autonomous and remote sensing systems to support tactical oceanography.\n- Continued to develop state of the art numerical model assimilation and initialization techniques, improved physical parameterizations, air-sea interactions, and fidelity for atmospheric and ocean prediction systems.\n- Continued development of expert system methods to characterize and predict Riverine\/estuarine systems to support Naval Special Warfare, Marine Expeditionary Forces and new Riverine units.\n- Continued studies of complex ocean currents in the Indian Ocean using gliders and remote sensing methods being developed to support tactical oceanography.\n- Continued studies of ocean and wave response to typhoons and monsoons in the Western Pacific.\n- Continued studies of how to predict the 'full battle space environmental cube' using networked sensors and multiply coupled ocean\/wave\/atmosphere\/acoustic prediction systems to provide Seabase and Fleet\/Force protection.\n- Continued extensive 3-year field program on prediction of internal waves.\n- Continued extensive internal wave field program off the New Jersey Shelf; field work will coincide with and complement the Shallow Water Acoustics program.\n- Continued an assessment of the role of emerging sub-mesoscale parameterization techniques for improving next generation high resolution\/high accuracy environmental models.\n- Continued studies of complex ocean currents in the Indian Ocean using gliders and remote sensing methods being developed to support tactical oceanography.\n- Continued the field and modeling experiments to determine the lateral dispersion and maxing parameterization needed to understand model turbulence and to model ocean circulation.\n- Continued an effort to understand the dynamics that govern spiciness variability, its impact on ocean circulation, and the competing roles temperature and salinity have on ocean density and sound speed structure evolution.\n- Continued a field and modeling effort to understand and predict the generation and variability of western boundary currents in the Pacific Ocean.\n- Continued a field and modeling effort to understand the coupled physical processes that result in the propagation of the air-sea mode known as the Madden-Julian Oscillation in the Indian Ocean.\n- Continued a field and modeling program to investigate the structure and circulation of the South China Sea and oceanographic variability along the coast of Vietnam.\n- Continued studies of the coupled atmosphere-ocean-cryosphere-wave physics from the submesoscale to decadal climate scales to permit development of new global coupled modeling systems.\n- Continued studies of changes in the Arctic oceanography, meteorology and cryosphere and associated processes to allow permit development of new prediction models for the Arctic.\n- Continued arctic research to develop a new generation of ocean-ice-atmosphere dynamic prediction models, including process studies involving remote sensing and in-situ observations.\n- Continued collaborative studies with Vietnam to observe and model oceanographic processes along the Vietnamese shelf.\n- Continued field experiments using autonomous vehicles to observe topographically-generated currents and turbulence around islands in the Western Pacific Ocean.\n- Continued research efforts related to the development of an Earth System Prediction Capability to enable improvements in extended range environmental forecasts.\n- Continued the effort to understand the relative importance of key physical processes governing the attenuation of wave energy in the marginal ice zone (MIZ). Study results will contribute to improved understanding of these processes for applications in spectral wave and general circulation models (GCMs).\n- Continued research efforts to observe, understand, and predict the evolution of the Marginal Ice Zone in the Arctic Ocean.\n- Continued in situ, airborne, and remote sensing observational efforts to inform scientific studies of the physical environment in the Arctic region.\n- Continued research on integrated Arctic System Models to enable improved forecasts of the operational environment on lead times from hours to months in the Arctic domain.\n- Continued an investigation into the changing surface conditions of the Arctic Ocean, resulting from observed reductions in sea ice cover.\n- Initiated research on extreme currents and highly variable flow generated by flow encountering abrupt topography in the Western Pacific.\n- Initiated research on the structure and variability of the Northern Arabian Sea circulation using autonomous, unmanned sampling systems in order to provide critical basic understanding.\n\nOcean Acoustics\n- Continued analysis of deep-water acoustic transmissions made in the North Pacific to understand the scattered sound field due to ocean volume variability and bathymetric features.\n- Continued a field and modeling effort to simultaneously study shallow-water medium fluctuations and develop time reversal communications using adaptive channel equalizers.\n- Continued shallow-water, shelf-break measurements and analysis to characterize the effects of the ocean water column and seabed variability on low- and mid-frequency acoustic propagation and scattering.\n- Continued a field and modeling effort to establish the capabilities of underwater acoustic communications for FORCEnet and persistent undersea surveillance.\n- Continued the development and testing of geo-acoustic inversion and extrapolation methods.\n- Continued investigations into quantifying, predicting and exploiting uncertainty in acoustic prediction models.\n- Continued research to develop complex analytic equations that couple oceanographic modes, both horizontal and vertical, to their corresponding frequency-dependent acoustic modes to give direct acoustic prediction capability.\n- Continued research to quantify uncertainty in acoustic field computations for multi-scale ocean environments using novel approaches involving Bayesian prediction and polynomial chaos expansions to embed environmental uncertainty into multiscale ocean dynamics and acoustic propagation.\n- Continued data collection and analysis of deep water ambient noise with emphasis on the Philippine Sea.\n- Continued reverberation and clutter modeling studies.\n- Continued investigation of acoustic propagation in the Arctic.\n- Continued soft sediment geoacoustic inversion studies with an emphasis on the Gulf of Mexico.\n- Initiated geoacoustic inversion studies with an emphasis on the New Jersey and Arctic Shelves."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "70.450"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Littoral Geosciences and Optics\n- Continue all efforts of FY 2016, less those noted as complete.\n- Complete studies of Coupled Human-Landscape Interactions in Low-lying Coastal Environments.\n- Initiate research efforts to observe, understand and predict coastal land-air-sea interactions and identify needed improvements in operational databases and coupled land-air-sea modeling resolutions, formulations and implementations.\n- Initiate research efforts to model the time-varying shallow-water acoustical environment on HPC resources and to evaluate these models with field data and underwater remote sensing systems.\n\nMarine Mammals and Biology\n- Continue all efforts of FY 2016.\n\nPhysical Oceanography and Prediction\n- Continue all efforts of FY 2016, less those noted as complete.\n- Complete studies of internal waves and strait dynamics emphasizing field studies in the Celebes, Philippine, and Sulu Seas.\n- Complete studies of ocean and wave response to typhoons and monsoons in the Western Pacific.\n- Complete workshops to define science needs for Sea Basing.\n- Complete extensive 3-year field program on prediction of internal waves.\n- Complete extensive internal wave field program off the New Jersey Shelf; field work will coincide with and complement the Shallow Water Acoustics program.\n- Complete the field and modeling experiments to determine the lateral dispersion and maxing parameterization needed to understand model turbulence and to model ocean circulation.\n- Complete an effort to understand the dynamics that govern spiciness variability, its impact on ocean circulation, and the competing roles temperature and salinity have on ocean density and sound speed structure evolution.\n- Initiate a modeling and autonomous observation study of the Northern Arabian Sea using floats, gliders, and drifters.\n- Initiate field experiments to investigate changes in Arctic stratification and circulation and related physical processes in the Beaufort and Chukchi Seas.\n- Initiate a multidisciplinary field effort to characterize and understand air-sea-land interactions over the Maritime Continent in the western Pacific and the impact on intra-seasonal variability and extended-range prediction.\n\nOcean Acoustics\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete research to develop complex analytic equations that couple oceanographic modes, both horizontal and vertical, to their corresponding frequency-dependent acoustic modes to give direct acoustic prediction capability.\n- Complete research to quantify uncertainty in acoustic field computations for multi-scale ocean environments using novel approaches involving Bayesian prediction and polynomial chaos expansions to embed environmental uncertainty into multiscale ocean dynamics and acoustic propagation.\n- Completed soft sediment geoacoustic inversion studies with an emphasis on the Gulf of Mexico.\n- Initiate geoacoustic inversion studies with an emphasis on the New Jersey and Artic Shelves."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "75.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "75.178"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural Physical Oceanography and Prediction\n\nConduct research on ocean variability generated by flow encountering abrupt topography in the Western Pacific; Carry out field experiments to investigate changes in Arctic stratification and circulation and related physical processes in the Beaufort and Chukchi Seas. Carry out a multidisciplinary field effort to characterize and understand monsoon intra-seasonal  variability in the Indian Ocean. Finish analysis from a study of the structure and variability of the Northern Arabian Sea circulation using autonomous, unmanned sampling systems.\n\nExtramural Littoral Geosciences and Optics\n\nComplete all efforts from previous fiscal years. Initiate development of methodologies and\/or observing technologies which are: a) nimble, cost-effective, rapidly re-locatable, or will offer bold insight into littoral dynamics, or b) utilize sensors on operational platforms (termed organic) in ways which increase battlespace awareness or can be used to map the maritime domain while idle. Initiate studies and modeling of shelf, near-shore, delta, estuarine, and riverine dynamics, including surface and internal waves, currents, stratification, sediment transport and the seabed response and coastal winds driving shallow water response. Understanding shallow water features which will affect acoustic propagation or acoustic system performance and\/or events which cause swimmer or navigational hazards (bathymetry-wave-current-wind interactions), navigationally significant bathymetry or trafficability changes, are of particular interest. Initiate studies using remote sensing of the coastal and riverine environment, above and below the sea surface and canopy, e.g., from EO, IR, radar, SAR, inSAR and acoustic, from land or ship-based, unmanned vehicles, airplanes or satellites. New remote sensing tools and algorithms that can be used to initialize forecast models in distant, remote and\/or denied areas are of particular interest.  Initiate studies of optical processes in the littoral environment, including the atmosphere, sea surface, water column, sea bed and suspended or dissolved materials. Predicting the timing (initiation, transport and clearance) of materials that negatively affect optical clarity, is of particular interest.\n\nExtramural Marine Mammals and Biology\n\nIntegrated Ecosystem Research - Conduct basic research to understand the patterns and causes of variability in the distribution and abundance of marine mammals over space and time. Initiate a multidisciplinary approach using tagging, visual surveys, and passive acoustics to collect baseline measures of marine mammal behaviors and distributions relative to environmental features and marine mammal prey fields. Investigate using animal tagging and passive acoustic monitoring to study behaviors and distributions of marine mammals relative to key environmental properties (biotic and abiotic).  This includes providing a context for interpreting behavioral responses to external stimuli (i.e. anthropogenic sound), and providing basic knowledge needed for predictive models of species of concern.\n\nEffects of Sound - Conduct basic research on behavioral, physiological (hearing and stress response), and potentially population-level consequences of sound exposure on marine life. Initiate research to characterize the causal chain of events leading from sound exposure to \"biologically significant\" behavioral reactions that might increase risks of population-level effects and\/or the potential for stranding. An additional focus is to characterize the gas management and kinetics (stores and use) in marine mammals. Conduct research into the mechanisms that enable marine mammals to dive to deep depths for long durations while mitigating, if not avoiding, health threats. Initiate research to advance our understanding of sound reception mechanisms in mysticetes (large whales) will require a thorough exploration of the anatomy surrounding the ear and the whole head combined with modeling sound propagation through various tissues of whale heads and\/or bodies.  Another research focus is better understand the stress response in marine mammals to sound exposure. Conduct research to develop an understanding of the natural variation of stress markers, better understand and characterize the relationships among hormones or other biomarkers in different matrices, define and compare the quantitative and temporal relationships of hormones across the different matrices, and evaluate and characterize the relationship between the physiological stress response in marine mammals and acoustic exposure and 'biologically significant' disturbance. Continue research to develop statistical models of the population consequences of acoustic disturbance to be fitted to data from marine mammal populations and lead collaborative development of transferable models of the effects of disturbance on marine mammals.\n\nMonitoring and Detection - Conduct research to develop and test new and existing technology to detect and classify marine mammals in the marine environment and during periods of low light such as passive acoustics, and IR. Continue research and development of passive acoustic signal processing algorithms for detection, classification, and localization of marine mammals. Continue the development and testing of autonomous hardware platforms using passive acoustics and\/or IR to detect and classify marine mammals using a variety of fixed, towed, floating, and profiling platforms.\n\nExtramural Ocean Acoustics \n\nConduct research to understand propagation and scattering of acoustic energy in shallow-water ocean environments.  Areas of research include: shallow-water scattering mechanisms related to reverberation and clutter; seabed acoustic measurements supporting geoacoustic inversion; acoustic propagation through internal waves and coastal ocean processes and the development of unified ocean\/seabed\/acoustic models, including scattering from rough surfaces, biologics and bubbles; and penetration\/propagation within the porous seafloor.\n\nIntramural Battlespace Environments\n\nThe overall objective of this research is to improve basic understanding of physical, seafloor and biological oceanographic processes on space and time scales of naval interest. Emphasis is on improved measurements, laboratory and model based experiments to quantify and understand important oceanographic processes that lead to the development of ocean dynamic models from global to submesoscale scales, and to couple these oceanographic models with atmospheric, ice, biological, sediment response, and optical models. Surveillance of coastal land areas and waters is important to support Navy operations and difficult. The Navy\/Marine Corps needs include an improved use of overhead (airborne and satellite) active and passive microwave sensors, overhead optical sensors, surface-based (ships and ground-based) grazing angle microwave sensors. To predict bottom boundary physical, geological, geochemical, geoacoustic and geotechnical properties in shallow-water operating areas requires:  a) an improved understanding of processes that generate and modify the shape, structure and physical properties of the seafloor, subseafloor, ocean water column and ice-cover and topography\/morphology;  b) use of rapid, airborne characterization of littoral environments including time-varying coastal topography, littoral bathymetry, sea-level height, land and seafloor sedimentary structures to explain\/predict the observed changes; c) remote sensing of bulk properties of Arctic sea-ice over broad two-dimensional areas that previously could be sampled only at spot locations by in-situ sampling; and d) quantification of the influence of turbulence generated at the seafloor boundary layer on vertical mixing and stratification in shallow water outside the surf zone."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SCIENCE AND ENGINEERING EDUCATION, CAREER DEVELOPMENT AND OUTREACH"
                                    },
                                    "Description": {
                                        "val": "Science and Engineering Education and Career Development activities include DON participation in science fairs, summer research interns\/fellows at Navy laboratories, graduate fellowships for individuals expected to become members of the engineering faculty at Historically Black Colleges and Universities and Minority Institutions (HBCU\/MIs), and curricular enrichment programs. It is centered on Naval S&T efforts supporting Science, Technology, Engineering and Math (STEM). Outreach includes the encouragement, promotion, planning, coordination and administration of Naval Science and Technology. \n\nFunding also supports ONRG International Science Program whose mission is to search the globe for emerging scientific research and advanced technologies to enable the Office of Naval Research and the Naval Research Enterprise to effectively address current needs of the Fleet\/Forces, and investigate and assess revolutionary, high-payoff technologies for future naval missions and capabilities. This is accomplished through PhD-level Associate Director scientists located in Asia, Europe and South America collaborating with international organizations and researchers through grants in innovative basic research, and establishing quality, relevant connections between international science and technology (S&T) centers of excellence and DON, DoD, and other US Government organizations. The direct impact of this investment is to capitalize on international basic research during unprecedented and dynamic global interdependence, increasing the ability to solve DON S&T challenges through shared knowledge and technologies with partners during a time of budget constraints. Additionally, this investment builds global S&T awareness to reduce the risk of potential technological surprise, and supports theater security cooperation goals to sustain cooperative relationships with an expanding set of international partners to enhance global security.\n\nFunding increase in 2018 is the result of increased research initiatives in the areas of STEM and International Outreach. \n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.105"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Science, Technology, Engineering and Math (STEM)\n- Continued awarding prizes at 400 regional high school science fairs and four national competitions For Inspiration and Recognition of Science and Technology (FIRST), Junior Science and Humanities Symposia (JSHS), and Association for Unmanned Vehicle Systems International (AUVSI).\n- Continued supporting high school summer interns at Navy laboratories Science and Engineering Apprentice Program (SEAP).\n- Continued supporting undergraduate\/graduate students as summer research interns at Navy laboratories Naval Research Enterprise Internship Program (NREIP).\n- Continued providing graduate fellowship support to HBCU engineering faculty candidates.\n- Continued funding Young Investigator Program (YIP) research grants.\n- Continued inspiring, engaging, educating and employing exceptional candidates to sustain and enhance the naval research enterprise.\n- Continued funding for the following educational and outreach efforts: Youth Exploring Science (YES), American Society of Materials (ASM) Teacher Camp, Expanding Your Horizon (EYH), Forest Partners, and Sally Ride Science, plus SeaPerch, FIRST, and BotBall robotics efforts.\n- Continued support for SciGirls, Navy GEMS (Gains in the Education of Mathematics and Science), STEM Literacy for Navy recruits, Business-Higher Education Forum (BHEF), and the Gulf Coast Initiative.\n- Continued new projects to further teacher development and Grades 13\/14 STEM degree retention.\n- Continued new effort on undergraduate retention in STEM majors at Minority Serving Institutions.\n- Continued new effort for teacher training in STEM for schools in underserved communities.\n- Continued new computer science programs for female undergraduates.\n- Continued expansion of internships to underserved students.\n- Continued Masters in Systems Engineering program at a minority institution in partnership with Assistant Secretary of the Navy (Research, Development and Acquisition).\n- Continued to refocus STEM outreach and education efforts towards demonstrated Navy and Marine Corps workforce needs and away from areas of responsibility delegated to the National Science Foundation, the Department of Education, and the Smithsonian Institution.\n- Continued to emphasize and expand the NREIP and SEAP summer internship programs.\n\nInternational Outreach - ONR Global\n- Continued international outreach support through ONR Global that provides a conduit for new scientific areas on the international front and promotes foreign sources of research important to the Naval mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.115"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Science, Technology, Engineering and Math (STEM)\n- Continue all efforts of FY 2016.\n\nInternational Outreach - ONR Global\n- Continue all efforts of FY 2016."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.752"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Science, Technology, Engineering and Math (STEM)\n\nInitiate STEM initiatives and multi-year efforts that are intended to be approximately three years in length and in topics supporting STEM education relevant to naval science and technology workforce development by improving STEM education curriculum enrichment and student experiences in higher education and high schools, coordination and support of STEM efforts across DON, and participation of naval personnel in science fairs.\n\nInternational Outreach - ONR Global\n\nONR Global will support 26 PhD level scientists engaging with international scientists and engineers through liaison visits to research institutions in more than 60 countries. ONR will be establishing a new office in India."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SENSORS, ELECTRONICS AND ELECTRONIC WARFARE (EW)"
                                    },
                                    "Description": {
                                        "val": "Efforts include the basic research portions of: sensing, diagnostics, and detectors; navigation and timekeeping; nanoelectronics; wide band gap power devices; real-time targeting; Electro-Optical\/Infra-Red (EO\/IR) electronics; EO\/IR electronic warfare; EO\/IR sensors for surface\/aerospace surveillance; Radio Frequency (RF) sensors for surface\/aerospace surveillance; solid state electronics; vacuum electronics; and RF electronic warfare.\n\nFunding increase in 2018 is the result of increased research initiatives in the areas of Intramural Electromagnetic Warfare and Intramural Electronics.\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "46.459"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued monolithic integration of multifunctional materials to enable passive devices and sensors into wide bandgap semiconductor circuits.\n- Continued investigation of physical basis for improved time and frequency standards using quantum-entangled ions and atoms.\n- Continued investigation of ultra-high speed logic and multiple-quantum-well devices with a goal of >500 gigahertz (GHz) samplers, in support of mixed signal circuits for receiver analog-to-digital converters (ADC's).\n- Continued program to extend device performance and architectures to frequencies approaching terahertz (THz).\n- Continued program to incorporate Magnesium Diboride (MgB2) tunnel junctions into simple electronic logic structures.\n- Continued study to determine if the coupling between spins in quantum dots mediated by the virtual excitons is sufficiently strong for use in solid state implementations for quantum information.\n- Continued program on advanced epitaxial growth for novel Si-based detector applications.\n- Continued development of a blind adaptive beamforming approach for the High Frequency (HF) radar case and compare with both the conventional and traditional approaches.\n- Continued development of approaches for probability of detection for deterministic signals in stationary noise and quantify for non-stationary noise.\n- Continued development of electromagnetic ultra-near-field holography.\n- Continued development of sensitive miniature fluxgate magnetometers.\n- Continued projects to explore physical behavior of full arrays of nanoscale devices for logic, memory, and imaging.\n- Continued a program to apply innovative mass nanofabrication techniques to previously developed nanodevice arrays.\n- Continued a program on the control of deleterious defects in silicon carbide (SiC).\n- Continued a program on the study of Quantum Dots and their application to coherent wave function control and quantum information.\n- Continued a program on the tailoring of the optical, structural and electronic properties of semiconductor quantum wires.\n- Continued a program to demonstrate non-volatile memory, based on spin-torque Magnetic Random Access Memory (MRAM), with switching speed > 1 GHz and write currents small enough (<1 mA) to be driven by superconducting Rapid Single Flux Quantum (RSFQ) logic.\n- Continued a program to determine if the newly invented Reciprocal Flux Quantum Logic in fact delivers 2x higher speeds with 5x fewer Josephson junctions and power, while using the same underlying devices so that single chip hybrid circuits between it and the dominant RSFQ logic are feasible.\n- Continued demonstrations of tunable analog filters made in a digital Nb device foundry.\n- Continued work on optical manipulation of ultra-cold atoms.\n- Continued investigation of temporal-spatial noise shaping circuits and architectures for high power digital-to-analog conversion with objectives of doubling spectral bandwidth, reduction of element density (15%), and extension of multidimensional Nyquist limits to both linear and planar arrays.\n- Continued the evaluation and assessment of hardware-compatible space-time algorithms for Digital Signal Processor (DSP) applications to Transmit\/Receive (T\/R) arrays.\n- Continued research to improve mixed signal III-V device and circuit modeling with objectives of achieving a 30 dB dynamic range improvement for complex circuits containing over 100,000 devices.\n- Continued project to explore graphene based nanoelectronic devices.\n- Continued program in chip-scale quantum architectures.\n- Continued project to reduce heat transfer through electrical leads in cryogenic packaging.\n- Continued project to explore development of devices, sigma delta and time encoder circuits for near THz switching with objectives of enabling analog and digital conversion at millimeter wave frequencies.\n- Continued high-sensitivity magnetometry using quantum logic.\n- Continued materials studies of low temperature regenerator (high thermal capacity) materials and\/or controlled flow microstructures with the goal of improving energy efficiency of cryocoolers.\n- Continued research into fundamental concepts and mathematics for digital array architectures.\n- Continued research to apply carbon nano-tube technology to acoustic sensing.\n- Continued research to investigate two-dimensional electron gases in perovskite oxide heterostructures.\n- Continued project to investigate self-assembled one-dimensional GaN channels in AlGaN\/GaN structures.\n- Continued spin-based electronics research.\n- Continued graphene physics and bandgap engineering research.\n- Continued work on spin properties of graphene.\n- Continued research effort to determine the most appropriate tunnel barrier for MgB2 Josephson junctions.\n- Continued an effort to grow low defect density, high purity epitaxial 4H-SiC at high growth rates suitable for high power electronic device applications.\n- Continued design, construction, and testing of sonic crystals that can be tuned to have specific acoustic properties.\n- Continued effort to create a physics-based understanding of epitaxial oxides and insulators for use in applications for advanced electronics.\n- Continued investigation into stabilizing in-phase coherent state of coupled systems for coherent power generation.\n- Continued high output impedance solid state device technologies and materials.\n- Continued effort to fabricate functionalized micro-opto-mechanical systems for the measurement of micromechanical photothermal spectra of adsorbed chemical vapor analytes.\n- Continued research effort on chemical synthesis and bandgap tailoring in graphene nanoribbons.\n- Continued research on spin dynamics in Group IV semiconductors and related device concepts.\n- Continued research efforts on non-conventional nanofabrication that hold promise for sub-10nm resolution.\n- Continued studies of the physics origin of noise and behavioral fluctuations in superconducting circuits, especially analog to digital converters, and incorporate the understanding into computer aided circuit simulators.\n- Continued studies of the generation and recombination dynamics of non-equilibrium quasiparticles associated with digital switching events in superconducting logic.\n- Continued investigation of metamaterials with embedded active devices to better understand multidimensional signal processing from RF through THz frequencies.\n- Continued effort on nuclear optical frequency standard in Thorium 229.\n- Continued studies of intraband transitions in wide bandgap quantum wells.\n- Continued studies of the use of non-linear optical (phonon-photon interactions) phenomena as a method of cooling to cryogenic temperatures.\n- Continued effort to investigate statistical representations of target and signal techniques.\n- Continued research on defect engineering and characterization in graphene.\n- Continued studies of how to prevent flux trapping and diagnose its occurrence in complex superconducting circuits and to design real time expert measurement systems in general for testing of new designs defined in VHSIC (Very High Speed Integrated Circuits) Hardware Description Language (VHDL).\n- Continued MgB2 Josephson junction work with first tests of 10 device logic cells to determine likely clock speeds of this new materials technology.\n- Continued high output impedance solid state amplifier technologies.\n- Continued program of ultraprecise gravitational measurements using atom interferometers.\n- Continued research on graphene based high performance flexible electronics.\n- Continued research on DNA based carbon nanotube sorting and placement.\n- Continued investigation of electrical stress characterization and Gallium Nitride transistor stability.\n- Continued development of a path-integral-based theory of wave propagation in bounded, disordered media.\n- Continued effort to develop multiple layered semiconductor quantum dots for infrared optical applications.\n- Continued research on characterization and control of graphene edge effects.\n- Continued research on electronic functionality in DNA nanostructures.\n- Continued research on chemical functionalization and self-assembly of graphene nanostructures.\n- Continued studies of how best to densitify superconducting circuits using new third generation Nb devices including what new layers devoted to resistors, filters, power distribution or wiring would provide the greatest system benefit.\n- Continued research on correlated electron materials for high performance electronic devices.\n- Continued effort to study novel oxide materials with high electron densities for high performance transistors.\n- Continued research on synthesis of electronic Boron Nitride films.\n- Continued research on defect characterization of single layer Boron Nitride.\n- Continued studies of analog intelligent nanoelectronics computational architecture.\n- Continued research on new class of superconductors or devices in which competition between superconducting and magnetic ordering is involved.\n- Continued research on multi-THz electromagnetic devices lying within the intersection of high-speed electronic materials, photonic materials and active metamaterials.\n- Continued research on semiconductor nanowire array based transistors operating in the quantum capacitance limit for highly linear RF electronic devices and photonic nanoresonators.\n- Continued research on 2D materials other than graphene.\n- Continued research on chemical synthesis of carbon nanostructures.\n- Continued research towards detecting and manipulating Majorana fermions in condensed matter systems.\n- Continued studies of topological insulator materials and novel device concepts exploiting properties of transport in their protected electronic state.\n- Continued efforts to improve the sensitivity of superconducting quantizers, mechanisms to achieve >20 GHz in-building wireless (IBW) in analog to digital converters, and explore origins of non-linearities in quantizers.\n- Continued studies of whether superconducting qubits can act as controllable sources of microwave entangled photons and whether these plausibly have application to quantum radar.\n- Continued study of active control of biomolecular binding on surfaces.\n- Continued search for sustainable replacements for semiconductors and strong magnets.\n- Continued study of sensing, selection and control of marine microbes.\n- Continued effort to develop techniques for the atomic layer deposition of high-quality dielectric films on semiconductor surfaces with extremely low interface state densities.\n- Continued effort to determine the feasibility and develop a greater understanding of defect science in SiC epitaxial layers on low offcut substrates suitable for power electronic applications.\n- Continued fundamental investigation onto the synthesis and material properties of graphene, boron nitride and other two dimensional materials; identify potential exploitation avenues.\n- Continued development of the method of moments solvers for millimeter wave region targets\n- Continued development of phase-only pattern synthesis for transmit arrays.\n- Continued development of a new theory of inference for statistical signal processing.\n- Continued research to control quantum dot excitations by using acoustic phonons.\n- Continued development of mathematical and numerical tools to understand stochastic prediction and control of delay coupled dynamical systems.\n- Continued effort to develop novel Interfacial Misfit (IMF) & Selective Area Pillar (SAP) techniques for molecular beam epitaxy (MBE) growth of non-lattice matched III-Sb alloys with low defect densities & favorable band alignments for a new generation of IR optical devices.\n- Continued effort to develop mid-, far-infrared and terahertz nanophotonic optical components using optic phonon modes within polar dielectrics.\n- Continued research on optical and plasmonic properties of graphene in infrared (IR) and terahertz (THz) spectral regions.\n- Continued effort to maintain the ten (10) femto-second jitter produced by high speed long Josephson junction (LJJ) clocks as these pulses propagate to their point of use in coherently sampling multiple ADC and devise a Josephson junction based way of phase locking a LJJ clock to an external master clock.\n- Continued non-equilibrium k-space transport studies.\n- Continued research on micro plasma based materials, devices, and circuits.\n- Transferred studies of analog intelligent nanoelectronics computational architecture.\n- Transferred research on optical and plasmonic properties of graphene in infrared (IR) and terahertz (THz) spectral regions.\n- Transferred research on 2D materials other than graphene.\n- Transferred research on chemical synthesis of carbon nanostructures.\n- Transferred research towards detecting and manipulating Majorana fermions in condensed matter systems.\n- Transferred studies of topological insulator materials and novel device concepts exploiting properties of transport in their protected electronic state.\n- Transferred research on spin dynamics in Group IV semiconductors and related device concepts.\n- Transferred research efforts on non-conventional nanofabrication that hold promise for sub-10nm resolution.\n- Transfer research on defect engineering and characterization in graphene.\n- Completed research on duel-STM characterization of graphene film.\n- Completed studies of chemical vapor deposition (CVD) of graphene on copper.\n- Completed research on spin properties in topological insulators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "46.907"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete research on heterojunction bipolar transistors with diamond collectors.\n- Complete research on optical modulators using vanadium oxide.\n- Complete research on phosphorene field-effect transistors.\n- Complete research on transistors based on lanthanum-doped barium tin oxide.\n- Initiate research on chalcogenide-based phase-change materials for photonics.\n- Initiate research on improved thermal conductivity and contact resistance of germanium telluride for RF switches.\n- Initiate research exploiting non equilibrium k-space transport in electronic devices for high efficiency signal generation and information processing.\n- Initiate research exploiting avalanche transport phenomena in wide bandgap materials and devices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.758"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Extramural SEEW\n\nContinue basic research in the areas of solid state transistors and devices for high frequency analog and digital operation; high efficiency, highly linear amplifiers for microwave, millimeter-wave, low-noise, and power applications; superconducting and other technologies which are designed to deliver software defined, wide band, simultaneous signal functionality for conventional system contexts, including, but not limited to, SATCOM, Surveillance, Electronic Warfare (EW), signal intelligence (SIGINT), and communications; electronics and photonics technology that provides for the control, reception, transmission and processing of signals; and continue research to advance navigation, timekeeping and sensing technology, including cooling and trapping of atoms and ions; Bose-Einstein condensation and coherent matter- wave physics; optically-based frequency standards; improved time and frequency metrology using quantum entanglement and quantum logic processing; quantum optomechanics; and coherence and control of quantum systems.\n\nIntramural Undersea Warfare  \n\nConducted research focused on using a broad spectrum of techniques, including acoustic holography, new optical\/electrical\/magnetic measurement technologies, phonon transport measurement and control, and advanced numerical methods.  Investigates physical phenomena related to acoustic propagation in oceanic environments that exhibit variations in impedances, sound speeds, density, sedimentation, bathymetry, and oceanography to improve system prediction performance, sonar processing, and to discover novel concepts for ASW.  The work relates directly to the Navy's need for thermoelectric power generation, devices and systems having improved performance for shallow water Anti-Submarine Warfare (ASW), acoustic and electric signature measurement and control, and energy generation.  \n\nIntramural Electromagnetic Warfare\n\nFundamental research is being conducted looking at revolutionary mechanisms for advance tracking techniques for the joint battle space.  A very novel concept of using radars for long range speech reception and playback is ongoing.  RCS prediction capabilities for naval vessels is being researched to cover ultra-wide bandwidths, significantly expanding our predictive narrow band capabilities.  When coupled with another developmental effort on multistatic radar theory will provide a broad perspective of target signatures essential to defining radar and EW performance requirements.\n\nIntramural Materials and Chemistry\n\nDesign novel experiments and theoretical models to create advanced or improved materials using new concepts and techniques for applications and sensors and advanced electronics. For applications to improve target identification algorithms utilizing non linier dynamics to understand and demonstrate the principles and mechanisms of DNA-based molecule-scale machines to amplify detection of biochemical agents. Fabricate single normal layer of materials to create monolayer ferromagnets and semiconductors. The material of choice will be single layer MoS2 for utilization as indirect gap semiconductors. The NRL unique single stage accelerator mass spectrometer to evaluate the fine scale detection limits of fusion products and isotopes.  Understanding of the protein-surface interactions will be directed to fabricate biosensors. First principle theoretical models are developed to understand the principles governing the interactions between surfaces and small molecules. \n\nIntramural Electronics\n\nCreate new knowledge and understanding and explore new concepts, components, techniques and methods, for the design, growth, and characterization of electronic, electromagnetic, and electro-optical materials, fabrication processes, electronic and electro-optic components, including novel electromagnetic concepts and techniques, and plasma phenomena and theory."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "WEAPONS"
                                    },
                                    "Description": {
                                        "val": "Efforts include: undersea weaponry; energetic materials and propulsion; expeditionary operations (communications, materials for forensic sensing, landmine detection, human sensory enhancements, lightweight power sources and information efficiency); counter directed energy and applied electromagnetics.\n\nThis activity also includes Secretary of Defense directed peer-review basic research to develop innovative solutions and enhance the science and engineering base.\n\n\n\nAccomplishments and plans described below are examples for each effort category."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.209"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Weaponry\n- Continued conducting basic research related to critical S&T (including vehicle control, maneuverability, and stability) associated with the development of High-Speed Supercavitating Vehicles (HSSV).\n- Continued expansion of the Navy Undersea Research Program (NURP) Program to provide a further infusion of educated and career minded scientists and engineers in support of the National Naval Responsibility (NNR) for Undersea Weapons Research.\n- Continued evaluation of viable synthesis methodologies and characterization of candidate explosive ingredients suitable for undersea weapons applications.\n- Continued studies metalized explosives, lattice deformation of crystalline explosives, high thermal conductivity nanocomposites for vehicle arrays, microplasma fuels reforming and biomimetic propulsion mechanisms for underwater vehicles exploiting flutter instability.\n- Continued validation of hydroacoustics models and test and evaluate acoustic array signal processing algorithms.\n- Continued study on propulsion and its interaction with supercavitating cavity, and control surfaces.\n- Continued acoustic concepts formulation and modeling for low-noise bio-inspired propulsion systems.\n- Continued high energy density power system research for under water vehicles.\n- Continued concept development on inversion of swarm dynamics for underwater tactical applications.\n- Continued development of diagnostic capabilities to accurately determine aluminum combustion characteristics in oxidizing environments.\n- Continued an Otto Fuel II characterization study for undersea weapons.\n- Continued basic research related to cavity stability, vehicle control, maneuverability, stability associated with the development of high-speed, supercavitating vehicles.\n- Continued new, and continue on-going, research in fusing phenomenology, reactive materials, high oxygen constituents and insensitive munitions and use of these technologies in advanced warhead concepts.\n- Completed new coating concepts for corrosion and anti-fouling protection of UUVs.\n- Completed computer code refinements and investigation of supercavitating vehicle dynamics and instability.\n\nEnergetic Materials and Propulsion\n- Continued development of a fundamental understanding of initiation mechanisms of explosive crystals subjected to shock stimulus.\n- Continued exploring the use of quantum mechanics and molecular dynamics to provide fundamental properties for energetic materials to predict initiation\/detonation criteria for insensitive munitions applications.\n- Continued investigation of JP-10 combustion-based Proton-Exchange-Membrane (PEM) fuel cells.\n- Continued investigation of multi-tube multi-nozzle Pulse Detonation Engines (PDEs) and multi-tube common nozzle PDEs.\n- Continued investigation of nanometallic-hydrocarbon hybrid catalytic combustion for increased energy release rates.\n- Continued investigation of novel initiation techniques, including optimized injection parameters, and integrated single tube operation for PDEs.\n- Continued Advanced Energetics research in reactive, explosive, and propulsive energetic materials, including high energy ingredient synthesis & characterization, and fundamentals of initiation and decomposition mechanisms, to tailor energy release processes in order to achieve substantial performance gains and\/or enhanced survivability in harsh environments.\n- Continued to develop fundamental understanding of nitramine and perchlorate decomposition mechanisms for propellant applications.\n- Continued to develop organometallic-based highly energetic ingredients.\n- Continued efforts to explore alternative fuel concepts for Naval applications to include hydrogen, synthetic diesel, and biodiesel.\n- Continued development of multi-parameter sensor for multi-phase combustion flows (UAV and underwater PDEs).\n- Continued implementation of new & nanostructured materials design concepts for direct energy conversion and waste energy conversion.\n- Continued investigation of integrated pulse detonation engine-airframe for autonomous vehicles, and pulse detonation for passive weapons (noise, jamming).\n- Continued studies to determine the best investment of technologies for Unmanned Undersea Vehicle (UUV) Guidance and Control (G&C).\n- Continued hydroacoustics models and experiments to reduce the self-noise on cavitator acoustic array.\n- Continued acoustic signal processing algorithms for HSSV guidance and control.\n- Continued development of new concepts for underwater power generation.\n- Continued development of non-lethal undersea warheads for Overseas Contingency Operations.\n- Continued development of PDE for underwater applications.\n- Continued new thrust on the design, synthesis and characterization of high energy dense oxidizers.\n- Continued structure property relationship studies on advanced propellant systems and high blast energetic compositions.\n- Continued synthesis and characterization of cluster complexes between reactive metals and energetic oxidizers and explosives.\n- Continued research and development for hypersonic propulsion system technologies for increased range and speed, improved stealth and maneuverability, reduced emissions and signatures, lower noise, wider operational envelopes and turndown ratio.\n- Continued research into coulombic explosives via unique electronic and structural properties of atomic clusters not observed in bulk.\n- Continued development of a new methodology coordinating both theoretical and synthetic chemistry to maximize molecular design and predicted molecule stabilities facilitating insight into the next generation of energetic materials.\n- Continued research to develop ability to synthesize and quantitatively predict energetic material performance from first principles of quantum chemistry.\n- Continued research and development on aircraft, fuels and rocket propulsion system technologies for increased range and speed, improved stealth and maneuverability, reduced emissions and signatures.\n- Continued an investigation that focuses both theoretical and synthetic processes to maximize molecular design and crystal morphology for new insensitive munition (IM)-compliant commodity energetic material ingredients.\n- Initiated hypersonic aerodynamics, aerothermodynamics and high temperature materials research focused on challenges resulting from unique Navy platform constraints.\n\nExpeditionary Operations\n- Continued investigation of catalysts that reduce the pre-processing requirements for using logistic fuels in solid oxide fuel cells.\n- Continued basic materials research to explore and improve high strain and stress rate performance of high performance fibers, armor inserts, and structural materials.\n- Continued basic research into automated reasoning and data fusion for distributed surveillance.\n- Continued fundamental chemistry and materials science research to advance water purification technologies.\n- Continued basic research to advance electrochemical energy conversion and storage.\n- Continued a Vehicle Autonomy effort focused on unmanned and autonomous systems to displace the operator from hazardous conditions\/environments, lighten the load of individual Marines, and provide greater warfighting capability.\n- Continued a new effort to research peer-to-peer mixed initiative planning to allow unmanned autonomous systems to collaborate and improve their common operating picture without having to have a human in-the-loop.\n- Continued Distributed Trust Models effort to determine USMC S&T gaps hindering dominance in cyberspace.\n- Continued development of collection strategies based on cutset sensor topologies in order to provide enhanced situational awareness with sparse sampling.\n\nCounter Directed Energy\n- Continued investigating the most promising physics, science, and mathematic solutions to protect naval assets against directed energy threats.\n- Continued establishing the basic science and technology issues relevant to the propagation of directed energy in the atmosphere and its interaction with sensors, electronics and structural materials.\n- Continued assessment of theoretical constructs for directed energy (DE) systems detection and geolocation.\n- Continued investigation into the susceptibility of critical naval electronic components to electromagnetic radiation.\n- Continued development of courseware for Counter Directed Energy (CDEW) for use at the U.S. Naval Academy and the Naval Postgraduate School.\n- Continued performance of laboratory experimentation on laser and High Power Microwave protection methods for future naval aviation systems and platforms.\n- Continued development of suitable metamaterial samples which provide electromagnetic shunting and conduct laboratory testing with laser and microwave systems.\n- Continued testing of unmanned systems DE protection methods.\n\nApplied Electromagnetics:\n- Continued program to conduct basic research and theoretical analysis in electromagnetic phenomena in the spectrum from microwaves to visible light. Areas of research will be in microwave directed energy, optical directed energy (lasers), terahertz sources, and related nanometer-scale electronics and sensors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.252"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Weaponry\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nEnergetic Materials and Propulsion\n- Continue all efforts of FY 2016, less those noted as completed above.\n\nExpeditionary Operations\n- Continue all efforts of FY 2016, less those noted as completed above.\n- Complete a Vehicle Autonomy effort focused on unmanned and autonomous systems to displace the operator from hazardous conditions\/environments, lighten the load of individual Marines, and provide greater warfighting capability.\n-Complete investigation of catalysts that reduce the pre-processing requirements for using logistic fuels in solid oxide fuel cells.\n- Initiate Dynamical Information Processing for Autonomous Systems.\n- Initiate expeditionary basic research efforts in computer science, human-social-cultural interactions and data science related to distributed systems.\n\nCounter Directed Energy\n- Continue all efforts of FY 2016, less those noted as completed above."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.925"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Undersea Weaponry\n\nConduct basic research related to critical S&T for undersea weapons and supercavitation. Expand research related to the Undersea Weapons initiative to provide a further infusion of educated and career minded scientists and engineers in support of the National Naval Responsibility (NNR) for Undersea Weapons Research.\n\nEnergetic Materials and Propulsion\n\nConduct basic research into the science of energetic materials and advanced propulsion technology. Researched advanced energetic material which provide reactive, explosive, and propulsive phenomena including high energy ingredient synthesis, modeling, characterization, and the fundamentals of initiation and decomposition mechanisms. Program has explored the bounds of energy management between conventional electron bonding energies and that of nuclear binding energies. Current investigations focus on both theoretical and experimental processes using molecular design and crystal morphology theory for the selection of new insensitive munition (IM)-compliant commodity energetic material ingredients. Investigate development of a new methodology coordinating both theoretical and synthetic chemistry to maximize molecular design and predicted molecule stabilities facilitating insight into the next generation of energetic materials including research to develop ability to synthesize and quantitatively predict energetic material performance. Pursue research into sub-nano scale molecular systems and the energetic phenomena including initiation techniques, novel nozzle, tube and flow approaches, and sensing and propulsive control technology. Investigating efforts to explore alternative fuel concepts for Naval applications to include hydrogen, electric propulsion, synthetic diesel, and biodiesel. Conduct basic research into solid rocket motor system technologies for increased range, speed, improved stealth, and maneuverability. Pursuing research into Rotating Detonation Engines (RDEs) and their application to air vehicles and weapons including detonation initiation techniques, low-loss combustor isolation, fuel-air mixing, tube and flow approaches, and sensing and control technology.\n\nExpeditionary Operations\n\nTransfer all efforts of FY 2017 to the Sciences Addressing Hybrid Threats Activity within this same Program Element.\n\nCounter Directed Energy\n\nConduct research into the basic science and technology issues relevant to the propagation of directed energy in the atmosphere and its interaction with sensors, electronics and structural materials. Pursue investigation of the most promising physics, science, and mathematic solutions to protect naval assets against directed energy threats. Execute an assessment of theoretical constructs for directed energy (DE) systems detection and geolocation. Current research pursues the investigation into the susceptibility of critical naval electronic components to electromagnetic radiation. Conduct performance of laboratory experimentation on laser and High Power Microwave protection methods for future naval aviation systems and platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BASIC RESEARCH CHALLENGE"
                                    },
                                    "Description": {
                                        "val": "The ONR Basic Research Challenge (BRC) program was established in 2008 to competitively select and fund promising research programs in new areas not addressed by the current basic research program. The program stimulates new, high-risk basic research projects in multidisciplinary and departmental collaborative efforts, and funds topics that foster leading edge science and attract new principal investigators and organizations. Basic Research Challenge awards are for a period of four years. Topics are submitted by ONR program officers and are selected for BRC awards by ONR's director of research. Basic Research Challenge award topics are then issued as a broad agency announcement.\n\nFunding increase in 2018 is the result of the increased number of topics of research initiatives in the area of Basic Research Challenges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.794"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued research into the science of autonomy.\n- Continued research into de-centralized on-line optimization.\n- Continued research into carbon molecular electronics.\n- Continued research into co-prime sensor array signal processing: a new framework for reduced complexity sensing.\n- Continued research into understanding and characterizing intuition for more effective small unit decision making training technologies.\n- Continued research into couplings of ocean to space of ionospheric drivers .\n- Continued research into biologically inspired flow field computation for sensing and control of ground vehicles.\n- Continued research into reduced order representations for design: development of optimized algorithms for multi-physics based models.\n- Continued research into multi-scale nonlinear mechanisms and effects associated with coupling weak energy into composite explosive compounds.\n- Continued research into integration of advanced analysis with materials research.\n- Continued research into towards active control of noise from hot supersonic jets.\n- Continued competition for new BRC awards to address selected high priority Naval S&T areas, transformational initiatives, and grand challenges, including strategically important DON research areas. Approximately four high priority research topics will be identified to solicit proposals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.082"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2016, less those completed in that year."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.396"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue Basic Research into, high-risk multidisciplinary research areas including: autonomy, de-centralized on-line optimization, carbon molecular electronics, co-prime sensor array signal processing, small unit decision making training, biologically inspired flow field computation, algorithm optimization for multi-physics based models, composite explosive compounds, advanced analysis techniques for materials, and active supersonic jet noise control.  \n\nInitiate basic research topics in emerging fields of science including: multiscale theory for cavitation in complex soft materials; phase-resolved bottom-side IONosphere (BSION); decentralized perception in data-rich dynamic environments; enhanced manufacturability with electrical currents; distributed sensing, actuation and control in soft materials for flexible appendages; predictive and causal modeling; and new opportunities to transform wall-bounded turbulence understanding."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Defense Basic Research seeks to improve the quality of defense research conducted predominantly through universities and government laboratories. It also supports the education of engineers and scientists in disciplines critical to national defense needs through the development of new knowledge in an academic environment. Initial research focus is generally conducted in an unfettered environment because of the nature of basic research, but as more is learned and applications emerge, individual research projects take on a more applied focus. Individual project metrics then become more tailored to the needs of specific applied research and advanced development programs. Example metrics include a biporous wick structure for thermal management of power electric modules capable of removing 900 watts per square centimeter which was recently developed by an academia\/industry team. The National Research Council of the National Academies of Science and Engineering's congressionally directed \"Assessment of Department of Defense Basic Research\" concluded that the DoD is managing its basic research program effectively."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "53.103"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "53.103"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "53.103"
                                        },
                                        "Text": {
                                            "val": "Expand and further basic research efforts to support Navy and Marine Corps needs in the following areas: Autonomous Systems; Command, Control, Communications and Computers (C4); Marine as a System; Information Analysis and Decision Support; Intelligence, Surveillance and Reconnaissance; Logistics; Materials; Operational Environments; Platforms; Power and Energy Technology; Sensors and Electronics; Warrior Performance and Protection; Weapons and Support (Education and Outreach)."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}