{
    "id": "2018-ChemicalandBiologicalDefenseProgram-PB-0400-MJBOOK-0-0-9e59437622b0b2ce978c78bb76975091975869b1138bfdd4eab85f0611238cd1-1",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-CBDP-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Chemical_and_Biological_Defense_Program_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "202.112"
            },
            "CurrentYear": {
                "val": "188.715"
            },
            "BudgetYearOne": {
                "val": "201.053"
            },
            "BudgetYearOneBase": {
                "val": "201.053"
            },
            "BudgetYearTwo": {
                "val": "194.578"
            },
            "BudgetYearThree": {
                "val": "195.454"
            },
            "BudgetYearFour": {
                "val": "196.820"
            },
            "BudgetYearFive": {
                "val": "196.787"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Applied research in the areas of physical technologies (CB protective materials, textiles, and filtration, sensors and sensing algorithms, effects modeling, chemical formulations, processes, and methods for hazard mitigation), medical technologies (drug discovery and platform technology development, biomarkers and assay development useful in drug development and diagnostics, human mimicking devices and regulatory science), and non-traditional agent medical and physical defense technologies, including characterization of emerging threats.  Major efforts support development of vaccines, therapeutics, next generation diagnostics systems, next generation chemical detectors, nerve agent pretreatments, and individual protection advances.\n\nIn the physical sciences area, Project CB2, focuses on continuing improvements in CB defense materiel, including contamination avoidance, decontamination, and protection technologies, as well as biological weapon\/agent surveillance.  \n\nFor Non-Traditional Agents (NTAs), Project NT2 consolidates all NTA efforts (both medical and non-medical) including pretreatments, therapeutics, detection, threat agent science, modeling, and protection and hazard mitigation.  \n\nThe medical program, Project TM2, focuses on the development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management.\n\nOne function of the CBDP S&T Applied Research budget is to preserve critical core competencies in the DoD Service laboratories which includes: United States Army Edgewood Chemical Biological Center (ECBC), United States Army Medical Research Institute of Infectious Diseases (USAMRIID), United States Army Medical Research Institute of Chemical Defense (USAMRICD), United States Army Natick Soldier Systems Center, Naval Research Lab (NRL), Air Force Research Lab (AFRL), among others. The intent is to maintain strategic partnerships with the DoD Service communities for mission success across the enterprise through collaborative planning and programming maintaining budget assurance.\n\nEfforts under this PE will transition to or will provide risk reduction for Advanced Technology Development (PE: 0603384BP), Advanced Component Development and Prototypes (PE: 0603884BP), and System Development and Demonstration (PE: 0604384BP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "202.611"
                },
                "CurrentYear": {
                    "val": "188.715"
                },
                "BudgetYearOne": {
                    "val": "206.855"
                },
                "BudgetYearOneBase": {
                    "val": "206.855"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "202.112"
                },
                "CurrentYear": {
                    "val": "188.715"
                },
                "BudgetYearOne": {
                    "val": "201.053"
                },
                "BudgetYearOneBase": {
                    "val": "201.053"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.499"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.802"
                },
                "BudgetYearOneBase": {
                    "val": "-5.802"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.499"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.802"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.802"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: N\/A\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "50.049"
                        },
                        "CurrentYear": {
                            "val": "56.191"
                        },
                        "BudgetYearOne": {
                            "val": "71.654"
                        },
                        "BudgetYearOneBase": {
                            "val": "71.654"
                        },
                        "BudgetYearTwo": {
                            "val": "67.381"
                        },
                        "BudgetYearThree": {
                            "val": "67.386"
                        },
                        "BudgetYearFour": {
                            "val": "67.566"
                        },
                        "BudgetYearFive": {
                            "val": "67.556"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB2 provides physical science applied research to develop future, multi-disciplinary, and multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.  Capability areas in this project include: protection\/hazard mitigation; detection; information systems technology; and threat agent science.  Protection and hazard mitigation focuses on providing technologies that protect from and reduce the impact of chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures.  Detection focuses on developing technologies for standoff and point detection and identification of chemical and biological agents.  Information systems technology focuses on advanced hazard prediction, operational effects and risk assessment, and systems performance modeling.  Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity, and focuses on the horizontal integration of CB defensive technologies in support of the Joint Services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.294"
                                            },
                                            "Text": {
                                                "val": "Completed Point-of-Use Formulation (previously named Dial a Decon) effort and transitioned data to the JPM-P Joint General Purpose Decontaminant - Hardened Military Equipment program of record. Completed predictive optimization of decontaminant dispensing parameters effort and transitioned data to the Joint General Purpose Decontaminant - Hardened Military Equipment program of record. Continued hot air biological decontamination effort to address sensitive equipment, platform interior, and aircraft decontamination needs, focusing on viral and vegetative bacterial efficacy and using a germinant to reduce the time needed to kill bacterial spores. Continued the effort using zirconium hydroxide (Zr(OH)4) to meet warfighter immediate and operational decontamination needs, focusing on large panel efficacy testing. Initiated chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft chemical warfare agent decontaminant needs. Completed new methodology development for chemical agent resistant coating (CARC) assessment and transitioned the data to the CARC Commodity Manager. Continued responsive and resistant coatings efforts to enhance decontaminability as part of the systems approach to achieving efficacy goals. Continued Wide Area Decontamination of Bacillus anthracis projects. Continued surface science investigations to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.975"
                                            },
                                            "Text": {
                                                "val": "Transition sorbent decontaminant formulation effort to advanced development for immediate decontamination to leverage emerging technologies and data that demonstrates significantly greater efficacy if decontamination process is initiated within the first hour.  Initiate room temperature ionic liquid decontaminant effort to address sensitive equipment decontaminant need (enzyme and catalytic) projects.  Continue application of data gathered from surface science investigations to inform design to initiate development of the next generation of hazard mitigation technologies that include integration of multiple systems to achieve efficacy goals.  Continue enhanced CB survivability and responsive coatings projects to enhance decontaminability as part of the systems approach to achieving efficacy goals.  Demonstrate the wide-area decontamination hazard mitigation effort, which focuses on biological spore decontamination in a representative outdoor environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.171"
                                            },
                                            "Text": {
                                                "val": "Complete agent resistant coatings effort and transition to the Air Force Item manager. Continue chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft chemical warfare agent decontaminant needs. Continue responsive coatings efforts to enhance decontaminability as part of the systems approach to achieving efficacy goals. Continue Wide Area Decontamination of Bacillus anthracis projects, focusing on agrochemical approaches. Continue surface science investigations with expanded set of materials, parameters and agents to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals. Continue elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents. Continue effort to examine how decontamination technologies perform on field assets when contaminated with other than CASARM (laboratory quality\/pure) chemical agents. Continue efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes toxic industrial chemicals (TICs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.778"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to develop novel filtration media in a lightweight, low-profile, and low-burden individual protective filter.  Developed components of a hybrid respirator that includes nanotechnologies, anti-fogging materials, dynamic response breathing, oxygen storage, and CO2 scrubbing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.698"
                                            },
                                            "Text": {
                                                "val": "Continue to develop components of a hybrid respirator that can scale between different challenge environments.  Components include nanotechnologies, anti-fogging materials, dynamic response breathing, oxygen storage and CO2 scrubbing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.113"
                                            },
                                            "Text": {
                                                "val": "Continue novel filtration efforts and develop respirator-helmet integration technologies. Continue closed circuit Self Contained Breathing Apparatus (SCBA) development, and portable integrated air management systems. Initiate multifunctional systems in relevant configurations at scale for respiratory and ocular protection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.369"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to enhance both force protection and situational awareness through the improvement of multi-functional materials that exhibit broad-reaching, cross-cutting capabilities in chemical\/biological sensing and detoxification. Validated response mechanisms of dynamic multi-functional materials that conform to the threat challenge amount."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.931"
                                            },
                                            "Text": {
                                                "val": "Engineer mixed matrix membranes with increased moisture permeability and selectivity against CB threats.  Incorporate metal-organic\/metal oxide constructs into these membranes to destroy chemical agents.  Continue to test reactive metal-organic\/ metal-oxide materials with chemical agents and develop deposition strategies to form composite materials.  Continue to develop and scale production technologies for novel materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.333"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.333"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced NFPA certified fully encapsulated ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance. Continue to develop composite and novel multi-functional materials and low thermal burden garment materials which provide site-specific CB protection On Demand."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their chemical warfare agent (CWA) filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.510"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to develop Residual Life Indicator (RLI) satellite filter cartridge system by finalizing the component design and begin verification testing of a system that was investigated in a field application for long term exposure in an operationally relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.233"
                                            },
                                            "Text": {
                                                "val": "Analyze and characterize the performance of RLI satellite filter cartridge.  Optimize the RLI performance to ensure correlation to that of the carbon bed in a CBRN collective protection filter.  Collect data to establish the filter bed performance of the RLI is effectively correlated with Guard Bed (a low profile pre-filter) and the RLI creates an extended filter bed life with Guard Bed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.343"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.343"
                                            },
                                            "Text": {
                                                "val": "Continue systems integration and surveillance of Guard Bed filters and RLIs. Continue fabrication of the photo luminescent RLI satellite cartridge prototypes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.901"
                                            },
                                            "Text": {
                                                "val": "Continued Personnel Decontamination hazard mitigation projects to develop an alternative to reactive skin decontamination lotion (RSDL). Completed the effort to enhance the barrier properties of the Chemical Human Remains Pouch (CHRP) fabric against the permeation of chemical agents using a liner and transitioned to the Contaminated Human Remains System (CHRS) program of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.673"
                                            },
                                            "Text": {
                                                "val": "Continue Personnel Decontamination hazard mitigation projects to develop an alternative to RSDL.  Continue mass casualty personnel decontamination projects to develop technology to manage the specific issues (throughput and efficacy) associated with mass casualty decontamination to support warfighter operations, including homeland defense mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.450"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "Transition technology data efforts to develop an alternative to RSDL. Initiate personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Biosurveillance (BSV)"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact, and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Text": {
                                                "val": "Completed effort to develop a trust filter for next generation data sources to be included in biosurveillance analytic capabilities of the Biosurveillance Ecosystem. Initiated effort to explore next generation device-to-cloud capabilities and possible applications for biosurveillance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.380"
                                            },
                                            "Text": {
                                                "val": "Develop technologies (e.g., event-based surveillance and historical baselines; predictive models of plant and\/or animal disease; uncertainty quantification) to intelligently fuse ubiquitous sensing capabilities (wearables, field deployed diagnostics and autonomous environmental sensing vehicles).  Data fusion technologies were developed in FY16 under BA2 TM2\/Diagnostics; readjustment in FY17 more appropriately aligns these activities as biosurveillance efforts.  Continue device-to-cloud capabilities effort to reliably transmit sensed data to a secure repository and appropriately feed into disease modeling, medical resource estimation, and decision support tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.708"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.708"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies aimed at predicting, forecasting and mitigating biosurveillance events (e.g., data gathering and sharing mechanisms for event-based surveillance; compilation of historical baselines; models of plant and\/or animal disease spread; social media data analytics, uncertainty quantification). Develop capabilities to intelligently fuse ubiquitous sensing capabilities (wearables, field deployed diagnostics and autonomous environmental sensing vehicles) for earlier warning. Initiate enhanced data visualization capabilities for both sensor data fusion and predictive disease propagation models. Initiate Integrated Early Warning Ecosystem to provide improved Chemical and Biological Defense (CBD) situational awareness, a common analytical work bench for users, integration and fusion of a wide array of relevant data sources, and decision support tools for the tactical to strategic level command authorities. The intent is to leverage advances gained in the Biosurveillance Ecosystem development for application in the wider Integrated Early Warning domain. This effort will be funded out of both CB2 (Chemical Biological Defense)\/Biosurveillance  and TM2 (Techbase Med Defense)\/Biosurveillance . Efforts in this budget will focus on modeling and simulation and innovative data fusion techniques."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Detection"
                                    },
                                    "Description": {
                                        "val": "Emphasis on the detection and identification of chemical and biological threats.  Objectives include the development of miniaturized detector for sensing of chemical and biological agents, and design for prototype whole pathogen genome sequencing system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.109"
                                            },
                                            "Text": {
                                                "val": "Completed algorithm development to increase range capabilities, reduce false positives, and provide decision capabilities for large data sets. Continued concept and technology development for biological threat early warning detection. Initiated the development of proteomic detection capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.831"
                                            },
                                            "Text": {
                                                "val": "Continue concept and technology development for the biological threat early warning detection.  Initiate development of sample preparation techniques to enhance environmental detection platforms.  Continue high sensitivity immunoassay detection platforms for environmental samples."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Detection Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Focus of this budget activity is to develop capabilities to detect and identify chemical and biological threats. This activity can include development of point, remote, or standoff sensors as appropriate, to address both conventional and non-traditional chemical and biological threats. These efforts are being developed to further the detection capability for early warning of exposure to contamination for the warfighter."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.051"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.051"
                                            },
                                            "Text": {
                                                "val": "This program realigns FY17 efforts from CB2 (Chemical Biological Defense)\/Detection and NT2 (Techbase Non-Traditional Agents Defense)\/Detection. Continue concept and technology development for biological and chemical threat early warning detection. Continue development of sample preparation techniques to enhance environmental detection platforms. Initiate the development of detection capabilities for identifying genomic editing events. Continue development of a man worn environmental  sensor for detecting exposure to chemical hazards. Continue the development of proteomic detection capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop capability for predicting the source term of releases of chemical, biological, and industrial materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.137"
                                            },
                                            "Text": {
                                                "val": "Completed development of initial waterborne transport and dispersion models, including advancements to the Incident Command Tool for Drinking Water Protection (ICWater) which models riverine systems, System for Hazard Assessment of Released Chemicals (SHARC) which models coastal\/littoral systems, and associated documentation.  These models target the Joint Effects Model (JEM) waterborne modeling requirements. Continued development and implementation of solar radiation algorithms to support photo-oxidation kinetics that will enable temporal changes in solar radiation over the course of an incident simulation. Completed field studies to validate waterborne transport and dispersion model capabilities developed in the previous year. Continued interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment. Completed high-resolution and probabilistic meteorology research, incremental numerical weather prediction system upgrades, and provided operational support for the Environmental Data Enterprise (EDE). Initiated work to optimize the urban subsystem modeling capability and increased the fidelity of source term estimation in urban environments. Continued development of MicroSWIFT\/SPRAY (MSS) to improve hazard prediction in urban environments in Hazard Prediction and Assessment Capability (HPAC)including completing parallelization and validation of a fast, parallel momentum solver for incorporation into Parallel SWIFT. Completed improvements and validation for a SPRAY dense gas model.  Initiated development of a liquid pool model within MSS. Continued advancing the urban modeling capability and optimizing the urban sub-system for interfacing transport models of varying fidelity and speed. Continued research and development to enhance the fidelity of the missile intercept modeling capability within the HPAC by developing architecture and interface specifications required to address existing gaps in intercept model capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.822"
                                            },
                                            "Text": {
                                                "val": "Continue development of waterborne transport and dispersion models, including advancements to the ICWater and SHARC.  Leverage new data sources for higher resolution land-use, bathymetric and oceanographic data.  Continue related field studies to validate waterborne transport and dispersion model outputs.  Continue interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Continue work to optimize the urban subsystem modeling capability and develop capability to perform linked Bayesian probability analysis and increase the fidelity of source term estimation for urban environments.  Continue development of MSS to improve hazard prediction for urban environments in HPAC.  Continue research and development to enhance the fidelity of the missile intercept modeling capability within the HPAC.  Continue development of a virtual test and evaluation simulation environment for evaluating\/stressing source characterization and hazard refinement techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.648"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.648"
                                            },
                                            "Text": {
                                                "val": "Continue development to improve urban subsystem, specifically coupling between indoor and outdoor dispersion models for urban releases and initiate field studies for validation of these capabilities. Begin development and enhancement of source-term estimation\/source characterization algorithms. Complete research and development of enhancements to the fidelity of the missile intercept modeling capability within the HPAC. Initiate research and development of advanced weather modeling techniques. Initiate development of enhancements to human response models for CBRN agent and toxic industrial chemical exposures. Continue development of MSS to improve hazard prediction for urban environments in HPAC, including continuing to upgrade the code to meet CCMI compliance and implementing terrain-following dense gas motions.  Complete development of a secondary evaporation model. Initiate development of next generation littoral waterborne modeling system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools.  Develop chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of CB agents on equipment, personnel, and operations.  These chapters are developed by a mix of contractors and labs, employing the experts in each subject area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.527"
                                            },
                                            "Text": {
                                                "val": "Continued providing access of field trial data sources to transport and dispersion community. Continued to develop additional chapters of the CB-1. Completed drafts of CB-1 Chapter 12 - Human Factors and Chapter 8 - Structures\/Site Characteristics. Continued work drafting Chapter 13 - Consequence Assessment and Chapter 15 - Battlespace Management. Began work on Chapter 18 - Material Effects and Chapter 20 - Risk Assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.791"
                                            },
                                            "Text": {
                                                "val": "Improve modeling of subsurface chemical concentrations of contaminants.  Complete several CB-1 chapters, currently planned to include \"Meteorological\/Environmental Data\", \"Geographic Data\", \"Battlespace Management\" and \"Reconnaissance\".  Initiate several CB-1 chapters, currently planned to include \"Test and Evaluation\" and \"Consequence Management\"."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.216"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.216"
                                            },
                                            "Text": {
                                                "val": "Continue working on all 20 Chapters of CB-1.  Make CB-1 available online. Continue providing access of field trial data sources to transport and dispersion community."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Operational Effects & Planning"
                                    },
                                    "Description": {
                                        "val": "Provide tools to enable the assessment and mitigation of impacts at the personnel, system, tactical, operational and strategic levels.  Develop and institutionalize consensus-based, scientifically sound data and analytical methods to link CBRN exposures to relevant operational effects and to enhance test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.002"
                                            },
                                            "Text": {
                                                "val": "Continued Joint Expeditionary Collective Protection System Performance Model development and Individual Protection System Performance Model Development. Initiated health and human effects modeling capability for expanded threat list. Continued operational effects research and analysis efforts, previously referred to as Decision Support Tool, to provide objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting. Completed the transition of data collected by the agent fate program into an electronic, user friendly database. Continued simulation based training development to enhance senior leader decision making during weapons of mass destruction (WMD) crises. Began study to investigate relationships among low level chemical nerve agent exposures, adverse individual health and physiological effects, and degradation on individual military task performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.446"
                                            },
                                            "Text": {
                                                "val": "Continue system performance model integration and advanced development for program-wide exploitation for collective and individual protection and contamination avoidance.  Continue to develop health and human effects modeling capability.  Increase effort on operational effects research and analysis efforts, to provide objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.046"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.046"
                                            },
                                            "Text": {
                                                "val": "Complete development of health and human effects modeling capability. Conduct service-specific human performance experiments aimed at better understanding operational risk. Provide objective, quantitative analysis in support of science and technology initiative, material developments, operational guidance, and requirements setting. Develop simulation-based training to enhance senior leader decision making during weapons of mass destruction (WMD) crises. Enhance CBRN operational risk assessment tools for the Navy.  This includes the development of models of various ship classes and tools to assess the impact of CBRN use on individual and team tasks. Begin to study the relationships among low level chemical nerve agent exposures, adverse individual health and physiological effects, and degradation on individual military task performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Supports defensive countermeasure development against chemical and biological (CB) threats by delivering the scientific understanding and relevant estimates of the hazards posed to humans by exposure to CB agents. \n\nToxicological and\/or infectious-dose information and environmental response supports development and\/or enhancing both operational risk and exposure guidelines; limits for detection and protection; goals for decontamination; and medical countermeasures.  The knowledge generated from this program is used to inform understanding of hazards and hazard prediction models as well as to inform countermeasure development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.529"
                                            },
                                            "Text": {
                                                "val": "Initiated Ebola infectious dose studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection; and goals for decontamination and medical countermeasures. Continued to define particle and agent properties and predict aerosolization behavior to inform hazard assessments. Developed methods for facilitating rapid prediction of agent-substrate interactions. Delivered data on the influence of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection). Continued to develop Absorption, Distribution, Metabolism, Excretion, and Toxicity (ADMET) models of physiological response to agent and predictive toxicology capabilities. Characterized priority emerging chemical and biological threats to provide critical agent data to decision makers and technology developers. Continued developing methods for biological agent characterization and environmental persistence and decontamination."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.411"
                                            },
                                            "Text": {
                                                "val": "Continue to develop methods for biological agent characterization including genomic fingerprinting and tracing initiated with Ebola virus efforts.  Provide environmental persistence and decontamination estimates on high priority biological threat agents, including genomic finger printing and\/or tracing.  Continue to define particle properties to predict aerosolization behavior to inform hazard assessment.  Continue efforts to characterize the effects growth media have on the environmental fate of biological aerosols for understanding hazards.  Continue developing methods to predict agent-substrate interactions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.575"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.575"
                                            },
                                            "Text": {
                                                "val": "Continue developing advanced methods for biological agent characterization. Continue to deliver environmental metagenomic information. Continue providing data on fate, persistence, and response of priority biological agents in various environments to reveal latent details on their behavior. Continue developing methods to understand biological agent fate on surfaces and begin developing methods for understanding energetic materials for vulnerability assessments and signature identification and development. Continue defining particle properties and agent-substrate interaction to predict agent behavior and aerosolization to inform hazard assessment. Continue with relevant biological toxicity and infectious dose studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection; and goals for decontamination and medical countermeasures. Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "17.141"
                                        },
                                        "CurrentYear": {
                                            "val": "19.109"
                                        },
                                        "BudgetYearOne": {
                                            "val": "18.093"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "18.093"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.835"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.790"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.837"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.835"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "65.810"
                        },
                        "CurrentYear": {
                            "val": "64.476"
                        },
                        "BudgetYearOne": {
                            "val": "56.187"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.187"
                        },
                        "BudgetYearTwo": {
                            "val": "54.223"
                        },
                        "BudgetYearThree": {
                            "val": "54.721"
                        },
                        "BudgetYearFour": {
                            "val": "52.894"
                        },
                        "BudgetYearFive": {
                            "val": "52.883"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT2 provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs).  This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to counter emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination, information systems and modeling and simulation, and medical countermeasures.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.309"
                                            },
                                            "Text": {
                                                "val": "Completed Point-of-Use Formulation (previously named Dial a Decon) effort and transitioned data, including NTA efficacy data to the JPM-P Joint General Purpose Decontaminant - Hardened Military Equipment program of record. Continued the effort using zirconium hydroxide (Zr(OH)4) to meet warfighter immediate and operational NTA decontamination needs.  Integrated NTAs, including newly identified emerging threats, into all material contamination mitigation projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.142"
                                            },
                                            "Text": {
                                                "val": "Continue integrating NTAs, including newly identified emerging threats into the continuing Government owned decontaminant formulation, sensitive equipment decontamination (enzyme and catalytic) projects, responsive coatings, multiple system integration, and the full hazard mitigation technology development portfolio.  Initiate focus on hazard mitigation of other emerging threats and classes of NTAs, including data sharing with international partners.  Incorporate data gathered from surface science effort to inform design of new approach on Government owned formulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.939"
                                            },
                                            "Text": {
                                                "val": "Continue integrating the full range of NTAs into the material contamination mitigation portfolio. Continue responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals. Continue effort to examine how decontamination technologies perform on field assets when contaminated with other than CASARM (laboratory quality\/pure) NTAs. Continue efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.519"
                                            },
                                            "Text": {
                                                "val": "Transitioned human remains storage data to the human remains related programs and the Joint Mortuary Affairs Center (JMAC), Fort Lee, Virginia. Integrated NTA threats into Personnel Decontamination hazard mitigation projects to develop an alternative to Reactive Skin Decontamination Lotion (RSDL)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.669"
                                            },
                                            "Text": {
                                                "val": "Continue mass casualty personnel decontamination projects to develop technology to manage the specific issues (throughput and efficacy) associated with mass casualty decontamination that include efficacy against NTAs and emerging threats decontamination to support warfighter operations, including homeland defense mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.761"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Text": {
                                                "val": "Transition technology data developed by efforts to develop an alternative to RSDL, including efficacy data against representative NTAs to Next Generation Personnel Decontamination. Initiate personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators that provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.358"
                                            },
                                            "Text": {
                                                "val": "Continue to investigate performance limitations current and developmental of respiratory protection technologies against NTA challenges and investigate counter-measures to these specific limitations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.733"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.733"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate upgrades to existing air purification (including respiratory protection) technologies to enable broad spectrum protection and extended filter life. Assess novel filtration materials against new NTAs and compounds of interest."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Chemical Diagnostics - Medical"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods to detect exposure to non-traditional agents in clinical samples. Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker. Supports the analytics for traditional agent diagnostics and hand-held diagnostic technologies that might be applied to NTA diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.248"
                                            },
                                            "Text": {
                                                "val": "Continued to expand NTA biomarkers for additional compounds. Optimized method development for identification and validation of NTAs in clinical samples for additional compounds of interest. All efforts transition to TM2 (Techbase Med Defense)\/Chemical Diagnostics  in FY17."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Chemical Pretreatments - Medical"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments and prophylactics that provide protection against NTAs and emerging chemical threats. Prophylactic medical countermeasures (MCMs) include catalytic and stoichiometric bioscavengers that rapidly bind and detoxify a broad spectrum of NTAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.605"
                                            },
                                            "Text": {
                                                "val": "Continued focused studies to identify lead catalytic bioscavenger candidates against NTA exposure in validated animal models. Continued development of a catalytic bioscavenger cocktail effective against multiple NTAs. Continued to explore alternative technologies for bioscavenging enzymes to address capability gaps such as immunogenicity, circulatory stability, dosing, shelf-life, and delivery. Continued efforts to develop nanotechnology enabled prophylaxis. Continued research projects at the Absorption, Distribution, Metabolism, Excretion and Toxicology (ADMET) Center of Excellence (CoE) to improve MCM understanding and facilitate development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.838"
                                            },
                                            "Text": {
                                                "val": "Explore bioscavengers administered as post-exposure, pre-symptomatic prophylaxis against NTAs in validated animal models.  Evaluate Food and Drug Administration (FDA) licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.837"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to identify and develop catalytic enzymes for use against selected, priority NTAs. Continue to explore alternative technologies for bioscavenging enzymes to address capability gaps such as immunogenicity, circulatory stability, dosing, shelf-life, and delivery. Initiate development of new platform technologies such as modulation of endogenous protein expression or other innate protective response. Complete investigation of nanotechnology to support prophylactic countermeasures. Continue research projects at the ADMET CoE to improve MCM understanding and facilitate development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Chemical Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury. Determines the toxic effects of agents by probable routes of field exposure, as well as standard experimental routes. Physiological parameters and pathological assessments will be used to establish the general mode and mechanism(s) of toxicity. Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to NTAs and emerging chemical threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.065"
                                            },
                                            "Text": {
                                                "val": "Synthesized analogs of known and novel therapeutic compounds that cross the blood brain barrier. Evaluated compounds in high-throughput, in vitro screens for reactivation of cholinesterases. Investigated known, licensed, FDA-approved countermeasures for use against selected, priority NTAs. Continued research projects at the ADMET CoE to improve MCM understanding and facilitate development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.492"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize novel therapeutic compounds that cross the blood brain barrier and can be used as treatments for NTA exposures.  Continue to evaluate licensed FDA therapeutics against NTAs for potential EUA.  Continue to utilize the ADMET CoE to support evaluation and development of new NTA therapeutics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.670"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.670"
                                            },
                                            "Text": {
                                                "val": "Continue pursuit of analogs of therapeutic compounds to treat NTA exposures. Continue to test compounds using high-throughput, in vitro screens. Continue to evaluate licensed FDA therapeutics against selected, priority NTAs. Continue to evaluate compounds at the ADMET CoE to identify leads. Continue to evaluate FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of chemical agent exposure. Initiate additional animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Detection"
                                    },
                                    "Description": {
                                        "val": "Primary focus is to assess the potential of multiple technologies to meet the needs to detect the presence of NTAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.376"
                                            },
                                            "Text": {
                                                "val": "Completed development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination application. Continued concept and technology development for chemical threat early warning detection. Initiated the development an on-man sensor for detecting exposure to chemical hazards. Initiated the development of a low-cost chemical detection capability utilized for identification of liquid threats, and transitioned to NT3 (Techbase Non-Traditional Agents Defense)\/Detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.333"
                                            },
                                            "Text": {
                                                "val": "Continue development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination applications.  Continue concept and technology development for chemical threat early warning detection."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction. Develop NTA source term algorithms for predicting chemical hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept. Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.582"
                                            },
                                            "Text": {
                                                "val": "Completed analysis of data resulting from small-scale testing of NTA simulants and continue test execution. Continued sensitivity and validation studies on NTA source term models and update and expand NTA databases.  Continued initial development of agent fate modeling for NTAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.738"
                                            },
                                            "Text": {
                                                "val": "Continue sensitivity and validation studies on NTA source term models and update and expand NTA databases.  Continue development of agent fate modeling for NTAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.722"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.722"
                                            },
                                            "Text": {
                                                "val": "Initiate additional small-scale testing of NTA simulants and provide test data for source term model development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Provide critical agent characterization (physical and physiological\/toxicological) data on current and emerging threat agents to prepare for surprise which enables and informs development and testing of NTA defense technology such as detection, decontamination, protection, and hazard assessment. This preliminary assessment of new threats informs decision makers, Concept of Operations (CONOPs) and Tactics, Techniques and Procedures (TTP) Development as well as provides the basis for all countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.106"
                                            },
                                            "Text": {
                                                "val": "Provided supportable data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures. Continued to characterize the synthesis physico-chemical properties and environmental fate of priority NTAs. Continued preparing laboratory and operational toxicity estimates for next priority NTAs. Refined and delivered human toxicity estimates for next priority NTAs. Continued to develop in-silico platforms for predicting human ADMET of threat agents. Characterized priority emerging threats, including those areas where the threats converge, to provide critical agent parameters to decision makers for hazard assessment and response, and for countermeasure development. Initiated roadmapping and gap identification to build a predictive Threat Agent Science or Computational Rapid Identification & Scientific Threat AnaLysis (CRISTAL) capability for DoD. Initiated predictive toxicology research efforts to support development of the CRISTAL capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.906"
                                            },
                                            "Text": {
                                                "val": "Continue to characterize priority emerging threats to provide critical agent parameters to decision makers and technology developers to support countermeasure development and testing, informs concept CONOPs, policies, doctrines and procedures.  Build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps.  Continue the evaluation of synthesis pathways, physico-chemical properties and environmental fate properties for priority threats.  Continue assessing the impact of environmental factors and substrate properties on threat agent activity (persistence, transport, degradation, resuspension, etc).  Continue preparing laboratory and operational toxicity estimates for next priority NTAs.  Refine and deliver human toxicity estimates for next priority NTAs.  Continue to develop in-silico platforms for predicting human ADMET of threat agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.525"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.525"
                                            },
                                            "Text": {
                                                "val": "Continue characterizing priority emerging threats to provide critical supportable data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures. Continue to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats. Continue evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats. Continue assessing the impact of environmental factors and substrate properties on threat agent activity (persistence, transport, degradation, resuspension, etc.). Continue preparing laboratory and operational toxicity estimates for next priority NTAs. Continue to refine and deliver human toxicity estimates for next priority NTAs. Initiate development of medium- to high-throughput laboratory approaches to predict acute systemic toxicity in support of CRISTAL capability. Expand computational and in vitro research efforts concerning ADMET, physical characterization and behavior to support development of the CRISTAL capability. Initiate efforts to integrate the computational and in vitro predictive tools developed for CRISTAL to provide a computational user interface that can accommodate multiple streams of data and provide outputs based on best available information."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "20.633"
                                        },
                                        "CurrentYear": {
                                            "val": "17.173"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.655"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.655"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "22.893"
                                        },
                                        "BudgetYearThree": {
                                            "val": "24.347"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.490"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.291"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "86.253"
                        },
                        "CurrentYear": {
                            "val": "68.048"
                        },
                        "BudgetYearOne": {
                            "val": "73.212"
                        },
                        "BudgetYearOneBase": {
                            "val": "73.212"
                        },
                        "BudgetYearTwo": {
                            "val": "72.974"
                        },
                        "BudgetYearThree": {
                            "val": "73.347"
                        },
                        "BudgetYearFour": {
                            "val": "76.360"
                        },
                        "BudgetYearFive": {
                            "val": "76.348"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM2 provides for applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to chemical and biological threat agents.  Categories for this project include core science efforts in Medical Chemical, Medical Biological, Diagnostics, and the Medical Countermeasures Initiative (MCMI).  This project supports applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents.  Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents.  Diagnostic research focuses on providing high quality data closer to the point-of-need comprising device innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools.  \n\nMCMI was established to coordinate inter-related advanced development and flexible manufacturing capabilities, and these efforts within science and technology (S&T) have been concentrated in advancing two areas: 1) regulatory science and 2) flexible manufacturing technologies and processes for MCMs.  These MCMI efforts are enablers supporting the DoD Medical Countermeasures Advanced Development and Manufacturing (MCM-ADM) capability.  The focus of these efforts is unchanged, but starting in FY17 all MCMI efforts under TM2 are transitioned into Viral\/Bacterial\/Toxins Vaccines, Vaccine Platforms and Research Tools, and Bacterial Therapeutics to reduce budget management complexity and highlight the range of MCM efforts ongoing with the ADM."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment. Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools. The Chemical Biological Defense Program partners with civil agencies and DoD agencies to provide near real-time information and provide situational awareness, yielding analytical and predictive capabilities for DoD decision makers including Combatant Commanders."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.920"
                                            },
                                            "Text": {
                                                "val": "Continued the development of the Biosurveillance Ecosystem to include analyst collaboration tools, advanced analytics, and analyst workbench. Continued various biosurveillance analytic capabilities. These capabilities include the following: real-time disease forecasting; agricultural animal population database for zoonotic disease analysis; an online crowdsourcing game for bacterial genome assembly to enhance rapid pathogen discovery and identification; biosurveillance analysis using clinical diagnoses and social media indicators in military populations; capability to assess the risk of disease spread to the United States; a data-driven framework for zoonotic disease prediction; biosurveillance visualization capabilities; and a Global Rapid Identification Tool for diagnosing infectious disease bioevents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.182"
                                            },
                                            "Text": {
                                                "val": "Development of Biosurveillance Ecosystem is shifted to Biosurveillance.  Complete the next iteration of analytic capabilities, specifically an agricultural animal population database for zoonotic disease analysis, an online crowdsourcing game for bacterial genome assembly to enhance rapid pathogen discovery and identification, a capability to assess the risk of disease spread to the United States, a data-driven framework for zoonotic disease prediction, and tools for diagnosing infectious disease bioevents.  Continue development of biosurveillance analytic capabilities, including real-time disease forecasting capabilities, novel visualization capabilities, mobile applications, an ecological analytics capability to monitor and map global, near-real-time areas at risk of emerging infectious diseases, an ability to link sequencing at remote locations with the Biosurveillance Ecosystem.  Develop next generation of technologies with focus on synthesizing large volumes of data to enable analysts and decision makers to make informed decisions in real-time.  Initiate new efforts to explore utilizing ensemble approaches to disease forecasting."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.171"
                                            },
                                            "Text": {
                                                "val": "Continue development of biosurveillance analytic capabilities, including real-time disease forecasting capabilities, novel visualization capabilities, mobile applications, an ecological analytics capability to monitor and map global, near-real-time areas at risk of emerging infectious diseases. Continue new efforts to explore utilizing ensemble approaches to disease forecasting. Initiate Integrated Early Warning Ecosystem to provide improved CBD situational awareness, a common analytical work bench for users, integration and fusion of a wide array of relevant data sources, and decision support tools for the tactical to strategic level command authorities. The intent is to leverage advances gained in the Biosurveillance Ecosystem development for application in the wider Integrated Early Warning domain.  This effort will be funded out of both CB2 (Chemical Biological Defense)\/Biosurveillance  and TM2 (Techbase Med Defense)\/Biosurveillance . Efforts in this budget will focus on medical and diagnostic data and analytics."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chemical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to chemical warfare and\/or non-traditional agents (CWA\/NTA) in clinical samples. Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.882"
                                            },
                                            "Text": {
                                                "val": "Continued development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds. Continued developing confirmatory assays for discovered markers. Initiated and completed small-scale telemetric study using animals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.149"
                                            },
                                            "Text": {
                                                "val": "Complete development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds.  Complete the development of confirmatory assays for discovered markers and continue assay verification studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.482"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Text": {
                                                "val": "Complete development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds for organophosphate (OP) nerve agents generating butyrylcholinesterase (BChE). Complete the development of confirmatory assays for discovered markers. Initiate assay verification studies and investigations to mature chemical diagnostic assays for use in forward field settings or at point-of-need."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Focuses on in-vitro assay development for viral vaccines."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.119"
                                            },
                                            "Text": {
                                                "val": "Developed in-vitro assays for Western, Eastern, and Venezuelan Equine Encephalitis (WEVEE) virus vaccines. Developed in-vitro assays for VEE virus protease activity and structure based discovery of viral protease inhibitors. All efforts transition to TM2  (Techbase Med Defense)\/Viral\/Bacterial\/Toxins Vaccines in FY17."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWA) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection. Discovery of host biomarkers generated in response to exposure to biological threat agents, whether known or emerging."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.182"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease processes. Continued discovery and identification of host response and\/or agent biomarkers. Continued to develop nanomaterial structure designs to enable companion diagnostics. Initiated efforts and feasibility studies on integrating identification of antimicrobial resistance into future diagnostic systems. Initiated designs and studies on the development of vertical flow immunoassays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.268"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease.  Continue discovery and identification of host response biomarkers.  Continue efforts and initiate verification studies for RADAR and feasibility of integrating identification of antimicrobial resistance into future diagnostic systems.  Initiate the investigation for designing biomarker validation methods and activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.551"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.551"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease. Continue discovery and identification of host response and\/or agent biomarkers. Complete efforts and initiate verification studies on integrating identification of antimicrobial resistance into future diagnostic systems. Initiate the investigation for designing biomarker validation methods and activities. Complete designs and studies on the development of vertical flow immunoassays. Initiate assay development for extremely difficult to detect\/diagnosis intracellular pathogens of severe acute systemic febrile illnesses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Next Generation Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories. This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.721"
                                            },
                                            "Text": {
                                                "val": "Continued development of multiplexed point of need diagnostic platform technologies into syndromic-based panels. Continued transition of candidate diagnostic technologies to NGDS Increment 2 in TM3 (Techbase Med Defense)\/Diagnostic Device Platforms in FY17. Initiated high sensitivity immunoassay and protein detection platforms for clinical samples."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.685"
                                            },
                                            "Text": {
                                                "val": "Complete development of multiplexed point of need diagnostic platform technologies into syndromic-based panels.  Initiate development of sample preparation techniques to enhance clinical diagnostic platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.392"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.392"
                                            },
                                            "Text": {
                                                "val": "Continue development of sample preparation techniques to enhance clinical diagnostic platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Medical Countermeasures Initiative"
                                    },
                                    "Description": {
                                        "val": "Integrate the regulatory science and manufacturing technologies and processes developed into the DoD MCM-ADM as enablers of the advanced development and flexible manufacturing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.109"
                                            },
                                            "Text": {
                                                "val": "Evaluated novel conjugation approaches for polysaccharide based vaccines.  Continued technology transfer of process development and manufacturing activities with Advanced Development Manufacturing (ADM) facility. All efforts transitioned to TM2 (Techbase Med Defense)\/Viral\/Bacterial\/Toxins Vaccines, Vaccine Platforms and Research Tools, and Bacterial Therapeutics in FY17."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Viral\/Bacterial\/Toxins Vaccines"
                                    },
                                    "Description": {
                                        "val": "Generate novel or improved vaccines against viral, bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Develop assays that identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.479"
                                            },
                                            "Text": {
                                                "val": "Refined animal model development projects with regulatory guidance, including animal models for aerosolized Burkholderia mallei and B. pseudomallei (melioidosis). Evaluated candidate Burkholderia vaccines in small and large animal models. Assessed correlates of immunity elicited by Burkholderia and Coxiella (Q-fever) species. Tested promising vaccine candidates designed to protect against genetically engineered Anthrax strains for safety and efficacy in NHPs. Continued testing of vaccine candidates for protection against aerosolized Type A Francisella tularensis infection and initiate alternative candidate vaccine. Expanded to two approaches for Q Fever vaccines. Developed and evaluated bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.026"
                                            },
                                            "Text": {
                                                "val": "Execute down-selection of FDA Animal Rule compliant non-human primate model for aerosolized Burkholderia pseudomallei (melioidosis), which adequately mimics progression of human disease.  Continue correlates of immunity studies: Characterize specific antibody responses during human Burkholderia pseudomallei (melioidosis) and Coxiella (Q-fever) infections.  Complete data analysis for studies involving novel subunit, polysaccharide, and OMV-based candidate Burkholderia (glanders and melioidosis) vaccines in small and large animal models.  Continue to evaluate and define in composition type A Francisella tularensis (Tularemia) vaccine prototypes in established small animal and NHP models for safety and efficacy.  Develop a non-reactogenic Coxiella (Q-fever) vaccine and a humanized mouse model for aerosolized Q-fever [moved from TM2\/MCMI].  Evaluate prototypic three-component vaccines against WEVEE viruses in small animal models with down-selected adjuvants.  Initiate immune correlate studies with a three-component vaccine against WEVEE viruses in small animal models.  Evaluate immunogenicity and efficacy of nanoparticle adjuvants with the VEEV DNA vaccine and the trivalent (WEVEE) vaccine in mice.  Continue to assess the ability of novel adjuvants to enhance the protective efficacy of viral vaccines.  Initiate research to assess MCM capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.629"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.629"
                                            },
                                            "Text": {
                                                "val": "Complete qualification\/validation of well-defined animal models of Burkholderia and Q Fever. Continue analysis of T and B cell antigen-based Q Fever vaccine candidates. Initiate manufacturing and investigative new drug (IND) enabling studies of OMV or other lead Burkholderia candidates based on results in animal models refined toward Animal Rule Licensure use. Down select tularemia vaccine based on efficacy in animals for advancement to clinical studies. Evaluate efficacy of multivalent monoclonal antibody cocktail for protection against multiple serotypes of botulinum neurotoxin in relevant animal models. Evaluate potential animal models for medical countermeasure development against broad spectrum of biological toxins. Continue nonclinical efficacy and clinical safety development of multivalent filovirus vaccine against Zaire ebolavirus, Sudan ebolavirus and Marburgvirus. Continue comparison of homologous and heterologous prime-boost regimens with filovirus candidates. Continue detailed dissection of the immune response following alphavirus and filovirus vaccination by epitope mapping and B-cell antigen receptor (BCR) antibody repertoire analysis. Continue evaluation of immunogenicity and efficacy of nanoparticle adjuvanted VEEV DNA vaccine and the trivalent WEVEE vaccine in NHP. Initiate development of multiplexed VEEV infection biomarker assay. Continue to assess MCM capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates. Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.419"
                                            },
                                            "Text": {
                                                "val": "Maintained studies that utilize clinical samples from Filovirus outbreaks in multiple international locations to refine definition of clinically relevant correlates of immunity.  Initiated novel adjuvants as platforms for utilization in biodefense vaccines. Developed and evaluated bridging strategies for interim fielding capability readiness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.928"
                                            },
                                            "Text": {
                                                "val": "Complete evaluation of hybrid antigenic proteins for use in broad spectrum vaccines for Staphylococcus Enterotoxins in relevant small animal models [moved from TM2\/MCMI].  Downselect to most promising Toll-Like Receptors against adjuvants for testing in vivo with relevant vaccines [moved from TM2\/MCMI].  Exploration of novel formulation and targeting systems for enhanced vaccine potency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.191"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.191"
                                            },
                                            "Text": {
                                                "val": "Initiate construction and evaluation of hybrid alphavirus E1\/E2 antigenic vaccines. Maintain capability and assess biodefense Burkholderia vaccine candidates in the in vitro biomimetic Modular IMmune In-vitro Construct (MIMIC) system. Evaluate production and scale-up of trivalent inactivated alphavirus vaccines and use these particles to generate new WEVEE monoclonal antibodies (mAbs). Analyze mAbs for neutralizing activity and map epitopes of strongly neutralizing mAbs. Establish, organize, and sustain the Human Specimen Archive at USAMRIID. Continue in vivo down selection of next generation TLR agonist adjuvants. Initiate evaluation of hybrid antigenic proteins for use in broad spectrum vaccines for alphaviruses."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.867"
                                            },
                                            "Text": {
                                                "val": "Evaluated FDA-approved drugs for potential repurposing as effective antivirals. Continued to evaluate novel antibody-based therapeutics for Filovirus infections. Continued identification and evaluation of novel pathogen-directed therapeutics for Filoviruses and Alphaviruses."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.284"
                                            },
                                            "Text": {
                                                "val": "Screen and evaluate novel small molecule inhibitors of alphaviral infections in vitro and in vivo.  Evaluate novel formulations to deliver antivirals to target sites and\/or to enable new dosing methods.  Evaluate modified nucleoside analogues as inhibitors of alphaviral infections in animal models for their access to the central nervous system and ability to inhibit encephalitic complications.  Identify novel nuclear import and export inhibitors for modulation of capsid localization against alphaviruses.  Initial studies target Venezuelan equine encephalitis (VEE), but there is potential for broad spectrum activity against WEE and EEE, as well."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.983"
                                            },
                                            "Text": {
                                                "val": "Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo. Continue development of small molecule ribonucleoside inhibitors directed against alphaviruses. Develop alphavirus animal models for evaluation of therapeutic countermeasures. Continue optimization of broad-spectrum inhibitors of filovirus infection that antagonize the NPC1-GP interaction. Continue studies to enhance Anti-viral Therapy Against Ebola (Zaire) and Marburg Viruses. Development of an inhalation model of VEEV in the common marmoset. Continue funding small molecule\/repurposing efforts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.243"
                                            },
                                            "Text": {
                                                "val": "Augmented FDA approved and late stage development drug screening programs for BWAs and determined  in vitro susceptibilities. Evaluated reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates. Evaluated efficacy of bioactive peptides for the ability to stimulate host protective pathways in mouse models.  Identified and validated novel targets and initiate small molecule screening for inhibitors. Developed alternative animal models to evaluate efficacy of candidates against otherwise nonpathogenic Multi-Drug Resistant (MDR) BW surrogate strains."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.484"
                                            },
                                            "Text": {
                                                "val": "Evaluate FDA approved or late stage therapeutics for activity against Burkholderia, Francisella tularensis, Bacillus anthracis, and Yersinia pestis.  Continue to evaluate reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates.  Continue the discovery and advancement of non-traditional strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.  Continue generation of MDR surrogate panels to bridge the gap between antimicrobial resistant biowarfare agents and multi-drug resistant clinical pathogens.  Organotypic platform-related work previously funded under TM2\/MCMI will be continued here."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.775"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.775"
                                            },
                                            "Text": {
                                                "val": "Continue the discovery and advancement of non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection. Continue evaluation of FDA approved and mid to late stage therapeutics for activity against wildtype and MDR Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species. Continue to evaluate reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.544"
                                            },
                                            "Text": {
                                                "val": "Continued to synthetize and optimize novel BoNT small organic molecules inhibitors (SMI) in in vitro assays (enzymology and ADME) and in vivo PK tolerability in rodents and rabbits. Continued to assess regenerative medicine opportunities vis-a-vis insulin-like growth factor IGF-1 muscle regeneration in rats extensor digitorum longus (EDL) model. Initiated evaluation of late development and FDA approved drugs for treatment of staphylococcal enterotoxin B intoxication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.015"
                                            },
                                            "Text": {
                                                "val": "Further evaluate most potent small molecule BoNT\/A inhibitors in neuronal assays and ex vivo model systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Perform safety (Good Laboratory Practice-GLP) studies with one SMI; select candidates for IND submission of one SMI and IGF-1 for treatment post BoNT A intoxication."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Pretreatments, Nerve Agents"
                                    },
                                    "Description": {
                                        "val": "Develop pretreatments and prophylactics that provide protection against all organophosphorus (OP) nerve agents. Pretreatments\/prophylactics include both stoichiometric and catalytic bioscavengers that rapidly bind and detoxify a broad spectrum of OP nerve agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.032"
                                            },
                                            "Text": {
                                                "val": "Selected promising G-type nerve agent catalytic bioscavengers candidates to analyze. Continued developing V-type nerve agent catalytic bioscavenger, and a regimen of catalytic bioscavengers effective against multiple nerve agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.669"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize catalytic bioscavengers for acceptable in vivo toxicity profile, pharmacokinetic (PK) and efficacy activity against G-type and V-type OP nerve agents in appropriate animal models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.593"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.593"
                                            },
                                            "Text": {
                                                "val": "Continue efforts developing prophylactic medical countermeasures including bioscavengers. Continue efforts developing prophylactic and pretreatment medical countermeasures, including bioscavengers. Initiate development of animal models for operationally relevant exposures to better support development of pretreatment and prophylactic MCMs and MCM concepts of use including post-exposure pre-symptomatic applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize injuries resulting from exposure to chemical warfare agents (CWAs). This effort involves the development of neuroprotectants, anticonvulsants, and improved therapies for enzyme reactivation. This work is designed to develop potential candidates that will ultimately be submitted for FDA licensure or to identify previously licensed products for new uses in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.736"
                                            },
                                            "Text": {
                                                "val": "Focused on refined technology that facilitates delivery of therapeutic regimen to the central nervous system (crossing the blood brain barrier (BBB). Selected promising molecular, nanomaterial-based drug delivery platforms for further development. Developed and screened for new potential leads as broad spectrum\/centrally acting cholinesterase reactivators. Developed a quick computational method to approximate binding of reactivators in OP- adducted cholinesterase binding site. Devised a predictive computational approach to simulate compound penetration of the BBB and applied to library of test compounds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.358"
                                            },
                                            "Text": {
                                                "val": "Support in vivo validation and characterization of therapeutics for: 1) an improved broad spectrum oxime; 2) compounds effective in the brain for enhanced neuroprotection and 3) compounds effective in the brain for enhanced survival.  Continue exploring technologies for delivery of therapeutics to the brain (crossing the blood brain barrier).  Continue supporting development and screening for broad spectrum cholinesterase reactivators that work in the brain.  Continue development of animal models for realistic operational threat agent exposure and MCM development.  Investigate dermal treatments and therapeutics for nerve agent and sulfur mustard exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.445"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.445"
                                            },
                                            "Text": {
                                                "val": "Continue synthesizing and screening broad spectrum reactivators. Continue testing of BBB penetration. Continue developing computational capabilities using molecular dynamics to predict compound ability to penetrate the BBB. Continue exploring alternate modes of drug encapsulation for delivery across the BBB. Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "89.090"
                                        },
                                        "CurrentYear": {
                                            "val": "83.838"
                                        },
                                        "BudgetYearOne": {
                                            "val": "92.846"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "92.846"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "88.809"
                                        },
                                        "BudgetYearThree": {
                                            "val": "93.823"
                                        },
                                        "BudgetYearFour": {
                                            "val": "104.821"
                                        },
                                        "BudgetYearFive": {
                                            "val": "104.255"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "68.160"
                                        },
                                        "CurrentYear": {
                                            "val": "65.648"
                                        },
                                        "BudgetYearOne": {
                                            "val": "83.999"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "83.999"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "73.090"
                                        },
                                        "BudgetYearThree": {
                                            "val": "35.432"
                                        },
                                        "BudgetYearFour": {
                                            "val": "26.460"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.317"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.060"
                                        },
                                        "CurrentYear": {
                                            "val": "5.681"
                                        },
                                        "BudgetYearOne": {
                                            "val": "5.165"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "5.165"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.790"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.675"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.975"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.098"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "80.412"
                                        },
                                        "CurrentYear": {
                                            "val": "106.223"
                                        },
                                        "BudgetYearOne": {
                                            "val": "136.553"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "136.553"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "107.315"
                                        },
                                        "BudgetYearThree": {
                                            "val": "141.385"
                                        },
                                        "BudgetYearFour": {
                                            "val": "170.160"
                                        },
                                        "BudgetYearFive": {
                                            "val": "146.138"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "64.773"
                                        },
                                        "CurrentYear": {
                                            "val": "39.504"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.388"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.388"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "62.092"
                                        },
                                        "BudgetYearThree": {
                                            "val": "38.576"
                                        },
                                        "BudgetYearFour": {
                                            "val": "40.607"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.746"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.541"
                                        },
                                        "CurrentYear": {
                                            "val": "7.145"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.950"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.950"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.850"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.728"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.060"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.532"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}