{
    "id": "2018-DefenseThreatReductionAgency-PB-0400-JBOOK-f46c7987f6a08d0ac692df5bc743b3d529085cff82f258dad959e09dff8f100c-2",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DTRA-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603160BR"
        },
        "ProgramElementTitle": {
            "val": "*Counter Weapons of Mass Destruction Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1398.986"
            },
            "PriorYear": {
                "val": "298.123"
            },
            "CurrentYear": {
                "val": "266.444"
            },
            "BudgetYearOne": {
                "val": "268.607"
            },
            "BudgetYearOneBase": {
                "val": "268.607"
            },
            "BudgetYearTwo": {
                "val": "273.973"
            },
            "BudgetYearThree": {
                "val": "277.360"
            },
            "BudgetYearFour": {
                "val": "283.382"
            },
            "BudgetYearFive": {
                "val": "288.959"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "*Program Element 0603160BR name changes from Counterproliferation Initiatives - Proliferation, Prevention and Defeat to Counter Weapons of Mass Destruction Advanced Technology Development beginning in FY 2018.\n**Project RF-Detection and Forensics Technologies subdivides into Projects RD-Detection Technologies and RF-Forensics Technologies in FY 2016.\n***Project RR title changes from Combating WMD Test and Evaluation to Countering WMD Test and Evaluation beginning in FY 2017."
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Threat Reduction Agency (DTRA) Counter Weapons of Mass Destruction (WMD) Advanced Technology Development program element funds the development and testing of subsystems and components for integration into prototype systems with the potential to transition into mature, state-of-the-art WMD surveillance, detection, defeat, prevention, nonproliferation, counterproliferation, consequence management, and treaty verification capabilities.\n\nThe Counterproliferation Initiatives - Proliferation, Prevention, and Defeat portfolio is aligned with strategic planning objectives as well as with Science and Technology (S&T) investment direction which is established annually by DTRA.  The objectives directly support policy and planning guidance from the Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction community.\n\nThe portfolio advances the Countering WMD (CWMD) mission by selecting advanced technology development initiatives that meet the following criteria: (1) Efforts are clearly defined and directly linked to mission-specific capability requirements of DTRA, the Military Departments, Combatant Commanders, other DoD and federal agencies, and international partners; (2) preliminary assessments of subsystems and components offer the highest potential for technological feasibility, operability and producibility upon transition out of S&T research; (3) activities demonstrate cost effectiveness or cost reduction potential of technologies during field testing or simulation at scale."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "290.310"
                },
                "CurrentYear": {
                    "val": "266.444"
                },
                "BudgetYearOne": {
                    "val": "259.490"
                },
                "BudgetYearOneBase": {
                    "val": "259.490"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "298.123"
                },
                "CurrentYear": {
                    "val": "266.444"
                },
                "BudgetYearOne": {
                    "val": "268.607"
                },
                "BudgetYearOneBase": {
                    "val": "268.607"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "7.813"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "9.117"
                },
                "BudgetYearOneBase": {
                    "val": "9.117"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "14.600"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.787"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "9.117"
                                },
                                "BudgetYearOneBase": {
                                    "val": "9.117"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase in FY 2018 from the previous President's Budget submission is due to the net effect of a shift in investment priorities to fund the Special Test Bed capability requirements for missile defeat in this program element, a realignment of funds from O&M to RDT&E for the Hard Target Research and Analysis Center (HTRAC) to fund new R&D subject matter expertise to identify, characterize,  increased investment in consequence of execution, and incremental Service Requirement Review Board reductions, as part of the Department of Defense reform agenda, for consolidation and understand and exploit vulnerabilities in adversary WMD programs, activities, and capabilities. reduction of service contracts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RA"
                    },
                    "ProjectTitle": {
                        "val": "Information Sciences and Applications"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.532"
                        },
                        "PriorYear": {
                            "val": "11.494"
                        },
                        "CurrentYear": {
                            "val": "11.422"
                        },
                        "BudgetYearOne": {
                            "val": "10.229"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.229"
                        },
                        "BudgetYearTwo": {
                            "val": "11.983"
                        },
                        "BudgetYearThree": {
                            "val": "12.183"
                        },
                        "BudgetYearFour": {
                            "val": "12.468"
                        },
                        "BudgetYearFive": {
                            "val": "12.733"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Sciences and Applications project provides technical expertise and reach-back support to the United States and its allies across the Countering Weapons of Mass Destruction (CWMD) mission space. The project performs continuous modeling of ad hoc computational analyses on the consequences of Weapons of Mass Destruction (WMD) in consultation with military and civilian planners, warfighters, and first responders and leverages research performed by the Project on Advanced Systems and Concepts for CWMD at the Naval Postgraduate School. The project also supports international CWMD cooperation by developing technologies and concepts suitable for foreign release.\n\nThe decrease from FY 2017 to FY 2018 is due to decreased investment in hazard and effects characterization and technical reachback support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RA: Information Sciences and Applications"
                                    },
                                    "Description": {
                                        "val": "Project RA develops modeling and simulation capabilities and provides technical reachback support to maintain and increase decision advantage for the United States and its allies through improved situational understanding across the complete CWMD mission space."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.494"
                                            },
                                            "Text": {
                                                "val": "- Continued development of global synthetic population and activity database for modeling secondary and tertiary effects using agent-based, socially coupled simulations to enable rapid modeling of infectious disease propagation and impacts of population behaviors and movement after a WMD event.\n- Continued to develop detailed models of specified nuclear facilities to analyze vulnerabilities and estimate hazards.\n- Completed over 500 WMD collateral effects products in support of Central Command Area of Responsibility targeting\/planning; completed 930 Requests for Information (RFIs) from across Combatant Commands, services and Interagency; supported the Federal Emergency Management Agency as the Interagency Modeling Atmospheric Analysis Center (IMAAC) Operations Hub; the IMAAC participated and completed analyses for 6 activations and supported 25 exercises.  Collateral effects products, RFIs and IMAAC analyses provided immediate and direct support to CWMD operational planning, incident response, and training across the DoD and Interagency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.422"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop the global synthetic population and activity database for modeling infectious disease propagation and impacts of population behaviors and movement after a WMD event.\n- Continue to develop detailed models of specified nuclear facilities to analyze vulnerabilities and estimate hazards.\n- Enhance 64-bit version of CWMD modeling and simulation planning tools for analysis of large data sets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.229"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.229"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop the global synthetic population and activity database for modeling infectious disease propagation and impacts of population behaviors and movement after a WMD event in support of Combatant Command force health protection and consequence management planning.\n- Continue to develop detailed models of specified nuclear facilities to analyze vulnerabilities and estimate hazards in support of target and consequence management planning.\n- Continue to develop processes, capabilities, and expertise in Chemical, Biological, Radiological, Nuclear, and High-yield Explosives (CBRNE) in order to provide tailored support to DoD with 24\/7 Technical Reachback."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "29.133"
                                        },
                                        "CurrentYear": {
                                            "val": "29.127"
                                        },
                                        "BudgetYearOne": {
                                            "val": "30.270"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "30.270"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.325"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.286"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.083"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.077"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "154\/0605502BR"
                                    },
                                    "Title": {
                                        "val": "Small Business Innovation Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.473"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "*RD"
                    },
                    "ProjectTitle": {
                        "val": "Detection Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "26.415"
                        },
                        "CurrentYear": {
                            "val": "17.775"
                        },
                        "BudgetYearOne": {
                            "val": "17.556"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.556"
                        },
                        "BudgetYearTwo": {
                            "val": "18.530"
                        },
                        "BudgetYearThree": {
                            "val": "20.697"
                        },
                        "BudgetYearFour": {
                            "val": "21.250"
                        },
                        "BudgetYearFive": {
                            "val": "21.681"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*Project RF-Detection and Forensics Technologies subdivides into Projects RD-Detection Technologies and RF-Forensics Technologies in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Detection Technologies project continues research formerly conducted under project RF.  This project develops, integrates, and transitions advanced concepts, technologies, and subsystems enabling enhanced nuclear and radiological location, identification, and tracking capabilities.  Leveraging gains made in applied research efforts, this project produces advancements in range, process time, sensitivity, and accuracy.  In addition, this project continues the development of novel concepts and technologies enabling the identification and exploitation of non-radiation based signatures associated with nuclear threats (e.g., transportation of nuclear materials, patterns of activity, or unique materials).\n\nThe decrease from FY 2016 to FY 2017 is due to decreased investment in radiation detection and nuclear threat detection intelligence, surveillance and reconnaissance technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RD:  Detection Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RD develops, integrates and transitions radiation detection technologies, as well as systems, tools, techniques, and procedures that take advantage of non-radiation based signatures, in order to advance warfighter capabilities to rapidly detect, localize, characterize, and interdict nuclear and radiological threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.415"
                                            },
                                            "Text": {
                                                "val": "- Demonstrated, tested, and fielded systems to remotely monitor small and wide areas which may produce or contain nuclear threats.\n- Designed and fabricated prototype passive detection systems for determining the location and signature of nuclear material and tested and characterized developmental prototype passive detection systems.\n- Transitioned near-term technologies to generate prototypes and design packages that will assist operational users.\n- Developed prototype of a new high resolution detector with reduced weight and improved form factors that can be concealed in container consistent with the operational environment.\n- Conducted advanced\/operational testing and evaluation of radiation detection systems to assess their performance.\n- Tested and evaluated the integration of high resolution detectors with lower resolution detectors to determine the potential to meet threshold radiological\/nuclear (R\/N) detection requirements.\n- Integrated nuclear threat analysis algorithms into existing systems to test and evaluate effectiveness in reducing processing time.\n- Integrated advances in materials science into lightweight, high-resolution radiation spectrometers for use in field operations.\n- Integrated new cellular technology into the Radiological\/Nuclear (R\/N) search network to ensure rapid flow of data from detectors.\n- Improved performance of new detector materials; imaging and spectroscopy systems; and signals analysis methods through rigorous laboratory and field testing.\n- Analyzed nuclear threat signatures to improve or integrate collection into sensor systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.775"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and integrate nuclear and radiological signature collections into new sensor systems.\n- Continue to integrate nuclear threat analysis algorithms into existing systems in order to evaluate accuracy and effectiveness in reducing process time.\n- Continue to demonstrate, test, and transition systems that remotely monitor nuclear and radiological threat signatures in small and wide areas.\n- Continue to develop high-fidelity radiation test objects supporting advanced assessment capabilities in order to improve radiation detection prototypes.\n- Continue to develop, test, and evaluate a hand-held radiation monitor replacement providing radioisotope identification capability and real-time information feed.\n- Develop and deploy devices enabling low cost operational testing and evaluation of radiation signature detectors against mock special nuclear material sources of interest.\n- Develop and integrate interoperable systems enabling a true common operational picture among nuclear and radiological search teams, across platforms, and within shared or distributed areas.\n- Test and evaluate new radiation detection technologies in order to validate capabilities, improve prototypes, and provide required performance data to support follow-on development.\n- Test and evaluate an operational high resolution gamma-ray imager suited for multiple mission sets to support integration with next generation nuclear imaging systems.\n- Simulate and evaluate loose nuke scenarios in order to validate nuclear threat mitigation plans developed by Department of Defense and civilian users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.556"
                                            },
                                            "Text": {
                                                "val": "- Transition sensor capabilities to replace Nuclear Biological Chemical Reconnaissance Vehicle (NBCRV) and Stryker obsolete radiological\/nuclear equipment.\n- Continue to develop, test, and evaluate a handheld radiation monitor replacement that provides radioisotope identification capability and real-time information feed.\n- Continue to develop and deploy devices to enable low-cost operational testing and evaluation of radiation and nuclear threat signature detectors against simulated special nuclear material sources of interest, high-fidelity radiation test objects, and realistic threat mockups.\n- Continue to integrate interoperable systems enabling a true common operating picture among nuclear and radiological search teams, across platforms, and within shared or distributed areas.\n- Continue to test and evaluate new radiation and nuclear threat detection technologies in an operationally relevant environment to validate capabilities, improve prototypes, and provide required performance data.\n- Complete testing and evaluation of an operational high resolution gamma-ray imager suited for multiple mission sets to support integration with next generation nuclear imaging systems.\n- Design, fabricate, test, and characterize prototype passive roadside detection systems to determine the location and signature of nuclear material.\n- Transition near-term technologies, such as helium-3 alternatives and automated particle identification, to generate prototypes and design packages that will meet operational needs.\n- Conduct advanced, operational testing and evaluation of radiation and nuclear threat detection systems to assess their performance.\n- Integrate back-end unit capabilities such as internal electronics and communications capabilities, nuclear and radiological signature collections, and non-radiation nuclear threat signature collections into new sensor systems.\n- Continue to integrate radiation and nuclear threat analysis algorithms into existing systems to evaluate accuracy and effectiveness in reducing process time and form factors. \n- Continue to demonstrate, test, and transition systems that remotely monitor nuclear and radiological threat signatures in local and wide area searches."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "15.083"
                                        },
                                        "CurrentYear": {
                                            "val": "15.936"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.769"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.769"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "17.005"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.451"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.677"
                                        },
                                        "BudgetYearFive": {
                                            "val": "18.035"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RE"
                    },
                    "ProjectTitle": {
                        "val": "Counter-Terrorism Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "551.315"
                        },
                        "PriorYear": {
                            "val": "107.265"
                        },
                        "CurrentYear": {
                            "val": "102.976"
                        },
                        "BudgetYearOne": {
                            "val": "103.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "103.869"
                        },
                        "BudgetYearTwo": {
                            "val": "105.915"
                        },
                        "BudgetYearThree": {
                            "val": "108.099"
                        },
                        "BudgetYearFour": {
                            "val": "110.632"
                        },
                        "BudgetYearFive": {
                            "val": "112.871"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Counter-Terrorism Technologies project develops and transitions a full spectrum of new technologies to counter emergent weapons of mass destruction (WMD) threats. This project supports the U.S. Special Operations Command (USSOCOM) in two research areas: (1) Countering WMD-Terrorism (CWMD-T) Counterproliferation Research and Development is a collaborative effort to develop advanced, warfighter-unique technologies to defeat terrorist WMD development\/acquisition pathways, to include defeat of the devices themselves, while minimizing risks to U.S. forces; (2) USSOCOM CWMD-T Support develops concepts and technologies to integrate and synchronize operations and activities that prevent terrorists and rogue nation states from developing, acquiring, proliferating, or using WMD. This effort supports Commander USSOCOM responsibilities under the Chairman, Joint Chiefs of Staff Unified Command Plan.\n\nThe decrease from FY 2016 to FY 2017 is due to reduced investment in next generation CWMD technologies to balance other priorities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RE: Counter-Terrorism Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RE supports Joint U.S. Military Forces, specifically USSOCOM, in the research areas of warfighter-unique, mission-specific WMD defeat, denial, counterproliferation, and interdiction technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "107.265"
                                            },
                                            "Text": {
                                                "val": "- Transitioned Multi-path COTS\/GOTS Software Defined Radio.  Over-the-horizon prototype permits deep install receiver upstream of production and capability to monitor, manage, and execute OCONUS mission from CONUS.\n- Transitioned Very Low Frequency (VLF) receiver prototype.  VLF prototype permits capability to monitor, manage, and execute low-visibility WMD missions.\n- Transitioned a Special Applications Module for MODI providing special enhanced countermeasures.\n- Deployed WMDpedia link onto the Dynamic Picture of the Operating Environment (DPOE) portal.  This tool provides SME-level information on Chemical, Biological, Radiological, Nuclear (CBRN) threats for analysts and planners.\n- Deployed a Common Operating Picture\/Common Intelligence Picture enabling users to create, share, and consume information.\n- Released DPOE V2.6, providing enhancements for searching, mapping, and collaboration.\n- Demonstrated sensor collection capability (validation and collection) from an operational facility in a configuration that can be integrated across DoD, the Intelligence Community (IC), and 17 other government organizations.\n- Demonstrated the DARPA Deep Exploration and Filtering of Text (DEFT) Automated World Actor Knowledge Extractor (AWAKE) capability to show how information from multiple formats could be combined to create a capability for analysts to research a topic by analysis and synthesis rather than by reading the document.\n- Transitioned next generation imaging technologies to enhance Explosive Ordnance Disposal (EOD) forces advanced diagnostic capabilities.\n- Developed tools used to impede Improvised Explosive Device (IED) triggers and conducted render safe diagnostics validation tests on emergent threat articles.\n- Developed precision shaped charges using a proven manufacturing process through the use or modification of an existing shaped charge design.\n- Initiated the development of rational choice and game theory algorithms and integrated into advanced Bayesian models in support of probabilistic forecasting.\n- Continued development of new counterproliferation technologies for Joint U.S. Military Forces to counter WMD, enabling warfighters to improve their ability to detect, disable, interdict, neutralize, and destroy chemical, biological, and nuclear production, storage, and weaponization facilities.\n- Continued multi-year efforts to develop innovative CWMD technologies and tools designed to locate, identify, characterize, assess, and attack WMD production and storage facilities with engineered capabilities to minimize loss of life and collateral damage.\n- Continued work on multi-year efforts to develop high fidelity test articles and enhanced electronic test objects for EOD Device Defeat."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "102.976"
                                            },
                                            "Text": {
                                                "val": "- Integrate enhancements in Natural Language Processing and Machine Reading capabilities into Joint Worldwide Intelligence Communications System (JWICS) knowledge management and planning tools.\n- Integrate, test, and deploy socio-cultural and behavioral factor data into the Intent Model to enhance threat prediction capabilities.\n- Develop applications enabling seamless information sharing between the USSOCOM CWMD Support Program (SCSP) and other intelligence agency databases.\n- Develop customizable dashboards displaying user-driven data displays and functionality on the SCSP JWICS portal.\n- Continue to support Combatant Command exercises and planning events in order to enhance existing SCSP tools and databases, and to identify and validate new requirements.\n- Continue to monitor and collaborate with other agencies, such as the Defense Advanced Research Projects Agency and the Intelligence Advanced Research Projects Agency, on advanced analytics technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "103.869"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "103.869"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop offensive counter proliferation, counter-WMD technologies.\n- Continue to develop threat specific test articles and analyses for Tiered Threat Modeling Archive.\n- Continue to develop technologies that defeat unintended radio emissions.\n- Continue to develop lighter, smaller, more effective breaching capabilities.\n- Continue to develop next generation flexible x-ray technology applications.\n- Continue to develop WMD facility breaching technology applications.\n- Continue to develop Nuclear, Biological, and Chemical (NBC) defense technologies.\n- Continue to develop WMD render safe technologies.\n- Continue to develop technologies to maneuver in a WMD environment.\n- Continue to develop WMD pathway (process & facility) defeat technologies.\n- Perform prototype testing of machine learning tools for integration with the USSOCOM CWMD Support Program's (SCSP) Next Generation Joint Worldwide Intelligence Communications System (JWICS) Portal.\n- Integrate High Performance Computing (HPC) into the JWICS operating environment to provide more robust data analytics and improve accuracy of emerging WMD threat forecasts.\n- Develop and test technologies for evaluating large quantities of data and intelligence information to improve smart discovery, data inferencing, and system-generated cueing and alerting capabilities.\n- Develop Graphic Analytics and Knowledge-Base Reasoning HPC applications.\n- Initiate development of models to enhance Discover & Search components of the Anticipatory WMD Analyst Reasoning Environment (AWARE) tool.\n- Continue to develop DPOE Knowledge Graphic and Predictive Analytics for Unknown Unknowns.\n- Develop Course of Action models for anticipatory adversarial actions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.795"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "*RF"
                    },
                    "ProjectTitle": {
                        "val": "Forensics Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "356.817"
                        },
                        "PriorYear": {
                            "val": "40.373"
                        },
                        "CurrentYear": {
                            "val": "38.540"
                        },
                        "BudgetYearOne": {
                            "val": "40.286"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.286"
                        },
                        "BudgetYearTwo": {
                            "val": "42.580"
                        },
                        "BudgetYearThree": {
                            "val": "40.925"
                        },
                        "BudgetYearFour": {
                            "val": "42.144"
                        },
                        "BudgetYearFive": {
                            "val": "43.124"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "*Project RF-Detection and Forensics Technologies subdivides into Projects RD-Detection Technologies and RF-Forensics Technologies in FY 2016."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Forensics Technologies project develops, integrates, tests, and demonstrates post-detonation nuclear forensics systems providing accurate, rapid, and reliable means to collect, analyze, and evaluate prompt data and debris from a nuclear or radiological event in support of exploitation and attribution efforts.  These forensic capabilities enable the Defense Threat Reduction Agency (DTRA) and its trusted partners to detect, locate, identify, track, and interdict nuclear and radiological threats, including weapons and material, and enablers to their acquisition and development.  In accordance with DoD Directive S-2060.04, DTRA serves as the U.S. Government lead for post-detonation National Technical Nuclear Forensics (NTNF) research and development (R&D).  As the central NTNF R&D coordinator, DTRA works in consultation with interagency partners to develop and improve ground-based capabilities supporting exploitation and attribution missions.  NTNF R&D supports advanced research in the following areas: (1) Prompt nuclear effects exploitation for attribution; (2) nuclear device characterization for forensics; (3) nuclear forensic materials exploitation for attribution.\n\nThe decrease from FY 2016 to FY 2017 is due to decreased investment in monitoring and verification technology, device characterization for forensics, and materials exploitation for attribution.  The increase from FY 2017 to FY 2018 is due to the relative impact of reduction in FY 2017."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RF:  Forensics Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RF supports nuclear forensics by developing: (1) technologies, systems and procedures for post detonation nuclear forensics; (2) on\/off-site analysis to meet forensic, verification, monitoring and confidence-building requirements; (3) technologies to detect, locate, identify, track, and interdict nuclear and radiological threats, including enablers to their acquisition and development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "40.373"
                                            },
                                            "Text": {
                                                "val": "- Completed final set of DISCREET OCULUS installations in the Washington DC metropolitan area, enabling the capture of prompt diagnostic data signatures in the event of a nuclear or radiological detonation. Two of three city\/region area installation efforts are complete, with a third ongoing in NYC\/Newark in preparation for transition to the USAF U.S. Prompt Diagnostics System in FY 2018.\n- Tested and demonstrated performance of DISCREET OCULUS speed-of-light sensors and ability to determine reaction time history using the Sandia National Laboratories High-Energy Radiation Megavolt Electron Source (HERMES) III accelerator facility as a simulated nuclear detonation source.\n- Transitioned advanced gamma spectroscopic capabilities to the operational user providing reliable forensic analytical results on several fission\/activation products directly, with no radiochemical separations, significantly reducing the time and cost required to measure these nuclides.\n- Completed a major joint experimental campaign with the National Nuclear Security Administration (NNSA) at the National Criticality Experiments Research Center (NCERC) within the Device Assembly Facility (DAF) at NNSS providing vital nuclear material diagnostic information to the nuclear forensics community.\n- Developed a modular prototype using advanced materials and techniques to collect and detect gaseous radionuclide signatures of evasive nuclear testing.\n- Developed and delivered tools to DoD operational units for estimation of probable delay times before escape of radio isotopic gases from underground nuclear tests.\n- Developed methodology for quantitative determination of systematic uncertainty in detection and discrimination of nuclear testing signatures.\n- Developed prototype cosmic-ray muon imaging solution for standoff detection of nuclear warheads in storage or deployed on strategic launch and delivery systems. Enhanced detection capabilities could lead to adoption of this technology for verification of future Strategic Arms Reduction Treaties. \n- Developed infrastructure and capability for iterative testing, refinement, and integration of national monitoring capabilities. \n- Continued to develop, test, demonstrate, and field upgraded prototypes for prompt diagnostics, debris collection, and sample analysis; modeling to support nuclear device reconstruction; and forensics data to decrease timeline, lower uncertainties, and increase confidence in technical nuclear forensics conclusions.\n- Continued to develop tools based on near-source small-scale strong-motion science to assist detection and characterization of low yield and evasive nuclear testing.\n- Conducted laboratory experiments with lasers to assess shock\/seismic signatures from underground nuclear tests.\n- Evaluated advanced methods to better integrate the collection, detection, and analysis of low-yield or evasive nuclear weapons testing signatures. \n- Continued to develop long-term operational solutions to detect, collect, and analyze gas and radionuclide signatures of nuclear testing.\n- Validated alternate signatures of nuclear weapons testing and developed measurement techniques. \n- Enhanced the on-site inspection system and virtual training tool with additional operational scenarios for nuclear materials production monitoring in support of the Fissile Material Cutoff Treaty and the Army nuclear disablement\/elimination mission.\n- Provided technical support for certification of compliance of foreign digital electro-optical sensors with Open Skies Treaty limits."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.540"
                                            },
                                            "Text": {
                                                "val": "- Complete initial operational assessment of advanced prompt diagnostics for ground-based sensor prototype systems.\n- Complete plans and carry out associated acquisition activities for the transition of advanced prompt diagnostics sensor prototype systems to the U.S. Prompt Diagnostics System.\n- Demonstrate advanced technologies for the collection of alternative nuclear detonation signatures, such as electromagnetic pulse and transient ionospheric disturbances, to detect and locate clandestine nuclear testing.\n- Demonstrate advanced technologies for cosmic ray, muon-excited remote counting of nuclear warheads in delivery vehicles and in storage, supporting treaty monitoring, and verification.\n- Develop, test, and demonstrate a portable ground-based sensor prototype for post-detonation prompt diagnostics under DISCREET OCULUS.\n- Develop, test, and demonstrate enhanced prototype technologies for prompt diagnostics, debris collection, data analysis, debris diagnostics, and technical capability modeling to support nuclear device reconstruction and attribution, as well as to decrease timeline, lower uncertainty, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Develop, test, and demonstrate enhanced prototype technologies to support validation and verification processes and capabilities in order to decrease timeline, lower uncertainty, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Develop, evaluate, and demonstrate surrogate debris materials used in validation and verification technologies and in field and fixed laboratory analytic processes.\n- Develop advanced radionuclide gas collection technologies in support of counterproliferation and compliance verification for the Non-Proliferation Treaty and the Comprehensive Test Ban Treaty.\n- Develop advanced technologies to detect and monitor for low-yield nuclear tests, including novel techniques for collecting and observing material emissions and source region seismic signatures.\n- Continue to develop new prompt diagnostic technologies to improve sensor portability, with emphasis on size, weight, and power consumption reduction, and on expanded operational capability.\n- Prepare and conduct an interagency technology demonstration of end-to-end nuclear forensics capabilities.\n- Prepare an international technical demonstration of post-detonation nuclear forensics research and development capabilities.\n- Coordinate with partner nations to improve global U.S. nuclear forensics and attribution capabilities, under appropriate international agreements.\n- Integrate nuclear threat analysis algorithms into existing systems to test and evaluate their effectiveness in reducing processing time.\n- Demonstrate, test, and field systems to remotely monitor small and wide areas which may produce or contain nuclear threats.\n- Design and fabricate prototype passive detection systems for determining the location and signature of nuclear material and test and characterize developmental prototype passive detection systems.\n- Transition near-term technologies to generate prototypes and design packages that will assist operational users.\n- Conduct advanced\/operational testing and evaluation of radiation detection systems to assess their performance.\n- Develop and build a new high-resolution detector with reduced weight and improved form factors that can be concealed in container consistent with the operational environment.\n- Integrate new cellular technology into the Radiological\/Nuclear (R\/N) search network to ensure rapid flow of data from detectors.\n- Test and evaluate the integration of high-resolution detectors with lower resolution detectors to determine the potential to meet threshold R\/N detection requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.286"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.286"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop, test, and demonstrate enhanced prototype technologies for prompt diagnostics, debris collection, analysis and diagnostics, and device and modeling to support nuclear device reconstruction and attribution, as well as to decrease timeline, lower uncertainty, and increase confidence in technical nuclear forensics conclusions supporting attribution.\n- Complete preparations and conduct an interagency technology demonstration and evaluation of end-to-end post-detonation nuclear forensics capabilities.\n- Evaluate surrogate debris materials as part of a demonstration and evaluation of field\/fixed laboratory analysis and debris diagnostics processes.\n- Develop, evaluate, and demonstrate surrogate debris materials to validate and verify newly developed capabilities, and to realistically exercise field and fixed laboratory analytic and diagnostic processes.\n- Continue to develop, test, and demonstrate prototype ground-based prompt diagnostic technologies that improve sensor portability, with emphasis on size, weight, and power consumption reduction, and expand operational capability.\n- Initiate transition of advanced prompt diagnostics sensor prototype systems to the U.S. Prompt Diagnostics System.\n- Expand identification and documentation of improvised nuclear device (IND) signatures through modeling, simulation, and experiments, and develop tools and capabilities to support the attribution of IND detonations. \n- Evaluate capability to rapidly rule-in\/rule-out known foreign devices using prompt and radiochemical signatures in a simulated realistic technology demonstration.\n- Continue to coordinate with partner nations to enhance and improve global U.S. nuclear forensics and attribution capabilities, under appropriate international agreements.\n- Initiate simulation of and assess source and propagation data for site-specific signatures from evasive and low-yield underground nuclear explosions.\n- Continue to develop algorithms and tools for collection and high-fidelity modeling and analysis of local seismic signatures of evasive and low-yield nuclear tests.\n- Collect and analyze physical response data from natural and man-made events that provide signals similar to those from low-yield, evasive underground nuclear explosions.  Compare these data with results produced by computer simulation of the events.\n- Continue to develop advanced, modular radionuclide gas collection technologies in support of counterproliferation goals and compliance verification for the Non-Proliferation Treaty and the Comprehensive Test Ban Treaty.\n- Continue to develop advanced technologies to detect and monitor low-yield nuclear tests, including novel techniques for collecting and observing material and electromagnetic emissions and source-region seismic signatures."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.525"
                                        },
                                        "CurrentYear": {
                                            "val": "10.008"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.274"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.274"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "10.345"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.560"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.771"
                                        },
                                        "BudgetYearFive": {
                                            "val": "10.991"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "123\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "7.156"
                                        },
                                        "CurrentYear": {
                                            "val": "4.568"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.727"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.727"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.710"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.367"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.899"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.172"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RG"
                    },
                    "ProjectTitle": {
                        "val": "Defeat Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "95.067"
                        },
                        "PriorYear": {
                            "val": "21.002"
                        },
                        "CurrentYear": {
                            "val": "20.710"
                        },
                        "BudgetYearOne": {
                            "val": "22.161"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.161"
                        },
                        "BudgetYearTwo": {
                            "val": "22.557"
                        },
                        "BudgetYearThree": {
                            "val": "23.031"
                        },
                        "BudgetYearFour": {
                            "val": "23.145"
                        },
                        "BudgetYearFive": {
                            "val": "23.619"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Defeat Technologies project develops, integrates, demonstrates, and transitions innovative kinetic and non-kinetic weapon capabilities to expand traditional and asymmetric options available to Combatant Commanders to deny, disrupt, and defeat Weapons of Mass Destruction (WMD) while minimizing collateral effects.  Technology development focuses on the physical or functional defeat of (1) chemical, biological, nuclear, and radiological threat materials, (2) an adversary's ability to deliver the same, as well as (3) the physical and non-physical support networks enabling both.  This program achieves these goals through the systematic identification and maturation of technologies capable of defeating WMD agents or agent-based processes, then integrating them into weapons, delivery systems, or rapid WMD elimination capabilities.  This effort includes developing specific WMD agent\/agent-based process simulants, test infrastructure, and sampling capability required for effective development, testing, and evaluation of next generation capabilities to ensure optimum weapon solutions are achieved.  Requirements are delineated in Agency Priority Lists for lethal and non-lethal Countering WMD (CWMD) capability.  Based on specified requirements, weapons and capabilities are transitioned to a Service program of record for system acquisition.\n\nThe decrease from FY 2016 to FY 2017 is due to decreased investment in next generation CWMD technologies to balance other priorities.  The increase from FY 2017 to FY 2018 is due to the relative impact of reductions in FY 2017."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RG:  Defeat Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RG develops advanced technologies and weapon concepts and validates their applicability to CWMD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.002"
                                            },
                                            "Text": {
                                                "val": "- Completed design refinements to and initiated demonstration of Heated and Mobile Munitions Employing Rockets (HAMMER) weapon system and subsystems and integration through analysis and testing up to and including full scale static testing to achieve Technology Readiness Level (TRL) 4\/5.  HAMMER provides a concept demonstration for penetrating weapons which mitigate collateral contamination effects through: low overpressure, minimal target structure damage, and no aerosolization.\n- Conducted Modular Autonomous CWMD System Increment A (MACS-A) Risk Reduction Test 2, which demonstrated increased supervised autonomous technologies addressing multiple payload configurations to enhance combating WMD and included navigation in an underground facility in extreme obscurants with limited communications.  MACS-A addresses the ability to enable plug-and-play technologies as a force multiplier.\n- Transitioned initial MACS-A concept to U.S. Army for further development.\n- Demonstrated a highly resilient weapon design that survived two separate shock environments at different velocities, enabling detailed prototype work on other sub-systems with a known shock environment to meet TRL 6 specifications prior to transition.  Additionally, the body of knowledge resulting from the construction of high fidelity targets (softer than cement) to meet specifications of analogous high fidelity soil-codes, penetration tools, and build properties will serve many communities of interest investigating earth penetrating weapons and ground sensor designs.\n- Continued development of access denial or denial-of-use technologies for CWMD applications.\n- Continued functional defeat system development, testing, and demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.710"
                                            },
                                            "Text": {
                                                "val": "- Conduct static tests of full-scale HAMMER weapon system and initiate preparation for full-scale dynamic tests.\n- Conduct static demonstration of initial capability of access denial and denial-of-use technologies against WMD representative targets.\n- Initiate Agent Defeat Penetrator weapon system design effort.\n- Initiate access denial weapon concept design effort.\n- Continue to develop and integrate classified component and system designs. Prepare to conduct initial demonstrations.\n- Continue to develop and test functional defeat system.\n- Continue to develop and test diagnostic capability to meet emerging needs for agent defeat."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.161"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.161"
                                            },
                                            "Text": {
                                                "val": "- Conduct dynamic sled tests of full-scale HAMMER weapon system and prepare for technology transition starting in FY 2019.\n- Conduct full scale demonstration of access denial and denial-of-use technologies against WMD representative targets.\n- Accomplish static testing of a full-scale Agent Defeat Penetrator weapon system against a representative WMD target.\n- Continue development and testing of a new access denial weapon concept.\n- Continue to develop technologies in support of agent defeat and associated facilities.\n- Continue to develop and test diagnostic capability to meet emerging needs for agent defeat.\n- Conduct MACS follow-on incremental component\/system demonstration.\n- Conduct functional defeat system demonstration.\n- Develop and integrate MACS Family of Systems Enabling Technologies in preparation for a system demonstration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.946"
                                        },
                                        "CurrentYear": {
                                            "val": "11.304"
                                        },
                                        "BudgetYearOne": {
                                            "val": "11.060"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "11.060"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.290"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.530"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.770"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.017"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RI"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear Survivability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "37.908"
                        },
                        "PriorYear": {
                            "val": "6.621"
                        },
                        "CurrentYear": {
                            "val": "6.561"
                        },
                        "BudgetYearOne": {
                            "val": "6.658"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.658"
                        },
                        "BudgetYearTwo": {
                            "val": "6.729"
                        },
                        "BudgetYearThree": {
                            "val": "6.854"
                        },
                        "BudgetYearFour": {
                            "val": "6.992"
                        },
                        "BudgetYearFive": {
                            "val": "7.132"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear Survivability project develops, integrates, demonstrates, and transitions innovative technologies for the protection of mission-essential personnel, critical military and national defense capabilities, and associated control and support systems during a nuclear event.  Research under this project supports the mission critical systems identified under Department of Defense (DoD) Instruction 3150.09, Chemical, Biological, Radiological, and Nuclear (CBRN) Survivability Policy.  The Defense threat Reduction Agency (DTRA) is the DoD-designated center of excellence for electromagnetic pulse survivability assessments.  The System Vulnerability and Assessment effort develops nuclear assessment capabilities to support operational planning, weapon effects predictions, and strategic system design.  This activity also provides the DoD’s nuclear design and protection standards for new and existing systems, e.g., command and control facilities and aircraft.  Key systems include the Nuclear Command and Control system, the net-centric thin-line, and both military and civilian satellites and associated support systems.  The Radiation hardened nano-electronics effort develops and integrates radiation-hardened, high-performance prototype nano-electronics to meet DoD space and strategic system requirements.  The Human Survivability supports the Nuclear Test Personnel Review Program (NTPR), confirming the participation of Atomic Veterans in nuclear testing and radiological events and providing radiation dose assessments.  The NTPR is administered by the Department of Veterans Affairs and the Department of Justice for radiogenic disease compensation programs.\n\nThe decrease from FY 2016 to FY 2017 is due to decreased investment in Nuclear Surety."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RI: Nuclear Survivability"
                                    },
                                    "Description": {
                                        "val": "Project RI develops, integrates, and transitions novel technologies that radically enhance the survivability and resilience of DoD nuclear forces and their associated control and support systems in the event of an attack or other hostile action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.621"
                                            },
                                            "Text": {
                                                "val": "- Executed Mighty Guardian XVIII force-on-force test to evaluate nuclear security policy at the Navy’s Strategic Weapons Facility Pacific, Naval Base Kitsap, WA.\n- Published Hazard Prediction Analysis Capability Health Effects from Nuclear and Radiological Environments Version 1.0 Technical Reference Manual.\n- Continued the development of the next generation of Defense Integration and Management of Nuclear Data Services (DIAMONDS) network and infrastructure design.\n- Modernized DIAMONDS software code with design reviews and meetings with users for future needs\/requirements. \n- Fielded and continued to evaluate test-bed system at select user sites."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.561"
                                            },
                                            "Text": {
                                                "val": "- Produce technical reports to address DoD concerns for radiogenic disease related to potential ionizing radiation exposure.\n- Fabricate Pathfinder & Product Demonstration Vehicle to support technology transfer from (6.2) Applied Research to the United States Air Force\/Space & Missile Center and National Reconnaissance Office, for maturation in their Productization & Qualification program in 6.4 Advanced Component Development and Prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.658"
                                            },
                                            "Text": {
                                                "val": "- Continue producing technical reports addressing DoD radiogenic disease concerns; which address Congressional interest in historical veteran radiation exposure and present day radiological exposures of the DoD-affiliated population.\n- Complete development of the Satellite System Natural & Nuclear Environment Protection Standard.\n- Initiate development of a Satellite System Natural & Nuclear Environment Protection Handbook.\n- Complete update of the NATO Allied Engineering Publication AEP-04 Nuclear Survivability Criteria for Armed Forces Material and Installations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "30.896"
                                        },
                                        "CurrentYear": {
                                            "val": "34.051"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.103"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.103"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.736"
                                        },
                                        "BudgetYearThree": {
                                            "val": "35.438"
                                        },
                                        "BudgetYearFour": {
                                            "val": "36.161"
                                        },
                                        "BudgetYearFive": {
                                            "val": "36.896"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RL"
                    },
                    "ProjectTitle": {
                        "val": "Nuclear & Radiological Effects"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.528"
                        },
                        "BudgetYearOne": {
                            "val": "3.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.500"
                        },
                        "BudgetYearTwo": {
                            "val": "3.456"
                        },
                        "BudgetYearThree": {
                            "val": "3.457"
                        },
                        "BudgetYearFour": {
                            "val": "3.455"
                        },
                        "BudgetYearFive": {
                            "val": "3.455"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Nuclear and Radiological Effects project develops, integrates, and transitions nuclear and radiological assessment modeling tools for use in military planning processes. The assessment modeling tools provide critical analytics for Consequence of Execution (COE) considerations during nuclear targeting and post-detonation nuclear response, supporting interagency strategic and tactical decision making. These COE considerations can include the full range of political, military, economic, social, infrastructure, and information (PMESII) factors and their interaction, extending analytical capabilities beyond common damage assessment practices and into second and third order effects. These activities\/efforts support Combatant Commands and other Department of Defense (DoD) organizations by providing accurate and reliable consequence assessment and response information.  \n\nThe increase from FY 2016 to FY 2017 is due to the transition of nuclear effects modeling applied research efforts to advanced technology development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RL: Nuclear and Radiological Effects"
                                    },
                                    "Description": {
                                        "val": "Project RL develops nuclear and radiological assessment modeling tools to support military operational planning, weapons effects predictions, and strategic system design decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.528"
                                            },
                                            "Text": {
                                                "val": "- Develop nuclear weapon effects tools specifically designed for transition to military targeting systems.\n- Develop nuclear weapon effects tools specifically designed to support nuclear survivability and standards formulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "- Continue to add militarily significant nuclear weapon effects to tools specifically designed for transition to military targeting systems.\n- Continue to add militarily significant nuclear weapon effects to tools specifically designed to support nuclear survivability and standards formulation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.333"
                                        },
                                        "CurrentYear": {
                                            "val": "28.668"
                                        },
                                        "BudgetYearOne": {
                                            "val": "29.228"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "29.228"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.640"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.324"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.999"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.695"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "*123\/0605000BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Systems Development"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "64.199"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Prior year funds related to this this project in program element number 0605000BR."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RM"
                    },
                    "ProjectTitle": {
                        "val": "WMD Counterforce Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "131.135"
                        },
                        "PriorYear": {
                            "val": "19.374"
                        },
                        "CurrentYear": {
                            "val": "23.138"
                        },
                        "BudgetYearOne": {
                            "val": "24.663"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.663"
                        },
                        "BudgetYearTwo": {
                            "val": "25.447"
                        },
                        "BudgetYearThree": {
                            "val": "25.892"
                        },
                        "BudgetYearFour": {
                            "val": "26.473"
                        },
                        "BudgetYearFive": {
                            "val": "27.006"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Weapons of Mass Destruction (WMD) Counterforce Technologies project develops, integrates, demonstrates, and transitions emerging technologies enabling efforts to find, characterize, assess, and plan for the defeat of WMD threats. There are two core research efforts in this project. The WMD battlespace awareness effort provides warfighters with capabilities to find, characterize, and assess WMD threats. This effort develops and integrates sensing technologies with multi-mission Unmanned Aerial System payloads. The Countering WMD (CWMD) weapons effects effort develops modernized, fast-running, validated CWMD planning tools and integrates modeling and simulation software to optimize the execution of WMD and associated hard target defeat operations.\n\nThe increase from FY 2016 to FY 2017 is due to increased investment in WMD reconnaissance technology and weapons effects and planning tools. The increase from FY 2017 to FY 2018 is due to increased investment in weapons effects and planning tools technology development."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RM:  WMD Counterforce Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RM provides: (1) full-scale testing of CWMD weapons effects, weapon effects modeling, and weapon delivery system optimization; and (2) WMD sensor, surveillance, and data processing technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.374"
                                            },
                                            "Text": {
                                                "val": "- Validated correlation between Biological Intelligence, Surveillance, and Reconnaissance (Bio-ISR) Mobile Ground Sensor (MGS) training aid and high priority biological warfare agent; this successful test was critical for continued development of counter-biological warfare search capabilities meeting customer requirements.\n- Developed first generation Bio-ISR Loop Mediated Isothermal Amplification (LAMP) Bio Identifier; the LAMP system will provide end-users with a field presumptive identification capability for biological warfare threat agents.\n- Developed and transitioned Granite Toupee CWMD system (GT) Phase I to meet emergent customer requirements; GT reduces operator CWMD target engagement dwell times and increases operator safety during neutralization of WMD materials.\n- Transitioned initial biological search technologies (Biological-Intelligence, Surveillance and Reconnaissance (Bio-ISR) Spiral 1) to DoD and Interagency end-users. Initiated planning for Bio-ISR Spiral 2 demonstration of improved biological search technologies.\n- Transitioned models for blast propagation through failing blast doors, sufficient to predict both the response of the blast door and the hazard to people and equipment.  A stand-alone fast running model (FRM) was delivered to U.S. Forces Korea and the Republic of Korea (ROK) Agency for Defense Development.\n- Completed Integrated Munitions Effectiveness Assessment (IMEA) 11.1, supporting target characterization (e.g., 4D processes, adobe structures, barrier walls, scalable equipment), ground operations (e.g., Concept Development and Experimentation (CDE), fragment, and crater debris effects and visualization), and air delivered weapon planning (e.g., GPS jamming, slab strength reduction for follow-on weapons, and hard target void sensing fuse updates), along with DTRA informal accreditation to allow the use of IMEA 11.1 for Targeting Weaponeering Assistance Cell Reachback support.\n- Supported Army Program Manager for Unmanned Systems in performing analysis of WMD Aerial Collection System transition activities, fielding, and procurement.\n- Delivered prototype 64-bit version of CWMD modeling and simulation planning tools for analysis of large data sets.\n- Delivered Targeting\/Weaponeering academics and targeting recommendation packages for Combatant Commands.\n- Delivered agent defeat modeling capabilities (Human Injury, Dynamic Pressure, and Structural Response) for DTRA’s Reachback mission. \n- Demonstrated unmanned platform capable of high-altitude\/long-range glide, vertical takeoff, and landing transition, and egress for covert emplacement of Chemical, Biological, Radiological, and Nuclear (CBRN) payloads\/sensors.\n- Demonstrated nano-material based sensor\/reporting system for detection of biological and chemical threats. \n- Designed, developed, integrated, and tested computer vision and autonomous navigation on unmanned systems to enable precise CBRN payload emplacement.\n- Initiated the development of a low-visibility sensor\/detection device for chemical search missions.\n- Continued to develop technology for enhanced area search, localization, and point detection\/identification tools for biological threats of interest (Spiral 2).\n- Continued to develop improved agent defeat modeling capabilities for WMD target attack planning.\n- Provided U.S. Central Command, Air Forces Central Command, and the Combined Joint Task Force Operation Inherent Resolve with over 300 Target Recommendation Packages."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.138"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate proof of concept for next-generation chemical warfare agent detector. \n- Demonstrate enhanced WMD sample collection system for low-visibility search operations.\n- Demonstrate Biological Intelligence Surveillance and Reconnaissance (Bio-ISR) Spiral 2 enhanced area search sensors\/capabilities for counter-bio search missions.\n- Integrate, test and demonstrate CBRN defeat technologies in a remotely-operated unmanned payload. \n- Test and validate the Vertical Take-off and Landing Autonomous Precision Emplacement System delivering chemical, biological, radiological and nuclear defeat payloads.\n- Transition enhanced structural response and WMD agent dispersion\/neutralization models, using new software architecture for improved WMD vulnerability assessment and force protection planning capabilities. \n- Transition final prototype of advanced area search sensor to counter biological warfare threats. \n- Complete phase one of three new software architecture developments, allowing WMD defeat modeling and simulation planning tools (i.e., IMEA) to enhance integration with partner agency tools.\n- Publish targeting\/weaponeering academics and targeting recommendation packages for Combatant Commands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.663"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.663"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate sample extraction prototype capability for rapid sampling of hazardous chemicals from solid storage.\n- Continue to demonstrate enhanced WMD sample collection and analysis systems for low-visibility search operations.\n- Demonstrate mission planning and analytical tools for chem-search operations, including sensor emplacement and source attribution.\n- Design, test and integrate Granite Toupee Phase II agitation and injection system upgrades to increase target prosecution efficiency and effectiveness.\n- Conduct Hydra Spear End-User Evaluation to gain operator perspective and catalog recommended prototype system upgrades for final system production.   \n- Conduct Hydra Shield Operational Evaluation to determine system effectiveness and operational utility against WMD targets in representative environments.  \n- Begin phase two of three new software architecture developments, allowing WMD defeat modeling and simulation planning tools (i.e., IMEA, VAPO) to more quickly and efficiently enhance integration with planning tools used by partner agencies and international allies. \n- Conduct proof of concept demonstrations for enhanced area search sensors and capabilities for biological weapon search missions."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "12.873"
                                        },
                                        "CurrentYear": {
                                            "val": "12.097"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.552"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.552"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.612"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.852"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.129"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.395"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "**RR"
                    },
                    "ProjectTitle": {
                        "val": "Countering WMD Test and Evaluation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.052"
                        },
                        "PriorYear": {
                            "val": "2.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.500"
                        },
                        "BudgetYearTwo": {
                            "val": "12.500"
                        },
                        "BudgetYearThree": {
                            "val": "12.500"
                        },
                        "BudgetYearFour": {
                            "val": "12.500"
                        },
                        "BudgetYearFive": {
                            "val": "12.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "**Project RR title changes from Combating WMD Test and Evaluation to Countering WMD Test and Evaluation beginning in FY 2017."
                        },
                        "ProjectMissionDescription": {
                            "val": "Project RR provides a unique national test bed capability for simulated weapons of mass destruction (WMD) facility characterization, weapon-target interaction, and WMD facility defeat testing to respond to operational needs by developing and maintaining test beds used by the Department of Defense (DoD), the Military Services, the Combatant Commanders and other Federal Agencies to evaluate the implications of WMD, conventional, and other special weapon use against U.S. military or civilian systems and targets.\n\nThe decrease from FY 2016 to FY 2017 is due to a relative impact of increased investment in FY 2016 for crane operations and build-out of the test bed structures at the Nevada National Security Site for sensor development and testing.  The increase from FY 2017 to FY 2018 is due to increased investment in the Special Test Bed for missile defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RR: Countering WMD Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Project RR provides a unique national test bed capability for simulated WMD facility characterization, weapon-target interaction, and WMD facility defeat testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "- Initiated crane operations 7 and 8 and the build-out of test bed structures at the Nevada National Security Site for sensor development and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.500"
                                            },
                                            "Text": {
                                                "val": "- Support Combatant Command exercises and planning events at the Nevada Test Bed in order to develop missile defeat technologies, tools, and capabilities.\n- Develop interagency capabilities and special tests in support of national priority programs and mission requirements.\n- Augment scheduling, test planning, maintenance and analysis capabilities for missile defeat technology tests and demonstrations."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "20\/0602718BR"
                                    },
                                    "Title": {
                                        "val": "Counter Weapons of Mass Destruction Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.718"
                                        },
                                        "CurrentYear": {
                                            "val": "13.666"
                                        },
                                        "BudgetYearOne": {
                                            "val": "13.652"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "13.652"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.464"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.945"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.288"
                                        },
                                        "BudgetYearFive": {
                                            "val": "13.586"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "RT"
                    },
                    "ProjectTitle": {
                        "val": "Target Assessment Technologies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "191.160"
                        },
                        "PriorYear": {
                            "val": "63.579"
                        },
                        "CurrentYear": {
                            "val": "41.794"
                        },
                        "BudgetYearOne": {
                            "val": "27.185"
                        },
                        "BudgetYearOneBase": {
                            "val": "27.185"
                        },
                        "BudgetYearTwo": {
                            "val": "24.276"
                        },
                        "BudgetYearThree": {
                            "val": "23.722"
                        },
                        "BudgetYearFour": {
                            "val": "24.323"
                        },
                        "BudgetYearFive": {
                            "val": "24.838"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Target Assessment Technologies project develops, integrates, tests, demonstrates, and transitions processes and technologies providing advanced capabilities in the areas of Weapons of Mass Destruction (WMD) target assessment and functional defeat.  The functional defeat process includes finding and identifying a facility, characterizing its function and physical layout, determining current or future vulnerabilities to available defeat mechanisms, planning and executing an attack, assessing damage, and denying reconstitution efforts.  Applying these processes to time-dependent constraints related to WMD target characterization and threat analysis presents a further technical challenge.  This project develops analytical tools and processes required to (1) find and characterize WMD targets and associated hard and deeply buried targets and to (2) assess in real time the results of physical and functional defeat operations (such as a direct attack).  These novel, dynamic capabilities enable Combatant Commands and the intelligence community (IC) to hold at risk high value targets possessed by adversaries.\n\nThe decrease from FY 2016 to FY 2017 is due to the projected completion of the development and integration of high-priority find, characterize, and assess sensor technologies and supporting algorithms and software.  The decrease from FY 2017 to FY 2018 is due to decreased investment reflecting the transition of the previously mentioned high-priority sensor technology and supporting algorithms to the combatant commands."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RT: Target Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Project RT provides Combatant Commands and the IC with technologies and processes to find and characterize WMD targets and hard and deeply buried targets and then assess the results of attacks against those targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "63.579"
                                            },
                                            "Text": {
                                                "val": "- Completion of two developmental demonstrations\/exercises (Crane Ops 5 and Crane Ops 6) to gather sensor data, develop signatures, and conduct sensor phenomenology analysis in support of further program development.\n- Designed, built, and delivered realistic test article to enhance fidelity of sensor demonstrations and testing.\n- Developed new and enhanced (range\/sensitivity) detection capabilities and enhanced delivery capabilities of the deployable sensor project.\n- Developed and demonstrated Nuclear WMD Defeat Model for support of IC CWMD analysis and functional defeat targeting.\n- Developed and demonstrated Chemical–Biological Weapons Emerging Threats Model capability for support of IC CWMD analysis and course of action selection.\n- Conducted validation and verification of thermal process modeling capability for support of IC functional vulnerability analysis of hard or deeply buried WMD related targets.\n- Demonstrated initial soil composition and layering penetration prediction model for support of target characterization and mission planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.794"
                                            },
                                            "Text": {
                                                "val": "- Demonstrate range and sensitivity detection capabilities and enhanced delivery system for a deployable remote ground sensor.\n- Conduct integration testing and algorithm validation of a deployable prototype ground sensor.\n- Integrate deployable ground sensor data outputs into Dynamic Characterization Modeling Tools to support time-dependent target analysis.\n- Develop processes and approaches for characterization of \"Pattern of Life\" based upon multiple modalities of data input. \n- Develop analytical processes for planning Functional Defeat of UGFs based on \"Pattern of Life\" analysis and near-real-time information updates.\n- Continue to develop WMD complex process models into target facility characterizations.\n- Continue to develop geo-technical soil and rock models for use in target characterization and sensor deployment planning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.185"
                                            },
                                            "Text": {
                                                "val": "- Complete prototype development, final documentation, and technical report in preparation for transition of a deployable remote ground sensor project.\n- Develop detailed feasibility study and program plan for WMD and Hard Target automated characterization capability.\n- Continue to develop comprehensive soil model library for support of geotechnical site characterization of WMD target sites.\n- Refine and enhance WMD complex modeling capabilities for integration with automated target characterization.\n- Integrate functional defeat and \"pattern of life\" models into automated target characterization capability.\n- Deliver enhanced counter-WMD and UGF schoolhouse training exercises to IC and Combatant Commands."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes best-of-breed researchers across DoD and other government agency laboratories, academia, industry, and international partner organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed demonstration programs transitioning each year.  (This is Priority Goal 4.1.2, as cited in U.S. Department of Defense Agency Strategic Plan for Fiscal Years 2015-2018, in support of Strategic Objective 4.1, \"Preserve investments to maintain our decisive technological superiority.\")"
                        }
                    }
                }
            ]
        }
    }
}