{
    "id": "2018-AirForce-PB-3600-MJBOOK-1-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-97",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "125"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "70.894"
            },
            "CurrentYear": {
                "val": "71.385"
            },
            "BudgetYearOne": {
                "val": "82.874"
            },
            "BudgetYearOneBase": {
                "val": "82.874"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "79.536"
            },
            "BudgetYearThree": {
                "val": "76.629"
            },
            "BudgetYearFour": {
                "val": "78.240"
            },
            "BudgetYearFive": {
                "val": "81.118"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "73.302"
                },
                "CurrentYear": {
                    "val": "66.385"
                },
                "BudgetYearOne": {
                    "val": "65.706"
                },
                "BudgetYearOneBase": {
                    "val": "65.706"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "70.894"
                },
                "CurrentYear": {
                    "val": "71.385"
                },
                "BudgetYearOne": {
                    "val": "82.874"
                },
                "BudgetYearOneBase": {
                    "val": "82.874"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.408"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "17.168"
                },
                "BudgetYearOneBase": {
                    "val": "17.168"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.696"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.712"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "5.000"
                                },
                                "BudgetYearOne": {
                                    "val": "17.168"
                                },
                                "BudgetYearOneBase": {
                                    "val": "17.168"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY16: $1.712 million decrease for the SBIR tax and $696 thousand below threshold reprogramming for higher AF priorities.\n\nFY17: As part of the FY2017 Request for Additional Appropriations (RAA), $5 million is required to accelerate the development of cyber \"System in the Loop\" infrastructure for detecting cyber vulnerabilities and increase cyber resiliency of weapon systems.\n\nFY18:  $16.929 million increase supports weapon system cyber resiliency as part of the larger AF FY18 cyber campaign plan. Also, included in the $17.168 million total is a $239 thousand increase for a nonpay\/nonfuel inflation adjustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "70.894"
                        },
                        "CurrentYear": {
                            "val": "71.385"
                        },
                        "BudgetYearOne": {
                            "val": "82.874"
                        },
                        "BudgetYearOneBase": {
                            "val": "82.874"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "79.536"
                        },
                        "BudgetYearThree": {
                            "val": "76.629"
                        },
                        "BudgetYearFour": {
                            "val": "78.240"
                        },
                        "BudgetYearFive": {
                            "val": "81.118"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities at four Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL, 704 Test Group at Holloman AFB NM (and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN, and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full-scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD Test and Evaluation (T&E).  These national test assets are available to others requiring their unique capabilities.\n\nThe 96 TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; testing of large-scale models such as space boosters together with their propulsion systems and it provides a climatic simulation capability.  The 704 TG at Holloman AFB, NM provides independent test and evaluation of inertial navigation systems, Global Positioning System (GPS) and integrated systems used for aircraft navigation and missile guidance systems, including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.  The 704 TG, OL-AC at Wright-Patterson AFB, OH provides independent T&E in support of aircraft survivability and full-scale aircraft landing gear T&E.  These T&E activities include the development, T&E of aircraft landing gear components supporting engineering acquisition, design, safety, and performance evaluations.  In addition, they provide an independent T&E capability for component qualification.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR)\/Cyber; and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities, on-board test aircraft systems, and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements, and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems, as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development of high speed sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support Command and Control (C2) functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by Joint Surveillance Target Attack Radar Systems (JSTARS) and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR\/Cyber also includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled tracks, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.  \n\nThis program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airframe\/Propulsion\/Avionics T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Airframe\/Propulsion\/Avionics (APA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "47.118"
                                            },
                                            "Text": {
                                                "val": "Joint Airborne Instrumentation Integration (JAII) completed instrumentation upgrades on Edwards T-38 test support aircraft, replaced outdated range radar systems and completed ground infrastructure upgrades to enhance network instrumentation, which completes this project.\n\nAdvanced Large Military Engine Capability (ALMEC) completed installation and checkout of the 9 C-plant main-drive exciters; all 18 exciters have been upgraded; completed installation and Functional Configuration Audit (FCA) for the Engine Test Facility (ETF) controls – phase 2 upgrade is underway; taken delivery of the H1 heater tubes and began demolition of H1 heater bank 1; completed detailed design of H1 heater roof installation.\n\nImproved Transonic Test Capability (IMTTC) completed final detailed design for the wind tunnel 16T Test Article Control System (TACS) and began fabrication and installation; completed acceleration of major procurements that reduced potential schedule impacts for Major Defense Acquisition Program (MDAP) test customers; completed design and developed procurement documents for the Test Conditions Control (TCC) and Pressure Sensitive Paints projects.\n \nTest Instrumentation Data Systems and Control (TIDSC) completed the Arcs facility (H1, H2 and H3 test cells) upgrade; completed the J2 test cell measurement system upgrade; completed detailed design and hardware procurement for the C2 test cell upgrade; and began the J1 and J2 facility upgrades.\n\nThe Common Range Integrated Instrumentation System (CRIIS) Production project completed the Analysis of Alternative (AoA) studies to address Time, Space, Position Information (TSPI) instrumentation capabilities.  CRIIS production began Lot 1 procurement of OSD Central Test and Evaluation Investment Program (CTEIP) developed CRIIS TSPI increment 2 pods, aircraft internal mounts and ground test support infrastructure.  Purchased and delivered initial CRIIS equipment focused on Eglin AFB IOC.\n\nThe Landing Gear Test Facility (LGTF) Modernization Program completed its Industry Day to discuss preliminary designs with potential vendors. A draft design specification has been completed and work on the acquisition strategy initiated.\n\nCommon Airborne Networked Instrumentation System (CANIS) supported and complemented the CTEIP-funded iNET Program by implementing the airborne solutions. FY16 activity implemented spirals 0, 1, and 2 of the CANIS acquisition approach. Spiral 0 modifies Air Force Test Center (AFTC) telemetry policies and procedures and makes use of tier 1 waveforms; Spiral 1 implements multi-band and C-Band transmitter and transceiver conversions; and Spiral 2 establishes a test asset networked data gathering\npackage.\n\nThe Next Generation Turbine Engine Test Capability (NGTETC) project revitalized capability at AEDC to make it more effective and efficient. It expanded the test envelope to accommodate next generation turbine engine performance characteristics.  NGTETC initiated discussions with contractors on possible exhaust cooler designs; completed preliminary designs on the compressor inbleed, thermal management, and power management systems; and began hardware procurement for test cell engine venture system.\n\nThe Improved Plant Reliability and Efficiency\/Transonic Aero Propulsion Test Capability (IMTPC) project began work to restore components and sub-systems in AEDC Wind Tunnel 16T primary drive systems. Work was done to determine requirements and design modifications for the compressor C1 blades, as well as the initiation of component analysis and integration for the main drive, the C1 compressor sub-systems (refurbish\/replace) and the electrical support systems (refurbish\/replace).\n\nModular Mission Control Room Upgrade (MMCRU) began in FY16. The initial studies supported the hardware integration (spiral 1), situational awareness integration (spiral 2), and applications migration of the MMCRU implementation. MMCRU establishes a \"cloud type\" mission control room architecture to enable user friendly access to and distribution of data through internet protocol (IP) networks.\n\nThe Voice Communication System Upgrade (VCSU) began in FY16. The program is currently conducting Market Research to determine appropriate requires. The program has met with other DoD users to evaluate the potential for commonality and synergy between ranges. The program has begun defining its acquisition strategy.\n\nThe T&E Board of Directors continued to lead Tri-Service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "51.866"
                                            },
                                            "Text": {
                                                "val": "ALMEC will complete upgrades for the ETF controls project and restoral of the C Plant H1 Heater.\n\nIMTTC will continue to install and integrate hardware and software enhancements for TCC and 16T TACS. \n\nTIDSC will complete the C2 facility upgrade.\n\nCRIIS production will continue Lot 1 procurement and fielding of CTEIP developed CRIIS TSPI increment 2 pods, aircraft internal mounts and ground test support infrastructure.\n\nThe LGTF Modernization Program will explore options to begin contract actions.\n\nCommon Airborne Networked Instrumentation System (CANIS) will continue supporting and complementing the CTEIP-funded iNET Program by implementing the airborne solutions. FY17 activity will include completing the implementation of spirals 0, 1, and 2 of the CANIS acquisition approach. Spiral 0 modifies Air Force Test Center (AFTC) telemetry policies and procedures and makes use of tier 1 waveforms; Spiral 1 implements multi-band and C-Band transmitter and transceiver conversions; and Spiral 2 establishes a test asset networked data gathering package.\n\nNGTETC will continue upgrades to exhaust coolers, compressor inbleed, power and thermal management systems.\n\nIMTPC will restore the capabilities of the main drive motors (rewind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor sub-systems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary Propulsion Wind Tunnel (PWT) facility main drive electrical utilities) to original specifications.\n\nMMCRU will continue to support the hardware integration (spiral 1), situational awareness integration (spiral 2), and applications migration of the MMCRU implementation.\n \nThe VCSU program will complete requirements definition and take receipt of initial test lab equipment. \n\nThe T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "54.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "54.510"
                                            },
                                            "Text": {
                                                "val": "ALMEC will complete upgrades for the ETF controls and restoration of the C Plant H1 heater.\n\nIMTTC will continue to install and integrate hardware and software enhancements for TCC and 16T TACS.\n\nThe VCSU Program will begin procurement of equipment for the mission control room (MCR). \n\nCRIIS Production will continue Lot 1 procurement of OSD CTEIP developed CRIIS TSPI Increment two pods, aircraft internal mounts, and ground support infrastructure. Purchase and delivery of initial CRIIS equipment will focus on Eglin AFB IOC.\n\nThe LGTF Modernization Program will continue design and fabrication (Phase II) efforts, and system integration (Phase III).\n\nThe Integrated Networked Enhanced Telemetry (iNET) Systems Integration and Support (ISIS) Program will begin in FY18. The program will begin to define design requirements to integrate and implement the telemetry technologies developed under the CTEIP-funded iNET Program.\n\nCANIS will continue supporting and complementing the CTEIP-funded iNET Program by implementing the airborne solutions. FY17 activity will include completing the implementation of spirals 0, 1, and 2 of the CANIS acquisition approach. Spiral 0 modifies AFTC telemetry policies and procedures and makes use of tier 1 waveforms; Spiral 1 implements multi-band and C-Band transmitter and transceiver conversions; and Spiral 2 establishes a test asset networked data gathering package.\n\nNGTETC will continue upgrades to exhaust coolers, compressor inbleed, power and thermal management systems.\n\nIMPTC will continue to restore the capabilities of the main drive motors (rewind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor sub-systems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary PWT facility main drive electrical utilities) to original specifications.\n\nMMCRU will continue to support the situational awareness integration (spiral 2) and begin development IO at each range (spiral 3), and applications migration of the MMCRU implementation.\n\nThe VSCU Program will continue to take receipt of MCR equipment and begin installation and integration activities.\n\nThe T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament\/Munitions T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Armament\/Munitions (A\/M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.475"
                                            },
                                            "Text": {
                                                "val": "Joint Gulf Range Area Network Development (JGRAND) acquired and installed equipment in the Alt RNOCC; implemented data encryption across the Eglin Range Information Grid (RIG); acquired and implemented optical fiber paths to improve range communication capabilities at the Eglin Test and Training Complex (ETTC).  JGRAND completes in FY16.\n\nCombined High Speed\/High Resolution (CHSHR) Electro-Optical\/Infrared (EO\/IR) Imaging implemented autonomous designs to test sites B-70 and C-72; acquired and modernized mobile optical tracking systems; completed evaluation of ultra-high speed camera options for hypersonic speed testing on the high-speed test track.\n\nNext Generation Munitions Test Environment (NGMTE) continued to upgrade aging gun and munitions test infrastructure, developed and procured common data instrumentation and acquisition systems, and replaced environmental test chambers\/facilities supporting gun and arena test capabilities.\n \nStarted the Airborne Sensor Data Correlation effort.  This effort is a research project to prototype fusing unmanned aerial system electro-optical and infrared full motion video to support accurate over-water weapons impact scoring. The results of this effort will help future testing of hypersonic and long-range weapons that require large test areas and larger hazard areas.\n\nHolloman High Speed Test Track (HHSTT) Gantry Crane project began efforts to replace the smaller and lower capacity gantry crane at HHSTT with a crane that can carry heavier targets needed to replicate more realistic weapons targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.907"
                                            },
                                            "Text": {
                                                "val": "CHSHR EO\/IR Imaging will complete implementation of autonomous designs to B-70 and C-72; acquire and modernize mobile optical tracking systems; complete evaluation of ultra-high speed camera options for hypersonic speed testing on the high-speed test track.\n\nNGMTE will continue to upgrade aging gun and munitions test infrastructure, develop and procure common data instrumentation and acquisition systems, and replace environmental test chambers\/facilities supporting gun and arena test capabilities.\n\nHHSST Gantry Crane project will complete the delivery and integration of the new gantry crane."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.176"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.176"
                                            },
                                            "Text": {
                                                "val": "NGMTE will complete upgrades to aging gun and munitions test infrastructure, development and procurement of common data instrumentation and acquisition systems, and replacement of environmental test chambers\/facilities supporting gun and arena test capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate C4ISR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.301"
                                            },
                                            "Text": {
                                                "val": "Improved Command and Control (C2) Test Operations Center (I-C2TOC) provided for improved capabilities to represent any level of Air Force Operations Centers, including the Squadron Ops Center, Wing Ops Center, and Air Ops Center, to support C4ISR testing at Eglin AFB. I-C2TOC began acquiring computer and network equipment to replace outdated network infrastructure and upgrade servers and workstations.\n\nCyber Defense Test Capability (CDTC) completed the first phase of a Federally-Funded Research and Development Center (FFRDC) study that will provide a detailed analysis of the draft six-step DoD cybersecurity test and evaluation process and determine its adequacy in testing cyber vulnerabilities of acquisition systems under test; initiated the second phase of the study which is to identify manpower requirements and test infrastructure investments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.612"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will continue C4ISR test network upgrades to C4ISR system hardware and software, and replace outdated network infrastructure.\n \nThe CDTC project will complete the study to develop a detailed implementation methodology for the DoD cybersecurity T&E process, and identify manpower requirements and develop a test investment roadmap."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.188"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.188"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will continue development of secure network infrastructure and initiate procurement of software and hardware servers and workstations needed to enhance net-centric C2 battle management operations and test control capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities supporting C4ISR end-to-end weapon system testing at Eglin AFB.\n\nThe CDTC project will continue in FY18. During this phase, implementation of the plan for acquiring and training the workforce necessary for executing the cybersecurity T&E process will begin.\n\nThe Weapon System Cyber Resiliency project will begin with requirements definitization and development of acquisition strategies.\n\nThe Cyber DT\/OT Range will begin with requirements definitization and development of acquisition strategies."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "23.558"
                                        },
                                        "CurrentYear": {
                                            "val": "21.630"
                                        },
                                        "BudgetYearOne": {
                                            "val": "35.405"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "35.405"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "28.513"
                                        },
                                        "BudgetYearThree": {
                                            "val": "28.540"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.049"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.655"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "683.307"
                                        },
                                        "CurrentYear": {
                                            "val": "680.217"
                                        },
                                        "BudgetYearOne": {
                                            "val": "678.289"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "678.289"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "686.379"
                                        },
                                        "BudgetYearThree": {
                                            "val": "700.630"
                                        },
                                        "BudgetYearFour": {
                                            "val": "713.790"
                                        },
                                        "BudgetYearFive": {
                                            "val": "729.060"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40.518"
                                        },
                                        "CurrentYear": {
                                            "val": "134.111"
                                        },
                                        "BudgetYearOne": {
                                            "val": "135.507"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "135.507"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "125.437"
                                        },
                                        "BudgetYearThree": {
                                            "val": "89.111"
                                        },
                                        "BudgetYearFour": {
                                            "val": "69.814"
                                        },
                                        "BudgetYearFive": {
                                            "val": "71.243"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE: BA 06: PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.895"
                                        },
                                        "CurrentYear": {
                                            "val": "28.091"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.720"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.720"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.105"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.646"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.160"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.777"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}