{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-51",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604771D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Information Distribution System (JTIDS)"
        },
        "R1LineNumber": {
            "val": "122"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "71.605"
            },
            "PriorYear": {
                "val": "13.774"
            },
            "CurrentYear": {
                "val": "16.288"
            },
            "BudgetYearOne": {
                "val": "15.358"
            },
            "BudgetYearOneBase": {
                "val": "15.358"
            },
            "BudgetYearTwo": {
                "val": "13.973"
            },
            "BudgetYearThree": {
                "val": "14.125"
            },
            "BudgetYearFour": {
                "val": "14.401"
            },
            "BudgetYearFive": {
                "val": "14.702"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.257"
                },
                "CurrentYear": {
                    "val": "16.288"
                },
                "BudgetYearOne": {
                    "val": "16.078"
                },
                "BudgetYearOneBase": {
                    "val": "16.078"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.774"
                },
                "CurrentYear": {
                    "val": "16.288"
                },
                "BudgetYearOne": {
                    "val": "15.358"
                },
                "BudgetYearOneBase": {
                    "val": "15.358"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.483"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.720"
                },
                "BudgetYearOneBase": {
                    "val": "-0.720"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.483"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "SRRB Reductions\/Management Realignment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.614"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.614"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DTIC Offset Bill"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.106"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.106"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY16 Actuals due to SBIR\/STTR adjustments"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "771"
                    },
                    "ProjectTitle": {
                        "val": "Link-16 Tactical Data Link (TDL) Transformation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "71.605"
                        },
                        "PriorYear": {
                            "val": "9.849"
                        },
                        "CurrentYear": {
                            "val": "11.793"
                        },
                        "BudgetYearOne": {
                            "val": "11.258"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.258"
                        },
                        "BudgetYearTwo": {
                            "val": "9.973"
                        },
                        "BudgetYearThree": {
                            "val": "10.125"
                        },
                        "BudgetYearFour": {
                            "val": "10.301"
                        },
                        "BudgetYearFive": {
                            "val": "10.702"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds will be used to provide technical and systems engineering, acquisition assistance and management oversight of critical Command, Control, Communications (C3), non-intelligence space, and cyber programs, projects and activities to maximize the return on investment in information technology resources and assist programs to be successful as the Department migrates to a structure implementing Joint Information Environment (JIE) technical standards. The Joint Tactical Information Distribution System (JTIDS) funding fulfills the Department's requirement for joint and combined network-enabled tactical data link (TDL) capabilities, netcentric\/JIE communications which comply to standards for interoperability and seamless integration with joint communication systems as well as the mission functionality that uses these systems. Also, these funds underwrite assessment of design and procurement and execution correction of critical information systems from initial definition through development to successfully delivered configurations. Funds provide expertise supporting technical oversight of design, performance and cost parameters of key Defense IT and National Security Systems and supporting infrastructure including critical cyber assessments. Resources in this program fund architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3, non-intelligence space, and cyber activities. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies, architectures, roadmaps and technical guidance documentation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Joint Tactical Information Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.849"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continued to coordinate with CDL Executive Agent to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments. Developed policy to reflect modernization in CDL waveforms and encryption. Continued to oversee development and validation of cryptographic core modernization, Small Unmanned Aircraft System (SUAS) Common Data Link (CDL) terminals, CDL waveform, CDL Compliance Test Tool, and Reference Implementation Laboratory development efforts.  Continue development of transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications.  Updated and publish the CDL enterprise roadmap that includes platform schedules and waveform modernization opportunities. Analyzed and assess mitigation strategies and technologies with regard to emerging activities that could restrict CDL spectrum access to ensure continued robust ISR communications capabilities. Updated Independent Assessment Update of CCM Technology Readiness. Continued planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conducted analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability.\n- Acquisition Management and Oversight: Provided technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.  Provide technical assessments and programmatic recommendations across DASD functional areas to address interoperability gaps and work early in the systems engineering. \n- FAB-T:  Analyzed readiness for DT&E and OT&E as command post terminal and PNVC production units begin to be delivered and integrated for test.  Provided risk assessments of system integration into the various airborne, ground fixed and ground transportable systems prior to installation. Worked with Air Force to implement DSD’s direction as end-to-end integrator of PNVC capability.  \n- Wideband SATCOM Capability:  Execute plans for expansion of SMC’s COMSATCOM role.  Support Wideband Requirements Review by Joint Staff and prepare for an AoA to determine the way forward after launching remaining WGS satellites, and COMSATCOM as an integrated wideband SATCOM capability.\n- AEHF: Provided programmatic analysis, technical reviews, and assessments of the AEHF program to reduce development, integration, and procurement risks. Provided risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element, and develop KMI to replace EKMS.\n- EPS:  Provided programmatic analysis, technical reviews, and assessments of the EPS program to reduce development, integration, and procurement risks.  Assessed risk as the TT&C system is integrated and tested prior to operations.\nProtected SATCOM AoA: Finalized assessment through analysis and synthesis of performance, cost and resilience data for cross-domain alternatives to support Protected SATCOMs (including infrastructure to support NC3 requirements). Documented analysis of alternatives in Final Report to provide recommendations for technology investments and associate acquisition strategy for Protected SATCOM capability.\n- National Leadership Command Capability (NLCC):  Continued in lead role as primary action office for AT&L in his role as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S).  Worked directly with the Executive Secretariat (DOD CIO) to oversee all aspects of preparation and conduct of CONLC3S meetings, as well as the SSG and EMB meetings that are held to essentially prepare\/tee up decisions for the CONLC3S to make at their meetings.  Also lead review process for any NLCC related documents. Supports the Joint Staff led Nuclear C2 CBA to its completion and identify capability gaps to be addressed by the CONLC3S.\n– Mobile User Objective System (MUOS): Provided technical and programmatic analysis and insights in support of C3CB oversight of the completion of the MUOS Multi-Service OT&E-2 and follow-on development and operational test activities. Continue to support vendor efforts to develop MUOS capable terminals and get them tested and certified for operation over MUOS, and for Service procurement. Prepared program documentation including ADM for follow-on sustainment activities for MUOS. Continue to track MUOS contract and management performance through interaction with the MUOS Program Manager, ASN RDA staff, and the Defense Contract Management Agency.  Continue interaction with the Combatant Commanders and the Army Forces Strategic Command in support of Early Operational Acceptance and Full Operational Acceptance.   \n- Navy Multiband Terminal.  Continued to track progress toward completion of NMT deliverables.  Interact with the NMT program manager, ASN RDA staff and the Defense Contract Management Agency (DCMA).  Reviewed monthly DCMA Performance Assessment Reports (PARs) advising C3CB leadership should any issues arise with NMT execution status.\n- Cooperative Engagement Capability.  Participated in the CEC Configuration Steering Board, Gate 6 review hosted by the Military Deputy, ASN RDA.  Performed follow-up briefings with the CEC Program Manager and DOT&E. Interactacted with the CEC Program Manager, ASN RDA staff and the Defense Contract Management Agency (DCMA).  Reviewed monthly DCMA Performance Assessment Reports (PARs) advising C3CB leadership of CEC execution status especially with regard to the Common Array Block antenna.\n- Handheld, Manpack, and Small Form Fit (HMS) JTRS:  Assessed the HMS program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provided a technical assessment of full and open competition process for both Rifleman and Manpack radios. Provide technical and programmatic analysis to support the Defense Acquisition Executive' Full Rate Production decision review.  Assessed the results of Initial Operational Test and Evaluation (IOT&E) as well as the existing manufacturing process, performance and reliability, and sustainment capabilities to formulate a recommendation for Full-Rate Production.  \n- Joint Tactical Networking Center (JTNC) JTRS:  Provided technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD).  Provided Secretariat functions for the JTNC BoD.\n- All JTRS (HMS, MNVR, AMF, JTN) Programs - Provided assessments of program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assessed readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.  Provided programmatic recommendations regarding cost\/schedule\/performance tradeoffs.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assessed the AMNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provided a technical assessment of full and open competition process for MNVR radios.\n- Provide assessments of DoD Business System programs with related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assessed readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.  Provided programmatic recommendations regarding cost\/schedule\/ performance tradeoffs.\n- Ground Tactical Networks Advanced Capabilities:  Matured narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable software code.  Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.  Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems.  FY16 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n- Tactical Data Link Modernization:  Accelerated improvements in TDLs to address A2AD and contested operations.  Built case for an Executive Agent (EA) for Airborne Tactical Data Networking to bring cross-Service high level focus to TDL improvements and coordinated S&T investments for future capabilities. Structure Link 16 evolution plans.  Worked with F-35 program to baseline Multi-function Advanced Data Link (MADL) and develop open architecture implementation of MADL waveform.  Developed initial concepts for common open architecture TDL terminal for potential use on next generation aircraft and F-35 block upgrades. Strengthen acquisition oversight, system engineering, standards and interoperability in use of TDLs on Network Enabled Weapons (NEW).  \n- Warfighter Information Network – Tactical (WIN-T):  Provided assessment of the transition of Increment 3 Network Operations and Net Centric Waveform software enhancements into the Increment 2 hardware units for fielding.  Provided final assessment of the Highband Networking Waveform 3.0 capability and track its progress for entry into the Waveform Repository.\n-  Joint C2 Portfolio Management: Supported development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY17-21 version of the Joint C2 Sustainment and Modernization Plan.\n- C2 Data: Provided technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provided technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands.\n- Friendly Force Tracking\/ Combat Identification: Provided technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC.  Provided technical support to DoD implementation of Mode 5 including supporting spectrum certification and assignment.   \n– Acquisition Management: Provided technical assistance in developing related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n- Environmental Monitoring: Developed DoD inputs for annual Federal Plan for Meteorological Services and Supporting Research; Supported various Federal and OSD offices on the subjects of: Space Weather, Spectrum losses and weather, Ionospheric capabilities, National Plan for Hurricanes, Space Situational Awareness, and DoD representation for METOC; Updated as required METOC\/Weather Enterprise Strategy and Roadmap and oversee implementation of results of Defense Weather Analysis of Alternatives (AoA); conduct assessment of USG weather satellite common ground system compliance; implement METOC data strategy; implemented DoD National Space Weather Strategy; advise Defense Space Acquisition Board, FCB\/JROC\/JCIDS process, other OSD PSAs, EA for Space office, COIs, etc. on METOC matters. \n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n- Space Control\/Space C2\/SSA:  Performed continued monitoring of cyber testing and cyber vulnerabilities of critical space programs. \n- Non-Intelligence Space Programs Technical Assessments:  Performed cyber vulnerability and cyber suitability assessments on space, PNT, METOC programs and others. Reviewed system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific space, PNT, and METOC programs to address cyber vulnerabilities and to inform milestone decisions. Conducted non-intelligence space program technical reviews on to include data strategies, systems engineering, risks and mitigations. Supported acquisition milestone decisions for programs including weather satellite follow-on activities.\n- PNT Programs Technical Assessments:  Continued OIPT leadership role.  Developed and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE.   Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field.  \n- PNT Portfolio Management:  Continued implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continued to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.793"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments.  Continue implementation and oversight of an enterprise transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications.  Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems.  Continue planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability.\n- Acquisition Management and Oversight: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.  Provide technical assessments and programmatic recommendations across DASD functional areas to address interoperability gaps and work early in the systems engineering. \n- FAB-T:  Support IOT&E execution. Work to assure the program has a successful LRIP-2 decision.  Continue to support PNVC integration and test.  Provide risk assessments of system integration into the various airborne, ground fixed an ground transportable systems prior to installation.\n-  Wideband SATCOM AoA: Conduct AoA plan assessing material solutions for WGS replenishment and for supporting other traditional commercial supplied users considering life-cycle cost, performance, suitability, operational effectiveness, and resiliency.  Support implementation and execution of the AoA plan including Senior Advisory Group meetings and evaluation of the space and control segments with associated user terminals for contested and benign operating environments.  \n- AEHF: Provide programmatic analysis, technical reviews, and assessments of the AEHF program to reduce development, integration, and procurement risks. Provide risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element.  Work to start efforts for the follow-on system to AEHF.\n- EPS:  Provide programmatic analysis, technical reviews, and assessments of the EPS program to reduce development, integration, and procurement risks.  Assess risk as the TT&C system is integrated and tested prior to operations.  Work to start efforts for the follow-on system to EPS.\n- National Leadership Command Capability (NLCC):  Continue in lead role as primary action office for AT&L in his role as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S).  Work directly with the Executive Secretariat (DOD CIO) to oversee all aspects of preparation and conduct of CONLC3S meetings, as well as the SSG and EMP meetings that are held to essentially prepare\/tee up decisions for the CONLC3S to make at their meetings.  Also lead review process for any NLCC related documents.\n- Handheld, Manpack, and Small Form Fit (HMS) JTRS:  Assess the HMS program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for both Rifleman and Manpack radios. Provide technical and programmatic analysis to support the Defense Acquisition Executive' Full Rate Production decision review.  Assess the results of Initial Operational Test and Evaluation (IOT&E) as well as the existing manufacturing process, performance and reliability, and sustainment capabilities to formulate a recommendation for Full-Rate Production.  \n- Joint Tactical Networking Center (JTNC) JTRS:  Provide technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD).  Provide Secretariat functions for the JTNC BoD.\n- All JTRS(HMS, MNVR, AMF, JTN)Programs - Provide assessments of program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.  Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assess the AMNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for MNVR radios.\n- Provide assessments of DoD Business System programs with related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight. Provide programmatic recommendations regarding cost\/schedule\/ performance tradeoffs.\n- Ground Tactical Networks Advanced Capabilities:  Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable software code.  Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.  Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems.  FY17 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n- Tactical Data Link Modernization:  Track and assess first Link 16 capability improvements in Multi-function Information Distribution System (MIDS-J) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, and Weapons Data Link (WDL) radios.  Begin standup of EA for Airborne Tactical Data Networking and develop detailed roadmaps and modernization strategies. Assess preliminary requirements for MADL 2.0 version and applicability to next generation aircraft needs.  Assess modeling and simulation infrastructure and currency with adversary threat emitters to improve investments decisions on TDL improvements.     \n- Warfighter Information Network – Tactical (WIN-T):  Review and assess the results of the Highband Networking Waveform (HNW) 3.0 air and ground node demonstration.  Track progress of the HNW 3.0 entry into the Waveform Repository.  Provide a technical review of the Increment 2 independent cyber design and implementation assessment.  Provide technical reviews and assessments of Increment 2 performance and corrective actions to include platform integration issues, Network Operations Tools improvements, and performance optimization of the HNW, Tactical Relay Tower, and Range Throughput Extension Kit. \n-  Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY17-21 version of the Joint C2 Sustainment and Modernization Plan.\n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provide technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands.\n- Friendly Force Tracking\/ Combat Identification: Provide technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC.  Provide technical support to DoD implementation of Mode 5 including supporting spectrum certification and assignment.   \n– Acquisition Management: Provide technical assistance in developing related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n- Space Control\/Space C2\/SSA:  Perform continued monitoring of cyber testing and cyber vulnerabilities of critical space programs. \n- Non-Intelligence Space Programs Technical Assessments:  Perform cyber vulnerability and cyber suitability assessments on space, PNT, METOC programs and others. Review system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific space, PNT, and METOC programs to address cyber vulnerabilities and to inform milestone decisions. Conduct non-intelligence space program technical reviews on to include data strategies, systems engineering, risks and mitigations. Support acquisition milestone decisions for programs including weather satellite follow-on activities.\n- PNT Programs Technical Assessments:  Continue OIPT leadership role.  Develop and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE.   Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field.  \n- PNT Portfolio Management:  Continue implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continue to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.258"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.258"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments.  Continue implementation and oversight of an enterprise transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications.  Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems.  Continue planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability.\n- Acquisition Management and Oversight: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.  Provide technical assessments and programmatic recommendations across DASD functional areas to address interoperability gaps and work early in the systems engineering. \n- FAB-T:  Support IOT&E execution. Work to assure the program has a successful LRIP-2 decision.  Continue to support PNVC integration and test.  Provide risk assessments of system integration into the various airborne, ground fixed an ground transportable systems prior to installation.\n-  Wideband SATCOM AoA: Conduct AoA plan assessing material solutions for WGS replenishment and for supporting other traditional commercial supplied users considering life-cycle cost, performance, suitability, operational effectiveness, and resiliency.  Support implementation and execution of the AoA plan including Senior Advisory Group meetings and evaluation of the space and control segments with associated user terminals for contested and benign operating environments.  \n- AEHF: Provide programmatic analysis, technical reviews, and assessments of the AEHF program to reduce development, integration, and procurement risks. Provide risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element.  Work to start efforts for the follow-on system to AEHF.\n- EPS:  Provide programmatic analysis, technical reviews, and assessments of the EPS program to reduce development, integration, and procurement risks.  Assess risk as the TT&C system is integrated and tested prior to operations.  Work to start efforts for the follow-on system to EPS.\n- National Leadership Command Capability (NLCC):  Continue in lead role as primary action office for AT&L in his role as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S).  Work directly with the Executive Secretariat (DOD CIO) to oversee all aspects of preparation and conduct of CONLC3S meetings, as well as the SSG and EMP meetings that are held to essentially prepare\/tee up decisions for the CONLC3S to make at their meetings.  Also lead review process for any NLCC related documents.\n- Handheld, Manpack, and Small Form Fit (HMS) JTRS:  Assess the HMS program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for both Rifleman and Manpack radios. Provide technical and programmatic analysis to support the Defense Acquisition Executive' Full Rate Production decision review.  Assess the results of Initial Operational Test and Evaluation (IOT&E) as well as the existing manufacturing process, performance and reliability, and sustainment capabilities to formulate a recommendation for Full-Rate Production.  \n- Joint Tactical Networking Center (JTNC) JTRS:  Provide technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD).  Provide Secretariat functions for the JTNC BoD.\n- All JTRS(HMS, MNVR, AMF, JTN)Programs - Provide assessments of program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.  Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assess the AMNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for MNVR radios.\n- Provide assessments of DoD Business System programs with related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight. Provide programmatic recommendations regarding cost\/schedule\/ performance tradeoffs.\n- Ground Tactical Networks Advanced Capabilities:  Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable software code.  Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.  Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems.  FY17 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n- Tactical Data Link Modernization:  Track and assess first Link 16 capability improvements in Multi-function Information Distribution System (MIDS-J) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, and Weapons Data Link (WDL) radios.  Begin standup of EA for Airborne Tactical Data Networking and develop detailed roadmaps and modernization strategies. Assess preliminary requirements for MADL 2.0 version and applicability to next generation aircraft needs.  Assess modeling and simulation infrastructure and currency with adversary threat emitters to improve investments decisions on TDL improvements.     \n- Warfighter Information Network – Tactical (WIN-T):  Review and assess the results of the Highband Networking Waveform (HNW) 3.0 air and ground node demonstration.  Track progress of the HNW 3.0 entry into the Waveform Repository.  Provide a technical review of the Increment 2 independent cyber design and implementation assessment.  Provide technical reviews and assessments of Increment 2 performance and corrective actions to include platform integration issues, Network Operations Tools improvements, and performance optimization of the HNW, Tactical Relay Tower, and Range Throughput Extension Kit. \n-  Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY17-21 version of the Joint C2 Sustainment and Modernization Plan.\n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provide technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands.\n- Friendly Force Tracking\/ Combat Identification: Provide technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC.  Provide technical support to DoD implementation of Mode 5 including supporting spectrum certification and assignment.   \n– Acquisition Management: Provide technical assistance in developing related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n- Space Control\/Space C2\/SSA:  Perform continued monitoring of cyber testing and cyber vulnerabilities of critical space programs. \n- Non-Intelligence Space Programs Technical Assessments:  Perform cyber vulnerability and cyber suitability assessments on space, PNT, METOC programs and others. Review system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific space, PNT, and METOC programs to address cyber vulnerabilities and to inform milestone decisions. Conduct non-intelligence space program technical reviews on to include data strategies, systems engineering, risks and mitigations. Support acquisition milestone decisions for programs including weather satellite follow-on activities.\n- PNT Programs Technical Assessments:  Continue OIPT leadership role.  Develop and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE.   Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field.  \n- PNT Portfolio Management:  Continue implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continue to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In executing JTDL tasking, existing fixed-price and cost-plus contracts will be utilized.\n-  Program reviews in support of the JCIDS, acquisition and PPBE processes."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Alignment: Accelerate DoD information age transformation to increase the effectiveness and efficiency of the warfighting, intelligence and business missions.\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Instantiation of enterprise-wide system engineering for the Joint Information Environment (JIE)\n\nPortfolio Management:  Provide for the timely and effective delivery of key Net-Centric capabilities through portfolio management of associated technology development and Major Defense Acquisition Programs (MDAPS) and Major Automated Information Systems (MAIS).\nMeasures:\n-  Key milestones completed for major net-centric acquisitions \n-  Number of major systems successfully completing net-centric critical performance reviews"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Resources will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Link-16 Tactical Data Link (TDL) Transformation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(AT&L)\/OASD(A)\/DASD(C3CB)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "71.605"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "9.849"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.793"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.258"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.258"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Link-16 Comm Tactical Data Link (TDL) Transformation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "105"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Capability & Platform Resilience"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.925"
                        },
                        "CurrentYear": {
                            "val": "4.495"
                        },
                        "BudgetYearOne": {
                            "val": "4.100"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.100"
                        },
                        "BudgetYearTwo": {
                            "val": "4.000"
                        },
                        "BudgetYearThree": {
                            "val": "4.000"
                        },
                        "BudgetYearFour": {
                            "val": "4.100"
                        },
                        "BudgetYearFive": {
                            "val": "4.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Provides resources for developmental acquisition support and management (to include the Cyber Investment and Management Board (CIMB))  oversight of Cyber capabilities as the Department conceives, develops, and rapidly fields cyber capabilities for Cyberspace Operations and the instantiation of cyber resilient platforms and weapons systems for priority kinetic and non-kinetic missions. The CIMB was established in 2012 in response to the FY2011 NDAA Section 933, where DoD was directed to provide a “strategy for the rapid acquisition of cyber capabilities, for cyber warfare for USCC and the Cyber Service components of the military departments. USD(AT&L) is responsible for compliance with the FY2011 NDAA and Chairs the CIMB.\nFunds provide technical, systems engineering, trend analysis, and oversight of programs, projects and activities developing cyber capabilities to maximize the Department's return on investment of cyberspace resources and effect a comprehensive approach for assessing, procuring, and sustaining critical cyber capabilities and cyber resilient systems and platforms from initial design, through development to capability delivery in support of weapons systems performance and military operations.  Additionally, these funds will provide systems analyses, portfolio management, executive support of CIMB, enterprise wide systems engineering and operational impact analyses related to Cyber capabilities and ensuring cyber resilience within systems and platforms.  Resources will also be used to provide expertise required for exercising technical direction over design, performance, cost parameters, determining and mitigating cyber risks of key systems and their dependencies.  The goal of this funding is to assure capability advantage, reduce time to the field, evaluate projects and concepts, minimize cyber related performance and operational risk of developing and fielding complex systems, ensure program dependencies are documented and included in acquisition decisions and address cyber security requirements, gaps and required technical solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Capability and Platform Resilience"
                                    },
                                    "Description": {
                                        "val": "Provides resources for developmental acquisition support and management (to include the Cyber Investment and Management Board (CIMB))  oversight of Cyber capabilities as the Department conceives, develops, and rapidly fields cyber capabilities for Cyberspace Operations and the instantiation of cyber resilient platforms and weapons systems for priority kinetic and non-kinetic missions. The CIMB was established in 2012 in response to the FY2011 NDAA Section 933, where DoD was directed to provide a “strategy for the rapid acquisition of cyber capabilities, for cyber warfare for USCC and the Cyber Service components of the military departments. USD(AT&L) is responsible for compliance with the FY2011 NDAA and Chairs the CIMB.  Funds provide technical, systems engineering, trend analysis, and oversight of programs, projects and activities developing cyber capabilities to maximize the Department's return on investment of cyberspace resources and effect a comprehensive approach for assessing, procuring, and sustaining critical cyber capabilities and cyber resilient systems and platforms from initial design, through development to capability delivery in support of weapons systems performance and military operations.  Additionally, these funds will provide systems analyses, portfolio management, executive support of CIMB, enterprise wide systems engineering and operational impact analyses related to Cyber capabilities and ensuring cyber resilience within systems and platforms.  Resources will also be used to provide expertise required for exercising technical direction over design, performance, cost parameters, determining and mitigating cyber risks of key systems and their dependencies.  The goal of this funding is to assure capability advantage, reduce time to the field, evaluate projects and concepts, minimize cyber related performance and operational risk of developing and fielding complex systems, ensure program dependencies are documented and included in acquisition decisions and address cyber security requirements, gaps and required technical solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.925"
                                            },
                                            "Text": {
                                                "val": "- Cyber Investment Management: Synchronized and coordinated cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provided support of the Cyber Investment Management Board and develop implementation guidance and associated direction.  Continued to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio and to identify strategic cyber issues the DoD will face in the future.\n- Refined the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conducted investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Utilized the results of the Cyber Rapid Acquisition Process Pilots to implement the new rapid cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Managed Cyber security Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cyber security within the Acquisition process.\n- Continued oversight of implementation of the Cyber Situational Awareness EoA (phase I and II) recommendations. \n- Initiated capability development of recommendations of the Unified Platform AoA.\n- Continued oversight of Joint Cyber Command and Control (C2) capability development. \n- Ensured Platform Resilience\/Mission Assurance (PR\/MA); Oversaw implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Continued to synchronize and provide oversight for DoD Cyber Ranges that support Cyber Training and Testing & Evaluations through the Cyber Range Focal Point. \n- Implemented DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conducted technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Oversaw DoD efforts to equip the cyber mission force. Support developments of requirements documents and architectures as required in collaboration with USCYBERCOM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.495"
                                            },
                                            "Text": {
                                                "val": "Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Utilize the results of the Cyber Rapid Acquisition Process Pilots to implement the new rapid cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Manage Cyber security Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cyber security within the Acquisition process.\n- Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations. \n- Initiate capability development of recommendations of the Unified Platform AoA.\n- Continue oversight of Joint Cyber Command and Control (C2) capability development. \n- Ensure Platform Resilience\/Mission Assurance (PR\/MA); Oversee implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Continue to synchronize and provide oversight for DoD Cyber Ranges that support Cyber Training and Testing & Evaluations through the Cyber Range Focal Point. \n- Implement DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conduct technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Oversee DoD efforts to equip the cyber mission force. Support developments of requirements documents and architectures as required in collaboration with USCYBERCOM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Utilize the results of the Cyber Rapid Acquisition Process Pilots to implement the new rapid cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Manage Cyber security Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cyber security within the Acquisition process.\n- Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations. \n- Initiate capability development of recommendations of the Unified Platform AoA.\n- Continue oversight of Joint Cyber Command and Control (C2) capability development. \n- Ensure Platform Resilience\/Mission Assurance (PR\/MA); Oversee implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Continue to synchronize and provide oversight for DoD Cyber Ranges that support Cyber Training and Testing & Evaluations through the Cyber Range Focal Point. \n- Implement DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conduct technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Oversee DoD efforts to equip the cyber mission force. Support developments of requirements documents and architectures as required in collaboration with USCYBERCOM."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Existing firm fixed priced and cost plus contracts will be utilized."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Cyber Investments: instantiation of cyber capabilities for resilient systems include risk assessments, vulnerability assessments, mitigation plans, prototype architectures, investment strategies, trends analyses, Evaluation\/Analysis of Alternatives, integrated mission analyses, technical and policy guidance directives.\n\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Timely delivery and development of key investment strategies, trend analysis and outcomes of the Evaluation\/Analysis of Alternatives.\n\nPortfolio Management:  Provide for the timely and effective delivery of portfolio management support of associated with Cyber Security and Major Defense Acquisition Programs (MDAPS) and Major Automated Information Systems (MAIS).\nMeasures:\n-  Key milestones completed for major cyber related acquisitions"
                        }
                    }
                }
            ]
        }
    }
}