{
    "id": "2018-AirForce-PB-3600-MJBOOK-0-0-0defb224afb5c223c489f2e5fd1ac166cf85e87ba92779e4cbd18d392211a193-6",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0602203F"
        },
        "ProgramElementTitle": {
            "val": "Aerospace Propulsion"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "184.498"
            },
            "CurrentYear": {
                "val": "185.671"
            },
            "BudgetYearOne": {
                "val": "192.695"
            },
            "BudgetYearOneBase": {
                "val": "192.695"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "193.579"
            },
            "BudgetYearThree": {
                "val": "201.148"
            },
            "BudgetYearFour": {
                "val": "201.071"
            },
            "BudgetYearFive": {
                "val": "203.605"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops propulsion and power technologies to achieve enabling and revolutionary aerospace technology capabilities. The program has six projects, each focusing on a technology area critical to the Air Force. The Advanced Propulsion Technology project develops high-speed air breathing propulsion engines to include combined cycle, ramjet, and hypersonic scramjet technologies to enable revolutionary propulsion capability for the Air Force. The Combustion and Mechanical Systems project develops engine mechanical system technologies: bearings, seals, drives, and lubricants as well as combustion components, concepts, and technologies for legacy and advanced turbine engines.  The Turbine Engine Technology project develops enabling capabilities to enhance performance and affordability of existing weapon systems and develops component technologies for ultra high pressure ratio, substantially improved durability, and adaptive cycle engine architecture to provide optimized performance, fuel efficiency, and life for widely varying mission needs. The Aerospace Power Technology project develops electrical power and thermal control technologies for military applications that remove operational limitations and enable advanced vehicle designs and high-power mission systems. The Rocket Propulsion Technology project develops advances in rocket propulsion technologies for space access, space maneuver, missiles, the sustainment of strategic systems, and tactical rockets. The Aerospace Fuel Technology project evaluates hydrocarbon-based fuels for legacy and advanced turbine engines, scramjets, pulse detonation, and combined-cycle engines. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nIn FY 2018, a portion of HQ AFRL S&T civilian manpower in PE 0602203F, Aerospace Propulsion, was transferred to PE 0602298F, Science and Technology Management - Major Headquarters Activities, to provide increased transparency to Congress on personnel in Major Headquarters Activities (MHA). \n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "185.926"
                },
                "CurrentYear": {
                    "val": "185.671"
                },
                "BudgetYearOne": {
                    "val": "196.053"
                },
                "BudgetYearOneBase": {
                    "val": "196.053"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "184.498"
                },
                "CurrentYear": {
                    "val": "185.671"
                },
                "BudgetYearOne": {
                    "val": "192.695"
                },
                "BudgetYearOneBase": {
                    "val": "192.695"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.428"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.358"
                },
                "BudgetYearOneBase": {
                    "val": "-3.358"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.836"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.264"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-3.358"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.358"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2016 reflects reprogramming to support Research and Development Projects, 10 U.S.C. Section 2358.\n\nDecrease in FY 2018 is due to realignment for autonomy and laser weapons systems priorities and transfer of some HQ AFRL civilian manpower to PE 0602298F, Science and Technology Management - Major Headquarters Activities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "623012"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Propulsion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.074"
                        },
                        "CurrentYear": {
                            "val": "27.095"
                        },
                        "BudgetYearOne": {
                            "val": "28.612"
                        },
                        "BudgetYearOneBase": {
                            "val": "28.612"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "27.898"
                        },
                        "BudgetYearThree": {
                            "val": "30.157"
                        },
                        "BudgetYearFour": {
                            "val": "28.331"
                        },
                        "BudgetYearFive": {
                            "val": "28.894"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops combined\/advanced cycle air breathing high-speed (up to Mach 5) and hypersonic (Mach 5 to 7) propulsion technologies to provide revolutionary propulsion options for the Air Force. These new engine technologies will enable future high-speed\/hypersonic weapons and aircraft concepts. The primary focus is on hydrocarbon-fueled engines capable of operating over a broad range of flight Mach numbers. Efforts include modeling, simulations, and proof of concept demonstrations of critical components; advanced component development; and ground-based demonstrations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hypersonic Scramjet Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop robust hydrocarbon fueled scramjet engine components and technologies to improve performance, operability, durability, and scalability for future platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.074"
                                            },
                                            "Text": {
                                                "val": "Tested advanced materials for application to scramjet engines.  Completed design and fabrication of a powerhead supporting the development of a medium scale scramjet.  Completed demonstration of a flexible-wall supersonic nozzle to enable flight Mach transition in ground testing of scramjets.  Completed preparation for direct connect testing of first performing contractor medium scale (ten times) scramjet combustor from Mach 3.5 to Mach 7.  Continued to develop advanced engine components to improve scramjet operating margin and to refine scramjet scaling laws for reusable applications. Continued to develop techniques to decrease scramjet take-over from Mach 4.5 to Mach 3.5 to provide robust options for combined cycle engines (CCEs). Continued to develop low internal drag flame stabilization devices and flight test engine components.  Continued to fabricate heavyweight direct connect scramjet combustors in medium scale (ten times).  Initiated facility reactivation for low Reynolds number supersonic and hypersonic flow research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.095"
                                            },
                                            "Text": {
                                                "val": "Complete direct connect testing of second performing contractor medium scale (ten times) scramjet combustor from Mach 3.5 to Mach 7.  Continue to develop advanced engine components to improve scramjet operating margin and to refine scramjet scaling laws for reusable applications. Continue to develop techniques to decrease scramjet take-over from Mach 4.5 to Mach 3.5 to provide robust options for CCEs. Continue to develop low internal drag flame stabilization devices and flight test engine components. Continue testing advanced materials for application to scramjet engines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.612"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.612"
                                            },
                                            "Text": {
                                                "val": "Complete scramjet engine controls development as part of the high speed strike weapon technology maturation program.  Complete mapping of scramjet isolator operability for distorted in-flow conditions.  Continue to develop advanced engine components to improve scramjet operating margin and to refine scramjet scaling laws for reusable applications. Continue to develop techniques to decrease scramjet take-over from Mach 4.5 to Mach 3.5 to provide robust options for CCEs. Continue to develop low internal drag flame stabilization devices and flight test engine components."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "623048"
                    },
                    "ProjectTitle": {
                        "val": "Combustion and Mechanical Systems"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.482"
                        },
                        "CurrentYear": {
                            "val": "10.574"
                        },
                        "BudgetYearOne": {
                            "val": "10.833"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.833"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "11.010"
                        },
                        "BudgetYearThree": {
                            "val": "11.206"
                        },
                        "BudgetYearFour": {
                            "val": "11.421"
                        },
                        "BudgetYearFive": {
                            "val": "11.646"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project evaluates lubricants, mechanical systems, and combustion concepts for advanced turbine engines, pulse detonation engines, and combined cycle engines. This project also develops technologies to increase turbine engine operational reliability, durability, mission flexibility, maintainability, and performance while reducing weight, fuel consumption, and cost of ownership. Applications include:  missiles, aircraft, and re-usable high-speed vehicles. Analytical and experimental areas of emphasis include:  lubricants, bearings, mechanical systems diagnostics, mechanical systems prognostics, rotor dynamics, oil-less engine technology, optical diagnostics, fundamental combustion, detonations, combustors, and afterburners. Lubricants for these engines must be thermally stable, cost-effective, and operate over a broad range of conditions. Advanced combustion concepts must be cost-effective, durable, and reduce pollutant emissions. A portion of this project supports adaptive cycle technologies. This effort develops component technology for an adaptive cycle engine architecture that provides both optimized performance and fuel efficiency for widely varying mission needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Combustion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, test, and evaluate revolutionary combustion and propulsion concepts for gas turbine, pulse detonation, and combined cycle engines for missiles, manned and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.454"
                                            },
                                            "Text": {
                                                "val": "Continued development of combustor, augmentor, constant volume combustion and pressure gain combustion technologies such as rotating detonation engines (RDEs), Inner-turbine burners (ITBs), and ultra-compact combustors (UCCs) to enable the next generation of gas turbine engines, new engine cycles, and combined-cycles. Continued using advanced diagnostics to obtain high-quality datasets that can be made available to and used by academia and industry for model development. Maintained efforts to determine necessary reference performance and operability combustion systems and metrics to decrease the cost of certifying new and alternative fuels in weapon systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.402"
                                            },
                                            "Text": {
                                                "val": "Continue to explore interactions and effects of compressor and turbine components on the combustor and combustor materials to reduce engine weight and increase efficiency. Continue using advanced diagnostics to obtain high-quality datasets that can be made available to and used by academia and industry for model development.  Maintain efforts to determine necessary reference performance and operability combustion systems and metrics to decrease the cost of certifying new and alternative fuels in weapon systems. Support development of advanced computational fluid dynamics (CFD) models to reduce combustor and augmentor design costs. Maintain efforts to determine necessary reference performance and operability combustion systems and metrics to decrease the cost of certifying new and alternative fuels in weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.510"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.510"
                                            },
                                            "Text": {
                                                "val": "Continue to explore interactions and effects of compressor and turbine components on the combustor and combustor materials to reduce engine weight and increase efficiency. Continue using advanced diagnostics to obtain high-quality datasets that can be made available to and used by academia and industry for model development and verification. Maintain efforts to determine necessary reference performance and operability combustion systems and metrics to decrease the cost of certifying new and alternative fuels in weapon systems. Support development of advanced CFD models to reduce combustor and augmentor design costs. Maintain efforts to determine necessary reference performance and operability combustion systems and metrics to decrease the cost of certifying new and alternative fuels in weapon systems.   Continue program development in computations, modeling and simulation, and research experimentation of advanced combustion concepts including pressure gain combustion components and system level architectures. Continue to explore advanced combustion and flameholding concepts working towards improved understanding at relevant operating conditions such as sub-atmospheric (less than 1 atmosphere) and high pressure (greater than 10 atmospheres)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostic Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate optical, electromechanical, and laser diagnostic tools and sensors for application to revolutionary propulsion technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.887"
                                            },
                                            "Text": {
                                                "val": "Continued development and demonstration of diagnostic systems for high-bandwidth kiloHertz-MegaHertz (kHz-MHz) measurements of combustion chemistry and physics based on 1) time-division-multiplexed hyperspectral absorption spectroscopy, 2) pulse-burst lasers, and 3) ultrashort-pulse (picosecond, femtosecond) lasers. Continued application to engine test cells, and fielded systems. Initiated providing sufficient data to support CFD combustion model development.  Specific efforts were focused on systems to achieve high-bandwidth imaging of non-reacting and reacting flows. Such systems were applied for seminal demonstration of full four-dimensional (4D) high-speed, volumetric imaging of reactant mixing, combustion species, and pollutant emissions (soot)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of diagnostic systems for high-bandwidth kHz-MHz measurements of combustion chemistry and physics based on 1) time-division-multiplexed hyperspectral absorption spectroscopy, 2) pulse-burst lasers, and 3) ultrashort-pulse (picosecond, femtosecond) lasers. Continue application to engine test cells and fielded systems. Continue to provide sufficient data to support CFD combustion model development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.717"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of diagnostic systems for high-bandwidth kHz-MHz measurements of combustion chemistry and physics.  Efforts seek to increase time scales of interest, size of regions explored, and increasing the number of species and their concentrations.  Diagnostics techniques should include 1) time-division-multiplexed hyperspectral absorption spectroscopy, 2) pulse-burst lasers, and 3) ultrashort-pulse (picosecond, femtosecond) lasers. Continue application of the insights gained to engine test cells and fielded systems. Continue to provide sufficient data to support CFD combustion model development.  Specific efforts include development and application of fast laser systems\nand various atomic tracers for high-speed, planar visualization of mixing as applied in gas-turbine and hypersonic\/scramjet propulsion systems. Further development of diagnostic tools\/methods will provide robust measurement capability in engine test cells and full-annular ground-test environments. Developing systems to provide portable measurement capability throughout engine development and testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lubricant Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, test, and qualify advanced turbine engine lubricants. Generate and maintain military specifications for aviation engine lubricants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.986"
                                            },
                                            "Text": {
                                                "val": "Demonstrated Enhanced Ester (EE) oils in F119 and F135 Component Improvement Program (CIP) Accelerated Maturation Testing (AMT) engines in preparation for transition to F-22 & F-35. Began developing Grade 4 oil Phase-out plan (F-22 & F-35). Planned for F-22 & F-35 flight tests of EE oils. Initiated Research and Development (R&D) investigation of novel ionic fluids as potential lubricants for extreme environments (i.e., hi-Mach)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.701"
                                            },
                                            "Text": {
                                                "val": "Continue investigating advanced thermal management technologies for fuel efficient engines & beyond. Continue developing Grade 4 oil Phase-out plan (F-22 & F-35). Continue developing on-line lube system health monitoring technologies. Continue supporting warfighter on field-related mechanical system issues."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.767"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.767"
                                            },
                                            "Text": {
                                                "val": "Continue developing innovative fluids (i.e., ionic fluids\/additives) as potential high temperature lubricants for high-Mach and future high performance engines. Demonstrate EE oils in rig testing and design studies of turbine engines. Continue transitioning EE oil to F-35 and F-22 fleet. Continue developing on-line mechanical system health monitoring technologies. Implement new lubricant traction models into updated bearing design codes. Continue supporting the warfighter on field-related mechanical system issues."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bearing Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and test advanced bearing material technology and bearing concepts for small, intermediate, and large-scale turbine engine applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.155"
                                            },
                                            "Text": {
                                                "val": "Completed full-scale bearing rig testing in support of adaptive, fuel efficient engines. Completed oil-free, foil bearing R&D in support of supersonic expendable engines and remotely piloted aircraft. Experimentally validated improved bearing material life model.  Investigated failure mechanisms of advanced bearing alloys. Continued maturing active bearing thrust control system and fuse with engine prognostics health monitoring system for future efficient engines. Initiated development of active thrust-balance\/prognostic health management (PHM) system for large man-rated and medium-scale propulsion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.771"
                                            },
                                            "Text": {
                                                "val": "Continue developing physics-based bearing life model based on bearing alloy fatigue & microstructural investigations, including bearing life factors for advanced bearing materials.  Initiate in-house investigation of small magnetic bearings & oil-free bearings for small & medium scale unmanned aerial systems (UAS). Continue development of active thrust-balance\/PHM system for large man-rated and medium-scale propulsion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.839"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.839"
                                            },
                                            "Text": {
                                                "val": "Continue developing physics-based bearing life model based on bearing alloy fatigue & microstructural investigations, including bearing life factors for advanced bearing materials. Continue work on small magnetic bearings & oil-free bearings for small & medium scale UAS, hi-Mach cruise missile and low-cost engines. Integrate new bearing modeling simulation tools into full-engine design models. Continue development of active thrust-balance\/PHM system for large man-rated and medium-scale propulsion."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "623066"
                    },
                    "ProjectTitle": {
                        "val": "Turbine Engine Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "62.716"
                        },
                        "CurrentYear": {
                            "val": "52.519"
                        },
                        "BudgetYearOne": {
                            "val": "55.304"
                        },
                        "BudgetYearOneBase": {
                            "val": "55.304"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "55.222"
                        },
                        "BudgetYearThree": {
                            "val": "56.944"
                        },
                        "BudgetYearFour": {
                            "val": "58.330"
                        },
                        "BudgetYearFive": {
                            "val": "59.490"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops technology to increase turbine engine operational reliability, durability, mission flexibility, and performance, while reducing weight, fuel consumption, and cost of ownership. Analytical and experimental areas of emphasis are fans and compressors, high temperature combustors, turbines, internal flow systems, controls, augmentor and exhaust systems, integrated power and thermal management systems, engine inlet integration, mechanical systems, adaptive cycle technologies, and structural design. This project develops component technology for an adaptive cycle engine architecture that provides both optimized performance and fuel efficiency for widely varying mission needs. This project supports joint DoD, agency, and industry efforts to focus turbine propulsion technology on national needs. The program plan is relevant across capability areas for global responsive strike, tactical and global mobility, responsive space lift, and persistent intelligence, surveillance, and reconnaissance (ISR)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Turbofan\/Turbojet Engine Core Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop core turbofan\/turbojet engine components (i.e., compressors, combustors, and turbines) for fighters, bombers, sustained supersonic\/hypersonic cruise vehicles, and transports."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.572"
                                            },
                                            "Text": {
                                                "val": "Completed development of modeling and simulation tools for advanced components including coupled aerothermal models; highly loaded, low emissions combustion systems; and turbine durability designs. Performed structural assessment research of mechanical and turbine components operating in a realistic engine environment. Continued development of improved compressor aerodynamic design tools to extend engine operability and efficiency. Completed detailed design of efficient, very high pressure ratio core component technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.523"
                                            },
                                            "Text": {
                                                "val": "Develop and validate modeling and simulation tools for the design and analysis of advanced turbine components with improved durability for adaptive cycle engines. Continue development of improved compressor aerodynamic design tools and analysis methods to extend engine operability and efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.770"
                                            },
                                            "Text": {
                                                "val": "Develop and validate modeling and simulation tools for the design and analysis of advanced turbine components with improved durability for adaptive cycle engines. Continue development of improved compressor aerodynamic design tools and analysis methods to extend engine operability and efficiency."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Turbofan\/Turbojet Engine Fan, Low Pressure Turbine, and Integration Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop turbofan\/turbojet engine components (i.e., fans, nozzles, etc.) used in engines for fighters, bombers, sustained supersonic strike and hypersonic cruise vehicles, and transports."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.872"
                                            },
                                            "Text": {
                                                "val": "Completed preliminary designs of an adaptive engine to reduce specific fuel consumption reduction by up to 35% for embedded high bypass turbofans, and for sustained supersonic strike applications. Continued development of modeling and simulation tools, including methods to predict behavior of serpentine inlets and nozzles. Initiated rig tests to validate modeling and simulation tools to predict fan\/inlet interaction for both podded and embedded propulsion systems. Completed rig tests to validate probabilistic ignition prediction tool for advanced augmentor design system. Validated models for function and durability of high temperature electronics for engine control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.589"
                                            },
                                            "Text": {
                                                "val": "Continue development of modeling and simulation tools, including methods to predict behavior of serpentine inlets and nozzles. Develop and validate modeling and simulation tools for the design and analysis of advanced low pressure turbine components to enable lower cost\/weight systems with improved aero-performance for increased range and endurance at altitude."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.840"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.840"
                                            },
                                            "Text": {
                                                "val": "Continue development of modeling and simulation tools, including methods to predict behavior of serpentine inlets and nozzles. Develop and validate modeling and simulation tools for the design and analysis of advanced low pressure turbine components to enable lower cost\/weight systems with improved aero-performance for increased range and endurance at altitude.  Identify control technology elements applicable to integrated propulsion\/power\/thermal solutions. Define actionable indicators and assess interface control gaps to enable decision-based informed lifecycle tools."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile and Remotely Piloted Aircraft Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop limited life engine components for missile and remotely piloted aircraft (RPA) applications, including long-range supersonic and hypersonic vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.975"
                                            },
                                            "Text": {
                                                "val": "Completed development of advanced modeling and simulation tools for variable cycle component design, advanced cooling concepts, compact augmentors, and composite structures. Continued to demonstrate advanced component designs in rig testing. Utilized validation data to develop improved test protocol for small engine augmentor designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.424"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate advanced component designs in rig testing. Continue to utilize validation data to develop improved test protocol for small engine augmentor designs.  Initiate development and validation of modeling and simulation tools for the design and analysis of turbine components with mission-tailored aero-performance and highly efficient cooling geometries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.659"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate advanced component designs in rig testing. Continue to utilize validation data to develop improved test protocol for small engine augmentor designs. Continue development and validation of modeling and simulation tools for the design and analysis of turbine components with mission-tailored aero-performance and highly efficient cooling geometries.  Develop and validate parameter, process, and performance modeling for components manufactured through additive technologies.  Develop and validate rules and tools to enable flexible design for targeted life."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Turboshaft\/Turboprop and Small Turbofan Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop components for turboshaft\/turboprop and small turbofan engines for trainers, rotorcraft, special operations aircraft, and theater transports."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.297"
                                            },
                                            "Text": {
                                                "val": "Continued to refine and apply advanced modeling and simulation tools for advanced cooling concepts, high efficiency gearboxes, and high performance airfoils. Demonstrated advanced vibration and temperature sensors for use in engine durability testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.983"
                                            },
                                            "Text": {
                                                "val": "Continue development and validation of modeling and simulation tools to achieve very high levels of loading for advanced low pressure turbine components. Continued to refine and apply advanced modeling and simulation tools for advanced cooling concepts, high efficiency gearboxes, and high performance airfoils."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.035"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.035"
                                            },
                                            "Text": {
                                                "val": "Continue development and validation of modeling and simulation tools to achieve very high levels of loading for advanced low pressure turbine components. Begin exploration of advanced integrated engine controls with potential for synergistic airframe system level benefits."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "623145"
                    },
                    "ProjectTitle": {
                        "val": "Aerospace Power Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.240"
                        },
                        "CurrentYear": {
                            "val": "34.703"
                        },
                        "BudgetYearOne": {
                            "val": "34.736"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.736"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "36.287"
                        },
                        "BudgetYearThree": {
                            "val": "37.715"
                        },
                        "BudgetYearFour": {
                            "val": "36.386"
                        },
                        "BudgetYearFive": {
                            "val": "35.658"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops integrated electrical and thermal management components, controls and systems  for military aerospace applications. Power component technologies are developed to increase reliability, maintainability, commonality, affordability, and supportability of aircraft and flight line equipment. Research is conducted in energy storage and hybrid power system technologies to enable special purpose applications. Electrical power and thermal management technologies enable future military megawatt level power and thermal management needs. This project supports development of electrical power and thermal management components, controls and systems suitable for applications to legacy and future aircraft platforms including strike and mobility concepts. Lightweight power systems suitable for other aerospace applications are also developed."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power System Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop integrated system architecture, controls, and component technologies to provide for the large amounts of electrical power needed, and concurrent thermal mitigation required, by current and future manned and unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.240"
                                            },
                                            "Text": {
                                                "val": "Continued development of system and component electrical power, electro-mechanical, and thermal technologies for high-power applications. Continued development of hybrid approaches to power generation, storage, and application as well as thermal management.  Continued testing of subsystems hardware in conjunction with continued platform level tip-to-tail modeling and simulation energy optimization. Completed integrated ground demonstration of adaptive power and thermal management system for next generation air platforms. Completed power, thermal and propulsion architecture study for future air platforms.  Continued development of advanced, safe energy storage, power distribution, and management systems to include Silicon Carbide applications and batteries.  Initiated power and thermal development toward demonstration of tactical aircraft high-power payload capability, e.g. laser weapon system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "34.703"
                                            },
                                            "Text": {
                                                "val": "Continue development of system and component electrical power, electro-mechanical, and thermal technologies for high-power applications. Continue development of hybrid approaches to power generation, storage, and application as well as thermal management.  Continue testing of subsystems hardware in conjunction with continued platform level tip-to-tail modeling\nand simulation energy optimization.  Continue development of advanced, safe energy storage, power distribution, and management systems to include Silicon Carbide applications and batteries. Continue power and thermal development toward demonstration of tactical aircraft high-power payload capability, e.g. laser weapon system.  Complete design of laser weapon system demonstration architecture."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.736"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.736"
                                            },
                                            "Text": {
                                                "val": "Continue development of system and component electrical power, electro-mechanical, and thermal technologies for high-power applications. Continue development of hybrid approaches to power generation, storage, and application as well as thermal management.  Continue testing of subsystems hardware in conjunction with continued platform level tip-to-tail modeling\nand simulation energy optimization. Continue development of advanced, safe energy storage, power distribution, and management systems to include Silicon Carbide applications and batteries.  Continue power and thermal development toward demonstration of tactical aircraft high-power payload capability, e.g. laser weapon system.  Continue analysis and development of adaptive power and thermal control systems for high-power aircraft.  Initiate development of advanced power options for small unmanned aircraft."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624847"
                    },
                    "ProjectTitle": {
                        "val": "Rocket Propulsion Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "58.121"
                        },
                        "CurrentYear": {
                            "val": "56.278"
                        },
                        "BudgetYearOne": {
                            "val": "58.594"
                        },
                        "BudgetYearOneBase": {
                            "val": "58.594"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "58.472"
                        },
                        "BudgetYearThree": {
                            "val": "60.354"
                        },
                        "BudgetYearFour": {
                            "val": "61.735"
                        },
                        "BudgetYearFive": {
                            "val": "62.950"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops rocket propulsion technologies for space access, space maneuver, the sustainment of strategic systems (including solid boost\/missile propulsion, post boost control, aging and surveillance efforts), and tactical missiles. Analytical and experimental areas of emphasis are propellants, propellant management, combustion, rocket material applications, technology for sustainment of strategic systems, and innovative space propulsion concepts. Technologies of interest will improve reliability, performance, survivability, affordability, and environmental compatibility of these systems. Develop technologies to reduce the weight and cost of components using new materials and improved designs and manufacturing techniques. All efforts in this project contribute to the sustainment of the rocket propulsion industry, providing rocket propulsion technology for the entire DoD. Technologies under this program enable capabilities of interest to both DoD and National Aeronautics and Space Administration (NASA). Efforts include: modeling and simulation; proof of concept tests of critical components; advanced component development; and ground-based tests. Aging and surveillance efforts could reduce lifetime prediction uncertainties for individual motors by 50%, enabling motor replacement for cause. All efforts are part of the Rocket Propulsion 21 (RP21) program and reviewed by a DoD level steering committee yearly for relevance to DoD missions and achieve RP21 Goals."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3.600"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally directed efforts"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fuel Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, characterize, and test advanced hydrocarbons, energetics, solid propellants, and monopropellants to increase space launch payload capability and refine new synthesis methods."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.461"
                                            },
                                            "Text": {
                                                "val": "Completed scale up methods for removing components from fuels that adversely affect fuel coking in rocket engine environments. Continued to evaluate scaled-up propellants in advanced combustion devices to determine materials compatibility and performance to include supporting large-scale motor tests. Continued to develop advanced binder systems to enable use of advance solid propellant ingredients with significant improvements over state-of-the-art. Continued to utilize 60-liter batch reactor to supplement micro continuous flow technology for the production of propellant ingredients. Continued development and characterization of next generation ionic liquid propellants for use in spacecraft and missile defense applications. Evaluated the effects of ingredient variability on solid propellant properties and ageing characteristics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.854"
                                            },
                                            "Text": {
                                                "val": "Develop robust binder systems compatible with advanced energetic materials to significantly improve the performance of state-of-the-art solid propellants. Produce modular micro plant, which will allow for the production of desired chemicals on-demand. Promote acoustic resonant mixing in order to improve the homogeneity and reproducibility of solid propellant formulations. Develop scaled-up propellants for use in large-scale motor tests. Continue development and characterization of next generation ionic liquid propellants for use in spacecraft and missile defense applications. Support NASA’s Green Propellant Infusion mission to demonstrate a non-toxic ionic liquid based propulsion system in space."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.136"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.136"
                                            },
                                            "Text": {
                                                "val": "Continue developing solid rocket propellant binder systems for intended use across a variety operationally relevant conditions.  Conceive, synthesize, scale-up, and characterize novel energetic ingredients, including both fuels and oxidizers, for use across the span of space and missile applications from strategic and tactical boost through in-space thrust and attitude control.  Transfer knowledge for making green monopropellants to the United States industrial base.  Formulate, scale-up, and evaluate formulations of solid and liquid rocket propellants.  Identify, evaluate, and adapt 21st century material processing equipment to enable more rapid and agile development and more precise products.  Continue support for NASA’s Green Propellant Infusion mission to demonstrate a non-toxic ionic liquid based propulsion system in space.  Continue research in high-temperature resins, insulators, and composite case fabrication techniques to enable high mass-fraction rocket motor cases. Initiate high-performance bi-propellant synthesis and formulation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Liquid Engine Combustion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced liquid engine combustion technology for improved performance, while preserving chamber lifetime and reliability needs for engine uses in heavy lift space vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.353"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of injector concepts in hot fire conditions. Continued efforts looking at multi-injector designs and control effectors. Continued transition of candidate injector technologies to industry. Continued hot fire tests in combustion stability rig. Continued combustion stability modeling critical to supporting future hydrocarbon fueled liquid rocket engines. Developed reduced chemical kinetic mechanism for fuel combustion implementable in computational fluid dynamics (CFD) simulations (first & second phase: 1 to 80 atmospheres of pressure). Experimentally evaluated novel cooling channel designs developed via additive manufacturing. Extended modeling and simulation of fuel film cooling to include additional physical effects in order to close gaps with experimental data. Continued developing understanding of hydrocarbon fuel production, what components affect fuel coking and should be removed from the fuel (or added) during the production process, and how fuels can be engineered with a purpose. Completed a test article that enables heat transfer tests at conditions relevant to full scale boost engines in a laboratory environment. Continued to evaluate and develop advanced material solutions for high temperature components in rocket engines. Continued to develop high performance compact liquid rocket engine technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.837"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of injector concepts in hot-fire conditions. Continue examination of multi-injector designs and control effectors. Deliver high-fidelity injector simulations that complement experimental data. Continue hot fire tests in combustion stability rig. Continue combustion stability modeling critical future hydrocarbon fueled liquid rocket engines. Deliver combustion stability codes to rocket community, enabling more robust and stable engine designs. Continue developing understanding of hydrocarbon fuel production, what components affect fuel coking and should be removed from the fuel (or added) during the production process, and how fuels can be engineered with a purpose. Employ new fuel and material operating limitations, manufacturing processes, and launch goals in cycle analysis to identify trade space for future engines. Continue to evaluate and develop advanced material solutions for high temperature components in rocket engines. Develop refractory metallic film deposition techniques for application in catalytic thrusters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.118"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.118"
                                            },
                                            "Text": {
                                                "val": "Complete the testing plan for the program to assess the potential payoff of, and technical barriers to, Rotating Detonation Engines as a reliable and lower-cost advanced propulsion approach for both launch and in-space applications.  Continue evaluation of methane multi-injector designs in hot-fire conditions. Deliver high-fidelity injector simulations that complement experimental data. Continue hot fire tests in combustion stability rig.  Continue combustion stability modeling critical future hydrocarbon fueled liquid rocket engines. Deliver combustion stability codes with nearly-complete set of validation data to rocket community, enabling more robust and stable engine designs. Continue developing understanding of hydrocarbon fuel production, expanding testing in to methane fuels and other cryogenic cooling.  Employ new fuel and material operating limitations, manufacturing processes, and launch goals in cycle analysis to identify trade space for future engines. Continue to evaluate and develop advanced material solutions for high temperature components in rocket engines. Initiate installation of new test facility that will fill the current capability gap and allow for fast, low-cost testing of multi-injector designs and stability strategies at conditions relevant to the demands of both DoD and industry for next-generation engines (including use of liquid oxygen and higher pressures and thrust)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Liquid Engine Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop advanced liquid engine technologies for improved performance, while increasing life and reliability needs for engine uses in expendable and reusable launch vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.610"
                                            },
                                            "Text": {
                                                "val": "Continued to develop enabling Hydrocarbon Boost (HCB) technology for future spacelift concepts and continued risk reduction activities for the development of HCB technologies (turbopump assembly, thrust chamber assembly). Completed Critical Design Review for the full-scale Preburner. Initiated long-lead fabrication of the Preburner. Began exploring engine concepts for next generation, beyond 2035, launch vehicles and concepts to effect cost reductions. Also explored changing facility needs and requirements to support characterization of components and research demonstrators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.906"
                                            },
                                            "Text": {
                                                "val": "Continue to develop enabling HCB technology for future spacelift concepts and continue risk reduction activities for the development of HCB technologies. Continue exploring engine concepts for next generation, beyond 2035, launch vehicles and concepts to effect cost reductions. Continue exploring changing facility needs and requirements to support characterization of components and research demonstrators."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.644"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.644"
                                            },
                                            "Text": {
                                                "val": "Complete architecture and cost-benefit study for next generation liquid propulsion, with efforts focused on modularity and cost reduction. Continue to develop enabling HCB technology for future spacelift concepts and continue risk reduction activities for the development of HCB technologies. Continue exploring engine concepts for next generation, beyond 2035, launch vehicles and concepts to effect cost reductions. Initiate sub-scale risk mitigation and technology maturation activities to transition to next generation engine concepts."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "On-Orbit Propulsion Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop solar electric, solar thermal, chemical, and advanced propulsion technologies for station-keeping, repositioning, and orbit transfer for satellites and satellite constellations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.383"
                                            },
                                            "Text": {
                                                "val": "Completed support of NASA flight of Air Force Research Laboratory (AFRL) non-toxic monopropellant (replaces toxic monopropellant currently used in spacecraft). Conducted scale-up of advanced monopropellants and evaluated advanced ignition schemes and chamber concepts, including integration of advanced plume diagnostic capabilities. Continued development of next-generation high power electric spacecraft propulsion for increased efficiency, operability, and flexibility. Continued advanced modeling and simulation tool developments to improve design and analysis tools for a wide range of spacecraft propulsion concepts\/technologies, to incorporate new concepts\/technologies, and to model electric propulsion and chemical thruster physics accurately. Transitioned initial version of new thruster\/plume modeling framework to spacecraft industry for use in future designs. Explored and developed new generation of chemical spacecraft thruster technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.190"
                                            },
                                            "Text": {
                                                "val": "Continue scale-up research of the advanced monopropellant (AF-M315E) and continue supporting demonstrations of advanced ignition schemes and chamber concepts. Improve upon baseline plume diagnostic capabilities. Continue development of next-generation high power electric spacecraft propulsion, with efforts focused on two competing technology paths. Continue advanced modeling and simulation tool developments to improve design and analysis tools for a wide range of spacecraft propulsion concepts\/technologies.  Extend efforts to develop high fidelity modeling and simulation tools for both chemical and electric propulsion thrusters. Continue transition of new thruster\/plume modeling framework to spacecraft industry for use in future designs. Release version 2 beta code to industry partners and provide user support. Explore and develop new generation of bipropellant chemical spacecraft thruster technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.732"
                                            },
                                            "Text": {
                                                "val": "Continue scale-up research of advanced chemical propellants with particular focus on transition of numerical tools and experimental methodologies for advanced monopropellants to spacecraft industry.  Support maturation of advanced plume diagnostics for both chemical and electric propulsion thrusters with potential for integrated state-of-health application.  Expand validation and verification programs (both experimental and flight) to quantify accuracy of modeling and simulation tools developed to support thruster-spacecraft integration.  Continue transition and support of thruster\/plume modeling framework to spacecraft industry, with addition of advanced electric propulsion (EP) thruster models, to industry partners.  Continue to explore advanced EP and chemical thruster concepts and assess new spacecraft propulsion requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Access and Strike Applications"
                                    },
                                    "Description": {
                                        "val": "Develop missile propulsion and boost technologies for space access and strike applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.132"
                                            },
                                            "Text": {
                                                "val": "Continued to develop advanced tactical propulsion. Continued development and evaluation of next generation of updated, physics-based modeling, simulation, and analysis tools for missile propulsion components and applications. Continued to develop advanced component technologies for missile propulsion applications for strategic and strike systems helping to ensure their long-term sustainment. Continued propellant development efforts including long-life propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.146"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced tactical propulsion. Continue development and evaluation of next generation of updated, physics-based modeling, simulation, and analysis tools for missile propulsion components and applications. Continue use of tools in upcoming missile propulsion demonstration. Continue to develop advanced component technologies for missile propulsion applications for strategic and strike systems helping to ensure their long-term sustainment. Develop technology options for post-boost systems exploring cost reductions, performance improvements, and potential for commonality among Air Force, Navy, and Missile Defense Agency. Continue propellant development efforts including long-life propellants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.440"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.440"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced tactical propulsion. Continue development and evaluation of next generation of updated, physics-based modeling, simulation, and analysis tools for missile propulsion components and applications. Continue used tools in upcoming missile propulsion demonstration. Continue to develop advanced component technologies for missile propulsion applications for strategic and strike systems helping to ensure their long-term sustainment, to include an altitude hot fire. Continue development of technology options for post-boost systems exploring cost reductions, performance improvements, and potential for commonality among Air Force, Navy, and Missile Defense Agency. Continue propellant development efforts including long-life propellants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ballistic Missile Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop missile propulsion technologies and aging and surveillance technologies for ballistic missiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.582"
                                            },
                                            "Text": {
                                                "val": "Continued to apply next generation of chemical and aging mechanism modeling, simulation, and analysis tools, sensor schemes and tools, and non-destructive analysis tools. Continued advanced sensor development efforts to further improve data acquisition and reduce uncertainty in ballistic missile life predictions. Supported transition of previous tools, models, data management system to user. Improved the fidelity and precision of non-destructive evaluation tools, improving capability to determine flaw size, orientation, and location. Initiated long-term validation of tools through long-term aging of sub-scale motors. Continually monitored and periodically tested sub-scale motors to validate the sensor and complete analytical analysis of each motor."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.345"
                                            },
                                            "Text": {
                                                "val": "Continue to apply next generation of chemical and aging mechanism modeling, simulation, and analysis tools, sensor schemes and tools, to user. Continue advanced sensor development efforts to further improve data acquisition and reduce uncertainty in ballistic missile life predictions. Continue long-term validation of tools through long-term aging of sub-scale motors. Continue to monitor and periodically test sub-scale motors to validate the sensor and analytical analysis of each motor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.524"
                                            },
                                            "Text": {
                                                "val": "Continue to apply next generation of chemical and aging mechanism modeling, simulation, and analysis tools, sensor schemes and tools, to user needs and unique problems. Initiate development of advanced sensor, non-destructive evaluation, modeling and supporting technology development efforts to detect and explain phenomena further improve data acquisition and reduce uncertainty in ballistic and tactical missile solid rocket motor life predictions. Continue long-term validation of tools through long-term aging of sub-scale motors. Continue to monitor and periodically test sub-scale motors to validate the sensor and analytical analysis of each motor."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "625330"
                    },
                    "ProjectTitle": {
                        "val": "Aerospace Fuel Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.865"
                        },
                        "CurrentYear": {
                            "val": "4.502"
                        },
                        "BudgetYearOne": {
                            "val": "4.616"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.616"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.690"
                        },
                        "BudgetYearThree": {
                            "val": "4.772"
                        },
                        "BudgetYearFour": {
                            "val": "4.868"
                        },
                        "BudgetYearFive": {
                            "val": "4.967"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project evaluates hydrocarbon-based fuels for legacy and advanced turbine engines, scramjets, pulse detonation and combined cycle engines. This project also considers fuel related concepts that can increase turbine engine operational reliability, durability, mission flexibility, energy efficiency, and performance while reducing weight, fuel consumption, and cost of ownership. Applications include missiles, aircraft, sustained high-speed vehicles, and responsive space launch. Analytical and experimental areas of emphasis include evaluations of fuel properties and characteristics of alternative fuels developed from unconventional sources (such as coal, natural gas, biomass, and combinations thereof), unique\/alternate fuels and components used in integrated thermal and energy management systems including high heat sink fuel capability, fuels logistics and associated vulnerabilities, and combustion diagnostics and engine emissions measurements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Alternative Fuels"
                                    },
                                    "Description": {
                                        "val": "Conduct evaluations and perform technical assessments of alternative hydrocarbon fuels derived from coal, natural gas, and biomass for use in legacy and advanced aerospace systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.195"
                                            },
                                            "Text": {
                                                "val": "Continued to evaluate advanced cellulosic alternative fuels being considered for addition to commercial aviation jet fuel, which Air Force (AF) will use due to conversion to new fuel standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate advanced alternative fuels being considered for addition to commercial aviation jet fuel, which AF will use due to conversion to new fuel standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.102"
                                            },
                                            "Text": {
                                                "val": "Complete evaluations of fully-synthetic jet fuels produced from alcohol and triglyceride feedstocks."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Thermal and Energy Management"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced components and conduct performance assessments of advanced aircraft integrated thermal and energy management systems for engines and aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.468"
                                            },
                                            "Text": {
                                                "val": "Evaluated fuel-based closed-loop liquid precooler systems for tactical air platforms. Optimized the composition of next generation endothermic fuel for use with catalysts for maximum heat sink and reduced coking."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.401"
                                            },
                                            "Text": {
                                                "val": "Continue to develop fuel and catalyst approaches to improve endothermic fuel heat sink and minimize coking."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.437"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.437"
                                            },
                                            "Text": {
                                                "val": "Evaluate advanced additives, catalysts, and fuel composition approaches to minimize endothermic fuel coking."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuel Logistics"
                                    },
                                    "Description": {
                                        "val": "Study and evaluate low-cost approaches to reduce fuel logistics footprint to reduce cost. Study fuel logistics vulnerabilities and develop detection and mitigation technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.468"
                                            },
                                            "Text": {
                                                "val": "Evaluated AF capability to reduce\/eliminate fuel additives F-24\/Jet A."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.401"
                                            },
                                            "Text": {
                                                "val": "Continue to develop tools to link changes in F-24\/Jet A fuel composition over time with fuel properties and performance including infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.437"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.437"
                                            },
                                            "Text": {
                                                "val": "Develop fuel temperature limits for full-life fuel systems as part of integrated power and thermal management systems"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combustion Emissions and Performance"
                                    },
                                    "Description": {
                                        "val": "Develop and test advanced emissions diagnostic techniques for airbreathing propulsion systems. Conduct evaluations of the combustion and emissions characteristics of aviation fuels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.734"
                                            },
                                            "Text": {
                                                "val": "Initiated combustor\/hot section materials durability study as a function of fuel composition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Evaluate fuel composition effects on operability and emissions of advanced developmental combustors and engines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.640"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.640"
                                            },
                                            "Text": {
                                                "val": "Complete Aerospace Recommended Practice (ARP) for particulate emissions measurements for engine certification, joint with Federal Aviation Administration (FAA), NASA, and industry."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}