{
    "id": "2018-DefenseLogisticsAgency-PB-0400-JBOOK-93ef420b155c5965fcf09b1297f9c2fcb91c712f7d4f88b3c6d5e268769c7d7b-9",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DLA-U_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Defense_Logistics_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0708011S"
        },
        "ProgramElementTitle": {
            "val": "Industrial Preparedness"
        },
        "R1LineNumber": {
            "val": "244"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "21.843"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "21.843"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Logistics Agency (DLA) Industrial Preparedness Manufacturing Technology (IP ManTech) Program supports the development of a responsive, world-class manufacturing capability to affordably meet the warfighters’ needs throughout the defense system life cycle.  IP ManTech: Provides the crucial link between invention and product application to speed technology transitions.  The program matures and validates emerging manufacturing technologies to support low-risk implementation in industry and Department of Defense (DoD) facilities, e.g. depots and shipyards.  It addresses production issues early by providing timely solutions, thereby reducing risk and positively impacting system life cycle affordability by providing solutions to manufacturing problems before they occur.  \n\nBeginning in FY16, DLA ManTech was realigned into three Strategic Focus Areas (SFA): 1) Improving Industrial base Manufacturing Processes; 2) Maintaining Viable Sources of Supply; and 3) Improving Technical and Logistics Information.  \n•\tThe Improving Industrial Base Manufacturing Processes SFA includes efforts to reduce industrial base material costs and production lead-times, while improving the quality of DLA managed products. This SFA subsumed the former supply chain oriented efforts in  Subsistence Network (formerly known as the Combat Rations Network for Technology Implementation), Procurement Readiness Optimization—Advanced Casting Technology (PRO-ACT), Procurement Readiness Optimization—Forging Advance System Technology (PRO-FAST), and Battery Network (BATTNET). New manufacturing processes within the scope of this SFA include emerging technologies such as Additive Manufacturing.  \n•\tMaintaining Viable Supply Sources includes efforts to assure the commercial industrial base can satisfy DLA materiel requirements. This SFA subsumed the Material Acquisition Electronics ManTech efforts.  In the future, it will include other DLA efforts to maintain a viable industrial capability in areas such as Strategic Materials. \n•\tThe Improving Technical and Logistics Information SFA include efforts to improve and facilitate the exchange of engineering and logistics information among DLA industry partners and customers. It includes the MANTECH program Military Uniform System Technology (MUST) (formerly known as Customer Driven Uniform Manufacturing) and the Defense Logistics Information Research Program from P.E. 0603712S.  A primary focus of this SFA is to capitalize on the emerging “Model Based Enterprise” paradigm and the semantic web as an enabler to a logistics system that is smart and connected.    \n\nNOTE: The single supply chain exhibits were removed as they are now included within the SFA exhibits."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.605"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.843"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.762"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.762"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Over the FY 17, $9.346M was realigned to the ManTech PE from the DLA Log R&D PE (0603712S) and DLA Procurement Defense-Wide.  These funds will address critical shortfalls in the Improving Industrial Base Manufacturing Processes and Maintaining Viable Supply Sources SFA's.  The largest requirement was in the Maintaining Viable Supply Sources to develop a long-term, reliable source of linear microcircuits.  These devices are critical to maintaining the readiness of front line weapon system electronics.  High priority requirements in the Improving Industrial Base Manufacturing Processes SFA included additional funding for battery technology, castings and forging manufacturing technology."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "7"
                    },
                    "ProjectTitle": {
                        "val": "Improving Industrial Base Manufacturing Processes (formerly Material Availability)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "5.293"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.293"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Material Availability (MA) Strategic Focus Area (SFA) is an R&D effort undertaken with DLA’s industrial base to reduce material costs, reduce the length and variability of Production Lead-Times, assure the DLA managed products meet requirements, and continuously improve quality and reliability. Benefits of this SFA include lower material costs, lower inventory levels and more predictable Customer Wait Times, fewer quality deficiencies, and lower customer support costs.  This strategic focus area includes within its scope the Subsistence Program (former Combat Rations Program), the Battery Program, the Castings and the Forgings programs.  \n\nThe Battery network objective is to develop the next generation of battery manufacturing technologies for cost and price efficiency, longer shelf life, and lighter batteries with higher energy. The network conducts R&D initiatives to address sustainment gaps and bridge technical solutions into higher MRLs for specific groups of batteries. For FY2014, DLA received 139,163 orders for 2.85 million batteries at $183M net value - compared to FY13 $176M and FY12 $216M. The Battery network focuses on projects to develop the production capability for advanced lithium-based non-rechargeable and rechargeable batteries to ensure the prompt and sustained availability, quality, and affordability of batteries. Desired outcomes include: streamlined inventory and associated cost reductions through standardization and improved distribution practices; resolved obsolescence issues; addressed surge and sustainment issues; enhanced security of supply chain; increased competition and manufacturing base; reduced per unit battery cost; and leveraged Service-level (Army, Navy, Air Force) and other governmental (DOE, DOT, NASA) R&D efforts to insert new technology and practices into the existing DLA battery inventory.\n\nThe Subsistence Network objective is to research and promote manufacturing improvements in the subsistence supply chain with the goals of leveraging the latest technologies, encouraging innovation and modernization, and to maximizing capability and capacity in subsistence. The areas of research includes: combat rations, food equipment, field feeding solutions, food footprint, food innovations, food safety and defense, garrison feeding, nutrition and health, storage and packaging solutions, surge and sustainment support, and water security. The Microwave Assisted Thermal Sterilization (MATS), MRE Alternate Chemical Laminate, Optimize Combat Ration Inspection Costs, and Combat Rations Shelf Life Temperature Monitoring Project are current short-term projects that will have desired results such as improved processes, enhanced  quality of individual and group combat rations, reduced cost associated with combat rations inpsections, and increased efficiencies, then transition these improvements as applicable to industrial base suppliers and government suppliers. \n\nThe Castings consortium objective is to develop new materials and technologies for the metalcasting industry to help DLA improve the supply of parts that contain castings. Weapon system spare parts managed by DLA that contain castings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs).  Cast parts are ~2% of National Stock Numbered Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered up to 10% are castings.  This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design.  Once developed, these capabilities will support the foundry industry, where the technologies will be tested and implemented in conjunction with the industry associations.  These advancements will improve the metalcasting supply chains for the DOD and the DLA to better support the warfighter.  This is achieved through investments in projects aimed at reducing lead-time, reducing cost, and improving quality of castings critical to DOD weapon systems.\n\nThe Forgings consortium objective is to develop new material and technological solutions for the forging industry to help DLA improve the supply of parts that contain forgings.  Weapon system spare parts managed by DLA that contain Forgings are responsible for a disproportionate share of DLA’s backorders or unfilled orders (UFOs).  Forged parts are ~2% of National Stock Numbered Class IX parts but represent ~5% of all backorders, and when only the oldest backorders are considered up to 10% are forgings.  This program includes tasks to develop new capabilities in the areas of inspection, materials, processes, modeling, and design.  Once developed these capabilities will support the forging industry, where the technologies will be tested and implemented in conjunction with the industry associations.  These advancements will improve the forging supply chains for the DOD and the DLA to better support the warfighter.  This is achieved through investments in projects aimed at reducing lead-time, reducing cost, and improving quality of forgings critical to DOD weapon systems.\n\nThe Additive Manufacturing (AM) objective is to establish AM as an effective alternative to conventional manufacturing and document the process for AM benefits.  DLA needs to exploit AM technology as a lead-time and inventory reduction enabler."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Industrial Base Manufacturing Processes (formally Material Availability)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.293"
                                            },
                                            "Text": {
                                                "val": "The Subsistence Network issued a new Broad Agency Announcement (BAA) in July 2016 and will remain open for five years. The BAA projects have an expected duration of 6-24 months and the government plans to invest up to $18 million during Fiscal Years 2017-2021 for funding research in response to this BAA. The 5 MILMRE Menu Bag Test, a short term study  associated  with the Meals Ready-to-Eat (MRE) Chemical Laminate project was completed in December of 2016.\nThe work on three Short Term Projects (STP) (Optimize Combat Rations Inspection, Microwave Assisted Thermal Sterilization (MATS), and MRE Shelf Life Temperature Monitoring Project) were extended at the government request in FY16 to fund additional research, development and testing of these projects. Further research and testing on the Optimize Combat Rations Inspection project will identify and test 18 cost savings measures. On the MATS project, a Microwave Assisted Thermal Sterilization Carrier Tray was designed and tested to optimize the product quality that the MATS can produce. The MRE Shelf Life Temperature Monitoring Project was extended to examine other subsistence storage and distribution points, including transportation systems and determine the temperature and humidity conditions that subsistence items are exposed to at the locations. The Small Business Innovation Research program Subsistence Topics were released in September 2016 and STPs were reviewed for consideration of Phase I selection in 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY17 Fund Realignment from BA07 to BA03 PE 0603680S."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Battery Network plan is to establish contract partners through a competitive Broad Area Announcement (BAA) based upon proposals that demonstrated knowledge, experience, and expertise in the following areas of interest: Automation, Diminishing Manufacturing & Supply, Battery Safety, Reducing Acquisition Costs, Shelf Life, Supply Chain Logistics, Surge\/Sustainment, and Technology Transition\/Insertion. A Government Steering Group (GSG) of power source technical experts from the military services R&D groups will inform general R&D requirements for supply chain and technology improvement. The plan also includes awarding Phase 2 and 3 projects from DLA’s Small Business Innovation Research (SBIR) in advanced battery manufacturing technology. \n\nThe Subsistence Network Broad Agency Announcement (BAA) for the acquisition of research and development of short term projects was released in July 2016 and will remain open for five years, FY17 – FY21.  A Joint Steering Group made up of government representatives from the Military Services, DLA, U.S. Department of Agriculture, U.S. Public Health Center, and the Natick Soldier Research, Development and Engineering Center will review ongoing projects, identify new areas for investment, assess proposed projects, examine procedures and processes, keep abreast of new technologies, and understand DLA and DoD subsistence needs and requirements.\n\nThe DLA Castings R&D Program involved a competitive Broad Agency Announcement (BAA) in FY16 soliciting for new R&D projects.  Evaluations will be completed in 2017, with multiple contract awards anticipated for 2017.  The current contracts reached the end of their base period of performance on September 30, 2016, which were also awarded under a competitive BAA in 2011. \nThe DLA Forgings R&D projects were awarded through a competitive Broad Agency Announcement (BAA)."
                        },
                        "PerformanceMetrics": {
                            "val": "The Battery Network plan is to report returns on investments and achievements to the Joint Defense Manufacturing Technology Panel (JDMTP) for evaluation. \n\nThe Subsistence Network plan is to execute reductions in cost for shipping, storage, supply chain process, inventory, waste and inspections, as well as reduced lead times for combat ration production, field feeding equipment, garrison feeding and “market fresh.\"\n\nFor example, SUBNET will provide the following technical achievements: 1) a microwave-assisted capability to sterilize group-sized entrees and components, packaged in Institutional Sized Pouches (ISP) and Polymeric Trays and 2) identify and produce at least one or more alternate sealant layers that can be used by the rations industry to pack high acidic food products and to ensure uninterrupted supply of MRE rations. \n\nThe Castings consortium plan is to report returns on investments and achievements to the Joint Defense Manufacturing Technology Panel (JDMTP) for evaluation. \n\nThe Forgings consortium plan is to report returns on investments and achievements to the Joint Defense Manufacturing Technology Panel (JDMTP) for evaluation.  \n\nThe Additive Manufacturing metric is the number of parts qualified for AM and the lead-time savings achieved to make small quantities of items.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Maintaining Viable Supply Sources (formerly High Quality Sources)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "10.188"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.188"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The High Quality Sources SFA are projects undertaken to assure that the industrial base can respond to DLA requirements and DLA can fill military customers’ material requirements reliably and consistently.  Benefits include eliminating cancelled requisitions returned to customers as “non-procurable.” This strategic focus area includes within its scope the Material Acquisition Electronics program.  \n\nThe Material Acquisition Electronics roadmap has four major thrusts in Digital Microcircuits: Advanced Schottky TTL, TTL Compatible CMOS, 512 Kilobit RAM\/ROM and Mega Gate ASIC.  The Roadmap also includes a new major thrust area: Linear Microcircuits.  Over the past several years, obsolescence in this class of microcircuits has greatly increased and has become a significant concern.  These are classes of microcircuits that are expected to become non-procurable in FY 17 and beyond.  Without the technologies planned on the MAE Roadmap, DLA will not be able to support DoD’s requirements for high quality spare parts for critical electronic systems and subsystems.  \n\nThe Strategic Materials roadmap is a new thrust for the DLA Mantech program.  It is designed to ensure that critical strategic materials are available from domestic sources and that process innovations are in place to efficiently process or recover strategic materials. Domestic capabilities can enhance national security and potentially reduce Defense Stockpile requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maintaining Viable Supply Sources (formally High Quality Sources)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.188"
                                            },
                                            "Text": {
                                                "val": "MAE continued planning for the specific emulation technology implementations to support specific device family groups in consonance with customer and agency requirements. MAE completed development and transitioned higher density Read-Only and Random-Access Memory, Advanced Emitter-Coupled Logic and Closed-Cell CMOS capabilities into full-scale production, further increasing DLA’s ability to re-establish sourcing of non-procurable microcircuit NSNs. The newly transitioned emulation capabilities address several discontinued device families and will increase the potential emulation production envelope by several hundred NSNs.  MAE also initiated new implementations including development of TTL-Compatible CMOS Emulation Capability and development of reverse engineering and design capability for Field-Programmable Gate Arrays (FPGAs). It continued developing 350 nanometer Digital Emulation circuitry, bringing emulation capability that re-establishes sources for additional NSNs.  AME also completed initial development and capability assessments (gap analysis) to support a new major emulation thrust to support Linear Microcircuits beginning in FY2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY17 Fund Realignment from BA07 to BA03 PE 0603680S"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "MAE efforts are incremental funding on a competitive awarded 5 year contract.  \n\nStrategic Materials efforts will be competitively evaluated and awarded using Broad Agency Announcement (BAA) procedures."
                        },
                        "PerformanceMetrics": {
                            "val": "Transition of one technology implementation (base array) to low-rate initial production or full-scale production.  Each technology implementation increases the breadth of microcircuit part types which can be returned to a procurable status; improving readiness and avoiding the need to redesign at the next-higher level.  Potential benefit to hundreds of weapon systems.\n\nStrategic Materials: Develop roadmap and transition targeted manufacturing technologies.  \n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Improving Technical and Logistics Information (formerly Industry and Customer Collaboration)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "6.362"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.362"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Improving Technical and Logistics Information Strategic Focus Area (SFA) projects improve and facilitate the communication of technical and logistics information among industry, DLA’s military customers and DLA. This SFA includes Military Unique Sustainment Technology (MUST) and the Defense Logistics Information Research (DLIR) (P.E. 0603712S) within its scope. The movement of the DLIR related work from P.E. 0603712S to the DoD ManTech Program aligns the funding to the critical interface between DLA and industry and away from internal DLA operations.\n\nThe MUST focus addresses GAO Report 12-707 recommendations that DoD to establish a “knowledge-based approach” to collaborate on define and communicate of military unique requirements. DLA has the responsibility to communicate and manage the technical requirements among the Services and the Defense Industrial Base. Currently, there is no common environment for collaborating on new requirements among the stakeholders. The strategic objective of the DLA MUST program is to identify, develop and adopt technologies that can significantly reduce the lead-time between Individual Item and Equipment (IIE) development and sustainment from years to months. The program focuses on technologies that will transform the military IIE supply chain from an “electronic paper” (i.e. PDF\/MS Word) based, manual environment into a knowledge based automated environment. The resulting approach will be a neutral platform that will seamlessly communicate military unique technical requirements throughout the end to end supply chain.\n\nThe DLIR Model Based Enterprise effort will develop capabilities to systematically accept engineering and design data from the Military Services, validate and store item technical data in 3D models. There are two classes of data that must be addressed: newly designed parts for systems still in development and legacy parts for systems that are in sustainment. The problem with newly designed parts is capturing the complete and accurate designs. The legacy parts do not have digital engineering models which recreate the design in contemporary engineering systems.   \n\nThe Technical and Logistical Data Interoperability will pioneer methods to capture data from military Services, Original Equipment Manufacturers (OEMs), and suppliers to form a seamless thread of interoperable and linked data models."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Improving Technical and Logistics Information (formally Industry and Customer Collaboration)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.362"
                                            },
                                            "Text": {
                                                "val": "The MUST program completed plans to set up distributed pilots of the knowledge based approach. The pilots are developing and demonstrating a digital specification authoring tool, a 3D visualization tool, and technology to streamline the transition of requirements from the Services to DLA.  This technology allows DLA, its customers and suppliers to access, manage and share technical requirements in a common format. \n\nThe DLIR program completed the Strategic Sourcing Tool Project which provided an automated and repeatable process with an accompanying application for rapidly identifying commercially available equivalents for stocked NSNs. \n\nAdditionally, the DLIR program initiated the Product Lifecycle Management (PLM) Interoperability Project. Currently, technical part data must be manually aggregated and interpreted, and then re-entered and verified within the various systems used by the Services, DLA, and its suppliers, to ensure consistency of all requirements. This project will attempt to semi-automate integration of requirements within each system, improve exchange across systems, and ensure that all participants are made aware of changes that affect these requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "FY17 Fund Realignment from BA07 to BA03 PE 0603680S"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Delivery\/Task Orders are awarded against a competitively awarded IDIQ contracts."
                        },
                        "PerformanceMetrics": {
                            "val": "The metrics for ICC are error elimination in engineering and technical data, including omissions and uncertainties in specifications, streamlining vendor level of effort associated with completing procurements, and improved collaboration among the Services, DLA and the industrial base.  The result will lead to reduced lead-time, inventory and to avoid the costs of defective material.\n\nAt least 30% of the completed projects will transition.   \n\nOSD-C financial metrics (obligation and disbursement) will be achieved."
                        }
                    }
                }
            ]
        }
    }
}