{
    "id": "2018-Navy-PB-1319-MJBOOK-4-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-43",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0305232M"
        },
        "ProgramElementTitle": {
            "val": "RQ-11 UAV"
        },
        "R1LineNumber": {
            "val": "243"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "2.807"
            },
            "PriorYear": {
                "val": "0.635"
            },
            "CurrentYear": {
                "val": "0.418"
            },
            "BudgetYearOne": {
                "val": "2.022"
            },
            "BudgetYearOneBase": {
                "val": "2.022"
            },
            "BudgetYearTwo": {
                "val": "0.535"
            },
            "BudgetYearThree": {
                "val": "0.521"
            },
            "BudgetYearFour": {
                "val": "0.532"
            },
            "BudgetYearFive": {
                "val": "0.545"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Small Unit Remote Scouting System (SURSS) - The SURSS program procures unmanned aircraft systems (UAS) to provide battalion\/company\/detachment level units with scalable airborne reconnaissance and surveillance to aid in detecting, identifying, engaging, or avoiding enemy units. Multiple systems, to include RQ-12 Wasp, RQ-11 Raven, RQ-20 Puma and various Nano\/VTOL UAS's are required to meet various operational requirements delineated in the Operational Requirements Document. The SURSS program also conducts Field User Evaluations (FUEs) to support Universal Urgent Needs Statements (UUNS) that inform future USMC system procurement and ensure Marines have the most current technology available.\n\nDevelopment efforts for SURSS are ongoing in order to keep Group I-II UAS capability in line with emerging technologies and threats.  SURSS is developing a Single Operator Man-Portable Ground Control System (SOMGCS) to improve portability and digital interoperability.  Mobile ad-hoc network (MANET) communication relay, laser marker, and Signals Intelligence payloads integration are being developed to improve effectiveness and interoperability to better support the warfighter.  Improvements such as solar technology, improved batteries, software upgrades, and alternative repair components are being explored to improve effectiveness, reliability, and reduce support costs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.635"
                },
                "CurrentYear": {
                    "val": "0.418"
                },
                "BudgetYearOne": {
                    "val": "1.510"
                },
                "BudgetYearOneBase": {
                    "val": "1.510"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.635"
                },
                "CurrentYear": {
                    "val": "0.418"
                },
                "BudgetYearOne": {
                    "val": "2.022"
                },
                "BudgetYearOneBase": {
                    "val": "2.022"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.512"
                },
                "BudgetYearOneBase": {
                    "val": "0.512"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.500"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.500"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.012"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.012"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2018 from FY 2017 of $1.6M is due to increased integration requirement for SOMGCS Software and MANET, as well as beginning integration of the Laser Marker.  Operational assessments begin in FY18 for these items as well and equates to the increase in funding from FY17."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2292"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned Air Systems (Intel)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "2.807"
                        },
                        "PriorYear": {
                            "val": "0.635"
                        },
                        "CurrentYear": {
                            "val": "0.418"
                        },
                        "BudgetYearOne": {
                            "val": "2.022"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.022"
                        },
                        "BudgetYearTwo": {
                            "val": "0.535"
                        },
                        "BudgetYearThree": {
                            "val": "0.521"
                        },
                        "BudgetYearFour": {
                            "val": "0.532"
                        },
                        "BudgetYearFive": {
                            "val": "0.545"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Small Unit Remote Scouting System (SURSS) - The SURSS program procures unmanned aircraft systems (UAS) to provide battalion\/company\/detachment level units with scalable airborne reconnaissance and surveillance to aid in detecting, identifying, engaging, or avoiding enemy units. Multiple systems, to include RQ-12 Wasp, RQ-11 Raven, RQ-20 Puma and various Nano\/VTOL UAS's are required to meet various operational requirements delineated in the Operational Requirements Document. The SURSS program also conducts Field User Evaluations (FUEs) to support Universal Urgent Needs Statements (UUNS) that inform future USMC system procurement and ensure Marines have the most current technology available.\n\nRQ-12 Wasp (Block 0) - Wasp is a small, all environment UAS with a wingspan of 3.3 feet weight of 2.25 pounds and endurance of 60 minutes. The payload consists of a gimbaled turret with Electro Optical\/Infrared (EO\/IR) sensor. It allows maximum portability and provides near real time reconnaissance required by the platoon and rifle squad which reduces the Intelligence, Surveillance, and Reconnaissance (ISR) request-to-response timeframe and eliminates delays or denials for coverage due to an imbalance of unmanned air systems to requests. Wasp is used for remote reconnaissance and surveillance, force protection, convoy security, target acquisition, and battle damage assessment. A Wasp system consists of two air vehicles, two GCSs, and one reconnaissance, surveillance, and target acquisition (RSTA) kit.\n\nRQ-11 Raven (Block 1) - Raven is a small UAS with a wingspan of 4.6 feet, weight of 5 pounds and endurance of 90 minutes. The Raven employs a gimbaled EO\/IR sensor.  The Raven can be carried by personnel on foot and provides the company level unit an organic near real time ISR capability that facilitates rapid battlefield decision making.  A Raven system consists of three air vehicles, two GCS, and one RSTA kit.\n\nRQ-20 Puma (Block 2) - Puma is an all environment UAS with a wingspan of 9.2 feet, weight of 13 pounds and endurance of 2.5 hours.  The PUMA has demonstrated ranges up to 28 kilometers.  The standard payload consists of a gimbaled turret with an EO\/IR sensor.  A Signals Intelligence payload is also available.  The PUMA provides an organic, persistent ISR capability to battalion level units. Additionally, it has been used extensively by Route Clearance Platoons (RCP) and Combat Logistics Patrols (CLP) to enhance force protection and detect Improvised Explosive Devices (IEDs). A Puma system consists of two air vehicles, two GCSs, and one RSTA kit.\n\nLong Endurance Small UAS - LE SUAS is an organic Group 1-2 UAS operated and maintained by a ground or similar tactical unit. It includes Vertical Take Off and Landing (VTOL) kit capability, quiet electric motor\/hybrid fuel cell technology, high definition electro optic\/infrared\/laser (marker or designator) payload, and long range antenna kit. The air vehicle travels at an altitude of about 500-1000 feet about ground level at an approximate speed of 35 knots with an endurance of greater than eight hours with a fuel cell, and four hours with battery. It can be launched with an optional VTOL kit or with a launcher system. Mission sets include real-time full motion video for airborne intelligence, surveillance, reconnaissance (AISR), force protection, targeting, pattern of life observation, high value target tracking, control of indirect fires, full motion video to support target analysis, target package development, counter small UAS, spectrum operations (e.g. SIGINT\/Cyber\/EW) and communications relay\/extension. A system consists of three air vehicles, one ground control station, and associated equipment. Additionally, this system and similar organic small UAS require system modifications and integration to adapt for Field User Evaluations (FUE).\n\nIncrease in FY 2018 from FY 2017 of $1.604M is due to increased integration and test requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Product Development and Support"
                                    },
                                    "Description": {
                                        "val": "The $0.688M increase from FY17 to FY18 is due to laser marker development occurring in FY18 and increased development requirements for continuing efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.635"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continued Single Operator Man-Portable Ground Control Station (SOMGCS) development and integration with Killswitch, common software and hardware solution.\n-Completed assessment of rapid charging capabilities.\n-Initiated development and integration of Mobile Ad hoc Networks communication relay (MANET).\n-Initiated development and integration of electronic warfare capability (SIGINT) kit.\n-Initiated initial assessment of laser marker."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.418"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue SOMGCS development and transition to production.\n-Continue development and integration of Mobile Ad hoc Networks communication relay (MANET).\n-Continue integration electronic warfare capability (SIGINT) kit.\n-Initiate and complete operational assessment of SOMGCS."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.106"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.106"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Complete integration of electronic warfare capability (SIGINT) kit, laser marker, and Mobile Ad hoc Networks communication relay (MANET).\n-Initiate software development for SOMGCS to improve digital interoperability"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation (Operational Assessment)"
                                    },
                                    "Description": {
                                        "val": "The $0.916M increase in funding from FY17 to FY18 is due test and evaluation efforts starting that did not occur in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.916"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.916"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Initiate operational assessment of MANET, and Laser Marker.\n-Initiate assessment of low cost, commercial available Unmanned Aerial Systems to inform future procurements, and determine potential adversary capabilities.\n-Change in funding from FY17 to FY18 is due test and evaluation efforts starting that did not occur in FY17."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PMC\/4757"
                                    },
                                    "Title": {
                                        "val": "RQ-11 UAV"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.430"
                                        },
                                        "CurrentYear": {
                                            "val": "19.293"
                                        },
                                        "BudgetYearOne": {
                                            "val": "10.154"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "10.154"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.757"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.868"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.977"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.002"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program office is pursuing a rapid acquisition approach to quickly field new technology and capabilities to the warfighter. The strategy is to use evolutionary acquisition with incremental developments to meet the final desired Small Unit Remote Scouting System (SURSS) requirements (Joint USMC\/USA\/SOCOM capabilities). The next increment will involve an evolution to a Group 1-2 (Family of System) individually capable of executing requirements for long, medium and short range missions in fulfillment of the SURSS requirement.  A comprehensive review of service small UAS needs is being conducted to update current requirements documents."
                        },
                        "PerformanceMetrics": {
                            "val": "Successful operational test of MANET, SIGINT and Laser Marker payloads.\nSuccessful operational test of SOMGCS.\nFielding of the SOMGCS, MANET, SIGINT and Laser Marker payloads in accordance with planned schedule.\nFielding of remaining RQ-20 PUMA systems in accordance with planned schedule.\nDemonstrated improvements in Digital Interoperability."
                        }
                    }
                }
            ]
        }
    }
}