{
    "id": "2018-Navy-PB-1319-MJBOOK-1-0-e7487182eb20e49e1e261d2bd0d24b43d4ab9fea79e396b7b39295763fe44520-6",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603382N"
        },
        "ProgramElementTitle": {
            "val": "Advanced Combat Systems Tech"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "65.665"
            },
            "PriorYear": {
                "val": "1.572"
            },
            "CurrentYear": {
                "val": "57.034"
            },
            "BudgetYearOne": {
                "val": "61.381"
            },
            "BudgetYearOneBase": {
                "val": "61.381"
            },
            "BudgetYearTwo": {
                "val": "65.946"
            },
            "BudgetYearThree": {
                "val": "61.266"
            },
            "BudgetYearFour": {
                "val": "65.645"
            },
            "BudgetYearFive": {
                "val": "68.400"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Combat System Technology line is to evolve the technical and business practices for programs to change to an open architecture construct. The program was constructed to mature both technical and business model integration for C5I systems programs of record in an open architecture environment. The priority was incorporating the principles of modular design and design disclosure, reusable application software, interoperability and secure information exchange, lifecycle affordability and encouraging competition and collaboration.\n\nProject Unit 0324: Funding is to fully implement the Naval Open (Systems) Architecture (OSA) strategy. The implementation of this strategy provides the tools and leadership for assisting programs and the Naval Research and Development Establishment through the technical, business and cultural transition to OSA. The primary tools and assistance is established through a limited set of technical reference frameworks, consistent contract language guidance, Intellectual Property strategies and improvements in transparency of design disclosure and information exchange on past and current investments to support portfolio management and cross-program reuse. The OSA transformation effort will be applied to programs of record and coupled with rapid prototyping efforts being realized as management efficiencies both within programs and in accelerated acquisition efforts. Those elements include ensuring that all naval systems, families of systems, programs and prototypes move to modular OSA in accordance with Department of Defense (DoD) Instruction 5000.01 of 7 January 2015 which mandates that all DoD programs utilize Modular OSA to rapidly field affordable and interoperable systems. This project facilitates a strategic shift in the technical and business methods to establish cooperation and cross-domain\/COI business relationships. This improves innovation and economies of scale throughout the Navy and Marine Corps. This leadership effort has identified the business case and potential return on investment for moving the Navy towards an open systems approach, supported the development of open systems technologies, and integrated best business and technical practices for open systems development within Naval acquisition. Naval OSA ensures Navy-wide system architectures become extensible and scalable in function, capacity, and workload to meet Joint warfighting requirements. This also includes the identification and development of common software components, functions, reuse methodologies, and extensible product lines.\n\nProject Unit 0385: The Rapid Prototype Development project was new in FY17 and addresses the advancement and transition of combat system technologies. It supports the goals and objectives of the Chief of Naval Operations (CNO) Navigation Plan, Commandant of the Marine Corps (CMC) Planning Guidance, and the Cooperative Strategy for 21st Century Seapower. This project also supports the Secretary of the Navy's (SECNAV) Innovation Vision and the Implementation Directive for Better Buying Power 3.0. These efforts will reinvigorate and increase the use of prototyping and experimentation to rapidly field new warfighting capabilities, concepts and technologies, and engineering solutions. In some cases these efforts may be identified for acceleration in accordance with SECNAV and CNO guidance for Accelerated Acquisition.  With an emphasis on rapid prototyping of mature technologies the project is intended to expedite the development, exploration and fielding of combat system innovations in six warfighting domains: surface warfare, air warfare, undersea warfare, expeditionary warfare, information dominance and special operations warfare. Prototype development efforts will be used to develop\/refine Concepts of Operation (CONOPS) and operational requirements; evaluate the operational utility and technical feasibility of technology\/engineering innovations; support limited fielding of prototypes; and mitigate cost, schedule and performance risks associated with follow-on acquisition programs.\n\nProject Unit 0399: The Unmanned Rapid Prototype Development project was new in FY17 and was created to implement the SECNAVs emphasis on unmanned warfare systems and addresses the advancement and transition of naval warfare systems technology. This project funds unmanned system (UxS) rapid development technology initiatives based on Navy warfighting needs and capability gaps. This project supports the goals and objectives of the CNO Navigation Plan and the Cooperative Strategy for 21st Century Seapower. Additionally, this project supports the SECNAVs Innovation Vision and the Implementation Directive for Better Buying Power 3.0. In some cases these efforts may be identified for acceleration in accordance with SECNAV and CNO guidance for Accelerated Acquisition. With an emphasis on rapid prototyping of mature UxS technologies the project is intended to expedite the development, exploration and Fleet introduction of unmanned capabilities in the warfare areas of Surface, Air, Anti-Submarine, and Expeditionary Warfare, Information Dominance and Special Operations Warfare. The project will provide the Navy and Marine Corps with technical and operational utility assessments of technology\/engineering innovations; ability to refine operational requirements and concepts of operation; support limited fielding of prototypes; and mitigate cost, schedule and performance risk associated with follow-on acquisition programs. \n\nProject Unit 3422: The SHARC Surface Platforms demonstration project is part of the Department of Defense Third Offset Strategy as one element in the Sensor Grid category for 24\/7 autonomy infused Situational Awareness (SA). This project will purchase Commercial-off-the-Shelf SHARC Platforms (wave gliders) and integrate four (4) unique Government-owned classified mission payloads focused on the detection of threats. These capabilities will enable CONOPS development in an operationally relevant environment to demonstrate how these technologies can improve the SA to the battlespace Commanders.\n\nProject Unit 3423: The LOCUST demonstration is part of the Department of Defense Third Offset Strategy as one element in the Effector Grid category for small autonomous systems. LOCUST leverages the BA-3 Innovative Naval Prototype program developing and demonstrating swarming technology. The BA-3 effort is developing both the air vehicle, UAS swarming behaviors, and miniaturized sensor systems. ONR has demonstrated an autonomous system capable of launching 33 UASs in 40 seconds and flying them in a coordinated swarm. This BA-4 effort is trailing the BA-3 demonstration of technologies by a fiscal quarter and then demonstrating the technology in operationally relevant environments with military mission applications.\n\nProject Unit 3424: The Heterogeneous Collaborative Unmanned Systems (HCUS) demonstration is part of the Department of Defense Third Offset Strategy as one element in the Effector Grid category for small autonomous systems. HCUS provides autonomous, tactical monitoring of an adversary's port-sized littoral area for an extended period of time with capability to apply limited offensive effects on-demand.  Vehicles and sensors are intended to be used in contested environments - employing local communications nets, autonomous vehicle behavior, low bandwidth command links and local navigation with no requirement for GPS input. \n\nHCUS systems can be encapsulated and deployed as a single payload, or a small number of payload packages designed for specific missions. The payloads can be carried into theater by various manned or unmanned platforms depending on the degree of stealth required. A week-long project demonstration will simulate covert deployment, operations of autonomous UAVs over the area of interest, data exfiltration to a remote operator, autonomous UAV recharging via USVs and\/or UUVs, deployment of unmanned ground sensors for persistent sensing, and remote operator on-demand offensive attack on a simulated target."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.631"
                },
                "CurrentYear": {
                    "val": "57.034"
                },
                "BudgetYearOne": {
                    "val": "57.592"
                },
                "BudgetYearOneBase": {
                    "val": "57.592"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.572"
                },
                "CurrentYear": {
                    "val": "57.034"
                },
                "BudgetYearOne": {
                    "val": "61.381"
                },
                "BudgetYearOneBase": {
                    "val": "61.381"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.059"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "3.789"
                },
                "BudgetYearOneBase": {
                    "val": "3.789"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.059"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "3.033"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.033"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.756"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.756"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 funding request was reduced by -$0.124 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0324"
                    },
                    "ProjectTitle": {
                        "val": "Adv Combat System Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "65.665"
                        },
                        "PriorYear": {
                            "val": "1.572"
                        },
                        "CurrentYear": {
                            "val": "1.651"
                        },
                        "BudgetYearOne": {
                            "val": "1.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.869"
                        },
                        "BudgetYearTwo": {
                            "val": "1.855"
                        },
                        "BudgetYearThree": {
                            "val": "1.842"
                        },
                        "BudgetYearFour": {
                            "val": "1.879"
                        },
                        "BudgetYearFive": {
                            "val": "1.917"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Project Unit 0324: Funding is to fully implement the Naval Open (Systems) Architecture (OSA) strategy. The implementation of this strategy provides the tools and leadership for assisting programs and the Naval Research and Development Establishment through the technical, business and cultural transition to OSA. The primary tools and assistance is established through a limited set of technical reference frameworks, consistent contract language guidance, Intellectual Property strategies and improvements in transparency of design disclosure and information exchange on past and current investments to support portfolio management and cross-program reuse.  The OSA transformation effort will be applied to programs of record and coupled with Rapid Prototyping, Experimentation and Demonstration (RPED) efforts being realized as management efficiencies both within programs and in accelerated acquisition efforts. Those elements include ensuring that all naval systems, families of systems, programs and prototypes move to modular OSA in accordance with Department of Defense (DoD) Instruction 5000.01 of 7 January 2015 which mandates that all DoD programs utilize Modular OSA to rapidly field affordable and interoperable systems. This project facilitates a strategic shift in the technical and business methods to establish cooperation and cross-domain\/\nCOI business relationships. This improves innovation and economies of scale throughout the Navy and Marine Corps. This leadership effort has identified the business case and potential return on investment for moving the Navy towards an open systems approach, supported the development of open systems technologies, and integrated best business and\ntechnical practices for open systems development within Naval acquisition. Naval OSA ensures Navy-wide system architectures become extensible and scalable in function, capacity, and workload to meet Joint warfighting requirements. This also includes the identification and development of common software components, functions, reuse methodologies, and extensible product lines."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Align the Naval Enterprise Across All Domains to Implement OA"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued to coordinate and develop the quarterly OA Report to Congress, annual budget submission and financial reporting for this project. Implement Enterprise architecture of modular development and maximum reuse. Promote tailor-able open standards relative to Technical Reference Frameworks attributes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.030"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY16 Plan in addition to:\nExtending technical, business and cultural transition to increase OSA Adoption to RPED projects and programs of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.631"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.631"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY2017 Plan in addition to:\nCoordinate the development of hardware and software in using Technical Reference Frameworks for common\nproducts that could be employed across a variety of platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Change the Naval and Marine Corps Cultures to Institutionalize OA Principle"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.192"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued with direct engagement with programs to improve OA principles and practices through stakeholder management,\ncommunications, mentoring, training, and curriculum adjustment. Established and maintained communication and\ntransparency across programs to highlight new opportunities for enterprise product reuse and improved interoperability.\nSustained a strong message to the public and industry on the value of OA for cost-effective management of the acquisition portfolio. Adjust funding techniques for cross-Enterprise co-development. Identify best practices and collaborative forums to increase the likelihood of transitioning maturing technology into programs of record."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.217"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with FY2016 Plan in addition to:\nCoordinate the development of hardware and software in using Technical Reference Frameworks for common products\nthat could be employed across a variety of platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.624"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY2017 Plan in addition to:\nCoordinate the development of hardware and software in using Technical Reference Frameworks for common\nproducts that could be employed across a variety of platforms."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OA Systems Engineering Leadership"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.161"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued transition of programs to fully utilize the principles and practices of OA in accordance with the ASN(RDA) approved Naval OSA Strategy of November 2012. Continued collaboration and cooperation incentives,\nand improved techniques for finding and using modular capabilities. Adjust incentives for collaboration and cooperation between programs. Establish reward mechanisms for programs and personnel successful in achieving OSA implementations that rapidly integrate innovation and lower total ownership costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.166"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with FY2016 Plan in addition to:\nSponsor Communities of Interest to support cooperation between programs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.225"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue FY2017 Plan in addition to:\nSponsor Communities of Interest to support cooperation between programs"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Knowledge Products for Implementing OSA"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.219"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued effort to evolved the Program Managers OSA Workbook and other associated knowledge products to position Naval Programs to take advantage of consistent business and technical practices. Continued collaboration forums so that best practices can be shared so that the OA related knowledge products are kept up to date with the latest innovations being used in program execution. This included working with outside organizations such as DISA's Forge.mil as well as the Navy's NSERC\/NARS environments. Continued work to ensure that DAU is addressing training on OSA as directed to them under the Better Buying Power implementation memo that assigns DASN RDT&E the lead for providing baseline information for curriculum development. Continued to develop new training on OA, including deployment of Naval unique training on OA throughout the SYSCOMs and PEOs. Minimized DAU courses to fill needed knowledge gaps. Established an OSA mentoring program for acquisition professionals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.238"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with FY2016 Plan in addition to:\nWork with the Naval Laboratories to establish OSA as the default method for creating prototypes"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue with FY2017 Plan in addition to:\nWork with the Naval Laboratories to establish OSA as the default method for creating prototypes"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This has been a Navy Acquisition Executive directed effort to fundamentally alter the business, technical and cultural environment for warfare systems acquisition to improve cost, increase access to innovation, and reduce time to field. The Navy's OSA Enterprise effort built off past successes such as the Acoustic Rapid Commercial-off-the-Shelf Insertion started program and established this core OA Budget line (policy statement dated 5 August 2004). The strategy was further refined in the Deputy Chief of Naval Operations (DCNO)requirement of 23 December 2005 (N6\/7), the Naval OSA Strategy of 2011 and extended for applicability to the other Defense Services under the DoD Better Buying Power initiative.  This effort continues to expand into and support the related strategic shift to Rapid Prototyping, Experimentation and Demonstration."
                        },
                        "PerformanceMetrics": {
                            "val": "Change Naval Processes and business practices to cost-effectively innovate and rapidly deploy improved warfighting capability based on fleet requirements. Provide OSA to field common, interoperable capabilities; Change Navy and Marine Corps Business processes to Institutionalize OSA Principles."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0385"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Prototype Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "40.356"
                        },
                        "BudgetYearOne": {
                            "val": "25.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.876"
                        },
                        "BudgetYearTwo": {
                            "val": "30.219"
                        },
                        "BudgetYearThree": {
                            "val": "36.567"
                        },
                        "BudgetYearFour": {
                            "val": "42.386"
                        },
                        "BudgetYearFive": {
                            "val": "42.792"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This project was new in FY2017. Beginning in FY17, funding for the CNO Rapid Innovation Cell (CRIC) (Project 2140) was realigned from PE 0604707N Space and Electronic Warfare (SEW) Architecture\/Eng, as well as funding from the Rapid Technology Transition (RTT) program from PE 0203761N to support rapid prototype development in support of the CNO's Design for Maintaining Superiority strategy and lines of effort that focus on warfighting and learning faster."
                        },
                        "ProjectMissionDescription": {
                            "val": "Department of Navy (DON) leadership has acknowledged that maintaining maritime superiority depends in part on our ability to accelerate the speed of warfighting and technological innovations in order to extend our advantage to offset our adversaries' growing capabilities. The Rapid Prototype Development project supports the goals and objectives of the Chief of Naval Operations (CNO) Navigation Plan and Design for Maintaining Maritime Superiority, Commandant of the Marine Corps (CMC) Planning Guidance, and the Cooperative Strategy for 21st Century Seapower, and is fundamental to the DON's efforts to improve our acquisition outcomes. This project is aligned with, and in direct response to, calls for increased prototyping and experimentation in USD(AT&L)'s Better Buying Power 3.0, Secretary of the Navy's (SECNAV) Task Force Innovation direction, and the CNO direction to Achieve High Velocity Learning at Every Level. This project would target, among other sources, technologies maturing out of ONR's Leap Ahead portfolio as well as technologies maturing out of other S&T venues. These efforts will reinvigorate and increase the use of prototyping to rapidly field new warfighting capabilities, concepts and technologies, and engineering solutions.\n\nThe Rapid Prototype Development project funds a strategic focus on rapid prototyping of innovative combat system technologies and engineering innovations to explore Fleet-proposed capability concepts and needs, as well as foster advancements in naval warfighting capabilities. With an emphasis on rapidly prototyping mature technologies, the project is intended to expedite the development, exploration and fielding of technology and engineering prototypes to provide advanced warfighting capabilities, new technologies and engineering innovations across all Naval warfighting domains. Prototype development efforts will be used to inform\/refine Concepts of Operation (CONOPS) and operational requirements; evaluate the operational utility and technical feasibility of technology\/engineering innovations; support limited fielding of prototypes; and mitigate cost, schedule and performance risks associated with follow-on acquisition programs.\n\nIn support of the Fleet Forces Command, Naval Warfighting Development Centers, Naval Warfare Development Command, and the Marine Corps Combat Development and Integration Command, this project will leverage the scientific and engineering expertise and technical infrastructure within the Naval Research and Development Establishment (NR&DE) to produce sensor, weapon system, and command, control, and communications prototypes to address naval warfighting needs and pursue future naval warfighting concepts. \n\nAdditionally, new and emerging technologies and engineering innovations that offer the potential to reduce cost, increase readiness, or improve the overall efficiency or effectiveness of naval forces will be explored. A key distinction is that the process and battle rhythm is designed for optimal responsiveness to Fleet needs. \n\nSpecific projects under this project number will be selected and executed in accordance with the Department of the Navy (DoN) Accelerated Acquisition Process as described in SECNAVINST 5000.42.  The Secretary of the Navy will notify Congress prior to initiation of a project under this project number in accordance with the requirements established in Section 216 of the FY 2017 National Defense Authorization Act."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Prototype Development, Experimentation and Demonstration"
                                    },
                                    "Description": {
                                        "val": "Technologies, innovations, and threats continually emerge and require rapid response. Pre-set, yearly, or even quarterly proposal\/review cycles are not sufficiently responsive to the dynamic nature of cutting-edge technological breakthroughs, engineering innovations, new operational concepts, and\/or emerging threats. Rapid prototyping and demonstration addresses this issue by: \n\n- improving alignment across Fleet and Marine Corps forces, Requirements, Budgeting, and Research & Development organizations to prioritize initiatives and streamline management and execution of rapid prototyping and experimentation,\n- allowing the DON to \"learn fast\" through prototyping - completing projects as rapidly as possible to improve follow-on system acquisition decisions before incurring significant costs,\n- unleashing the intrinsic ingenuity of the Navy's Science and Technology (S&T) community, the NR&DE, and our talented Sailors and Marines.\n\nIn response to Fleet needs, rapid prototyping and demonstration will identify and select prototyping initiatives based on direct and continuous Fleet engagements. Integrated teams consisting of scientists and engineers from across the NR&DE are promptly deployed to interact with Fleet Commands, the Navy Warfare Development Command, and Warfighting Development Centers. The rapid prototyping and demonstration approach considers maturing S&T technologies and engineering innovations produced through Future Naval Capabilities, Innovative Naval Prototypes, Naval Innovative Science and Engineering (NISE) Section 219, Emerging Capabilities and Prototypes, and commercial technologies as potential prototypes. Direct and continuous interactions between our scientists and engineers and the operators they support will drive innovation and, more importantly, align technical ideas with operational needs at the earliest stages in prototype development. \n\nPrototypes are used to refine operational concepts and requirements through experimentation campaigns making maximum use of tools, ranges, and test facilities readily available within our NR&DE and Fleet experimentation venues. Prototypes will be demonstrated in operationally relevant environments on an accelerated timeline. Deliverables include actual integrated hardware\/software prototype system(s) and experimentation events, CONOPS, requirements analysis, test report(s), and technical data package(s) to support experimentation events, limited fielding decisions, and to inform leadership decisions on the development of an acquisition program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "40.356"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The rapid prototyping and demonstration process is iterative and responsive to warfighting needs, capability gaps, naval priorities, and technology opportunities. The FY18 execution plan will draw upon the focus areas, projects and plans outlined below and are based on USFF prioritized warfighting needs, assessments of emerging technology, and as informed by recent analysis, wargames and other experimentation results. The project focus areas reflect the Navy's strategic shift in national security to the Asia-Pacific Theater, and also address the requirement to continue to reduce lifecycle costs across all systems. The FY 2018 rapid development cycle execution plan will select promising technologies for rapid prototype and demonstration consistent with the focus areas.\n\n1. Electromagnetic Maneuver Warfare\nElectromagnetic Maneuver Warfare (EMW) is the Navy and Marine Corps warfighting approach to gain decisive\nmilitary advantage in the electromagnetic spectrum, to enable freedom of action across all naval mission areas. Advanced\ncomponents and prototypes will demonstrate multi-spectral sensors; passive detection, tracking, and targeting systems; real\ntime spectrum awareness; robust, resilient circuits, transceivers, links; electronic protection; emissions management; spread\nspectrum techniques; deception and decoys; electronic attack (including directed energy); networked sensors and weapon\nsystems; battle management aids; or cyber situational awareness, security, and operations.\n1.1 Battlespace Awareness\nEmerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia\nwill be integrated to demonstrate intelligence, surveillance, reconnaissance (ISR), and targeting support. Advanced sensing\ncapabilities (ship-, airborne-, and ground-based; multi-, hyper-spectral, and other) capable of long-range sensing and\ndiscrimination are required to understand electromagnetic emissions and ultimately produce fire control quality data.\nThis work will explore the warfighting utilization of emerging naval innovations such as Tactical Nighttime Wide-Area\nSurveillance, Ultra Wide Field Of View (FOV) Area Surveillance, and others.\n- Survey naval research and development, industry and academia sources for emerging sensors and processing capabilities.\n- Conduct trade studies to support CONOPS refinement.\n- Develop prototypes and perform sub-system and integration testing.\n- Conduct experiments at naval labs and test ranges.\n- Assess technical performance and operational utility at focused events such as Rim of the Pacific Exercise (RIMPAC)\n2018.\n- Develop objectives for follow-on Fleet experiments that include alternative technologies, more robust capabilities, or\nalternative employment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and\nexperimentation.\n\n1.2 Naval Tactical Data Links and Networks\nEmerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia\nwill be integrated to demonstrate secure, reliable, collection, analysis, and fusion of ISR and targeting data from organic\nassets and sensors. This work will explore the warfighting utilization of emerging naval and industry innovations, to include\nINPs , such as multiple, simultaneous, wideband data links, for signal and imagery data transmission between organic assets\nand Battle Group level processing systems. Technologies with the potential to provide Unit-level access to ISR data will be\nsubmitted to the Fleet for experimentation. Project will integrate mature technologies developed through naval investments\nin the areas of low probability of intercept and detection techniques, high data rate, long-range, multi-band and wideband\nlinks, networked and software defined modes, and encryption and signal processing technologies, as well as various\nNemesis modules.\n- Conduct requirements analysis in support of CONOPS refinement.\n- Complete design and demonstration objective reviews.\n- Perform sub-system and integration testing.\n- Conduct experiments in a simulated maritime relevant environment.\n- Assess technical performance and operational utility.\n- Submit to Fleet experimentation venues such as the Naval Tactical Data Network at-sea experiment.\n- Assess technical performance and operational utility.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative\nemployment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and\nexperimentation.\n\n1.3 Counter ISR and Targeting\nEmerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia\nwill be integrated to demonstrate directed energy and other prototype systems to counter enemy ISR and targeting systems,\nconduct electronic attack, and deploy jammers and decoys. . This work will explore the warfighting utilization of emerging\nnaval and industry innovations, such as High Power Radio Frequency Counter-UAS, Tactical EO-IE-SIGINT Integrated\nfor Targeting, various Nemesis modules as well as other prototypes which, due to the nature of those projects, specific\napplications and detailed plans are available at a higher classification level.\n- Technical assessment of emerging sensors, systems, and processing capabilities.\n- Participate and provide technical inputs to planned naval tabletop workshops, mission planning events, and wargames such\nas those planned in support of the Naval Integrated Fires Campaign.\n- Complete design and demonstration objective reviews.\n- Perform sub-system and integration testing.\n- Conduct experiments against threat surrogates in a maritime relevant environment.\n- Assess technical performance and operational utility.\n- Develop objectives for follow-on wargames and Trident Warrior\/Rim of the Pacific (RIMPAC 2018).\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and\nexperimentation.\n\n1.4 Data Fusion and Tactical Decision Aid\nEmerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia\nwill be integrated to demonstrate automated data-fusion engines and networked tactical decision aids which leverage\nnetworked sensors, radars, combat systems, and weapons to overcome single-platform limitations. This work will explore\nthe warfighting utilization of emerging naval and industry innovations, to include INPs, autonomous data fusion and\nprocessing modules, various Nemesis modules, as well as other prototypes.\n- Conduct requirements analysis in support of CONOPS refinement.\n- Complete demonstration objective reviews.\n- Software development and integration testing.\n- Conduct experiments in a simulated maritime relevant environment.\n- Assess technical performance and operational utility.\n- Human System Interface (HSI) assessments.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative\nemployment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and\nexperimentation.\n2. Undersea Dominance\nUndersea Dominance is focused on developing advanced components and prototypes to compliment the submarine\nforce with affordable fixed and mobile arrays, distributed netted sensors, autonomous systems, and advanced payloads.\nTechnologies with the potential to close anti-submarine warfare and mine warfare warfighting gaps will be submitted to the\nundersea dominance operating concept and mine warfare at-sea experiments.\n\n2.1 Advanced Payloads and Sensors\nEmerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia will\nbe integrated to demonstrate advanced payloads and sensors to support anti-submarine and mine warfare missions. This\nwork will explore the warfighting utilization of emerging naval and industry innovations such as Remote Aerial Sonar and\nCommunications Acoustic Laser System, Acoustic Communications modules that enable collaborative mission execution\nbetween distributed systems such as the heavy weight torpedo, Compact Rapid Attack Weapon, and Compact Modular\nSensor and processing Suite as well as other projects which due to their nature, specific applications and detailed plans are\navailable at a higher classification level.\n- Update requirements and CONOPS based on emerging technology and experimentation results\n- Conduct delta-design and delta-demonstration objective reviews\n- Perform acoustic sub-system and integration testing with airborne platform\n- Conduct experiments at Naval test ranges\n- Assess technical performance and operational utility\n- Submit to undersea dominance operating concept at-sea Fleet experiment\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and\nexperimentation.\n\n2.2 Advanced Undersea Weapons\nAdvanced Undersea Weapons initiatives provide limited area denial capability to support Fleet operations. This work\nwill explore the warfighting utilization of emerging naval and industry innovations such as the Multi-Compact Very Light\nWeight Torpedo Launcher, High Speed Electric Propulsion for the Anti-Torpedo Torpedo as well as other projects which,\ndue to their nature, specific applications and detailed plans, are available at a higher classification level.\n- Provide technical input to workshops and wargames such as the Undersea Innovation Seminar War Game.\n- Conduct delta-design and delta-demonstration objective reviews.\n- Sub-system and integration testing into such programs as the ultra-lightweight torpedo.\n- Conduct experiments at Naval test ranges.\n- Assess technical performance and operational utility.\n- Submit experiments to mine warfare at-sea Fleet experiments such as the Undersea Domain Operation Concept at-sea\nexperiment.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative\nemployment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and\nexperimentation.\n3. Surface Dominance\nSurface Dominance is focused on a fleet initiative to give the operational commander options to employ naval combat\npower in any anti-access\/area-denial (A2\/AD) environment. The emergence of sophisticated sea-denial strategies has driven a need to shift to an offensive imperative to control the seas. Increasing surface-force distributed lethality in offensive\nweapons and associated concept of operations need more strike options for joint-force commanders and add battlespace\ncomplexity to an adversary's calculus. The prototypes and associated experiments will explore new concepts in Naval force\nemployment and enforce the core competencies of sea control when applied with bold new offensive methods.\nPrototypes in this area will explore:\n1. Identification of advanced research in the sensors and weapons that can be used to project power and counter rapidly\nevolving missile, air, submarine, and surface threats that challenge our ability to establish dominance at the times and places\nof our choosing.\n2. Development and exploration of new sensors and planning tools that will address a more complex targeting problem\nwhile creating more favorable conditions to project power where required.\n3. Experimentation with technologies and methods to more fully integrate the Navy and Marine Corps combat team to\nprovide persistent presence that can influence and control events at sea and in the littorals.\n4. Provide feedback to the planning and production of weapons, sensor, tactical tools and employment methods to address a\nmore broadly deployed lethality.\n\n3.1 Weapon Systems and Integration\nThis project will explore innovative and emerging electronics and control systems, sensors, payloads, and weapons\ntechnologies that have the capability of upgrading the offensive capability of surface combatants. Rapidly integrate and\ndemonstrate weapon system prototypes into existing and modular weapon systems to demonstrate increased lethality, range\nand effectiveness. This work will explore the warfighting utilization of emerging naval and industry innovations, such as\nadvanced gun systems and propelling charge designs, low cost imaging terminal seekers, enhanced lethality warheads, and\ndirected energy technologies.\n- Assess and support INPs, naval research and development emerging technologies, and industry innovations\n- Alternative weapon platform\/payload concept optimization study\n- Conduct demonstration objective review\n- Provide technical inputs to Fleet Battle experiments and wargames\n- Perform sub-system and tactical decision aid integration testing\n- Conduct range tests\n- Using experimentation, assess technical performance and operational utility.\n- Experimentation planning for multiple alternative platforms in a maritime relevant environment.\n\n3.2 Persistent Over-the-Horizon Engagement\nThis aspect of the campaign will concentrate on how to use alternative weapon concepts and the integration of innovative\npayloads. This work will explore the warfighting utilization of emerging naval research and development and industry\ninnovations, such as the various Nemesis modules the nature of which, specific applications and detailed plans are available\nat a higher classification level.\n- Conduct requirements and trade space analysis in support of CONOPS refinement.\n- Complete design and demonstration objective reviews.\n- Perform sub-system and integration testing.\n- Conduct experiments in a maritime relevant environment during Trident Warrior and RIMPAC exercises.\n- Assess technical performance and operational utility.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative\nemployment scenarios.\n- Assess INP and other emerging technologies for transition to acquisition through prototyping and experimentation"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.876"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.876"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The rapid prototyping and demonstration process is iterative and responsive to warfighting needs, capability gaps, naval priorities, and technology opportunities. The FY18 execution plan will draw upon the focus areas, projects and plans outlined below and are based on USFF prioritized warfighting needs, assessments of emerging technology, and as informed by recent analysis, wargames and other experimentation results. The project focus areas reflect the Navy's strategic shift in national security to the Asia-Pacific Theater, and also address the requirement to continue to reduce lifecycle costs across all systems. The FY 2018 rapid development cycle execution plan will select promising technologies for rapid prototype and demonstration consistent with the focus areas.\n\nThe FY 2018 execution plan will be finalized in Q4 FY 2017 and will address key focus areas outlined in the FY 2018 plans.  It is important to note that prototype initiatives will be continuously assessed to ensure Fleet needs and priorities are addressed.\n\n1. Electromagnetic Maneuver Warfare Electromagnetic Maneuver Warfare (EMW) is the Navy and Marine Corps warfighting approach to gain decisive military advantage in the electromagnetic spectrum, to enable freedom of action across all naval mission areas. Advanced components and prototypes will demonstrate multi-spectral sensors; passive detection, tracking, and targeting systems; real time spectrum awareness; robust, resilient circuits, transceivers, links; electronic protection; emissions management; spread spectrum techniques; deception and decoys; electronic attack (including directed energy); networked sensors and weapon systems; battle management aids; or cyber situational awareness, security, and operations.\n\na. Battlespace Awareness. Emerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia will be integrated to demonstrate intelligence, surveillance, reconnaissance (ISR), and targeting support. Advanced sensing capabilities (ship-, airborne-, and ground-based; multi-, hyper-spectral, and other) capable of long-range sensing and discrimination are required to understand electromagnetic emissions and ultimately produce fire control quality data. This work will explore the warfighting utilization of emerging naval innovations such as Tactical Nighttime Wide-Area Surveillance, Ultra Wide Field Of View (FOV) Area Surveillance, and others.\n- Survey naval research and development, industry and academia sources for emerging sensors and processing capabilities.\n- Conduct trade studies to support CONOPS refinement.\n- Develop prototypes and perform sub-system and integration testing.\n- Conduct experiments at naval labs and test ranges.\n- Assess technical performance and operational utility at focused events such as Rim of the Pacific Exercise (RIMPAC) 2018.\n- Develop objectives for follow-on Fleet experiments that include alternative technologies, more robust capabilities, or alternative employment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and experimentation.\n\nb. Naval Tactical Data Links and Networks. Emerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia will be integrated to demonstrate secure, reliable, collection, analysis, and fusion of ISR and targeting data from organic assets and sensors. This work will explore the warfighting utilization of emerging naval and industry innovations, to include INPs, such as multiple, simultaneous, wideband data links, for signal and imagery data transmission between organic assets and Battle Group level processing systems. Technologies with the potential to provide Unit-level access to ISR data will be submitted to the Fleet for experimentation. Projects will integrate mature technologies developed through naval investments in the areas of low probability of intercept and detection techniques, high data rate, long-range, multi-band and wide-band links, networked and software defined modes, and encryption and signal processing technologies.\n- Conduct requirements analysis in support of CONOPS refinement.\n- Complete design and demonstration objective reviews.\n- Perform sub-system and integration testing.\n- Conduct experiments in a simulated maritime relevant environment.\n- Assess technical performance and operational utility.\n- Submit to Fleet experimentation venues such as the Naval Tactical Data Network at-sea experiment.\n- Assess technical performance and operational utility.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative employment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and experimentation.\n\nc. Counter ISR and Targeting. Emerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia will be integrated to demonstrate directed energy and other prototype systems to counter enemy ISR and targeting systems, conduct electronic attack, and deploy jammers and decoys. . This work will explore the warfighting utilization of emerging naval and industry innovations, such as High Power Radio Frequency Counter-UAS, Tactical EO-IR-SIGINT Integrated for\nTargeting, as well as other prototypes. \n- Technical assessment of emerging sensors, systems, and processing capabilities.\n- Participate and provide technical inputs to planned naval tabletop workshops, mission planning events, and wargames such as those planned in support of the Naval Integrated Fires Campaign.\n- Complete design and demonstration objective reviews.\n- Perform sub-system and integration testing.\n- Conduct experiments against threat surrogates in a maritime relevant environment.\n- Assess technical performance and operational utility.\n- Develop objectives for follow-on wargames and Trident Warrior\/Rim of the Pacific (RIMPAC 2018).\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and experimentation.\n\nd. Data Fusion and Tactical Decision Aid. Emerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia will be integrated to demonstrate automated data-fusion engines and networked tactical decision aids which leverage networked sensors, radars, combat systems, and weapons to overcome single-platform limitations. This work will explore the warfighting utilization of emerging naval and industry innovations, to include INPs, autonomous data fusion and processing modules, as well as other prototypes.\n- Conduct requirements analysis in support of CONOPS refinement.\n- Complete demonstration objective reviews.\n- Software development and integration testing.\n- Conduct experiments in a simulated maritime relevant environment.\n- Assess technical performance and operational utility.\n- Human System Interface (HSI) assessments.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative employment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and experimentation.\n\n2. Undersea Dominance. Undersea Dominance is focused on developing advanced components and prototypes to compliment the submarine force with affordable fixed and mobile arrays, distributed netted sensors, autonomous systems, and advanced payloads. \n\nTechnologies with the potential to close anti-submarine warfare and mine warfare warfighting gaps will be submitted to the undersea dominance operating concept and mine warfare at-sea experiments.\n\na. Advanced Payloads and Sensors. Emerging technology and engineering innovations from Naval\/DoD research and development, industry, and academia will be integrated to demonstrate advanced payloads and sensors to support anti-submarine and mine warfare missions. This work will explore the warfighting utilization of emerging naval and industry innovations such as Remote Aerial Sonar and Communications Acoustic Laser System, Acoustic Communications modules that enable collaborative mission execution between distributed systems such as the heavy weight torpedo, Compact Rapid Attack Weapon, and Compact Modular Sensor and processing Suite as well as other projects. \n- Update requirements and CONOPS based on emerging technology and experimentation results\n- Conduct delta-design and delta-demonstration objective reviews\n- Perform acoustic sub-system and integration testing with airborne platform\n- Conduct experiments at Naval test ranges\n- Assess technical performance and operational utility\n- Submit to undersea dominance operating concept at-sea Fleet experiment\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and experimentation.\n\nb.  Advanced Undersea Weapons. Advanced Undersea Weapons initiatives provide limited area denial capability to support Fleet operations. This work will explore the warfighting utilization of emerging naval and industry innovations such as the Multi-Compact Very Light Weight Torpedo Launcher, High Speed Electric Propulsion for the Anti-Torpedo Torpedo as well as other projects.\n- Provide technical input to workshops and wargames such as the Undersea Innovation Seminar War Game.\n- Conduct delta-design and delta-demonstration objective reviews.\n- Sub-system and integration testing into such programs as the ultra-lightweight torpedo.\n- Conduct experiments at Naval test ranges.\n- Assess technical performance and operational utility.\n- Submit experiments to mine warfare at-sea Fleet experiments such as the Undersea Domain Operation Concept at-sea experiment.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative employment scenarios.\n- Assess and support INP and other emerging technologies for transition to acquisition through prototyping and experimentation.\n\n3. Surface Dominance. Surface Dominance is focused on a fleet initiative to give the operational commander options to employ naval combat power in any anti-access\/area-denial (A2\/AD) environment. The emergence of sophisticated sea-denial strategies has driven a need to shift to an offensive imperative to control the seas. Increasing surface-force distributed lethality in offensive weapons and associated concept of operations need more strike options for joint-force commanders and add battlespace complexity to an adversary's calculus. The prototypes and associated experiments will explore new concepts in Naval force employment and enforce the core competencies of sea control when applied with bold new offensive methods.\n\nPrototypes in this area will explore:\n1. Identification of advanced research in the sensors and weapons that can be used to project power and counter rapidly evolving missile, air, submarine, and surface threats that challenge our ability to establish dominance at the times and places of our choosing.\n2. Development and exploration of new sensors and planning tools that will address a more complex targeting problem while creating more favorable conditions to project power where required.\n3. Experimentation with technologies and methods to more fully integrate the Navy and Marine Corps combat team to provide persistent presence that can influence and control events at sea and in the littorals.\n4. Provide feedback to the planning and production of weapons, sensor, tactical tools and employment methods to address a more broadly deployed lethality.\n\na. Weapon Systems and Integration. This project will explore innovative and emerging electronics and control systems, sensors, payloads, and weapons technologies that have the capability of upgrading the offensive capability of surface combatants. Rapidly integrate and demonstrate weapon system prototypes into existing and modular weapon systems to demonstrate increased lethality, range and effectiveness. This work will explore the warfighting utilization of emerging naval and industry innovations, such as advanced gun systems and propelling charge designs, low cost imaging terminal seekers, enhanced lethality warheads, and directed energy technologies.\n- Assess and support INPs, naval research and development emerging technologies, and industry innovations\n- Alternative weapon platform\/payload concept optimization study\n- Conduct demonstration objective review\n- Provide technical inputs to Fleet Battle experiments and wargames\n- Perform sub-system and tactical decision aid integration testing\n\n- Conduct range tests\n- Using experimentation, assess technical performance and operational utility.\n- Experimentation planning for multiple alternative platforms in a maritime relevant environment.\n\nb. Persistent Over-the-Horizon Engagement. This aspect of the campaign will concentrate on how to use alternative weapon concepts and the integration of innovative payloads. This work will explore the warfighting utilization of emerging naval research and development and industry innovations, of which specific applications and detailed plans are available at a higher classification level.\n- Conduct requirements and trade space analysis in support of CONOPS refinement.\n- Complete design and demonstration objective reviews.\n- Perform sub-system and integration testing.\n- Conduct experiments in a maritime relevant environment during Trident Warrior and RIMPAC exercises.\n- Assess technical performance and operational utility.\n- Develop objectives for follow-on experiments that include alternative technologies, more robust capabilities, or alternative employment scenarios.\n- Assess INP and other emerging technologies for transition to acquisition through prototyping and experimentation"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects identified for execution under this project number are non-acquisition programs.  Each project will develop a project plan to support project execution.  Project plans will include a project schedule and technical requirements and objectives to measure project performance.  The selected technical solutions will be demonstrated in operationally relevant environments to assess their ability to meet warfighter requirements.  Project deliverables include actual integrated hardware\/software prototype systems, CONOPS, requirements, test reports, technical data, and associated doctrine, organization, training, leadership and education, and personnel aspects necessary to support decision making. These decisions include the transition of technologies to acquisition, further refinement of the technology, or termination and reinvestment of remaining funds to other technologies that add military value"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each of the projects funded. All will include measures identified in the Statement of Objectives (SOO), including completions, successes, terminations, and iterative prototype cycle times reported against schedules and deliverables stated in the requirement documents."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Support and Test and Evaluation costs are directly associated with the delivery of the primary product and included in the product development cost category for rapid prototype development, experimentation and demonstration cost categories."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NUWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.679"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.739"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.261"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.261"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.668"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.668"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.009"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.009"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "25.876"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "25.876"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "25.876"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 0385"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0399"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned Rapid Prototype Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "15.027"
                        },
                        "BudgetYearOne": {
                            "val": "15.361"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.361"
                        },
                        "BudgetYearTwo": {
                            "val": "15.347"
                        },
                        "BudgetYearThree": {
                            "val": "15.357"
                        },
                        "BudgetYearFour": {
                            "val": "15.380"
                        },
                        "BudgetYearFive": {
                            "val": "15.691"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This project was new in FY2017."
                        },
                        "ProjectMissionDescription": {
                            "val": "Department of Navy (DON) leadership has acknowledged that maintaining maritime superiority depends in part on our ability to accelerate the speed of warfighting and technological innovations in order to extend our advantage to offset our adversary's growing capabilities. The Unmanned Systems (UxS) Rapid Prototype Development project supports the goals and objectives of the Chief of Naval Operations (CNO) Navigation Plan and Design for Maintaining Maritime Superiority, Commandant of the Marine Corps (CMC) Planning Guidance, and the Cooperative Strategy for 21st Century Seapower, and is fundamental to the DON's efforts to improve our acquisition outcomes. This project is aligned with, and in direct response to, calls for increased prototyping and experimentation in USD(AT&L)'s Better Buying Power 3.0, Secretary of the Navy's (SECNAV) Task Force Innovation direction, and the CNO direction to Achieve High Velocity Learning at Every Level. These efforts will reinvigorate and increase the use of unmanned prototyping to rapidly field new warfighting capabilities, concepts and technologies, and engineering solutions..\n\nThe Unmanned Rapid Prototype Development project funds a strategic focus on prioritization of UxS rapid prototyping of innovative combat system technologies and engineering innovations to explore Fleet-proposed capability concepts and needs, as well as foster advancements in naval warfighting capabilities. With an emphasis on rapidly prototyping mature technologies, the project is intended to expedite the development, exploration and fielding of prototypes to provide advanced warfighting capabilities, new technologies and engineering innovations across all Naval warfighting domains. Prototype development efforts will be used to inform\/refine Concepts of Operation (CONOPS) and operational requirements; evaluate the operational utility and technical feasibility of technology\/engineering innovations; support limited fielding of prototypes; and mitigate cost, schedule and performance risks associated with follow-on acquisition programs.\n\nIn support of the Fleet Forces Command, Naval Warfighting Development Centers, Naval Warfare Development Command, and the Marine Corps Combat Development and Integration Command, this project will leverage the scientific and engineering expertise and technical infrastructure within the NR&DE to produce UxS sensors, weapon systems, and command, control, and communications prototypes to address naval warfighting needs and pursue future naval warfighting concepts. \nAdditionally, new and emerging UxS technologies and engineering innovations that offer the potential to reduce cost, increase readiness, or improve the overall efficiency or effectiveness of naval forces will be explored. A key distinction is that the process and battle rhythm is designed for optimal responsiveness to Fleet needs. \n\nSpecific projects under this project number will be selected and executed in accordance with the Department of the Navy (DoN) Accelerated Acquisition Process as described in SECNAVINST 5000.42.  The Secretary of the Navy will notify Congress prior to initiation of a project under this project number in accordance with the requirements established in Section 216 of the FY 2017 National Defense Authorization Act."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned Rapid Prototype Development, Experimentation and Demonstration"
                                    },
                                    "Description": {
                                        "val": "The project implements a pioneering strategic approach to the development and introduction of innovative unmanned system (UxS) technologies to the fleet. \n\nThe iterative rapid development cycle consists of:\n- the identification and prioritization of warfighting needs for unmanned warfare systems\n- the survey of existing the most promising technologies to satisfy the warfighting needs and to close capability gaps\n- the rapid prototyping and demonstration of mature technologies to address the highest priority warfighting needs to verify capability and military utility prior to transition to acquisition\n\nPrototyping and demonstration efforts exercise mature UxS technologies in operationally relevant environments to assess their operational utility and their ability to meet warfighter needs.   Deliverables include actual integrated hardware\/software prototype systems, CONOPS, requirements, test reports, technical data, and associated doctrine, organization, training, leadership and education, and personnel aspects necessary to support decision making. These decisions include the transition of technologies to acquisition, further refinement of the technology, or termination and reinvestment of remaining funds to other technologies that add military value. In addition, these efforts will enable the NR&DE to assess technical maturity of  Innovative Naval Prototypes (INP) and other emerging technologies for efficient transition to acquisition through prototyping and demonstration. The project technology initiatives will deliver game-changing capability to meet warfighting needs and close capability gaps with unmanned systems on the ground, in the air, on the sea, and under the sea."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.027"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Unmanned Systems Rapid Prototype, Development, Experimentation and Demonstration process is iterative,\nnimble, and responsive to warfighting needs, capability gaps, naval priorities, and technology opportunities. The project focus areas are in alignment with DoD and Navy Unmanned System Roadmaps, reflect the Navy's strategic shift in\nnational security to the Asia-Pacific Theater, and also address the requirement to continue to reduce lifecycle costs across all systems, including unmanned systems. The FY 2017 rapid development cycle execution plan will select promising\ntechnologies for rapid prototype and demonstration consistent with the focus areas.\n\n1. Advanced UxS Air, Surface, Undersea, and Ground System Payloads and Platforms\nThis focus is on the development and integration of emerging UxS platforms and\/or system payloads from across naval\nresearch and development, industry, and academia to inform requirements\/trade space analysis, CONOPS development,\nand to evaluate the warfighting utility and multi-mission employment options of advanced prototypes. UxS prototypes\nwill be evaluated through a series of iterative prototypes and demonstrations. Those UxS prototypes which demonstrate\nthe potential to satisfy warfighting capability needs or gaps or expand UxS employment options will be incorporated into\nplanned UxS rapid prototyping and demonstration events in FY17. Project will integrate mature technologies developed\nthrough Naval S&T investments, such as autonomous and supervisory control systems, dynamic contingency re-planning,\nadvanced power\/energy systems, artificial intelligence, advanced GPS and radar technology, Fast data fusion algorithms,\nand modular weapons as developed for the Autonomous Aerial Cargo Utility System (AACUS), the Common UAS Launch\nand Recovery Project, the Medium Displacement Unmanned Surface Vehicle (MDUSV), Cargo Unmanned Ground Vehicle\n(UGV), Low-cost UAV swarming Technology (LOCUST), USV swarm prototypes, and other S&T prototypes. More\nspecifically, the emerging technologies that contribute to the following needed Joint Capability Areas (JCAs) will receive\npriority:\na. Battlespace Awareness. UxS payloads and\/or platforms in all domains (air, sea, undersea, and ground) that significantly\nadvance the ability to conduct Intelligence, Surveillance, and Reconnaissance (ISR) and environment collection related\ntasks.\nb. Force Application. In the air domain, technologies for Unmanned Aircraft Systems (UAS) for air-to-air combat,\nelectronic warfare, and suppression and defeat of enemy air defense. In the maritime domain, both Unmanned Undersea\nVehicle (UUV) and Unmanned Surface Vehicle (USV) technologies for mine laying and mine neutralization.\nc. Protection. Advanced technologies to assist in attack prevention or effects mitigation, including explosive ordnance\ndisposal (EOD).\nd. Logistics. Cargo payload or platform systems with persistence to provide resupply of sea-based assets in high risk Anti-\nAccess\/Area Denial (A2\/AD) environments.\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution trade space analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-mission utility and employment options.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable payload and platform systems and capabilities.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) maritime environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/Tactics, Techniques, and Procedures (TTP)\ndevelopment.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/Fleet exercises, as required, to address alternative\ntechnologies, addition of more robust capabilities, or alternative employment methods to include multiple-UxS scenarios.\n- Update requirements and CONOPS\/TTPs based on experiment\/Fleet exercise results.\n- Provide technical data to inform Fleet models, simulations and wargames.\n\n2. Autonomy and Cognitive Behavior\nApply emerging technology and engineering innovations in all domains to provide control of basic vehicle operations and\nbehavior for communications, systems effectiveness, and reduced manpower. Technologies for manpower reduction during\nmission performance, data collection and analysis, and planning and re-planning are high priorities. Additional emerging\ntechnology includes increased system, sensor, and analytical automation to develop, record, playback, project, and parse\ndata and deliver \"actionable\" intelligence.\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Conduct Human-System Interface (HSI) assessment.\n- Evaluate potential for multi-mission utility and employment.\n- Develop initial design, technical performance and demonstration objectives.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance, operational utility, and extent of manpower interaction\nwith the UxS.\n- Assess need for design change and new objectives for follow-on experiments\/Fleet exercises that may address alternative\ntechnologies, additional capabilities, or use methods.\n- Update CONOPS\/CONEMPS based on experiment\/Fleet exercise results.\n- Provide technical data to inform Fleet models, simulations and wargames.\n\n3. Common Command and Control System\nLeverage emerging technologies and engineering innovations which support the warfighting utility and multi-mission\ncapability of unmanned systems across vehicle classes, variants, and domains for integration in common Naval architecture\nand frameworks for the common command and control of vehicles. The project integrates mature technologies developed\nthrough naval research and development investments to enable UxS long-range and autonomous operation, such as\ndeveloped for the Large Diameter UUV, Autonomous Aerial Cargo Utility System and Anti-Submarine Continuous Trail\nUnmanned Vessel (ACTUV). Additional technologies and capabilities to be developed include doctrine, systems and\nprocedures to dynamically task and manage remote UxS and associated sensors, and Navy UxS interoperability with United\nStates Air Force (USAF) and DoD\/OGA where operationally or fiscally beneficial.\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment methods.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable and common command and control system technologies\/capabilities, including mission planning\nand mission control software.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/Fleet exercises.\n- Update requirements and CONOPS\/CONEMPS based on experiment\/Fleet exercise results.\n- Provide technical data to inform Fleet models, simulations and wargames.\n\n4. Common Data Exfiltration and Transport\nIntegrate emerging technologies and engineering innovations for transporting collected data from each UxS into existing\nC4I networks, including technologies for UxS platforms to adaptively connect to a network; a compatible means to rapidly\noffload collected sensor data for immediate exploitation and analysis; the tagging and universal discovery of all UxS\ncollected data and information; and the mitigation of potential network vulnerabilities associated with UxS data transport.\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable, common, data exfiltration and transport hardware\/software technologies.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/TTP development.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/Fleet exercises, if required, that may address\nalternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/TTPs based on experiment\/Fleet exercise results.\n- Provide technical data to inform Fleet models, simulations and wargames.\n\n5. Communication Systems, Spectrum, and Resilience\nDevelopment and integration of emerging technologies to increase the availability of UxS communication links, the amount\nof data the communication links support, certification of the communication spectrum, and the resilience of all radio\nfrequency (RF) subsystems against interference (e.g., electromagnetic). Advanced technologies include multi-focused,\nsuper cooled antennas, conformal phased array antennas, cloud-enabled enterprise data centers, advanced error control, network path diversity, optical communications, and commercial gateway points-of-presence with digital inter-facility\ntransport.\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable, certifiable communication systems and resilience technology.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/TTP development.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/Fleet exercises, if required, that may address\nalternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/TTPs based on experiment\/Fleet exercise results.\n- Provide technical data to inform Fleet models, simulations and wargames.\n\n6. Interoperability and Modularity\nDevelopment and integration, in cooperation with joint, interagency, intergovernmental, and multinational (JIIM) partners,\nof standard information exchange requirements (IERs) that address joint and Service needs, interoperability profiles (IOPs),\nmiddleware, and other technologies needed to achieve the necessary level of interoperability across manned and unmanned\nsystems. Emerging capabilities include software reprogrammable interfaces, universal payload adapters, federated mission\ncomputing, and multiple input\/multiple output systems and subsystems.\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment, as well as life-cycle, integration, capability\nupgrade, maintenance and sustainment cost savings.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable, modular services and software modules.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/Fleet exercises, if required, that may address\nalternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/CONEMPS based on experiment\/Fleet exercise results. Provide technical data to\ninform Fleet models, simulations and wargames.\n\n7. Persistent Resilience\nLeverage emerging technologies and engineering innovation design schema to provide more effective on-station time for\nunmanned vehicles in all domains. This includes development and integration of the miniaturization of avionics, power and\npropulsion technology; reliability, maintainability, and survivability technology improvement; optimized material properties\nto allow unmanned systems to endure in extreme environments ranging from sandy and hot climates to humid or freezing\nclimates and from high altitudes to fathoms beneath the oceans; and fuel-efficient propulsion and power output technology.\nAdvanced capabilities include reduced size, weight, power, and cooling consumption technologies, low cost\/high reliability\nmaterials\/components, miniaturized warning\/self-protection systems, durable materials, and efficient electrical power\ngeneration, thermal management propulsion systems. The project integrates mature technologies developed through\nNaval S&T investments, such as alternative fuels, power and propulsion, and energy systems (including battery, fuel cell,\nrenewable sources) developed for the Large Diameter UUV (LDUUV), Anti-Submarine Continuous Trail Unmanned\nVessel (ACTUV), and other power\/energy initiatives.\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for mission endurance and\/or multi-platform, multi-mission utility.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype emerging technologies.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include\nsimulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/Fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/Fleet exercises, if required, that may address\nalternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/CONEMPs based on experiment\/Fleet exercise results.\n- Provide technical data to inform Fleet models, simulations and wargames.\n\n8. Research and Intelligence\/Technology Protection (RITP)\nDevelopment and integration of emerging UxS technologies to prevent unauthorized access\/control, unauthorized\/\nunintentional disclosure of data, and preservation of technological superiority from across naval research and development,\nindustry, and academia.\nSpecific project efforts in this comprehensive focus area include:\n- Evaluate project technologies in terms of RITP preservation of critical mission advantage over adversaries.\n- Implement and assess information controls in project development and execution to ensure RITP is maintained.\n- Incorporate RITP and cyber security protection in project requirements, and investigate additional capabilities and\nCONOPs\/CONEMPS serving to counter or mitigate adversary responses.\n- Prototype technologies with potential to advance RITP postures.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Update project requirements and CONOPS\/CONEMPs based on technology developments and experiment\/Fleet exercise\nresults."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.361"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.361"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The rapid prototyping and demonstration process is iterative and responsive to warfighting needs, capability gaps, naval priorities, and technology opportunities. FY 2017 projects will be continued and completed if not terminated. In addition, the FY18 execution plan will draw upon the focus areas, projects and plans outlined below and are based on USFF prioritized warfighting needs, assessments of emerging technology, and as informed by recent analysis, wargames and other experimentation results. The project focus areas are in alignment with DOD and Navy Unmanned System Roadmaps, reflect the Navy's strategic shift in national security to the Asia-Pacific Theater, and also address the requirement to continue to reduce lifecycle costs across all systems, including unmanned systems. The FY 2018 rapid development cycle execution plan will select promising technologies for rapid prototype and demonstration consistent with the focus areas.\n\n1. Advanced UxS Air, Surface, Undersea, and Ground System Payloads and Platforms \nThis focus is on the development and integration of emerging UxS platforms and\/or system payloads from across naval research and development, industry, and academia to inform requirements\/trade space analysis, CONOPS development, and to evaluate the warfighting utility and multi-mission employment options of advanced prototypes. UxS prototypes will be evaluated through a series of iterative prototypes and demonstrations. Those UxS prototypes which demonstrate the potential to satisfy warfighting capability needs or gaps or expand UxS employment options have been incorporated into planned UxS rapid prototyping and demonstration events in FY18. Where applicable projects will integrate mature technologies developed through Naval S&T investments, such as explosive and non-lethal technologies. More specifically, the emerging technologies that contribute to the following needed Joint Capability Areas (JCAs) will receive priority:\n\n\na. Battlespace Awareness. UxS payloads and\/or platforms in all domains (air, sea, undersea, and ground) that significantly advance the ability to conduct Intelligence, Surveillance, and Reconnaissance (ISR) and environment collection related tasks.\n\nb. Force Application. In the air domain, technologies for Unmanned Aircraft Systems (UAS) for air-to-air combat, electronic warfare, and suppression and defeat of enemy air defense. In the maritime domain, both Unmanned Undersea Vehicle (UUV) and Unmanned Surface Vehicle (USV) technologies for mine laying and mine neutralization.\n\nc. Protection. Advanced technologies to assist in attack prevention or effects mitigation, including explosive ordnance disposal (EOD).\n\nd. Logistics. Cargo payload or platform systems with persistence to provide resupply of sea-based assets in high risk Anti-Access\/Area Denial (A2\/AD) environments.\n\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution trade space analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-mission utility and employment options.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable payload and platform systems and capabilities.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) maritime environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/Tactics, Techniques, and Procedures (TTP) development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/fleet exercises, as required, to address alternative technologies, addition of more robust capabilities, or alternative employment methods to include multiple-UxS scenarios.\n- Update requirements and CONOPS\/TTPs based on experiment\/fleet exercise results.\n- Provide technical data to inform fleet models, simulations and wargames.\n\n2. Autonomy and Cognitive Behavior\nApply emerging technology and engineering innovations in all domains to provide control of basic vehicle operations and behavior for communications, systems effectiveness, and reduced manpower. Technologies for manpower reduction during mission performance, data collection and analysis, and planning and re-planning are high priorities. Additional emerging technology includes increased system, sensor, and analytical automation to develop, record, playback, project, and parse data and deliver \"actionable\" intelligence. \n\n\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Conduct Human-System Interface (HSI) assessment.\n- Evaluate potential for multi-mission utility and employment.\n- Develop initial design, technical performance and demonstration objectives.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance, operational utility, and extent of manpower interaction with the UxS.\n- Assess need for design change and new objectives for follow-on experiments\/fleet exercises that may address alternative technologies, additional capabilities, or use methods.\n- Update CONOPS\/CONEMPS based on experiment\/fleet exercise results.\n- Provide technical data to inform fleet models, simulations and wargames.\n\n3. Common Command and Control System\nLeverage emerging technologies and engineering innovations which support the warfighting utility and multi-mission capability of unmanned systems across vehicle classes, variants, and domains for integration in common Naval architecture and frameworks for the common command and control of vehicles. The project integrates mature technologies developed through naval research and development investments to enable command and control of UxS long-range autonomous operations. Additional technologies and capabilities to be developed include doctrine, systems and procedures to dynamically task and manage remote UxS and associated sensors, and Navy UxS interoperability with United States Air Force (USAF) and DOD\/Other Government Agency (OGA) where operationally or fiscally beneficial. \n\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment methods.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable and common command and control system technologies\/capabilities, including mission planning and mission control software.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/fleet exercises.\n- Update requirements and CONOPS\/CONEMP based on experiment\/fleet exercise results.\n- Provide technical data to inform fleet models, simulations and wargames.\n\n4. Common Data Exfiltration and Transport\nIntegrate emerging technologies and engineering innovations for transporting collected data from each UxS into existing C4I networks, including technologies for UxS platforms to adaptively connect to a network; a compatible means to rapidly offload collected sensor data for immediate exploitation and analysis; the tagging and universal discovery of all UxS collected data and information; and the mitigation of potential network vulnerabilities associated with UxS data transport. \n\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable, common, data exfiltration and transport hardware\/software technologies.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/TTP development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/fleet exercises, if required, that may address alternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/TTPs based on experiment\/fleet exercise results.\n- Provide technical data to inform fleet models, simulations and wargames.\n\n\n5. Communication Systems, Spectrum, and Resilience\nDevelopment and integration of emerging technologies to increase the availability of UxS communication links, the amount of data the communication links support, certification of the communication spectrum, and the resilience of all radio frequency (RF) subsystems against interference (e.g., electromagnetic). Advanced technologies include multi-focused, super cooled antennas, conformal phased array antennas, cloud-enabled enterprise data centers, advanced error control, network path diversity, optical communications, and commercial gateway points-of-presence with digital inter-facility transport. Specific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable, certifiable communication systems and resilience technology.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/TTP development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/fleet exercises, if required, that may address alternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/TTPs based on experiment\/fleet exercise results.\n- Provide technical data to inform fleet models, simulations and wargames.\n\n6. Interoperability and Modularity\nDevelopment and integration, in cooperation with joint, interagency, intergovernmental, and multinational (JIIM) partners, of standard information exchange requirements (IERs) that address joint and Service needs, interoperability profiles (IOPs), middleware, and other technologies needed to achieve the necessary level of interoperability across manned and unmanned systems. Emerging capabilities include software reprogrammable interfaces, universal payload adapters, federated mission computing, and multiple input\/multiple output systems and subsystems.\n\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate potential for multi-platform, multi-mission utility and employment, as well as life-cycle, integration, capability upgrade, maintenance and sustainment cost savings.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype interoperable, modular services and software modules.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/fleet exercises, if required, that may address alternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/CONEMPS based on experiment\/fleet exercise results. \n- Provide technical data to inform fleet models, simulations and wargames.\n\n7. Persistent Resilience\nLeverage emerging technologies and engineering innovation design schema to provide more effective on-station time for unmanned vehicles in all domains. This includes development and integration of the miniaturization of avionics, power and propulsion technology; reliability, maintainability, and survivability technology improvement; optimized material properties to allow unmanned systems to endure in extreme environments ranging from sandy and hot climates to humid or freezing climates and from high altitudes to fathoms beneath the oceans; and fuel-efficient propulsion and power output technology. Advanced capabilities include reduced size, weight, power, and cooling consumption technologies, low cost\/high reliability materials\/components, miniaturized warning\/self-protection systems, durable materials, and efficient electrical power generation, thermal management propulsion systems. \n\nSpecific project efforts in this comprehensive focus area include:\n- Conduct warfighter requirement, capability gap, and technical solution tradespace analysis.\n- Evaluate technology assessments and review requirements analysis.\n- Evaluate potential for mission endurance and\/or multi-platform, multi-mission utility.\n- Develop initial design, technical performance and demonstration objectives.\n- Prototype emerging technologies.\n- Complete prototype system\/sub-system development, integration and testing for demonstration in relevant (to include simulated) environments.\n- Perform final design, technical performance, and demonstration objective reviews.\n- Provide technical and demonstration objectives in support of CONOPS\/CONEMP development.\n- Refine and deliver demonstration plans in support of experiment\/fleet exercise events.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Develop design change and new objectives for follow-on experiments\/fleet exercises, if required, that may address alternative technologies, addition of more robust capabilities, or alternative employment methods.\n- Update requirements and CONOPS\/CONEMPs based on experiment\/fleet exercise results.\n- Provide technical data to inform fleet models, simulations and wargames.\n\n8. Research and Intelligence\/Technology Protection (RITP)\nDevelopment and integration of emerging UxS technologies to prevent unauthorized access\/control, unauthorized\/unintentional disclosure of data, and preservation of technological superiority from across naval research and development, industry, and academia. \n\nSpecific project efforts in this comprehensive focus area include:\n- Evaluate project technologies in terms of RITP preservation of critical mission advantage over adversaries.\n- Implement and assess information controls in project development and execution to ensure RITP is maintained.\n- Incorporate RITP and cyber security protection in project requirements, and investigate additional capabilities and CONOPs\/CONEMPS serving to counter or mitigate adversary responses.\n- Prototype technologies with potential to advance RITP postures.\n- Execute demonstration plans and assess technical performance and operational utility.\n- Update project requirements and CONOPS\/CONEMPs based on technology developments and experiment\/fleet exercise results."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects identified for execution under this project number are non-acquisition programs.  Each project will develop a project plan to support project execution.  Project plans will include a project schedule and technical requirements and objectives to measure project performance.  The selected technical solutions will be demonstrated in operationally relevant environments to assess their ability to meet warfighter requirements.  Project deliverables include actual integrated hardware\/software prototype systems, CONOPS, requirements, test reports, technical data, and associated doctrine, organization, training, leadership and education, and personnel aspects necessary to support decision making. These decisions include the transition of technologies to acquisition, further refinement of the technology, or termination and reinvestment of remaining funds to other technologies that add military value."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each of the projects funded. All will include measures identified in the Statement of Objectives (SOO), including completions, successes, terminations, and iterative prototype cycle times reported against schedules and deliverables stated in the requirement documents."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Support and Test and Evaluation costs are directly associated with the delivery of the primary product and included in the product development cost category for rapid prototype development, experimentation and demonstration cost categories."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Support and Test and Evaluation costs are directly associated with the delivery of the primary product and included in the product development cost category for rapid prototype development, experimentation and demonstration cost categories."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.103"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NUWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.320"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SPAWAR"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSWC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dahlgren, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.604"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.361"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.361"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.361"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 0399"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3422"
                    },
                    "ProjectTitle": {
                        "val": "SHARC Surface Platform"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "6.775"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.775"
                        },
                        "BudgetYearTwo": {
                            "val": "7.025"
                        },
                        "BudgetYearThree": {
                            "val": "0.500"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 3422 - Sensor Hosting Autonomous Remote Craft (SHARC)"
                        },
                        "ProjectMissionDescription": {
                            "val": "The SHARC demonstration project is part of the Department of Defense Third Offset Strategy as one element in the Sensor Grid category for 24\/7 autonomy infused Situational Awareness (SA). This project will purchase Commercial-off-the-Shelf SHARC Platforms (wave gliders) and integrate four (4) unique Government-owned classified mission payloads focused on the detection of threats. These capabilities will enable CONOPS development in an operationally relevant environment to demonstrate how these technologies can improve the SA to the battlespace Commanders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sensor Hosting  Autonomous Remote Craft (SHARC)"
                                    },
                                    "Description": {
                                        "val": "This is a new project beginning in FY 2018 - This project will demonstrate the warfighting utility of multiple, simultaneous, wideband data links for signal and imagery data transmission between host assets and Operational level processing systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Emerging technologies and engineering innovations from Naval\/DoD research and development and industry will be integrated to demonstrate secure and reliable collection, analysis, and fusion of ISR and targeting data from organic assets and sensors. This project will demonstrate the warfighting utility of multiple, simultaneous, wideband data links for signal and imagery data transmission between host assets and Operational level processing systems. Additionally, technologies providing Tactical level access to host asset ISR data will be demonstrated.  This project will integrate mature technologies developed in the areas of low probability of intercept and detection (LPI\/LPD) techniques, high data rate exchange, long-range multi-band and wideband links, networked nodes and software-defined modes, encryption, and signal processing modules. Additional details are available at higher classification levels."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non-acquisition program.  Maritime Surveillance Systems (MSS) Program Office (PEO SUB PMS 485) will procure commercial wave gliders from Boeing Liquid Robotics Division for SHARCS (FFP Contract) and TBD Contractors for sensor systems X,Y,Z (CPFF). SPAWAR SSC Pacific will refurbish two type V sensor systems for the engineering and technical integration, testing, and demonstration support.  Sensors V, X, Y and Z are all classified payloads."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each of the projects funded. All will include measures identified in the Statement of Objectives (SOO), including completions, successes, terminations, and iterative prototype cycle times reported against schedules and deliverables stated in the requirement documents."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3423"
                    },
                    "ProjectTitle": {
                        "val": "LOCUST"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.500"
                        },
                        "BudgetYearTwo": {
                            "val": "3.500"
                        },
                        "BudgetYearThree": {
                            "val": "3.000"
                        },
                        "BudgetYearFour": {
                            "val": "6.000"
                        },
                        "BudgetYearFive": {
                            "val": "8.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 3423 - Low Cost Unmanned Air Systems (UAS) Swarming Technology (LOCUST)"
                        },
                        "ProjectMissionDescription": {
                            "val": "The LOCUST demonstration is part of the Department of Defense Third Offset Strategy as one element in the Effector Grid category for small autonomous systems. LOCUST leverages the S&T Budget Activity (BA)-3 Innovative Naval Prototype program developing and demonstrating swarming technology. The BA-3 effort is developing both the air vehicle, UAS swarming behaviors, and miniaturized sensor systems. ONR has demonstrated an autonomous system capable of launching 33 UASs in 40 seconds and flying them in a coordinated swarm. This BA-4 effort is trailing the BA-3 demonstration of technologies by a fiscal quarter and then demonstrating the technology in operationally relevant environments with military mission applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "LOCUST"
                                    },
                                    "Description": {
                                        "val": "This is a new project in FY 2018 - Demonstrate mixed-initiative UAV swarming behaviors, enable the development of payload appropriate CONOPS\/TTPs for Many Vehicle\/Many Salvo swarms, and provide unmanned system capability to degrade threat Integrated Air Defense Systems (IADS) in support of follow-on manned system operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate a scalable system of inexpensive, commoditized Unmanned Aerial Vehicles (UAVs) with swarming behaviors providing two distinct mission capabilities. Phase 1 will develop and demonstrate both air- and ground-launched counter-Improvised Explosive Device (IED) and communications jamming capabilities to support a Marine Corps unit. Phase 2 will develop and demonstrate an unmanned undersea vehicle (UUV)-launched Swarm for counter-Integrated Air Defense Systems (IADS) in support of naval units. This project will demonstrate mixed-initiative UAV swarming behaviors developed by the BA-3 activity, enable the development of payload appropriate CONOPS\/TTPs for Many Vehicle\/Many Salvo swarms, and provide unmanned system capability to degrade threat IADS in support of follow-on manned system operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "There are two phases for this non-acquisition program.\n\nPhase 1 - Marine Corps Warfighting Laboratory (MCWL) Air Combat Element (ACE) will lead the Phase I effort in FY18 & 19. MCWL will procure additional launchers, LOCUST platforms and payloads. MCWL will work with the Common Launch Tube Program of Record to procure the multiple missile Common Launch Tube. MCWL will task NAWC AD to help integrate the launcher system onto the MV-22 and support flight test and flight certification. MCWL will use a supporting Warfare Center to integrate the launcher onto a Marine Corps Program of Record M-RZR or M-RZR trailer. MCWL ACE will closely coordinate with the BA-3 LOCUST program manager to procure the new 6\" diameter, additive manufactured, air frame (purchase through BA-3 activity contract). MCWL Experimental Division will define CONOPS\/TTPs, the experimental parameters and measures of effectiveness, and operational experiments suitable to apply the capability in a relevant operational environment to evaluate the military utility of the system to a small Marine Corps maneuver element. The Center for Naval Analysis will consolidate the post demonstration report for the systems military utility.\n\nPhase II - ONR will lead a Counter Integrated Air Defense System (IADS) in FY20-22 to demonstrate the advantages of small swarming UAVs against IADS defenses. ONR will work with the Naval Warfare Development Center (NWDC) to develop CONOPS \/ TTPS for this mission capability and fleet experimentation. NSWC Panama City Division (NSWC PCD) will provide operational and logistics support for the launch and recovery of the vehicles. This phase is delayed for two fiscal years to allow the INP to develop the miniaturized payloads required for an operational demo. This effort will mature the payloads for operational employment."
                        },
                        "PerformanceMetrics": {
                            "val": "MCWL Experimental Division will define CONOPS\/TTPs, the experimental parameters and measures of effectiveness, and operational experiments suitable to apply the capability in a relevant operational environment to evaluate the military utility of the system to a small Marine Corps maneuver element."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3424"
                    },
                    "ProjectTitle": {
                        "val": "Heterogeneous Collaborative Unmanned Systems (HCUS)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "8.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.000"
                        },
                        "BudgetYearThree": {
                            "val": "4.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project 3424 - Heterogeneous Collaborative Unmanned Systems (HCUS)"
                        },
                        "ProjectMissionDescription": {
                            "val": "The HCUS demonstration is part of the Department of Defense Third Offset Strategy as one element in the Effector Grid category for small autonomous systems. HCUS provides autonomous, tactical monitoring of an adversary's port-sized littoral area for an extended period of time with capability to apply limited offensive effects on-demand.  Vehicles and sensors are intended to be used in contested environments - employing local communications nets, autonomous vehicle behavior, low bandwidth command links and local navigation with no requirement for GPS input. \n\nHCUS systems can be encapsulated and deployed as a single payload, or a small number of payload packages designed for specific missions. The payloads can be carried into theater by various manned or unmanned platforms depending on the degree of stealth required. A week-long project demonstration will simulate covert deployment, operations of autonomous UAVs over the area of interest, data exfiltration to a remote operator, autonomous UAV recharging via USVs and\/or UUVs, deployment of unmanned ground sensors for persistent sensing, and remote operator on-demand offensive attack on a simulated target."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Heterogeneous Collaborative Unmanned Systems (HCUS)"
                                    },
                                    "Description": {
                                        "val": "This is a new project in FY 2018 - Develop integrated, adaptable systems of low cost, heterogeneous unmanned platforms capable of autonomous, collaborative behaviors to execute an operational naval mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop integrated, adaptable systems of low cost, heterogeneous unmanned platforms capable of autonomous, collaborative behaviors to execute an operational naval mission. This project leverages low cost UAV, UUV, and USV advancements in additive manufacturing, advanced autonomy, commercial components, and advanced sensing technologies. HCUS components are rapidly producible, expendable assets employed to minimize risk to manned platforms while increasing mission station time as recovery and return-to-base are not required."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "This is a non-acquisition program.  NSWCDD will provide Government oversight to the project and develop a multi-domain mission planning system compatible with the Aegis Combat System and Ship Self Defense System (SSDS) capable of tasking the JHU-APL autonomous systems. University Affiliated Research Center John Hopkins University: Applied Physics Laboratory will be responsible for the design and development of additive manufactured quad-copters, UUV launch system for UAV launch, low-profile USVs with commercial sensor systems, and unattended ground sensors (UGS) with a UGS deployment capability, the network backbone and long haul communications back to a combat system or Maritime Operations Center."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each of the projects funded. All will include measures identified in the Statement of Objectives (SOO), including completions, successes, terminations, and iterative prototype cycle times reported against schedules and deliverables stated in the requirement documents."
                        }
                    }
                }
            ]
        }
    }
}