{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-9",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605604A"
        },
        "ProgramElementTitle": {
            "val": "Survivability\/Lethality Analysis"
        },
        "R1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.069"
            },
            "CurrentYear": {
                "val": "38.571"
            },
            "BudgetYearOne": {
                "val": "41.843"
            },
            "BudgetYearOneBase": {
                "val": "41.843"
            },
            "BudgetYearTwo": {
                "val": "33.341"
            },
            "BudgetYearThree": {
                "val": "34.428"
            },
            "BudgetYearFour": {
                "val": "35.758"
            },
            "BudgetYearFive": {
                "val": "36.419"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds analytical products necessary for inherently-governmental Army Test & Evaluation Command\/Army Evaluation Center's (ATEC\/AEC) mission. Products result from investigating, analyzing, assessing, and reporting on the survivability of Soldiers, and on the survivability, lethality and vulnerability (SLV) of the highest priority Army systems whether those systems are employed during stability, support, defensive, or offensive missions. Developed through measurement, experiment, test support, and modeling and simulation (M&S), the products funded by this PE are used in many ways to make the Army force more survivable.This PE provides quantitative lethality and survivability analyses and data for fielded and developmental systems as the Army makes the required choices to decisively transform into a modular Brigade Combat Team (BCT) based organization. Products concern Army fire support systems, direct fire munitions; Army air defense and missile defense systems; Army aviation systems including Unmanned Aerial Vehicles; network communications and other network enabled battle command and communication systems; and selected joint services systems particularly relevant to the Army's joint and expeditionary role. Products also include analysis and data concerning individual Soldier items including protective equipment such as helmets and vests. These survivability products are leveraged into rapid-equipping initiatives and other technical support for operational forces involved in the current fight.  Continued development of these products also guarantees preservation of the Army's vitally needed technical corporate memory for expert survivability advice.\n\nSurvivability analyses funded by this PE are conducted across the spectrum of battlefield threats to include guns, missiles, mines and other methods of inflicting physical damage; jammers, countermeasures, and other electronic warfare techniques; cybersecurity and computer network operations; and directed energy weapons. This survivability information enables developers, users, and decision makers to perform credible survivability tradeoffs for both Soldiers and materiel. These technical survivability details enable properly informed decisions concerning systems and tactics that maximize both the combat power and survivability of Army forces. Survivability data and analysis results funded by this PE are efficiently leveraged for many different Army uses, reducing total cost to the Army by eliminating the need for duplicative capabilities funded by individual system developers. Central funding of this mission assures the Army accurate and consistent treatment of survivability across all classes of systems, across all formal system Evaluations, and across the Army's Army Regulation (AR) 5-5 studies process. Work program is prioritized principally by the ATEC\/AEC and is used by them in the Army's formal Evaluation process in such a way that ATEC can comply with its legally mandated responsibility to assess system survivability along with effectiveness and suitability. Program Managers (PM) and the Program Executive Officers (PEO) use the survivability analyses and data funded by this PE to make design decisions that are optimized for survivability, to direct specific weapon system development efforts that are needed for survivability enhancement, and to structure product improvement programs. Soldier survivability data and analysis is leveraged to support the survivability portion of the Headquarters’ Department of the Army (HQDA) Deputy Chief of Staff, Personnel (G1) Human Systems Integration (HSI) program. United States (U.S.) Army Training and Doctrine Command (TRADOC) combat developers exploit the survivability products funded by this PE to initiate and improve survivability\/lethality requirements, and to develop and refine doctrine and tactics. Also, the quantitative analytical results funded by the PE are leveraged as core inputs to formal Army regulation (AR) 5-5 studies and other studies as directed by Army leaders. While the Army is at war, analytical results funded by this PE are also directly leveraged for survivability support to current operations. Finally, for particularly urgent or controversial survivability issues, data and analysis funded by this PE are used directly by senior Army decision makers to assure technically sound program\/production decisions.   \n \nThis PE also supports cybersecurity survivability analysis of Army battle command\/networked systems as well as Army network architectures and technology. Supports ATEC and other electronic warfare vulnerability testers and evaluators by developing and providing highly technical specialized field countermeasure environments that threat forces may employ against Army communications networks, air defense and other systems. In conjunction with PMs and Army intelligence agencies, this PE also analyzes technical vulnerabilities of foreign weapons, network related systems, and intelligence Electronic Warfare (EW) systems to U.S. Army EW systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "33.246"
                },
                "CurrentYear": {
                    "val": "38.571"
                },
                "BudgetYearOne": {
                    "val": "33.909"
                },
                "BudgetYearOneBase": {
                    "val": "33.909"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.069"
                },
                "CurrentYear": {
                    "val": "38.571"
                },
                "BudgetYearOne": {
                    "val": "41.843"
                },
                "BudgetYearOneBase": {
                    "val": "41.843"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.177"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.934"
                },
                "BudgetYearOneBase": {
                    "val": "7.934"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.177"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "7.754"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.754"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "CivPay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.180"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.180"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2018 net increase of $7.934M includes: $5.0M for a second year increase for Excalibur Live Fire Test and Evaluation (LFT&E) Analyses; $3.0M in support of Survivability, Lethality, Vulnerability Analyses (SLVA) for cybersecurity; $0.180M for CivPay adjustments; and a decrease of $0.246M due to an inflation rate adjustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675"
                    },
                    "ProjectTitle": {
                        "val": "Army Survivability Analysis & Evaluation Supp"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.069"
                        },
                        "CurrentYear": {
                            "val": "38.571"
                        },
                        "BudgetYearOne": {
                            "val": "41.843"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.843"
                        },
                        "BudgetYearTwo": {
                            "val": "33.341"
                        },
                        "BudgetYearThree": {
                            "val": "34.428"
                        },
                        "BudgetYearFour": {
                            "val": "35.758"
                        },
                        "BudgetYearFive": {
                            "val": "36.419"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds analytical products necessary for inherently-governmental Army Test & Evaluation Command\/Army Evaluation Center's (ATEC\/AEC) mission. Products result from investigating, analyzing, assessing, and reporting on the survivability of Soldiers, and on the survivability, lethality and vulnerability (SLV) of the highest priority Army systems whether those systems are employed during stability, support, defensive, or offensive missions. Developed through measurement, experiment, test support, and modeling and simulation (M&S), the products funded by this Project are used in many ways to make the Army force more survivable. The Project provides quantitative lethality and survivability analyses and data for fielded and developmental systems.  Products concern Army fire support systems, direct fire munitions; Army air defense and missile defense systems; Army aviation systems including Unmanned Aerial Vehicles; network communications and other network enabled battle command and communication systems; and selected joint services systems particularly relevant to the Army's joint and expeditionary role. Products also include analysis and data concerning individual Soldier items including protective equipment such as helmets and vests. These survivability products are leveraged where possible into rapid-equipping initiatives and other technical support for operational forces involved in the current fight. Continued development of these products also guarantees preservation of the Army's vitally needed technical corporate memory for expert survivability advice.\n\nSurvivability analyses funded by this Project are conducted across the spectrum of battlefield threats to include guns, missiles, mines and other methods of inflicting physical damage; jammers, countermeasures, and other electronic warfare techniques; cybersecurity and computer network operations; and directed energy weapons. This survivability information enables developers, users, and decision makers to perform credible survivability tradeoffs for both Soldiers and materiel. These technical survivability details enable properly informed decisions concerning systems and tactics that maximize both the combat power and survivability of Army forces. Survivability data and analysis results funded by this Project are efficiently leveraged for many different Army uses, reducing total cost to the Army by eliminating the need for duplicative capabilities funded by individual system developers. Central funding of this mission assures the Army accurate and consistent treatment of survivability across all classes of systems, across all formal system Evaluations, and across the Army's AR 5-5 studies process. Work program is prioritized principally by the ATEC\/AEC and is used by them in the Army's formal Evaluation process in such a way that ATEC can comply with its legally mandated responsibility to assess system survivability along with effectiveness and suitability.  Program Managers (PM) and the Program Executive Officers (PEO) use the survivability analyses and data funded by this Project to make design decisions that are optimized for survivability, to direct specific weapon system development efforts that are needed for survivability enhancement, and to structure product improvement programs. Soldier survivability data and analysis is leveraged to support the survivability portion of the HQDA G1 Human Systems Integration (HIS) program. United States (U.S.) Army Training and Doctrine Command (TRADOC) combat developers exploit the survivability products funded by this Project to initiate and improve survivability\/lethality requirements, and to develop and refine doctrine and tactics. Also, the quantitative analytical results funded by the Project are leveraged as core inputs to formal Army regulation (AR) 5-5 studies and other studies as directed by Army leaders. When the Army is at war, analytical results funded by this Project are also directly leveraged for survivability support to current operations. Finally, for particularly urgent or controversial survivability issues, data and analysis funded by this Project are used directly by senior Army decision makers to assure technically sound program\/production decisions.   \n \nThis Project also supports highly technical cyber survivability analysis of Army battle command\/networked systems as well as Army network architectures and technology. Supports ATEC and other electronic warfare vulnerability testers and evaluators by developing and providing highly technical specialized field countermeasure environments that threat forces may employ against Army communications networks, air defense and other systems. In conjunction with PMs and Army intelligence agencies, analyzes technical vulnerabilities of foreign weapons, network related systems, and intelligence Electronic Warfare (EW) systems to U.S. Army EW systems. Provides survivability analysis to System of Systems Network Vulnerability Assessments, to Chief Information Office (CIO) G6, Network Integration Evaluation (NIE), to triad (the Brigade Modernization Command (BMC), ATEC, and the System of Systems Integration (SoSI) Directorate."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Survivability, Lethality, Vulnerability Analyses (SLVA) for Ground, Aviation, Munitions, and Soldier Systems"
                                    },
                                    "Description": {
                                        "val": "Conduct integrated survivability, lethality, vulnerability analyses for developmental aviation, ground, soldier and munition systems including Stryker, Ground Soldier System, Excalibur, and Intelligent Mine System (IMS). Completed ballistic survivability\/vulnerability analysis for Mine Resistant Ambush Protected (MRAP) vehicle Test & Evaluation, Guided Multiple Launch Rocket system (GMLRS) Alternative Warhead Initial Operational Test and Evaluation (IOT&E) and Excalibur Live Fire Test and Evaluation (LFT&E) System Engineering Test-P1 test events, which included providing pre-shot predictions, performing damage assessments after each live fire test, completing post-shot analyses, behind armor debris (BAD) test\/analyses, and crew survivability analysis and providing technical data required by ATEC for the Systems Evaluation Reports.  Additionally, results and recommendations from our crosswalk of MRAP LFT&E assessed casualty\/selected Theater casualty incidents were briefed to MRAP PM & vendors, ATEC, Headquarters Department of Army (HQDA) and the Director, Operational Test & Evaluation resulting in vehicle design improvements for MRAP platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.477"
                                            },
                                            "Text": {
                                                "val": "Conducted ballistic SLVA on AEC's highest priority platform and weapon systems, supporting LFT&E pre-shot predictions, damage assessments, post-shot analysis, and crew survivability analysis and provided  technical data for system evaluation reports.  Provided vulnerability reduction recommendations to PMs for those systems supported. For systems analyzed provided data to the Army Materiel Systems Analysis Activity (AMSAA) for support of Army Analyses of Alternatives. Made the necessary preparations for the start of Armored Multi-PurposeP Vehicle (AMPV) and Bradley full-up system-level LFT&E in Fiscal Year (FY) 2017.  Performed damage and crew casualty assessments as well as post-shot analyses during the Joint Light Tactical Vehicle (JLTV) and the Joint Assault Bridge (JAB) LFT&E programs; collected data incorporated into the Director, Operational Test and Evaluation (DOT&E) live-fire report to Congress as well as the System Evaluation Reports prepared by ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.654"
                                            },
                                            "Text": {
                                                "val": "Conduct ballistic and other needed SLVA on AEC's highest priority platform and weapon systems, supporting LFT&E pre-shot predictions, damage assessments, post-shot analysis, and crew survivability analysis and providing technical data for system evaluation reports. Provide vulnerability reduction recommendations to PMs for those systems supported. For systems analyzed, provide data to AMSAA for support of Army Analyses of Alternatives; incorporate collected data into the DOT&E live-fire report to Congress as well as the System Evaluation Reports prepared by ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.468"
                                            },
                                            "Text": {
                                                "val": "Will conduct ballistic, cyber and EW SLVA on AEC's highest priority platform and weapon systems, supporting LFT&E pre-shot predictions, damage assessments, post-shot analysis, and crew survivability analysis and will provide technical data for system evaluation reports. Will provide vulnerability reduction recommendations to PMs for those systems supported. For systems analyzed will provide data to AMSAA for support of Army Analyses of Alternatives. Will make the necessary preparations for the start of full-up system-level LFT&E in FY18-20. Will perform damage and crew casualty assessments as well as post-shot analyses during scheduled LFT&E programs. Will collect data incorporated into the DOT&E live-fire report to Congress as well as the System Evaluation Reports prepared by ATEC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) System Survivability Assessments"
                                    },
                                    "Description": {
                                        "val": "This effort produces assessments of the survivability of C4ISR systems in Electronic Warefare (EW) and cybersecurity threat environments and conducts Electronic Attack (EA) and Cybersecurity projects that reveal critical vulnerabilities in C4ISR systems. It also defines, demonstrates, and recommends mitigation options to proponents and evaluators of C4ISR. A cyber vulnerability database is maintained for the benefit of the community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.038"
                                            },
                                            "Text": {
                                                "val": "Analyzed data for Joint Tactical Radio System (JTRS) Mid-Tier Networking Vehicular Radios (MNVR) Initial Operational Test & Evaluation (IOTE) (NIE 16.1) and Follow-On Operational Test & Evaluation (FOTE) (NIE 16.2). Analyzed test data for the JTRS airborne radio systems. Conducted experimental and modeling analysis in support of Military Global Positioning System (GPS) User Equipment (MGUE) Increment1\/2 [support of advanced component development and prototypes (ACD&P), Technical  Risk Reduction, Electro-Motive Division \/ Production Phases, and Milestone (MS)_B\/C].  Conducted experimental and modeling analysis in support of the Distributed Common Ground System - Army (DCGS-A) Development and Test Inc 2 Rel 1 Software, [support of DCGS-A(D07)Increment 2-Development Contract Award Increment 2 and MS_B 2QFY16. Conducted experimental and modeling analysis in support of the Advanced Field Artillery Tactical Data System (AFATDS) Increment 2 V.7.0 Implementation \/ Deployment. Conducted experimental and modeling analysis in support of Avenger Fire Control Computer (AFCC) software and hardware upgrades for Forward Area Air Defense (FAAD) [support AFCC-Revision (AFCC-R) Development to ensure the system met the latest Information Assurance (IA) requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.363"
                                            },
                                            "Text": {
                                                "val": "Analyze Electronic Protection (EP) and cybersecurity for systems under test and systems under investigation in NIEs 16.1 and 16.2., and for additional highest priority technologies and developmental systems as specified by ATEC so as to reduce costs of downstream development by identifying and fixing vulnerabilities earlier and to assure that formal Army evaluations at Milestone decision points are fully informed on EP and cyber issues. Mature cyber-attack M&S tools so as to more accurately assess the operational impact of such attacks on small unit mission accomplishment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.761"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.761"
                                            },
                                            "Text": {
                                                "val": "Will analyze EP and cybersecurity for systems under test and systems under investigation for FY17 NIEs and for additional highest priority technologies and developmental systems as specified by ATEC so as to reduce costs of downstream development by identifying and fixing vulnerabilities earlier and to assure that formal Army evaluations at Milestone decision points are fully informed on EP and cyber issues. Will apply cyber-attack M&S tools so as to more accurately assess the operational impact of such attacks on small unit mission accomplishment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Survivability, Lethality, Vulnerability (SLV) Analyses for Developmental Air and Missile Defense Systems"
                                    },
                                    "Description": {
                                        "val": "Conduct integrated SLV analyses for developmental air and missile defense systems, pre-planned product improvements of current systems, and recently fielded systems. These systems include the Ballistic Missile Defense System (BMDS), Terminal High Altitude Air Defense (THAAD), PATRIOT, Surface-Launched Advanced Medium Range Air-to-Air Missile (SLAMRAAM), Joint Land Attack Cruise Missile Defense Elevated Netted Sensor System (JLENS), and Sentinel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Text": {
                                                "val": "Designed, developed, and employed advanced electronic attack countermeasures to assess Army Integrated Air and Missile Defense (AIAMD) system of systems. Provide advanced EA and cybersecurity testing for Patriot Post Deployment Build-08 user operational test events. Provided additional EA and cybersecurity testing on other AMD systems as needed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.554"
                                            },
                                            "Text": {
                                                "val": "Design, develop, and employ advanced electronic attack countermeasures to assess AIAMD system of systems. Provide advanced EA and cybersecurity testing for Patriot PDB-08 user operational test events. Provide additional EA\/EP and cybersecurity analysis for other Air Missile Defense systems as prioritized by ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.614"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.614"
                                            },
                                            "Text": {
                                                "val": "Will design, develop, and employ advanced electronic attack countermeasures to assess A and AMD system of systems. Will provide advanced EA and cybersecurity testing for Air and AMD user operational test events. Will provide additional EA and cybersecurity analysis and experimentation on other Air and AMD systems as needed by ATEC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}