{
    "id": "2018-Army-PB-2040-JBOOK-6496f983e90d3a98760d6d2aa09bce01c6733fe7e60bc4ee6b3adbaad3baa8ce-3",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "95.504"
            },
            "CurrentYear": {
                "val": "68.714"
            },
            "BudgetYearOne": {
                "val": "84.079"
            },
            "BudgetYearOneBase": {
                "val": "84.079"
            },
            "BudgetYearTwo": {
                "val": "85.808"
            },
            "BudgetYearThree": {
                "val": "79.455"
            },
            "BudgetYearFour": {
                "val": "84.389"
            },
            "BudgetYearFive": {
                "val": "74.319"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures weapons and munitions components\/subsystems and demonstrates lethal and non-lethal weapons munitions with potential to increase force application and force protection capabilities across the spectrum of operations. Project 232 focuses on affordable delivery of scalable (lethal to non-lethal) effects for weapons and munitions including: artillery, mortars, medium caliber, tank fired, Soldier weapons and shoulder fired weapons. Project L96 matures and integrates critical high energy laser subsystems into a mobile demonstrator to explore and validate system performance in relevant environments. Project L97 demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection.  \n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n  \nWork in this PE is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ; Edgewood Chemical Biological Center (ECBC), Edgewood, MD; and the Army Space and Missile Defense Command (SMDC), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "82.663"
                },
                "CurrentYear": {
                    "val": "68.714"
                },
                "BudgetYearOne": {
                    "val": "76.822"
                },
                "BudgetYearOneBase": {
                    "val": "76.822"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "95.504"
                },
                "CurrentYear": {
                    "val": "68.714"
                },
                "BudgetYearOne": {
                    "val": "84.079"
                },
                "BudgetYearOneBase": {
                    "val": "84.079"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "12.841"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.257"
                },
                "BudgetYearOneBase": {
                    "val": "7.257"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "15.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.159"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "7.236"
                                },
                                "BudgetYearOneBase": {
                                    "val": "7.236"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Civ Pay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.021"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.021"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.202"
                        },
                        "CurrentYear": {
                            "val": "46.051"
                        },
                        "BudgetYearOne": {
                            "val": "54.977"
                        },
                        "BudgetYearOneBase": {
                            "val": "54.977"
                        },
                        "BudgetYearTwo": {
                            "val": "53.532"
                        },
                        "BudgetYearThree": {
                            "val": "42.663"
                        },
                        "BudgetYearFour": {
                            "val": "46.128"
                        },
                        "BudgetYearFive": {
                            "val": "35.550"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for affordable precision munitions. Technologies include advanced energetic materials, insensitive munitions, novel fuze designs, penetrators, and scalable effects. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nEfforts in this Project support the Lethality and Ground Maneuver portfolios.\n\nWork in this Project is performed by the Armament Research, Development, and Engineering Center (ARDEC), Picatinny Arsenal, NJ."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Based Networked Munitions Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technology for improved capability remotely delivered area denial munition systems to include: networked munition architecture, low hazard effects, delivery mechanisms, and non-lethal response to tampering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.965"
                                            },
                                            "Text": {
                                                "val": "Developed area denial munition technologies including networked munition level architecture and advanced methods for precision delivery\/location of remote effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Mature the networked munition modular architecture for use in future Programs of Record; demonstrate technologies for non-kinetic energy vehicle stopping."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra-high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies for 155mm artillery to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with the Department of Defense (DoD) cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.882"
                                            },
                                            "Text": {
                                                "val": "Matured a novel cluster munition policy compliant warhead for 155mm artillery; conducted arena testing of multi-explosive formed penetration optimized for effects against armored targets integrated into a 155mm artillery projectile compliant with DoD cluster munition policy; conducted static and ballistic testing on an integrated projectile, culminating in a Technical Readiness Level (TRL) 6 demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.500"
                                            },
                                            "Text": {
                                                "val": "Validate the systems beginning to end capability as well as the system's ability to improve effectiveness against the desired target sets; mature and demonstrate various component designs in a system level solution. The effort continues to improve and mature a variety of integrated unitary and submunition system concepts to mitigate the gap that will emerge with the loss of cluster munitions. Concepts such as a unitary projectile geared towards medium armor targets, a full bore submunition with a highly reliable triple function fuze, a concept that increases the size and fuze volume of the Dual Purpose Improved Conventional Munition (DPICM) bomblet and incorporates high reliability fuzing while maintaining the traditional lethal mechanisms of DPICM. In Fiscal Year (FY) 2017 the efforts optimize the concept of bomblet\/system design and component space allocation to accommodate system level development and demonstrating concept performance through modeling and simulation. Efforts mature system level designs of unitary solutions and improve initial system level performance. Efforts continue to mature designs and exploit alternate technologies to mitigate risk; develop evaluation criteria to assess concept performance; integrate component technologies into system level solution that are effective against target sets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate various materiel cluster munition components at the system and component level; evaluate effectiveness of materiel solutions; and optimize solutions to address desired target sets. Submunition concepts will undergo extensive laboratory testing to ensure arming in proper environments and ensure fuzing reliability growth."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and ammunition handling systems optimized for remote operation. This effort demonstrates cannon-super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, ability to fire a suite of ammunition from non-lethal to lethal, and escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.608"
                                            },
                                            "Text": {
                                                "val": "Validated weapon system integration with ammo handling system (AHS) and conducted fixed hardstand integration to support initial weapon system demonstration to optimize and improve weapon\/ammo performance prior to test bed turret integration; matured test bed turret designs to support weapon system integration; exploited data from initial weapon demonstration to improve fire control software performance that will provide increased system accuracy.  Improved effectiveness and performance of programmable air burst munition (PABM) and armor piercing (AP) munition against personnel and materiel targets. Continued to mature combat load AHS to support integration into test bed turret for TRL 6 integrated system demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Validate PABM fuze technology and warhead lethality data, iterating and improving as necessary; using a commercially developed barrel, demonstrate PABM and AP effectiveness against personnel and materiel targets; design and fabricate 50mm weapon and AHS prototypes; exploit advances in advanced Fire Control hardware to improve system performance; mature Fire Control software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.700"
                                            },
                                            "Text": {
                                                "val": "Will validate weapon system integration with AHS and will conduct fixed hardstand integration to support initial weapon system demonstration to optimize and improve weapon\/ammo performance prior to test bed turret integration; mature test bed turret designs to support weapon system integration; exploit data from initial weapon demonstration to improve fire control software performance that will provide increased system accuracy; improve effectiveness and performance of PABM and AP munition against personnel and materiel targets; and continue to mature combat load AHS to support integration into test bed turret for TRL 6 integrated system demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the performance and insensitivity of energetic materials ranging from 25mm medium caliber (direct fire) through 155mm large caliber (indirect fire) weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "Began the transition of insensitive energetic materials of interest to the Army; and down-selected and evaluated energetic materials to be scaled up to production levels to verify they meet the Army needs and can be produced in large quantity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Will qualify energetic materials to provide complete material characterization to reduce technical risk when transitioning to end-item; continue to mature the advancement of nano-energetic formulations to validate nano-materials characteristics to provide substantially less shock sensitivity than current formulations while maintaining optimal performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Armament Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort is done in coordination with efforts in Program Element (PE) 0602601A, PE 0602618A, PE 0603004A, PE 0603005A, PE 0603270A, and PE 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.764"
                                            },
                                            "Text": {
                                                "val": "Developed hard-kill countermeasure system requirements to ensure proper interface with the Modular APS (MAPS); continued to mature and merge key hard-kill technologies including fire control, launcher, munition, and warhead for seamless integration with the Army's MAPS controller."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.250"
                                            },
                                            "Text": {
                                                "val": "Develop and bench test critical mature subcomponents as well as use of existing performance and simulation models to validate Hard Kill modularity as a capability; determine subsystem integration requirements and optimize interface specifications to support a Modular APS Framework (MAF) compliant Hard Kill component; mature modularity of subsystem components."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.250"
                                            },
                                            "Text": {
                                                "val": "Will modify Hard Kill Counter Measure (HKCM) subsystems to be compliant to MAPS standards; integrate, simulate and demonstrate Modular APS performance capability given mission scenario sets. Performance measures will include: threat detection, tracking, signal processing (Fire Control\/Modular APS Controller (MAC)) and threat defeat of rocket propelled grenades (RPGs) and recoilless rifles.  Will optimize interface specifications to support layered demonstrator of MAPS compliant hard kill component."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Non-Line-of-Sight (NLOS) Munition for Light Forces"
                                    },
                                    "Description": {
                                        "val": "This effort provides a precision technology capability for an 81mm mortar cartridge for light forces for base defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.965"
                                            },
                                            "Text": {
                                                "val": "Fabricated and demonstrated 81mm precision mortar design through a series of inert system flight tests which culminated in a capability demonstration at the end of FY16."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Sniper Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates advanced projectile designs such as long rod penetrator technologies that will provide snipers with the capability for increased range effectiveness (up to 1500m, possibly greater), hit probability, and armor penetration, for use in man-portable sniper weapons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Text": {
                                                "val": "Optimized and demonstrated advanced sniper ammunition concepts through modeling and simulation and design verification; and demonstrated selected fully integrated ammunition-weapon designs in relevant operational environments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery weapon system and projectile technologies that increase the range by 25% without an increase in platform weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.003"
                                            },
                                            "Text": {
                                                "val": "Matured designs of component technologies associated with longer range artillery capabilities including cannon tube, breech and mount; conducted initial component verification; and conducted prototype technology demonstrator testing of weapon sub-systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.686"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and optimize initial long range artillery subsystems components and prototypes including cannon tube, breech and mount; and mature component designs of secondary weapon subsystems such as scavenge systems, diagnostics, and muzzle brakes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate and optimize integrated long range artillery subsystems including the armament and lightweight trunnion support bracket and mature component designs of secondary weapon subsystems such as scavenge systems, elevation, equilibration, automated breech operation, and thermal warning; mature and demonstrate armament with emerging charge and projectile technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort integrates complementing navigation sensors, actuators and subsystems in order to demonstrate precision delivery capability on an indirect fire munition system in a global positioning system (GPS) denied environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.402"
                                            },
                                            "Text": {
                                                "val": "Demonstrated image navigation guidance technology with algorithms and associated optics integrated in a projectile through a series of captive flight tests; demonstrated guidance and control system in a dynamic test to verify the ability to maneuver in flight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Fully integrate the optics, image processing, navigation and control components into a guidance system for testing on candidate airframes; demonstrate baseline performance initially in day-time \/ favorable weather; demonstrate full system survivability in extreme environmental  conditions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate the integrated image based terminal guidance system on an indirect fire platform. The system demonstration will show the end to end functionality of the Guidance, Navigation, and Control (GNC) system’s ability to maintain <10m precision capability in a GPS denied environment. After this demonstration series, a Technical Readiness Assessment (TRA) will be conducted to verify system at TRL-6."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Unmanned Aviation System (C-UAS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates modular C-UAS technologies designed to encompass the entire kill chain including detection, tracking, classification, and defeat of UAS for point defense and mobile applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.633"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated technologies for UAS tracking and defeat; evaluated and selected weapon systems and munitions for defeat of UAS and integrated into current system of systems for mobile and area defense; integrated precision fire control mechanisms and demonstrated the system of systems defeat of UASs; evaluated results of demonstrated UAS defeat mechanisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "Continue the maturation and optimization of technologies for UAS tracking and defeating to include the integration of precision fire control mechanisms and weapons systems; validate the technologies at the subsystem level and evaluate results of the UAS defeat mechanisms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "Will integrate matured C-UAS technologies, to include precision fire control radar and small caliber munitions, onto a common weapons platform to form a system of systems for UAS detection, tracking, and defeat; perform system integration evaluations and validate the fire control radar and software for the UAS kill chain; update modeling and simulation tools based on collected data."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Munition Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery technologies including rocket and base bleed propulsion, hybrid lifting surfaces and guidance technologies which increase range and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.199"
                                            },
                                            "Text": {
                                                "val": "Matured and integrated projectile technologies for next generation extended range rocket-assisted projectiles including integrated munition designs involving novel rocket motor formulations, advanced flight controls, and precision guidance components that could survive launch conditions in an extended range cannon environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "Demonstrate designs of extended range rocket assisted projectiles fires with currently fielded weapon systems; optimize next generation rocket assisted projectile designs to increase lethality and range when fired with extended range cannon systems; optimize projectiles for use with advanced navigation, flight control, and guidance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.134"
                                            },
                                            "Text": {
                                                "val": "Will continue to exploit, mature, and demonstrate enhanced lethality from rocket assisted projectiles using technology enablers to optimize extended range vs. lethality; demonstrate integration of lifting surfaces, advanced navigation, flight control, and guidance technologies to enable precision at greatly extended ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technology for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes, and advanced fuze setting. These technologies will provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate airburst fuze technology systems for increased accuracy in multi-mode medium caliber rounds; demonstrate low-cost, in-line safety and arming systems for advanced warhead initiation schemes; improve multi-point initiation systems applicable to Insensitive Munitions; optimize next generation fuze setting methodologies to more efficiently transfer and store power and data to smart indirect fire projectiles. These technologies will continue to support the Joint Munitions Program Technical Coordinating Group (TCG-5 and TCG-10) and the Joint Fuze Technology Program (JFTP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.860"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.860"
                                            },
                                            "Text": {
                                                "val": "Will optimize and demonstrate reduced range error for increased accuracy in multi-mode medium caliber rounds; demonstrate advanced large caliber fuze setting technologies; and demonstrate advanced multi-point initiation systems and optimize advanced power systems for both fuze and munition systems. These technologies will continue to support the Joint Munitions Program TCG-5 and TCG-10 and the Joint Fuze Technology Program (JFTP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Small Arms Ballistic System"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced small arms ballistic calculations output from advanced sensor input and optimized architecture for rifles integrated with optic and precision-optical wind sensing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.915"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate optimized architecture for the precision-optical wind sensing; mature technologies to improve and increase probability of hit, exploiting advanced sensor data including downrange wind sensing, to provide ballistic corrections supporting Program Management (PM) Individual-Weapons platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Tactical Multi-Purpose (ETMP) Hand Grenade"
                                    },
                                    "Description": {
                                        "val": "This effort develops a multi-purpose selectable lethal hand grenade that produces either fragmentation or blast overpressure effects."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.100"
                                            },
                                            "Text": {
                                                "val": "Optimize and refine the design of the subsystems (mode selector, fuze, warhead) based on the results of testing completed to date; integrate all the components into a system and conduct laboratory assessments leading up to a TRL 5 demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Will develop and qualify the power source, which powers the electronic fuze system, at extreme temperature; design and qualify dual printed detonators; integrate power source and dual printed detonators into the system, conduct final TRL 5 demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Armament and Fire Control Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range Armament technologies including light weight Cannon and Mount structures, high efficiency recoil cylinders, common lower power fire control hardware, improved fire control software, and improved sensor to shooter communications which will increase range and accuracy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.096"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.096"
                                            },
                                            "Text": {
                                                "val": "Will begin to exploit, mature, and demonstrate enhanced light weight structures for cannon and mount components; mature and demonstrate common fire control hardware with improved software to improve accuracy at extended and current ranges."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Armament System Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates armament solutions adaptable to current aviation and future vertical lift applications in small caliber, medium caliber, counter measure and non-lethal technologies with a focus on light lethal aerodynamic systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.237"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Text": {
                                                "val": "Will mature and integrate technology for a multi-role armaments solution on Future Vertical Lift aircraft system; improve fire control algorithms for holistic offensive and defensive fires for aviation; optimize weapon system for stowed and deployed operability and munitions with hard kill lethality at range for conventional and more challenging threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Leader-Soldier Effects Tool Suite"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates fires and effects planning, coordination and execution tool suite for sensor to shooter and tactical application. Provides enhanced collaborative engagement capability of fielded and emerging battle command systems supporting PM Soldier Warrior and PM Mission Command Program of Record (POR) architectures."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.700"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advance fires planning capabilities, specifically develop commander guidance matrix, battery defense application, and echelonment of fires capability that provides digitized tools for the commanders at various echelons; enhance current fires and effects planning tools such as howitzer platforms and dismounted units range cards as well as sector sketches, optimal weapon emplacement tools, and three-dimensional (3D) de-conflictions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Small Arms Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate advanced small arms ballistic calculations from advanced sensor input and optimized architecture for the precision-optical wind system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.200"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate optimized architecture for the precision-optical wind system. Will mature technologies to improve and increase probability of hit, exploiting advanced sensor data including down-range wind sensing, to provide ballistic corrections supporting PM Individual-Weapons platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "43A"
                    },
                    "ProjectTitle": {
                        "val": "ADV WEAPONRY TECH DEMO"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Advanced Weaponry Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "Advanced weaponry technology demonstrations"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hybrid Projectile Technology Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15.000"
                                        },
                                        "Text": {
                                            "val": "Integrated and demonstrated technologies that extend range, increase lethality, improve accuracy and munition survivability for large and medium caliber munitions, both direct and indirect fired. Examples of such technologies include: integration of lifting surfaces, reducing projectile cross sections for increased survivability, and providing multiple lethality effects from the same munition."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.134"
                        },
                        "CurrentYear": {
                            "val": "17.728"
                        },
                        "BudgetYearOne": {
                            "val": "24.096"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.096"
                        },
                        "BudgetYearTwo": {
                            "val": "26.253"
                        },
                        "BudgetYearThree": {
                            "val": "30.169"
                        },
                        "BudgetYearFour": {
                            "val": "30.035"
                        },
                        "BudgetYearFive": {
                            "val": "30.736"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology.  The major effort under this project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon.  At entry level weapon power of around 10 kW, SSL technology has the potential to engage and defeat small caliber mortars, unmanned aerial vehicles (UAVs), surface mines, sensors, and optics.  At full weapon system power levels of around 100 kW, SSL technology has the potential to engage and defeat rockets, artillery and mortars (RAM), UAVs, cruise missiles, sensors, and optics at tactically relevant ranges.  HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance.  This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n \nWork is performed by the Army Space and Missile Defense Command (SMDC)\/Army Forces Strategic Command, Technical Center, Huntsville, AL."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on Army platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on various Army platforms, while ensuring platform volume, weight, and interface specifications are met. The laser system consists of laser devices, such as the laboratory laser devices developed under Program Element (PE) 0602307A, Project 042, and the prime power (PE 0603005A, Project 441), command and control and thermal management subsystems required for the laser device operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.867"
                                            },
                                            "Text": {
                                                "val": "Continued ruggedization of the thermal management subsystem and power management subsystem; ruggedized available power storage hardware received from the United States (U.S.) Army Tank-Automotive Research Development and Engineering Center (TARDEC) in preparation for integration; continued ruggedization of 50 kW class solid state laser subsystem components; and began ruggedization of the BMC3 subsystem."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.216"
                                            },
                                            "Text": {
                                                "val": "Will complete the ruggedization and preparation of platform to accept the 50 kW-class laser from Project 042; develop and integrate prime power and thermal management subsystems to support the 50 kW risk reduction testing in Fiscal Year (FY) 2018 and optimize the command and control subsystem to manage the new laser, power, and thermal management subsystems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.961"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.961"
                                            },
                                            "Text": {
                                                "val": "Complete ruggedization and modification of the High Energy Laser Mobile Test Truck (HELMTT) Beam Control System (BCS) and ruggedization of the Robust Electric Laser Initiative (RELI) 60 kW laser to enable integration. Complete the Demonstrator Initial Design Review (IDR) of the next generation pre-prototype HEL weapon system. This IDR matures the design of the HEL system as part of the HEL Tactical Vehicle Demonstrator effort."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Mobile Demonstrations (HEL MD)"
                                    },
                                    "Description": {
                                        "val": "This effort integrates a commercial-off-the-shelf (COTS) 10kW laser subsystem and demonstrated that performance. The 50 kW-class laser from Project 042 will be integrated into the existing mobile laser demonstrator platform that includes the ruggedized BCS built under the High Energy Laser Technical Demonstration effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high energy laser system in a relevant environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.267"
                                            },
                                            "Text": {
                                                "val": "Continued coordination activities for 50kW class laser demonstration and data collection events with range, the Laser Clearing House, and the Federal Aviation Authority (FAA) organizations; began modifications of interfaces and integration of thermal management and power management subsystems; began performance validation of integrated thermal management and power management subsystems for the 50 kW class demonstration; and began fabrication of interfaces and integration of laser subsystem components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.512"
                                            },
                                            "Text": {
                                                "val": "Will begin integration of the ruggedized 50 kW class laser subsystems into an Army platform and perform functional verifications to validate system operation; coordinate with the national test range(s) and procure targets for a system risk reduction demonstration; demonstrate the 50 kW class configuration in the laboratory to verify the system meets the performance metrics prior to beginning integration on the Army platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.135"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.135"
                                            },
                                            "Text": {
                                                "val": "Complete planning for the 50 kW-class HELMTT system demonstration in FY 2018. Conduct risk reduction demonstration of the 50 kW-class integrated laser system on the HELMTT to validate system design and interfaces. Collect data to be used to verify lethality models on atmospheric propagation data. This effort is part of the HEL Tactical Vehicle Demonstrator effort."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.168"
                        },
                        "CurrentYear": {
                            "val": "4.935"
                        },
                        "BudgetYearOne": {
                            "val": "5.006"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.006"
                        },
                        "BudgetYearTwo": {
                            "val": "6.023"
                        },
                        "BudgetYearThree": {
                            "val": "6.623"
                        },
                        "BudgetYearFour": {
                            "val": "8.226"
                        },
                        "BudgetYearFive": {
                            "val": "8.033"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces. This Project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nWork in this Project is related to, and fully coordinated with, Program Element (PE) 0602622A (Chemical, Smoke and Equipment Defeating Technology) and PE 0603606A, Project 608 (Countermine & Barrier Development).   \n\nThis Project sustains Army Science and Technology efforts supporting the Ground Maneuver portfolio.\n   \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan.   \n  \nWork in this project is performed and managed by the Army Research, Development, and Engineering Command (RDECOM), Edgewood Chemical Biological Center (ECBC), Edgewood, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Text": {
                                                "val": "Continued dissemination studies of artillery\/mortar delivered low hazard visual obscurant."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.851"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques for dissemination of new microwave obscurants and explore new microwave obscurant applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.866"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Will redesign and improve vehicle protection grenade cloud characteristics. Will initiate particulate materials dissemination studies for the Screening Obscuration Module generator system. Will explore obscurants’ ability to defeat anti-tank guided missiles."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and homemade explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.515"
                                            },
                                            "Text": {
                                                "val": "Optimized and matured the Chemical Fingerprint Imaging System (CFIS) device for unambiguous biometric identification of an individual linking explosive residue identified and found in latent fingerprints using Raman Chemical Imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.096"
                                            },
                                            "Text": {
                                                "val": "Will evaluate prototype CFIS standalone instruments to ensure they are fully integrated and will meet the fingerprinting and chemical identification requirements for the Common Analytical Lab System (CALS). Additionally will advance Ultraviolet-Visible Near Infrared (UV-Vis-NIR) multispectral imaging for improved discrimination of target materials and substrates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.134"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.134"
                                            },
                                            "Text": {
                                                "val": "Will refine prototype CFIS standalone instrument and compare with commercial off the shelf alternative on their ability meet the fingerprinting and chemical identification requirements for the Common Analytical Lab System (CALS). Will evaluate spatially offset Raman prototype for the forensic analysis of explosive materials in opaque containers."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.851"
                                            },
                                            "Text": {
                                                "val": "Expanded number of explosive materials detected in the Chemical Explosives Detector (CED) variant of the Joint Chemical Detector (JCD) while retaining Chemical Warfare Agent (CWA) and Toxic Industrial Chemical (TIC) detection capabilities; integrated software and algorithms supporting the detection of explosive materials in the CED; optimized and matured the inlet system for particulate and vapor detection, as well as integrated on-board vapor generators (OVGs) for dopant and calibrant delivery."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.988"
                                            },
                                            "Text": {
                                                "val": "Will identify up to four on-board calibrants in order to improve the real time detection of the CED by an order of magnitude.  Will determine mobility values of the calibrants and target molecules used as detection parameters for algorithms in ion mobility spectra. Will establish dependence of detection parameters on water vapor and make a final recommendation to JPM-CA of most stable calibrant.  Will Implement new detection parameters in software.  Will demonstrate improved ionization of explosives using up to four chlorine based dopants. Will optimize and mature CED probe design to enhance the detection performance on explosives and other low volatility threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.006"
                                            },
                                            "Text": {
                                                "val": "Will improve standoff detection capabilities for homemade and military explosives by developing advanced Raman detection algorithm emphasizing detection of trace explosives on surfaces. Will conduct analysis of alternative solutions for solid state laser sources and spectrometer designs to enhance detection sensitivity. Will integrate hardware and software improvements into existing commercial system for subsequent testing."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}