{
    "id": "2018-Army-PB-2040-JBOOK-3e91339aa28ec2881f9549044dc8a7daf4e287c1ca461095f2d8b42bf2f292b8-13",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603804A"
        },
        "ProgramElementTitle": {
            "val": "Logistics and Engineer Equipment - Adv Dev"
        },
        "R1LineNumber": {
            "val": "66"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "20.271"
            },
            "CurrentYear": {
                "val": "20.834"
            },
            "BudgetYearOne": {
                "val": "35.333"
            },
            "BudgetYearOneBase": {
                "val": "35.333"
            },
            "BudgetYearTwo": {
                "val": "18.397"
            },
            "BudgetYearThree": {
                "val": "18.177"
            },
            "BudgetYearFour": {
                "val": "17.392"
            },
            "BudgetYearFive": {
                "val": "17.136"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element supports advanced component development and prototypes of new and improved technologies for combat support and combat service support equipment essential to sustaining combat operations.  Advancements in bridging, electric power generators, material-handling, environmental control, shelter systems, cargo aerial delivery, field service systems, mortuary affairs equipment and petroleum equipment are necessary to improve safety and increase the tactical mobility, operational capability, lethality and survivability on the digital battlefield and to provide for greater sustainment while reducing the logistics support burden. Army Watercraft funding supports initiatives to enhance the seaworthiness, safety, survivability, supportability, energy efficiency, environmental, regulatory compliance and reliability of existing systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.233"
                },
                "CurrentYear": {
                    "val": "20.834"
                },
                "BudgetYearOne": {
                    "val": "19.492"
                },
                "BudgetYearOneBase": {
                    "val": "19.492"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.271"
                },
                "CurrentYear": {
                    "val": "20.834"
                },
                "BudgetYearOne": {
                    "val": "35.333"
                },
                "BudgetYearOneBase": {
                    "val": "35.333"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.962"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "15.841"
                },
                "BudgetYearOneBase": {
                    "val": "15.841"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.139"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.823"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "15.841"
                                },
                                "BudgetYearOneBase": {
                                    "val": "15.841"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY18 Added Armored Engineer Vehicles project EW8."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "526"
                    },
                    "ProjectTitle": {
                        "val": "Marine Orien Log Eq Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.445"
                        },
                        "CurrentYear": {
                            "val": "3.976"
                        },
                        "BudgetYearOne": {
                            "val": "4.345"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.345"
                        },
                        "BudgetYearTwo": {
                            "val": "3.938"
                        },
                        "BudgetYearThree": {
                            "val": "3.962"
                        },
                        "BudgetYearFour": {
                            "val": "3.969"
                        },
                        "BudgetYearFive": {
                            "val": "3.960"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program element supports projects and studies for advanced component development, including prototypes of equipment and sub-systems which provide critical capabilities for Unified Land Operations (ULO), by extending the Commander's available maneuver space into and throughout the littorals, inland waterways and near coastal regions.   Army watercraft equipment enables the conduct of riverine, Logistics-over-the-Shore (LOTS) and Joint Logistics-over-the-Shore (JLOTS), inter and intra-theater transport, movement and maneuver, mission command and sustainment, as identified in DODD 5100.01 (Functions of the Department of Defense and it's major components).  Army Watercraft exploit the inland waterways and littoral regions as waterborne maneuver and supply routes, conducting operations through littoral entry points (developed, undeveloped, and austere access points) and in non-permissive, and\/or denied access scenarios.  The Army uses a spectrum of Army Watercraft systems, from heavy sustainment ocean going landing craft capable of intra-theater and ship to shore transport and undeveloped beach or harbor access, to oceangoing and harbor utility tug boats and barge derricks for transport and denied port\/salvage operations, and modular causeway systems for (LOTS\/JLOTS).  The funding supports initiatives to enhance the seaworthiness, safety, survivability, supportability, energy efficiency, environmental, regulatory compliance and reliability of existing systems.  Funded efforts will address critical gaps in these areas for the current fleet, while at the same time researching, developing and testing emergent technologies in a manner to support future acquisitions and future fleet planning.  The funding enables our compliance with the National Defense Authorization Act of 1996 and 502(6) of the Clean Water Act and compliance with Environmental protection Agency (EPA) emission standards.\n\nFY18 funding will primarily support maturation of the Service Life Extension Program (SLEP) design for the Modular Warping Tug (MWT), support continued integration of Force Protection, and environmental projects."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Watercraft Program Support"
                                    },
                                    "Description": {
                                        "val": "PM\/Matrix Salary Support includes Program Management and System Engineering resources required to manage the program projects and provide contractor oversight.  It also includes benefits, travel, personnel training and other Government costs required to retain a professional acquisition workforce."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.475"
                                            },
                                            "Text": {
                                                "val": "-Developed a Flexor study for the Modular Causeway System (MCS) resulting in contract award.\n-Funded salary support to the Navy for Uniform National Discharge Standards (UNDS) analysis and committee representation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.574"
                                            },
                                            "Text": {
                                                "val": "PM\/Matrix Support includes PM and System Engineering oversight required to manage the program and provide contractor oversight. Salaries, benefits, travel, personnel training and other Government costs are included for retaining a profession acquisition workforce."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.370"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Text": {
                                                "val": "-PM\/Matrix Support.\n-Fund Navy for UNDS analysis and committee representation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection Capability"
                                    },
                                    "Description": {
                                        "val": "Army Watercraft Systems (AWS) Force Protection capability is limited to defensive measures.  Current efforts include development of gunner station and weapon station locations, integration of Common Remotely Operated Weapon Station (CROWS) and non-lethal Escalation of Force (EoF).  The EoF capability includes white light, green dazzler, an acoustic device, and percussion grenades."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.140"
                                            },
                                            "Text": {
                                                "val": "Funded concept development for integration of CROWS on Logistics Support Vessel (LSV) 7-8 Class vessels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Continue Force Protection, lethal (CROWS) and non-lethal (EoF) suite includes white light, eye safe laser, acoustic device and percussion grenades for LSV fleet."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.770"
                                            },
                                            "Text": {
                                                "val": "-Develop CROWS Integration kit for LCU 2000.\n-Continue EoF development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "At Sea Transfer Technology"
                                    },
                                    "Description": {
                                        "val": "At Sea Transfer Technology enables roll on and roll off (RO\/RO) capability from vessels at sea; and causeway transport of vehicles and equipment to the beach or shore.  The current effort serves to inform development of a Service Life Extension Program (SLEP) for the Modular Warping Tug (MWT) and Causeway Ferry (CF) which are principle working platforms in the Modular Causeway System (MCS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.541"
                                            },
                                            "Text": {
                                                "val": "-MWT\/CF Electrical Design Study - 75% complete.\n-Developed Technical Data Package (TDP) for 1 of 9 MWT\/CF modules.\n-Awarded Flexor Study."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.175"
                                            },
                                            "Text": {
                                                "val": "At Sea Transfer Development to include Modular Warping Tug (MWT) Standardization Project (ESTDSP) Study including Monthly Status Report, In Progress Reviews, Assessment of Solutions Report, and a Land Based Test\nsite with drawings for the Solution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.150"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop the MWT\/CF SLEP Design Solution; transition design to prototype.\n-Continue development of the MWT\/CF Technical Data Package (TDP)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Compliance Projects"
                                    },
                                    "Description": {
                                        "val": "Environmental projects enable compliance with requirements as defined in law under Uniform National Discharge Standards (UNDS) and Environmental Protection Agency (EPA) emissions standards.   The EPA reviews the UNDS Code of Federal Regulations (CFR) language in five year increments separated into three batches (types of discharge).  This is an ongoing assessment of statutory language which may or may not result in material solution change."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.126"
                                            },
                                            "Text": {
                                                "val": "- Completed feasibility study for the Marine Sanitation Device (MSD) Mobile Test Facility.\n- Continuation of Oily Water Separator (OWS) comparative analysis initiated in FY15.\n- Completed operational requirements draft for clean ballast water study."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.127"
                                            },
                                            "Text": {
                                                "val": "Funding to continue identification of Environmental Compliance Technologies IAW evolving statutory and regulatory requirements. Support from Navy UNDS experts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.055"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.055"
                                            },
                                            "Text": {
                                                "val": "- Funding to continue identification of Environmental Compliance Technologies IAW evolving statutory and regulatory requirements.\n- Continue MSD shipboard test and evaluation. \n- Continue OWS requirement and capability analysis. \n- Continue Clean Ballast Water requirement and capability analysis."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Watercraft Module Support System (AWMSS) formerly (AWMB)"
                                    },
                                    "Description": {
                                        "val": "Accommodations for supercargo to support the soldier at sea."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.063"
                                            },
                                            "Text": {
                                                "val": "AWMSS prototype completion and safety improvements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energy Efficiency and Emissions Compliance"
                                    },
                                    "Description": {
                                        "val": "Energy efficiency and emission compliance of Army Watercraft explores emerging technologies to improve power consumption, conform with regulation, and reduce the environmental impact of Army Watercraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Completed the Preliminary Design Review (PDR) for the electrical redesign of the MWT that included batteries as well as the entire electrical system.  This informs the MWT SLEP and meets energy standards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.600"
                                            },
                                            "Text": {
                                                "val": "Energy Efficiency and Emissions Compliance: Electrical System Technology Development and Standardization Project (ESTDSP) Study Plan, Monthly Status Report, a Monthly In Progress Reviews, Reports and Other AAS\nDocumentation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "MA4501000 MODIFICATION KITS"
                                    },
                                    "Title": {
                                        "val": "MA4501000 MODIFICATION KITS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.912"
                                        },
                                        "CurrentYear": {
                                            "val": "6.276"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.018"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.018"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "7.864"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.343"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.463"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.874"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MA4502000 INSTALLATION OF MODS"
                                    },
                                    "Title": {
                                        "val": "MA4502000 INSTALLATION OF MODIFICATIONS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.393"
                                        },
                                        "CurrentYear": {
                                            "val": "7.006"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.263"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.263"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.246"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.839"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.914"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.020"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "M11101000 Army Watercraft Esp"
                                    },
                                    "Title": {
                                        "val": "M11101000 Army Watercraft Esp"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "39.772"
                                        },
                                        "CurrentYear": {
                                            "val": "21.860"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.110"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.110"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "41.465"
                                        },
                                        "BudgetYearThree": {
                                            "val": "42.237"
                                        },
                                        "BudgetYearFour": {
                                            "val": "63.130"
                                        },
                                        "BudgetYearFive": {
                                            "val": "43.630"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "ML5355 ITEMS LESS THAN $5.0M"
                                    },
                                    "Title": {
                                        "val": "ML5355 ITEMS LESS THAN $5.0M (FLOAT RAIL)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.835"
                                        },
                                        "CurrentYear": {
                                            "val": "1.967"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.877"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.877"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.927"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.974"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.487"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.510"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "FY16 Significant Achievements:\n-Flexor Study awarded July 16\n-AWMSS - Safety updates complete\n-Completed 75% of MWT electrical redesign and developed TDP for 1 of 9 MWT modules"
                        },
                        "AcquisitionStrategy": {
                            "val": "Leverage government and public research centers (TARDEC and Naval Surface Warfare Center (NSWC) Philadelphia) and known public research institutes (Battelle) along with associated contract mechanisms to prototype, test, and evaluate component technologies that may be applicable to the current and future Army Watercraft fleet."
                        },
                        "PerformanceMetrics": {
                            "val": "-Integrated Master Schedule (IMS) whereby cost, schedule, and performance including critical path can be measured.  \n-Technical Reviews with entrance and exit criteria.\n-Deliverables:  \n  •\tdrawings\n  •\ttest data and test reports\n  •\tstudies and analytical reports\n  •\tfinal project reports"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EW8"
                    },
                    "ProjectTitle": {
                        "val": "Armored Engineer Vehicles"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "12.200"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.200"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Joint Assault Bridge (JAB) was funded under PR 654804\/H02 in FY17 and prior."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports live fire test and evaluation, initial operational test and evaluation and production qualification testing of the Joint Assault Bridge (JAB).  This project also funds efforts to upgrade and modernize the Assault Bridging Management portfolio through the development of new systems and enhancement of existing systems such as the M9 Armored Combat Earthmover (ACE) replacement."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Assault Bridge Testing"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.200"
                                            },
                                            "Text": {
                                                "val": "Funding supports live fire test and evaluation, initial operational test and evaluation and production qualification testing of the Joint Assault Bridge (JAB)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WTCV, GZ3001"
                                    },
                                    "Title": {
                                        "val": "Joint Assault Bridge"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "33.455"
                                        },
                                        "CurrentYear": {
                                            "val": "64.752"
                                        },
                                        "BudgetYearOne": {
                                            "val": "128.350"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "128.350"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "165.936"
                                        },
                                        "BudgetYearThree": {
                                            "val": "207.660"
                                        },
                                        "BudgetYearFour": {
                                            "val": "212.783"
                                        },
                                        "BudgetYearFive": {
                                            "val": "263.068"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "RDT&E efforts to support testing and follow-on production for Assault Bridging."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.600"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Initial Operational Test & Evaluation (IOTE)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Operational Test Command"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Hood, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.693"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.693"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.693"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Developmental Testing & Operational Testing (DT \/ OT)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Proving Grounds"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.407"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.407"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.407"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Production Qualification Testing (PQT)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aberdeen Proving Grounds"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.500"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.000"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "160773-8.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Joint Assault Bridge Development & Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Life Fire Test & Eval Armor Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Milestone \"C\""
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Low Rate Initial Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Critical Design Review"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Life Fire Test & Eval"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Production Qualification Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Developmental Test \/ Operational Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Test & Eval"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G11"
                    },
                    "ProjectTitle": {
                        "val": "Adv Elec Energy Con Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.525"
                        },
                        "CurrentYear": {
                            "val": "6.166"
                        },
                        "BudgetYearOne": {
                            "val": "6.524"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.524"
                        },
                        "BudgetYearTwo": {
                            "val": "8.183"
                        },
                        "BudgetYearThree": {
                            "val": "8.338"
                        },
                        "BudgetYearFour": {
                            "val": "7.822"
                        },
                        "BudgetYearFive": {
                            "val": "8.040"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Management and Distribution Control (MDC) was previously named Improved Power Distribution Illumination Systems Electrical (IPDISE)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Tactical Electric Power (TEP) program was established by the Department of Defense to develop modernized, standard families of mobile electric power sources and power distribution systems for all Services throughout the Department of Defense.  Project Manager Expeditionary Energy & Sustainment Systems (PM E2S2) derives concept and technology developments that will improve the performance, mobility, readiness and survivability of the next generation of tactical power sources in support of all Services.  It supports initiatives that are essential to the development and fielding of modernized TEP sources from Watts to Megawatts level that comply with environmental statues and provide noise and signature-suppressed, energy-efficient, lightweight, deployable and reliable equipment.  FY18 funding will support test and evaluation of technologies for Small Tactical Electric Power (STEP), Platoon Power Generation (PPG), Mobile Electric Hybrid Power Sources (MEHPS), and Management and Distribution Control (MDC).  Also, funding will support a holistic Modeling and Simulation approach to the evaluation of Operational Energy (OE)-related impacts, systems, and improvements; with the vision of reducing Army energy dependency and demand, increasing systems and contingency bases energy efficiency, seeking alternative energy sources and supporting a culture of energy responsibility while sustaining or enhancing operational capabilities.  This includes support of the Joint Operational Energy Initiative (JOEI).  Out years will support investigation of general advancements in engine, power equipment, energy storage, renewable\/alternative energy, and power distribution equipment that are applicable to current equipment and emerging requirements.  In addition, an extensive analysis of commercial generator technology is planned to support requirements definition for the next family of tactical sets.  Programs include costs for developing concept hardware and executing system evaluations at the Network Integration Evaluation (NIE) events at Ft. Bliss."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Contract Activity"
                                    },
                                    "Description": {
                                        "val": "Continue development of technology supporting the STEP program, MDC, and MEHPS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.525"
                                            },
                                            "Text": {
                                                "val": "Developed various technologies related to TEP and power distribution\/management across the DoD power spectrum. Specific efforts included STEP components, PPG prototypes, MEHPS components and MDC. Developed tools, systems and capability to provide holistic Modeling and Simulation (M&S) analysis of Operational Energy impacts, systems and potential improvements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.066"
                                            },
                                            "Text": {
                                                "val": "Develop various technologies related to TEP and power distribution\/management across the DoD power spectrum.  Specific efforts will include demo of metering and monitoring systems, energy storage and inverter systems, and MDC. Develop tools, systems and capability to provide holistic M&S analysis of Operational Energy impacts, systems and improvements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.524"
                                            },
                                            "Text": {
                                                "val": "Develop various technologies related to TEP and power distribution\/management across the DoD power spectrum. Specific efforts will include demo of metering and monitoring systems, energy storage and inverter systems, and MDC. Develop tools, systems and capability to provide holistic M&S analysis of Operational Energy, and support customer\/stakeholder analysis to inform key Science and Technology (S&T), Acquisition, and Requirements Development decision making."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government System Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Supports in house and external performance tests of concept hardware. Also supports evaluation of systems at Network Integration Evaluation (NIE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Evaluated and tested various technologies related to tactical electric power and power distribution and management across the DoD power spectrum. Efforts were aimed at resolving technology gaps to meet Army User requirements. Specific efforts included fabrication and performance testing of small generator sets, integration of generators with hybrid\/alternative energy power sources, and intelligent power distribution\/management systems. Program also supported Type Classification efforts for improved Command Post infrastructure. Program supported new equipment and concept demonstrations at NIE 16.2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation and testing of various technologies related to tactical electric power and power distribution and management across the DoD power spectrum.  Efforts will be aimed at resolving technology gaps to meet Army User requirements.  Efforts will support the TEP Capabilities Production Document (CPD).  Specific efforts will include performance testing of hybrid\/alternative energy power sources, open standards grid communications, small power sources, and intelligent power distribution\/management systems.  Program supports new equipment and concept demonstrations at NIE 17.2."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation and testing of various technologies related to tactical electric power and power distribution and management across the DoD power spectrum. Efforts will be aimed at resolving technology gaps to meet Army User requirements. Efforts will support the TEP CPD. Specific efforts will include performance testing of hybrid\/alternative energy power sources, open standards grid communications, and intelligent power distribution\/management systems. Program supports new equipment and concept demonstrations at NIE 18.2."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Other Contracts and Government agencies"
                                    },
                                    "Description": {
                                        "val": "Matrix engineering and analysis support for continued development of technology supporting the STEP program, MDC, and MEHP, as well as analysis and data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Prepared analysis of various technologies related to tactical electric power and power distribution and management across the DoD power spectrum.  Specific efforts included performance testing of small generator sets, hybrid\/alternative energy power sources, and intelligent power distribution\/management systems. Program also supported Type Classification efforts for improved Command Post infrastructure. Program supported new equipment and concept demonstrations at NIE 16.2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation and testing of various technologies related to tactical electric power and power distribution and management across the DoD power spectrum.  Efforts will be aimed at resolving technology gaps to meet Army User requirements.  Efforts will support the TEP CPD.  Specific efforts will include contract management and testing of small generator sets, hybrid\/alternative energy power sources, and power distribution\/management systems.  Program supports new equipment and concept demonstrations at NIE 17.2. Includes oversight, analysis and management of Operational Energy-related impacts, systems and improvements to reduce Army's energy dependence and improve operational capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation and testing of various technologies related to tactical electric power and power distribution and management across the DoD power spectrum. Efforts will be aimed at resolving technology gaps to meet Army User requirements. Efforts will support the TEP CPD. Specific efforts will include contract management and testing of hybrid\/ alternative energy power sources and power distribution\/management systems. Program supports new equipment and concept demonstrations at NIE 17.2. Includes oversight, analysis and management of Operational Energy-related impacts, systems and improvements to reduce Army's energy dependence and improve operational capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management"
                                    },
                                    "Description": {
                                        "val": "Continue development of technology supporting the STEP program, MDC and MEHPS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Provided oversight and management of various technology projects related to Tactical Electric Power and power distribution\/management across the DoD power spectrum. Efforts were aimed at resolving technology gaps to meet Army User requirements. Efforts supported the STEP and PPG programs and the TEP Capabilities Production Document (CPD).  Specific efforts included development of small sets, MEHPS and intelligent power systems. Provided oversight, analysis and management of Operational Energy-related impacts, systems and improvements to reduce Army's energy dependence and improved operational capabilities.  Supported Type Classification of AMMPS microgrid and power distribution components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Oversight and management of various technology projects related to Tactical Electric Power and power distribution\/management across the DoD power spectrum.  Efforts will be aimed at resolving technology gaps to meet Army User requirements.  Efforts will support the TEP CPD.  Specific efforts will include support of MEHPS, STEP, and power MDC systems.  Oversight, analysis and management of Operational Energy-related impacts, systems and improvements to reduce Army's energy dependence and improve operational capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "Oversight and management of various technology projects related to Tactical Electric Power and power distribution\/management across the DoD power spectrum. Efforts will be aimed at resolving technology gaps to meet Army User requirements. Efforts will support the TEP Capabilities Production Document (CPD).  Specific efforts will include support of MEHPS, and power MDC systems. Oversight, analysis and management of Operational Energy-related impacts, systems and improvements to reduce Army's energy dependence and improve operational capabilities."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "654804.194"
                                    },
                                    "Title": {
                                        "val": "Logistics and Engineer Equipment - Eng Dev 194"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.257"
                                        },
                                        "CurrentYear": {
                                            "val": "13.676"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.890"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.890"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.689"
                                        },
                                        "BudgetYearThree": {
                                            "val": "8.099"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.588"
                                        },
                                        "BudgetYearFive": {
                                            "val": "8.449"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MA9800"
                                    },
                                    "Title": {
                                        "val": "OPA 3,  Generators and Associated Eq. MA9800"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "97.154"
                                        },
                                        "CurrentYear": {
                                            "val": "145.027"
                                        },
                                        "BudgetYearOne": {
                                            "val": "116.204"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "115.635"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "0.569"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "128.610"
                                        },
                                        "BudgetYearThree": {
                                            "val": "127.262"
                                        },
                                        "BudgetYearFour": {
                                            "val": "127.148"
                                        },
                                        "BudgetYearFive": {
                                            "val": "130.781"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete advanced development pre-milestone B technology assessments and analysis, and transition products to Engineering and Manufacturing Development (EMD) phase (Milestone B) and subsequent transition to production (Milestone C). Support concept development and demonstration efforts. Products and technologies supported include tactical power and energy sources, alternative\/renewable energy systems, power distribution components, and power management and distribution control systems.  Provide analysis of Operational Energy related impacts to future development programs across RDECOM."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "G14"
                    },
                    "ProjectTitle": {
                        "val": "Materials Handling Equipment - Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.137"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports component development and Material Handling Equipment (MHE) prototyping and stays abreast of emerging and available technologies to be integrated into military MHE to address identified capability gaps and warfighter objectives.  This project enables the development of selected technologies and transition to system integration and development or production of MHE products.  MHE includes 5K Light Capability Rough Terrain Forklifts (LCRTF), Rough Terrain Container Handlers (RTCH) and Cranes, as well as ancillary MHE equipment, to support distribution of critical supplies in the theater of operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Engineering\/Program Management Support"
                                    },
                                    "Description": {
                                        "val": "Research and integrate technologies to enhance operations of Material Handling Equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.137"
                                            },
                                            "Text": {
                                                "val": "Researched and integrated technologies to enhance operations of Material Handling Equipment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "5K LCRTF G41002"
                                    },
                                    "Title": {
                                        "val": "5K Light Capacity Rough Terrain (LCRT) Forklift G41002"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.982"
                                        },
                                        "CurrentYear": {
                                            "val": "3.153"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "17.937"
                                        },
                                        "BudgetYearThree": {
                                            "val": "18.297"
                                        },
                                        "BudgetYearFour": {
                                            "val": "19.721"
                                        },
                                        "BudgetYearFive": {
                                            "val": "20.345"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Procure prototype component items for engineering tests and demonstrations with subject matter experts.  Conduct trades between cost and improved maintainability and environmental risk reduction.  Process engineering change proposals, update technical manuals and training materials, and prepare supporting acquisition documents and data to procure new training aids. Develop additional capabilities for existing systems such as the 5K Light Capability Rough Terrain Forklifts, Rough Terrain  Container Handler, and All Terrain Lifting Army System which will allow for improved safety, autonomous or semi automonous operation.  Award contracts with vehicle or Autonomus System Developer\/TARDEC Robotics to integrate existing technologies onto the platforms to allow for ease of operation or removal of the operator from vehicle.  Testing will be conducted at Aberdeen Proving Grounds, MD."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K39"
                    },
                    "ProjectTitle": {
                        "val": "Field Sustainment Support Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.800"
                        },
                        "CurrentYear": {
                            "val": "2.629"
                        },
                        "BudgetYearOne": {
                            "val": "2.429"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.429"
                        },
                        "BudgetYearTwo": {
                            "val": "2.507"
                        },
                        "BudgetYearThree": {
                            "val": "1.868"
                        },
                        "BudgetYearFour": {
                            "val": "1.917"
                        },
                        "BudgetYearFive": {
                            "val": "1.975"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports development of critical soldier support and sustainment systems for cargo aerial delivery capabilities. These systems will fill identified theater distribution and services capability gaps, improve unit sustainability, and increase combat effectiveness. This project supports Advanced Component Development and Prototyping of Critical Distribution Capabilities which provide improved safety and accuracy while increasing survivability of aircraft, personnel, and equipment. This project develops critical enablers that support the Quartermaster (QM) Force Transformation Strategy and The Army's Modular Capabilities by maintaining readiness through fielding and integrating new equipment. This project also ensures Army Expeditionary Forces are capable of rapid deployment through aerial delivery initiatives and reduces sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands in lift, combat zone footprint, and costs for logistical support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Extracted High and Low Speed Container Delivery System (EHLSCDS)"
                                    },
                                    "Description": {
                                        "val": "Provides a high speed (230 knot), low altitude (375 ft AGL) capability for up to eight Container Delivery Systems (CDS) to enhance aircraft and aircrew survivability and safety while improving accuracy and reducing dispersion for receiving ground units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "Completed EHLSCDS Design Validation (DV) testing, completed Milestone B and transitioned program into Engineering and Manufacturing Development (EMD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sustainment Aerial Delivery Equipment Helicopter Attachment Unassisted Load-Hook Up (SADE HAUL-UP)"
                                    },
                                    "Description": {
                                        "val": "Provides a safe hookup of cargo loads transported under helicopters for resupply and transportation purposes.  SADE HAUL-UP will eliminate the requirement for personnel to be positioned between the hovering helicopter and the load in dynamic operational conditions in order to physically attach the load, enhancing safety of the sling load operation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.229"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced component prototype design & fabrication on SADE Autoload Hookup with focus on reducing technology, engineering, integration, and life-cycle cost risk. Begin technology development demonstrations on prototype systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Precision Airdrop System-2K Block 1 Upgrade (JPADS-BLK1)"
                                    },
                                    "Description": {
                                        "val": "Supports increasing the technological and design maturity, testing, and integration of several key initiatives focused on: maintaining system accuracy and reliability in Global Positioning System (GPS) denied environments; collision avoidance; more precise position determination software; and improved Guidance Navigation and Control (GN&C) hardware."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced component prototype design & fabrication on JPADS-2K Block 1 upgrade solutions with focus on reducing technology, engineering, integration, and life-cycle cost risk. Conduct technology development demonstrations to determine if identified JPADS-2K Block 1 upgrade solutions are feasible, affordable, and supportable; satisfy validated capability requirements; and have acceptable technical risk."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Rigging and DeRigging Airdrop System (RRDAS)"
                                    },
                                    "Description": {
                                        "val": "Reduces rigging times while also providing the capability to rapidly de-rig loads on the drop zone. This will reduce the lead time to prepare LVADS loads while also increasing the survivability of receiving ground forces by ensuring the airdrop loads (to include weapon systems, prime movers, trailers, etc.) are quickly de-rigged and made operational."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Conduct market research with a focus on acquiring advanced component prototype designs with a goal of reducing technology, engineering, integration and life cycle risk. Begin technology development demonstration on prototype systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Low Velocity Airdrop System (ALVADS) - Light and Heavy\/ Dual Row Airdrop System (DRAS) Application"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.679"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.679"
                                            },
                                            "Text": {
                                                "val": "Conduct DRAS developmental prototype testing to establish ALVADS DRAS configuration."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPA MA7806"
                                    },
                                    "Title": {
                                        "val": "Precision Airdrop MA7806"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.291"
                                        },
                                        "CurrentYear": {
                                            "val": "4.298"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.147"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.147"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.178"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.219"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.282"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.348"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654804.L39"
                                    },
                                    "Title": {
                                        "val": "Field Sustainment Support ED 654804.L39"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.552"
                                        },
                                        "CurrentYear": {
                                            "val": "3.712"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.147"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.147"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.247"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.009"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.088"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.183"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Conduct pre Engineering and Manufacturing Development (EMD) advanced component development to reduce risk prior to entering EMD phase."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K41"
                    },
                    "ProjectTitle": {
                        "val": "Water And Petroleum Distribution - Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.615"
                        },
                        "CurrentYear": {
                            "val": "3.662"
                        },
                        "BudgetYearOne": {
                            "val": "4.773"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.773"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates the potential of prototype equipment and technologies to satisfy petroleum storage, distribution, and quality surveillance system requirements.  The Technology Development programs support the development and enhancement of rapidly deployable Petroleum and Water equipment.  The mission includes developing fuel quality analysis systems; achieving greater capabilities in the removal of Nuclear, Biological, Chemical (NBC) and other contaminants from water sources; reducing the logistics footprint; alternative source water acquisition, reutilization and disposal systems to reduce the requirement for transport of water into the theater; water purification and waste water treatment and material systems to decrease the logistics footprint and employment time for the transfer of liquid logistics in joint operations area.  This vital equipment enables the Army to achieve its mission by providing the Army with the means to be highly mobile and self-sustaining in very hostile joint operations areas.  Future Force operations demand that combat systems be rapidly deployable to the theater, rapidly emplaced upon arrival, and rapidly relocated to support a fast moving non-linear battlefield."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "3K Tactical Water Purification System (3K TWPS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.565"
                                            },
                                            "Text": {
                                                "val": "Completed detailed system design and prepared Milestone B program documentation and analysis.  Prepared for Preliminary Design Review (PDR).  Conducted detailed technical review of piping and instrumentation design in preparation for PDR. Fabricated ISO structure and prepared for test. Conducted freshwater and saltwater testing of breadboard system to validate component design."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.635"
                                            },
                                            "Text": {
                                                "val": "Complete system design and development leading to Critical Design Review (CDR).  Program Design Review (PDR) 3Qtr shelter test and achieve Milestone B."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.788"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.788"
                                            },
                                            "Text": {
                                                "val": "Conduct Critical Design Review.  Build prototype and begin Technical Data Package (TDP) development. Test Readiness Review."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Early Entry Fluid Distribution System (E2FDS)"
                                    },
                                    "Description": {
                                        "val": "The Early Entry Fluid Distribution System (E2FDS) is a rapidly emplaced, high-throughput petroleum distribution conduit system.  The E2FDS consists of 5-mile systems that can be connected to each other to form a pipeline trace up to 50 miles long.  It can throughput 850,000 gallons of petroleum or 650,000 gallons of raw\/non-potable water per day.  E2FDS is emplacement at a rate of 25 miles per day and retrieved at a rate of 10 miles per day.  The components are configured in stackable International Standards Organization (ISO) twenty foot equivalent units (TEU) for deployment and is Heavy Expanded Mobility Tactical Truck-Load Handling System (HEMTT-LHS), Palletized Load System (PLS) and PLS Trailer transportable.  It includes a Command and Control Module (C2M) that allows for central control of the pipeline trace from a single location.  The E2FDS complements the Inland Petroleum Distribution System (IPDS) by adding an early entry capability as well as a means for rapidly extending existing pipeline."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.050"
                                            },
                                            "Text": {
                                                "val": "Conducted Source Selection Evaluation Board. Awarded of EMD contract."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.027"
                                            },
                                            "Text": {
                                                "val": "Award Increment 2 of EMD contract and conduct Program Design Review (PDR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.985"
                                            },
                                            "Text": {
                                                "val": "Perform Developmental Testing (DT) on the E2FDS non-developmental components including the pump stations, employment and retrieval system and hose segments.  Development of Technical Manual (TM)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "PM PAWS Project L41 654804"
                                    },
                                    "Title": {
                                        "val": "Logistics and Engineer Equipment - Engineering Development L41"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.228"
                                        },
                                        "CurrentYear": {
                                            "val": "8.363"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.005"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.005"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "14.468"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.510"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.581"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.697"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Distribution Sys Petroleum & Water"
                                    },
                                    "Title": {
                                        "val": "Distribution Systems Petroleum & Water MA6000"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.381"
                                        },
                                        "CurrentYear": {
                                            "val": "120.896"
                                        },
                                        "BudgetYearOne": {
                                            "val": "47.597"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "47.597"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "49.027"
                                        },
                                        "BudgetYearThree": {
                                            "val": "52.589"
                                        },
                                        "BudgetYearFour": {
                                            "val": "46.825"
                                        },
                                        "BudgetYearFive": {
                                            "val": "36.885"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Quality Surveillance Equipment"
                                    },
                                    "Title": {
                                        "val": "Petroleum Quality Analysis System R67500"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.368"
                                        },
                                        "CurrentYear": {
                                            "val": "9.287"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.903"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.903"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.670"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "28.228"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Develop engineering prototypes for the 3K Tactical Water Purification System (3K TWPS), Army Fuels Automated Management System (AFAMS), and select Non-Development Item (NDI) based on market surveys and proposals from industry.  Based on market research a decision to award a competitive or sole source contract.  E2FDS will conduct Developmental Testing (DT) and will test data to inform a fair opportunity decision for production. Army Fuels Automated Management System (AFAMS) sensors will require the development and testing of self-reporting sensors for all fuel storage tanks."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VR8"
                    },
                    "ProjectTitle": {
                        "val": "Combat Service Support Systems - Ad"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.749"
                        },
                        "CurrentYear": {
                            "val": "4.401"
                        },
                        "BudgetYearOne": {
                            "val": "5.062"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.062"
                        },
                        "BudgetYearTwo": {
                            "val": "3.769"
                        },
                        "BudgetYearThree": {
                            "val": "4.009"
                        },
                        "BudgetYearFour": {
                            "val": "3.684"
                        },
                        "BudgetYearFive": {
                            "val": "3.161"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports development of critical soldier support and sustainment systems including shelter systems (rigid and soft wall), base camp subsystems, field service systems, mortuary affairs equipment, heaters, camouflage systems to counter emerging enemy threat technologies, and other combat service support equipment. These systems will fill identified theater distribution and services capability gaps, improve unit sustainability, improve resource and energy efficiency and increase combat effectiveness. This project supports Advanced Component Development and Prototyping of critical tactical support systems that support mobile Joint Service command and control, medical, and maintenance platforms. This project develops critical enablers that support the Quartermaster (QM) Force Transformation Strategy and The Army's Modular Capabilities by maintaining readiness through fielding and integrating new equipment. This project also ensures Army Expeditionary Forces are capable of rapid deployment and reduces sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands in lift, combat zone footprint, and costs for logistical support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Energy Efficiency Solutions and Zero-Footprint Base Camp"
                                    },
                                    "Description": {
                                        "val": "Zero-Footprint Base Camp reduces the operational energy and logistics footprint of the expeditionary base camp system, with the goal being a significant reduction in fuel, water, and power requirements to sustain operations in the field in addition to reducing site preparation, maintenance, and spare parts requirements. Operating a base camp such as Force Provider requires a significant amount of logistics support and also produces an enormous amount of by products, both of which cost money, human effort (that means a risk in the form of soldiers on the road), and represents a potential vulnerability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.041"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluation and demonstration of novel resource and operational energy saving technologies with focus on producing suitable technology demonstration prototypes and reducing technical risk. Identified promising technologies related to energy-efficient shelter systems transitioning from the Sustainability, Logistics Basing Science and Technology Objective Demonstration (SLB-STO-D) and integrated and evaluated them at the FT Devens Base Camp Integration Laboratory (BCIL).  Transitioned promising Zero-Footprint Base Camp technologies related to environmental control, micro-grids, and efficient appliances into Engineering and Manufacturing Development (EMD) supporting Force Provider requirements and Office of the Secretary of Defense (OSD) Joint Expeditionary Basing Work Group initiatives. These efforts compliment improved shelter and subsystem efficiencies significantly reducing the fuel and resource demand on base camp operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.497"
                                            },
                                            "Text": {
                                                "val": "Conduct evaluation of integrated technologies that are transitioning from the RDECOM 6.3 programs in a realistic operating environment at the Ft Devens Base Camp Integration Laboratory (BCIL). Efforts are focused on proving out subsystem maturity and the potential of these technologies before transitioning into Engineering and Manufacturing Development (EMD) and putting them into operational use within the Army Force Provider base camps as Pre-Planned Product Improvements (P3I). Focus will be on evaluating technologies that will improve upon the environmental, resource, and energy efficiency performance of the base camp. Specifically,  evaluate technologies transitioning from the Sustainability, Logistics Basing Science and Technology Objective Demonstration (SLB-STO-D).  Prepare promising Zero-Footprint Base Camp technologies for transition into Engineering and Manufacturing Development (EMD) supporting Force Provider requirements and OSD Joint Expeditionary Basing Work Group initiatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.954"
                                            },
                                            "Text": {
                                                "val": "Conduct evaluation of integrated technologies that are transitioning from the RDECOM 6.3 programs in a realistic operating environment at the Ft Devens Base Camp Integration Laboratory (BCIL). Efforts are focused on proving out subsystem maturity and the potential of these technologies before transitioning into Engineering and Manufacturing Development (EMD) and putting them into operational use within the Army Force Provider base camps as Pre-Planned Product Improvements (P31). Focus will be on evaluating technologies that will improve upon the environmental, resource, and energy efficiency performance of the base camp. Specifically, evaluate technologies in the areas of: resource and energy efficiency; renewable energy collection and storage; and smart base camp monitoring transitioning from the RDECOM 6.3 programs. Prepare promising technologies for transition into EMD supporting Force Provider requirements and OSD Joint Expeditionary Basing Work Group initiatives."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Black Waste Elimination for Small Base Camps (150 personnel)"
                                    },
                                    "Description": {
                                        "val": "Provides the capability to reduce\/eliminate the black water generated by small base camps. The objective capability will reduce our sustainment requirements for backhauling black waste water as well as our risk of contaminating the environment with biological contaminants. This capability will significantly reduce reliance on external support and is a key capability required to move toward zero footprint base camps."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.821"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.821"
                                            },
                                            "Text": {
                                                "val": "Award contract to fabricate an integrated prototype that incorporates promising black waste elimination technologies that are transitioning from the RDECOM 6.3 program.  Conduct evaluation in a realistic operating environment at the Ft Devens Base Camp Integration Laboratory (BCIL).  Prepare for transition into Engineering and Manufacturing Development (EMD)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Solid Waste Disposal for Small Base Camps"
                                    },
                                    "Description": {
                                        "val": "Provides an integrated waste management (reduction, treatment or disposal process) add-on capability that can safely process 1,000 lbs or more of mixed solid waste in a single day on site. Mixed solid waste produced on a single 150 person site must be properly managed through reduction, reuse, recycling, treatment, or disposal. Most of the waste is nonhazardous solid waste. Provides a substantial improvement over the current practice of burn pits that poses a health risk to Soldiers and\/or the backhaul logistics burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.058"
                                            },
                                            "Text": {
                                                "val": "Prepared and awarded contract for prototype design and fabrication."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultralightweight Camouflage Net System (ULCANS)"
                                    },
                                    "Description": {
                                        "val": "ULCANS is durable, robust, snag resistant state of the art camouflage system that provides increased survivability against multi-spectral visual, infrared and radar threats, thermal signature suppression and significant thermal\/solar reduction capability. ULCANS utilizes a snag-free design and is capable of use in all types of weather and climatic conditions except in heavy snow and winds. ULCANS variants are integrated systems that are very lightweight, easily deployable, versatile, user friendly and tailored to the equipment meeting the requirements of operations for combat systems, command and control equipment, logistic support sites, tactical facilities, and fixed facilities. RDT&E funding supports formal development of new ULCANS variants (Arctic, Urban) and necessary technology\/signature enhancements for current ULCANS variants (Woodland and Desert)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.240"
                                            },
                                            "Text": {
                                                "val": "Completed evaluation\/demonstration of ULCANS technology enhancements in a realistic environment.  Obtained Headquarters Department of the Army (HQDA) approval of ULCANS Increment I Capability Development Document (CDD) to support development of new Arctic\/Urban variants and upgrades to existing Woodland\/Desert variants.  Initiated planning to support new development contract for ULCANS Increment I."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Initiate Milestone B documentation and prepare solicitation to support ULCANS development contract for Arctic\/Snow variant and technology enhancements to ULCANS Woodland\/Desert variants."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary Waste to Energy System"
                                    },
                                    "Description": {
                                        "val": "The Expeditionary Waste to Energy System reduces the operational energy and logistics footprint of the expeditionary base camp system, with the goal of providing an integrated waste management and disposal process add-on capability that can safely process up to two tons of mixed solid organic waste in a single day on site with the energy associated with the management process being converted to usable energy in the form of fuel, heat and\/or electric power. This capability will provide a safe and suitable means to dispose of waste in remote expeditionary base camps while reducing the fuel and power requirements to sustain operations in the field. This capability provides a substantial improvement over the current practice of burn pits and backhaul with associated vulnerabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.410"
                                            },
                                            "Text": {
                                                "val": "Conducted evaluation of integrated waste to energy technologies investigated under RDECOM 6.3 programs. Efforts focused on proving out maturity and the potential of these technologies for future development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.654"
                                            },
                                            "Text": {
                                                "val": "Complete evaluation of integrated waste to energy technologies. Prepare solicitation for development of prototypes for testing. Transition program into EMD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.553"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.553"
                                            },
                                            "Text": {
                                                "val": "Complete technology assessment and make down selection of alternatives for advanced development."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Standard Family of Rigid Wall Shelters (ASF-RWS)"
                                    },
                                    "Description": {
                                        "val": "The ASF-RWS is a formal development program to modernize the Army's Standard Family of Rigid Wall Shelters by incorporating the latest shelter technologies in composites, corrosion resistance, lighting and energy efficient materials.  The ASF-RWS Program supports four RWS families to develop approved Technical Data Packages (TDPs) for standard shelter procurements in support of materiel developers and program managers that require RWS to house their integrated systems.  The ASF-RWS program will help eliminate the need for PMs to pursue customized development of rigid wall shelters to support their individual systems.  ASF-RWS procurements are customer funded by PMs as a cost of their program.  The ASF-RWS program will provide improved performance and add-on capabilities for four RWS family variants (1) Vehicle Mounted Shelters (2) Expandable & Non-Expandable, (3) Collapsible & Panelized, and (4) Bicons and Tricons."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.734"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.734"
                                            },
                                            "Text": {
                                                "val": "Complete performance specification, solicitation, and release solicitation for  ASF-RWS Family of Expandable\/Non-Expandable ISO RWS Variants development contract.  Award development contract and procure test items for Family of Expandable\/Non-Expandable ISO RWS Variants."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDT&E 654804.VR7"
                                    },
                                    "Title": {
                                        "val": "Combat Service Support Systems - RDTE 654804 VR7"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.346"
                                        },
                                        "CurrentYear": {
                                            "val": "4.325"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.743"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.743"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.424"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.377"
                                        },
                                        "BudgetYearFour": {
                                            "val": "5.053"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.515"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Evaluate Integrated Technologies in a realistic operational environment and transition promising efforts into Engineering and Manufacturing Development (EMD). Accelerate Base Camp efficiency and safety initiatives to incorporate in deployed camps and\/or incorporate during reset of equipment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}