{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c43fbf6cbb750060d4e843075183a8e999b0dddb3a2f8fae77d834880adb92d8-22",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "166.411"
            },
            "PriorYear": {
                "val": "77.966"
            },
            "CurrentYear": {
                "val": "49.895"
            },
            "BudgetYearOne": {
                "val": "57.876"
            },
            "BudgetYearOneBase": {
                "val": "57.876"
            },
            "BudgetYearTwo": {
                "val": "48.037"
            },
            "BudgetYearThree": {
                "val": "48.092"
            },
            "BudgetYearFour": {
                "val": "47.695"
            },
            "BudgetYearFive": {
                "val": "49.038"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Emerging Capabilities Technology Development (ECTD) Program Element (PE) supports a focus throughout the Office of the Deputy Assistant Secretary of Defense for Emerging Capability & Prototyping (DASD(EC&P)) on producing risk-reducing proof-of-principle prototypes and demonstrations of emerging technologies coordinated through interagency and joint partnerships.  ECTD will support the Assistant Secretary of Defense for Research & Engineering (ASD(R&E)) under the mitigating new and emerging threats priority area with longer-term, mission-focused capability development that crosses functional domains to enhance Warfighter adaptability and resilience.  The office, in collaboration with government labs, academia, and industry will execute projects that target specific mission capability gaps identified by the Combatant Commands (COCOMs), the Joint Staff and senior leadership in the Office of the Secretary of Defense."
        },
        "ProgramElementMissionDescription": {
            "val": "The ECTD funding supports projects that reduce the technology risk of emerging capabilities by advancing proof-of-principle prototypes in support of near and mid-term operational engagements and stability operations.  The framework is guided by the ASD(R&E), DASD(EC&P), and the Rapid Reaction Technology Office's science and technology objectives and focus areas.  With an emphasis on interagency and joint partnerships, ECTD develops initiatives to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span one to three years, typically at a cost of less than $4.000 million, and are demonstrated and released in spirals within the project timeline.  The ECTD program focuses on rapid prototyping of emerging technologies, including electromagnetic spectrum-agile capability options; multi-domain, autonomous systems; counter-weapons of mass destruction; and dismounted soldier systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "40.949"
                },
                "CurrentYear": {
                    "val": "49.895"
                },
                "BudgetYearOne": {
                    "val": "29.903"
                },
                "BudgetYearOneBase": {
                    "val": "29.903"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "77.966"
                },
                "CurrentYear": {
                    "val": "49.895"
                },
                "BudgetYearOne": {
                    "val": "57.876"
                },
                "BudgetYearOneBase": {
                    "val": "57.876"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "37.017"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "27.973"
                },
                "BudgetYearOneBase": {
                    "val": "27.973"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "38.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.983"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Baseline adjustment High Energy Laser"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "18.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "18.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Baseline adjustment India Science & Technology transfer"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Internal Baseline Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.027"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2016 reprogramming entry of $38.000 million represents the net of $12.000 million for the Long Endurance Airborne Platform (LEAP) project to improve battlespace awareness in the U.S. Central Command (USCENTCOM) area of responsibility (AoR), $30.000 million to support the Missile Defeat Project to address operational needs in the U.S. Strategic Command (USSTRATCOM) and U.S. Pacific Command (USPACOM) AoRs, and a -$4.000 million below threshold reprogramming to Program Element 0603648D8Z to remunerate for funds extended to ECTD during 2016 on behalf of the Missile Defeat Project.\n\nThe FY 2018 baseline funding increase of $27.973 million reflects an increase of $18.000 million for High Energy Laser, $10.000 million for the baseline transfer of the India S&T program from Joint Capability Technology Development (Program Element 0603648D8Z), and a $0.027 million reduction to pay for higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "166.411"
                        },
                        "PriorYear": {
                            "val": "77.966"
                        },
                        "CurrentYear": {
                            "val": "49.895"
                        },
                        "BudgetYearOne": {
                            "val": "39.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "39.876"
                        },
                        "BudgetYearTwo": {
                            "val": "48.037"
                        },
                        "BudgetYearThree": {
                            "val": "48.092"
                        },
                        "BudgetYearFour": {
                            "val": "47.695"
                        },
                        "BudgetYearFive": {
                            "val": "49.038"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "ECTD funding supports projects that reduce technology risk for emerging capabilities by advancing proof-of-principle prototypes to support near and mid-term operations.  The framework is guided by the ASD(R&E), DASD(EC&P), and the Rapid Reaction Technology Office's science and technology objectives and focus areas.  ECTD projects cross functional domains to transition needed capabilities that enhance Warfighter adaptability and resilience.  With an emphasis on interagency and joint partnerships, ECTD develops initiatives to produce capability options that anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span one to three years, typically at a cost of less than $4.000 million, and are demonstrated and released in spirals within the project timeline.  The ECTD program focuses on rapid prototyping of emerging technologies in areas that include: electromagnetic spectrum-agile capability options; multi-domain, unmanned autonomous systems; counter-weapons of mass destruction capabilities; and, dismounted soldier systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Voidstar"
                                    },
                                    "Description": {
                                        "val": "This project will demonstrate and deliver advanced Electronic Warfare (EW) capabilities on proven, tactical software-defined radio (SDR) technology.  The capabilities and radio are vertically-scalable to operate on platforms with varying size, weight, and power (SWaP) constraints; and, horizontally-scalable to coherently operate across disparate platforms.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.775"
                                            },
                                            "Text": {
                                                "val": "This project was able to blindly detect, classify, geolocate, and recommend EW counter reactions to agile threat signals in non-real time using digital signal processing (DSP) and machine learning.  Further details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.545"
                                            },
                                            "Text": {
                                                "val": "Voidstar will improve the capability for tactical units to provide (near) real-time counters to threat signals.  When successful the Voidstar capability will transition to the Air Force.  Further details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Engagement Weapon (LREW)"
                                    },
                                    "Description": {
                                        "val": "This project will complete the engineering and design work required to assess a multi-role, long-range interceptor for maintaining air dominance.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "The LREW project initiated systems design and engineering tasks and began kill chain architecture investigation.  Further details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.500"
                                            },
                                            "Text": {
                                                "val": "LREW will complete systems design, engineering, and kill chain investigations in FY 2017.  When successful, LREW will transition to multiple Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Raven Flash"
                                    },
                                    "Description": {
                                        "val": "The Raven Flash project will develop and demonstrate an adaptable, agile Electronic Warfare capability.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.212"
                                            },
                                            "Text": {
                                                "val": "The project defined a system architecture and a development path from a known operational concept of operations.  It also established development partners roles, responsibilities, and contribution; and, initiated source materials optimization and commercialization of materials fabrication."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.330"
                                            },
                                            "Text": {
                                                "val": "The Raven Flash project will develop, characterize, and integrate source system components.  FY 2017 efforts will enhance and integrate measurement and analysis sub-systems.  Baseline effects testing against selected representative target classes will be conducted in accordance with established level-of-effect (LOE) metrics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.920"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.920"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 accomplishments, Raven Flash will conduct high-fidelity laboratory integration of component sub-systems and characterize selected target system(s) at a test range.  This effort will demonstrate a high-fidelity laboratory prototype against surrogate target system."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Composite Flywheel Energy Storage and Power System"
                                    },
                                    "Description": {
                                        "val": "This project will develop and demonstrate a composite flywheel energy storage and power system; and, evaluate its potential applications for underwater systems.  This project will demonstrate energy and power densities from a composite flywheel system that meet or exceed current unmanned underwater vehicle battery technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "The project constructed an advanced composite flywheel energy storage and power demonstration module.  Subsequent testing assessed energy harvesting, storage, supply, and recharge performance.  Using FY 2016 funding, developmental work continues in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Base Resilience Sensor"
                                    },
                                    "Description": {
                                        "val": "This project will develop an advanced sensor to enhance detection and tracking of threat systems while cueing engagements with defensive systems.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "The project completed systems design and engineering for an integrated sensor chip assembly (SCA) prototype.  The SCA performance was tested at expected operating temperatures to validate against performance requirements.  Deliverables included a SCA evaluation report to document project results.  Using FY 2016 funding, developmental work continues in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Product Architectures, Design, and Manufacturing for Operational Responsiveness"
                                    },
                                    "Description": {
                                        "val": "This project demonstrated manufacturing cost and schedule gains by tightly coupling product architectures with manufacturing and design tools.  Using adaptive manufacturing architectures and three dimensional printers this project iteratively designed, built, and tested a prototype unmanned aerial system (UAS) to demonstrate improvements over conventional manufacturing approaches.  The project allows for iterative prototyping through additive manufacturing to accelerate development by orders of magnitude.  The demonstration platform for this effort is a modular, rapidly designed, and reconfigurable UAS with modules built using additive manufacturing.  The project also includes a system level design tool that allows the user to configure a new vehicle, predict its performance, and automatically generate the flight control laws for a new configuration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "This project is a continuation of an effort initiated in FY 2014.  The project produced a prototype system and associated training materials for a structures design module.  Final measures of operational responsiveness and training metrics were provided.  The UAS architecture and the training materials are readily transferrable to operators for rapid design and deployment.  In addition, the products transitioned to Naval Air Systems Command for further toolset development.  The overarching adaptive design approach demonstrated with this UAS prototype was adopted by elements of the Joint Improvised-threat Defeat Agency (JIDA) and the U.S. Marines."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronic Warfare Laboratory"
                                    },
                                    "Description": {
                                        "val": "This project will develop an extensible Advanced Electronic Warfare Laboratory (AEWL) technical framework that can be replicated at multiple government facilities to support emerging blue force Electronic Warfare (EW) subsystem and system prototypes in a realistic electromagnetic spectrum (EMS) environment.  This effort includes the hardware and software implementation of the first instantiation of the AEWL technical framework."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.450"
                                            },
                                            "Text": {
                                                "val": "The project analyzed and selected final AEWL system requirements, hardware and software design parameters and specifications, and initiated procurement of some subsystem components.  Software emulation of a portion of the AEWL was completed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.354"
                                            },
                                            "Text": {
                                                "val": "Procurement of hardware components and subsystems will continue.  The transition partner will verify AEWL software and hardware subsystems’ performance and conduct acceptance testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.152"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.152"
                                            },
                                            "Text": {
                                                "val": "Final integration of the hardware subsystems and acceptance testing of the integrated AEWL will be completed.  Once operational, the initial instantiation of the AEWL will be transitioned to the U.S. Army for evaluation and use."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Data Link for Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "This project will develop and demonstrate an advanced datalink for Unmanned Aerial Systems (UAS).  This capability gives warfighters increased battlespace awareness through increasing the range of existing surveillance theater assets.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "The project designed, developed, and initiated procurement of the advanced data link subcomponents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "This project will complete integration and testing of the prototype culminating in a final demonstration.  The prototype will transition to the U.S. Navy for integration into currently fielded UAS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Communications Architecture for Unmanned Systems (JCAUS)"
                                    },
                                    "Description": {
                                        "val": "This project developed a communication architecture for joint unmanned systems and a prototype communications module to accelerate the transition of advanced communications technology to unmanned systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "The project developed technical specifications for the system requirements document and architecture system design document.  Hardware and software development, integration, and testing will continue into FY 2017 leading to a final system demonstration.  The developed architecture and communications module will transition to the Naval Sea Systems Command for integration into currently fielded and future joint unmanned ground systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forward Laser Acoustic InhibitoR (FLAIR)"
                                    },
                                    "Description": {
                                        "val": "This project developed and demonstrated a unique user-defined capability to significantly raise the acoustic background noise level in maritime environments.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.700"
                                            },
                                            "Text": {
                                                "val": "The project designed and developed a prototype system for demonstration in a relevant environment.  Details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Further integration and testing of the prototype will be completed.  FLAIR will transition to the U.S. Navy for further development.  Details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Reconfigurable Radar"
                                    },
                                    "Description": {
                                        "val": "This project developed a prototype software reconfigurable radar comprised of application specific software executed on a common hardware architecture based primarily on commercial-off-the-shelf components.  This project uses a modular, reconfigurable approach to hardware and software resulting in a multipurpose prototype, which reduces cost and development time of radar systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The project finalized system requirements based on a review of modern radar hardware system design and initiated procurement of system components.  Hardware and software integration and testing will continue into FY 2017 leading to a final system demonstration.  The demonstration results will be used to inform future joint Service program of record acquisition decisions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Endurance Airborne Platform (LEAP)"
                                    },
                                    "Description": {
                                        "val": "Long Endurance Airborne Platform (LEAP) provides a revolutionary, low-cost, low acoustic signature, and persistent aerial intelligence, surveillance, and reconnaissance (ISR) capability by converting a proven, fuel-efficient light sport aircraft into an unmanned aerial system (UAS).  LEAP addresses the operational need for improved battlespace awareness in the U. S. Central Command (USCENTCOM) area of responsibility (AoR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "In 2016, this project developed additional classified payload and communication capabilities for special forces operations and other counter insurgency requirements.  In addition, it increased platform endurance to extend range of operations and surveillance time beyond current Group 4 UAS capabilities.  Testing and evaluation of the LEAP system was conducted outside the U.S. under 24 x 7 combat operations conditions.  The project achieved objective vehicle cost, capability, and rapid reaction requirements.  The LEAP system transitioned to the U.S. Special Operations Command for sustained operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "X-Lab"
                                    },
                                    "Description": {
                                        "val": "X-Lab will develop a robust architecture to query numerous extremely large data sets and provide solutions to challenging problems.  Initial work focused on leveraging data sets to provide early indications of activities leading to a terrorist or state-sponsored attack.  X-Lab will develop and assess analytic methods and tools for finding and correlating multiple subtle signatures.  Early detection and warning of precursor activities can enable intervention, earlier localization of response, and earlier deployment of countermeasures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The X-Lab architecture was expanded to include access to additional live and archived classified and unclassified data sets to address challenging problems.  The X-Lab system demonstrated the first ever automated analysis of archived imagery and text data, and provided advance indications and warnings of a simulated attack in a demonstration for the Joint Staff and Joint Warfare Analysis Center (JWAC)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "The X-Lab architecture will be expanded to include access to more live and archived classified and unclassified data sets to increase applications and system performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "The X-Lab architecture will be expanded to include access to more live and archived classified and unclassified data sets to increase applications and system performance.  Additional demonstrations focused on other Combatant Command problem sets will be conducted using these expanded data sets.  When successful, the X-Lab capability will transition to JWAC in FY 2018."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Missile Defeat"
                                    },
                                    "Description": {
                                        "val": "The Missile Defeat effort will support the assessment and development of a suite of capabilities to address emergent strategic and tactical threats.  The effort meets strategic goals of the Office of the Under Secretary of Defense for Acquisition, Technology & Logistics (OUSD(AT&L)).  The Missile Defeat effort also addresses operational needs in the U.S. Strategic Command (USSTRATCOM) and U.S. Pacific Command (USPACOM) areas of responsibility (AoR).  Project details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.000"
                                            },
                                            "Text": {
                                                "val": "The Missile Defeat effort supported the development of the Missile Defeat Enterprise (MDE) and improved national response to specific threats in the USSTRATCOM and USPACOM AoRs by integrating DoD and intelligence community efforts.  This was a congressional special interest item.  Further details are at the classified level."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This project will transition to the new Program Element 0604132D8Z Missile Defeat Defense Technology Innovation for additional work in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Remote Weapon Station (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR)"
                                    },
                                    "Description": {
                                        "val": "The Remote Weapon Station (RWS) Auto Prioritization, Targeting, and Operator Cueing (RAPTOR) project will develop a prototype for a crew-served weapon system that will semi-autonomously detect, track, prioritize, and engage multiple targets with operator determination.  This is a joint effort in conjunction with representatives of the U.S. Army Armament Research, Development and Engineering Center (ARDEC), the Joint Non-Lethal Weapons Directorate (JNLWD), and the Office of Naval Research (ONR).  These partner organizations will provide subsystems critical for RAPTOR functionality.  The combined demonstration of multi-agency science and technology developments will serve to inform the Common Remotely Operated Weapon Station (CROWS) Program of Record.  RAPTOR will also inform the development of a Joint Advanced Weapon Sensor System (JAWSS) Capability Development Document (CDD)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "The project completed development of a crew-served, semi-autonomous Remote Weapon Station (RWS) capable of detecting, tracking, prioritizing, and engaging multiple targets.  The final demonstration of the RAPTOR system in a simulated quick-response defense scenario was conducted in September 2016.  In addition to the final demonstration, the RAPTOR system participated in four additional exercises with the U.S. Army Tank Automotive Research, Development, and Engineering Center (TARDEC).  The results of the FY 2016 demonstrations and exercises will inform a transition decision to the U.S. Army."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Defined Radio Frequency Test System (Seeker)"
                                    },
                                    "Description": {
                                        "val": "The Software Defined Radio Frequency (RF) Test System, known as Seeker, will develop a rapidly reconfigurable test infrastructure with multiple capabilities to address RF spectrum sharing, spectrum relocation, and emergent RF spectrum denial.  The Seeker project is focused on missile defeat.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.135"
                                            },
                                            "Text": {
                                                "val": "The project continued hardware and software integration and testing.  Two capability increments were completed with a demonstration conducted for each increment.  Hardware and software integration and testing will continue into FY 2017 leading to a final system demonstration."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "This demonstration venue examines and explores emerging technologies and prototypes via a series of technology demonstrations and other activities conducted by the Rapid Reaction Technology Office within the office of the Deputy Assistant Secretary of Defense for Emerging Capability & Prototyping.  Thunderstorm enhances interagency and international collaboration and provides the Department of Defense (DoD) and participating partners with an opportunity to evaluate and assess the capabilities of new and emerging technologies, primarily in the fields of air, space, and intelligence, surveillance, and reconnaissance (ISR).  In addition, Thunderstorm provides an opportunity for technology developers to interact with operational commands and other government personnel to determine how specific efforts and systems may support or enhance warfighter capability needs.  Technology developers are given the opportunity to demonstrate selected technologies in geographically and operationally relevant scenarios.  Thunderstorm demonstration objectives, performance measures, lessons learned, post-demonstration assessments, and data evaluation serve to inform future DoD technology investments and identify new capabilities and new ways to employ existing capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Focus areas for FY 2016 Thunderstorm spirals included arctic challenges, dense urban and subterranean warfare, and physical security of critical port facilities.  In FY 2016, Thunderstorm demonstrated 65 technologies during 3 events, including systems from 32 small businesses, and these events achieved cost avoidance to the DoD of $1.973 million.  In addition, 14 technologies were referred to operational partners for follow-up or potential acquisition.  Thunderstorm also completed a publications review in support of port security and assisted a maritime demonstration venue with evaluating counter unmanned undersea vehicles."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Three Thunderstorm spirals are planned for FY 2017, building on the experience garnered from previous spirals.  Focus areas will include the continuation of physical security of critical port facilities, dense urban and subterranean warfare, and other priorities identified through engagement with stakeholders.  A demonstration will be conducted in coordination with the Stiletto maritime demonstration platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Thunderstorm focus will continue to reflect the most exigent challenges to DoD and provide a venue to explore new and innovative technological solutions.  Focus areas will be based on need and priorities identified through engagement with stakeholders in the U.S. Navy, U.S. Coast Guard, U.S. Army, U.S. Marine Corps, U.S. Special Operations Command (USSOCOM), U.S. Southern Command (USSOUTHCOM), U.S. Central Command (USCENTCOM), the Intelligence Community, and other operational users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stiletto Maritime Demonstration Program"
                                    },
                                    "Description": {
                                        "val": "Stiletto is a maritime technology demonstration and assessment asset developed as an experimentation platform to examine and explore emerging technologies and proof-of-principle prototypes.  Stiletto supports a series of maritime technology demonstrations annually and other activities conducted by the Rapid Reaction Technology Office (RRTO) within the office of the Deputy Assistant Secretary of Defense for Emerging Capability & Prototyping (DASD(EC&P)).  The program is guided by focus areas identified by Combatant Commands, military Service organizations, other defense organizations, and interagency partners.  Stiletto includes an experimental, all carbon fiber 88-foot boat that serves as a maritime demonstration platform and associated tools, processes, and equipment to assist in the assessment and development of prototypes.  Stiletto supports the rapid transition of emerging technologies across the range of military operations, thereby increasing the speed of response to emerging threats.  The boat supports special operations forces, expeditionary forces, and interagency users by exploring the military utility of new capabilities and reducing the risk of emerging technologies and concepts of operation.  The Stiletto Maritime Demonstration Program offers a streamlined experimentation and demonstration process that encourages system developers to engage directly with the warfighter in the maritime environment to rapidly adapt technologies around operational needs.  The Stiletto vessel is home-ported in Norfolk, Virginia."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Focus areas for the Stiletto Maritime Demonstration Program in FY 2016 included maritime electro-optical and infrared surveillance; counter unmanned underwater vehicles (C-UUV); and, maritime intelligence, surveillance, and reconnaissance (ISR) from unmanned aerial vehicles.  In FY 2016, Stiletto demonstrated 68 technologies during 4 capability demonstrations, including systems from 20 small businesses, and achieved cost avoidance to the DoD of $4.025 million.  Individual vendors saved an average $37 thousand of development cost per demonstration and 31 new CRADAs were signed between vendors and the Stiletto team for long term technology development.  The Stiletto platform also supported U.S. Special Operations Command (USSOCOM) during Trident Spectre 16; the U.S. Marine Corps Warfighting Laboratory during the Unmanned Tactical Command demonstration at Quantico, Virginia; and, the Thunderstorm Spiral for physical security of critical port facilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue engagement with operational partners to determine urgent demonstration requirements for FY 2017.  Four capability demonstrations are planned for FY 2017, including combatant craft integrated bridge systems, maritime disablement, precision engagement, and maritime electronic intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue to focus on emerging capabilities and threats.  Engagement with stakeholders in the U.S. Navy, U.S. Coast Guard, U.S. Army, U.S. Marine Corps, USSOCOM, U.S. Southern Command (USSOUTHCOM), the intelligence community, and other operational users will identify needs and priorities to guide capability demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Domain Demonstrations"
                                    },
                                    "Description": {
                                        "val": "Multi-Domain Demonstrations leverage existing demonstration venues and sites across the military Services to evaluate emerging technologies and prototypes.  Individual demonstrations are selected in the execution year in response to identified Combatant Commands needs, emerging threats, and opportunities.  Multi-domain demonstrations focus on the integration of emerging capabilities across space, air, sea, and ground domains, with specific attention to the five key building blocks associated with the Third Offset Strategy.  Sponsored demonstrations provide an opportunity for small businesses and other non-traditional partners to assess emerging technologies through informal evaluations in realistic environments.  The results of these evaluations enable improvements to prototype systems, inform the procurement process for future enhanced capabilities, and alert operational users of capabilities in development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Demonstrations were conducted with the Joint Experimental Range Complex at Yuma Proving Grounds, Arizona, to evaluate low-cost, small business-oriented technologies in the area of hostile gunfire detection.  Documentation of more than 300 systems demonstrated since 2003 were consolidated in the Defense Technical Information Center (DTIC) database."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Multi-domain demonstrations in FY 2017 will continue to support the Office of the Deputy Assistant Secretary of Defense for Emerging Capability & Prototyping programs and DoD’s focus on developing a Third Offset Strategy.  Demonstrations will leverage existing venues across the military Services and DoD component organizations.  Other priorities will be identified through engagement with stakeholders."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Innovation Unit Experimental"
                                    },
                                    "Description": {
                                        "val": "Defense Innovation Unit Experimental (DIUx) supports the research, development, and evaluation of current state-of-the-art capabilities.  DIUx leverages the venture capital community to identify non-traditional companies with emerging commercially based technologies.  DIUx exercises all avenues to fund promising technologies, including merit-based prize competitions, incubator partnerships, and targeted R&D efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2016, the DIUx completed two projects focused on social media analysis and network security support.  A social media analysis project successfully piloted technology to highlight advances in machine learning algorithms and natural language processing that reduce analysis time through the use of automated content analysis, classification, categorization, and data visualization; and, enable improved human-to-machine interface and teaming.  The proof-of-concept pilot demonstrated how these tools could assist analysts in shortening decision cycles to more effectively support theater operations.  After the successful pilot DIUx transitioned the capability to U.S. Army Intelligence and Security Command.  A network security support project successfully evaluated the ability of web-based software and associated platform to improve situational awareness of networked systems.  The tool provided improved situational awareness, enhanced network monitoring, and management capabilities in support of specific mission critical applications.  DIUx demonstrated and transitioned the capability to support joint Service missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects"
                                    },
                                    "Description": {
                                        "val": "Emerging Capabilities Technology Development (ECTD) funds supported projects requiring less than one million dollars for execution.  ECTD selected, executed, and transitioned low cost projects in the areas of: autonomous vehicles; maritime irregular warfare capabilities; countering violent extremism; persistent surveillance; low-cost, small footprint operations; and, other emerging technology areas.  These projects delivered proof-of-principle prototypes for evaluation or assessment by warfighters and other interagency users."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.244"
                                            },
                                            "Text": {
                                                "val": "•Advanced Digital Radio Frequency Memory (DRFM):  Deliverables included a coherent countermeasures (CoCM) virtual prototype using photonic technology to achieve a wide operational bandwidth, fast frequency tuning, and wide instantaneous bandwidth.  Additionally, the prototype provided sophisticated digital signal processing and generation of advanced CoCM waveforms and techniques.  The advanced DRFM transitioned to Naval Air Systems Command for further development. \n•Unattended Sensor Radio:  A tactical mesh radio network optimized to achieve the best data transmission rates in congested and contested environments.  The radio network is also energy efficient for long endurance unattended ground sensor applications.  The radio transitioned to Marine Corps Systems Command (MCSC) for integration into a classified program.\n•Portable Combustor for Soldier Power:  This project demonstrated a prototype dismount portable, 30-watt solid state combustor that generates electricity from high energy density liquid fuels.  The portable combustor transitioned to Army Communications Electronics Research Development and Engineering Center for further development. \n•Handheld Detector Portable Training Kit:  The training kit is a portable, stand-alone training tool for any handheld counter-improvised explosive device (IED) and landmine detector using stereoscopic optical technology.  The tool transitioned to Marine Corps Systems Command and demonstrated immediate feedback to users to improve quality of manual counter-IED and landmine detection.\n•Electromagnetic Spectrum (EMS) Agility:  This project conducted research and development leading to prototypes of enabling technologies for dynamic radio frequency spectrum sharing by Defense Department systems.  Prototypes from this project transitioned to a range of users including Navy’s Joint Service Explosive Ordnance Disposal office and Marine Corps Systems Command.\n•Persistics Software Enhancement:  This project developed and delivered systems that automatically integrate and analyze open source imagery data to predict adversary behavior and track weapons of mass destruction in denied areas.  The capability transitioned to Pacific Command and Special Operations Command and further details are classified.\n•Infrasonic Signal Association:  This capability automatically integrates and analyzes available open source intelligence feeds to predict adversary behavior and track weapons of mass destruction in denied areas.  This project transitioned to the Army and further details are classified.\n•Terra Firma:  Terra Firma is an expeditious method to determine the load bearing capacity of unimproved and semi-prepared (tactical) landing zones.  Terra Firma transitioned to Air Force Special Operations Command. \n•United Nations (U.N.) Peacekeeping Operations (PKO) Technology: The U.S. Southern Command (USSOUTHCOM) provided guidance on the types of technologies that could be used in multi-nation stabilization missions and developed a test-bed for recommended technologies.  A pilot project demonstrated the utility of integrating proven DoD technologies to enhance multilateral peacekeeping operations, and improved DoD collaboration with the U.N. and other peacekeeping stakeholders.  U.N. PKO prototypes transitioned to deployed forces in the U.S. Southern Command and U.S. Central Command areas of responsibility.\n•Understanding Russian Social Media Influence:  This project provided information on key audiences of Russian propaganda and potentially influential actors that the U.S. and its allies can leverage to develop and execute a counter Russian propaganda strategy.  This project transitioned to the U.S. European Command."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Proof-of-Principle Prototyping"
                                    },
                                    "Description": {
                                        "val": "This project focuses on cost-effective, limited duration efforts to design, develop, and deliver prototypes of cutting-edge land, sea, undersea, air, and space systems.  This effort seeks to rapidly develop and demonstrate asymmetric capabilities that can help maintain the U.S. competitive advantage.  The project provides an affordable venue to innovate new capabilities and increase speed to market through proof-of-principle and virtual prototyping.  These prototypes will be delivered to Joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and multi-domain demonstration venues across the Department of Defense (DoD).  Knowledge and experience gained through these demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  Development of advanced prototypes will involve partnerships with industry, academia, and non-traditional DoD partners.  Advanced rapid prototyping provides a mechanism to maintain a competitive advantage, impose asymmetric strategic costs on potential adversaries, and explore innovative, technology-enabled military capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.950"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution to support DoD Research and Engineering Enterprise Strategic Priorities.  Projects will focus on cost-effective, mission-focused efforts to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force.  Focus areas for prototyping projects include force protection, lethality, autonomous learning systems, manned-unmanned combat teaming, assisted human operations, warfighter resilience, command & control, mobility, and electronic warfare."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution and will support DoD Research and Engineering Enterprise Strategic Priorities.  Projects will focus on cost-effective, mission-focused efforts to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force.  Focus areas for prototyping projects include force protection, lethality, autonomous learning systems, manned-unmanned combat teaming, assisted human operations, warfighter resilience, command & control, mobility, and electronic warfare."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Spectrum Agility Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area includes cost-effective, mission-focused projects to design, develop, and rapidly deliver new concepts and technology prototypes aimed at protecting DoD systems and extending capabilities across the electromagnetic spectrum.  In the U.S. and allied nations, Department of Defense (DoD) communication and sensing capabilities are increasingly compromised by spectrum congestion and loss, as is evidenced by the recent radio frequency (RF) spectrum auction and the spectrum relocation fund.  In other operational environments, emergent Electronic Warfare (EW) threats, technologies, and tactics contest the use of RF spectrum and erode U.S. capabilities in ways that are difficult to predict and counteract.  This focus area helps address the dual challenges of anti-access and area denial though spectrum agility that supports the Third Offset Strategy by allowing our forces to operate when and where they are needed.\n\nPrototypes from this focus area will address spectrum sharing, spectrum relocation, and spectrum competition requirements, and will be evaluated under the electromagnetic (EM) conditions expected at home and abroad.  Projects will anticipate emerging EW challenges and explore adaptive, agile solutions.  Potential venues for prototype assessment include Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and multi-domain demonstration venues across the DoD.  Knowledge and experience gained through these demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  Development of advanced prototypes will involve partnerships with industry, academia, and non-traditional DoD partners.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities.  Development of advanced prototypes will involve partnerships with industry, academia, and non-traditional DoD partners."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.650"
                                            },
                                            "Text": {
                                                "val": "This focus area will be used to develop concepts and designs through proof-of-principle and virtual prototyping that will result in next generation electronic warfare, communications, and RF sensing capabilities in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will identify and analyze EM threats and provide capabilities that will enable DoD systems to operate effectively in the congested EM environments at home and those expected in future contingency operations.  Three to four prototype efforts are anticipated in FY 2017 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.562"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.562"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution and will support DoD Research and Engineering Enterprise Strategic Priorities.  Selected projects will focus on cost-effective, mission-focused efforts to design, develop, and deliver new concepts and technology prototypes aimed at protecting DoD systems and extending capabilities through agile electronic spectrum prototypes.  Two to three prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Sensing Concepts to Asymmetrically Counter Unconventional Weapons and Missile Threats Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses threats from weapons of mass destruction (WMD) and advanced cruise and ballistic missiles through low-cost, rapidly deployed distributed sensing concepts and enabling technologies.  Projects leverage networked sensors and autonomous learning systems to asymmetrically defeat emerging threats.  The focus area is aimed at developing prototype technologies and demonstrations of distributed networked sensors for:  (1) Enhanced detection capabilities for chemical, biological, radiological, nuclear, and high yield explosives threats; (2) Persistent intelligence and target discrimination in anti-access\/aerial denial (A2\/AD) environments; (3) Advanced sensors and sensor technologies for detection, tracking, and cueing missile defenses."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.219"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2017 include pursuing development of concepts and designs that will result in innovative concept of operations (CONOPS) and prototype systems in one to three years.  FY 2017 projects will include data mining for indications and warnings of a WMD or missile attack and unattended measurement and signature intelligence (MASINT) sensors to provide situational awareness of WMD activities in denied areas.  Two to three prototype efforts are anticipated in FY 2017 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.130"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.130"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force with critical enablers in distributed networked sensors, unattended intelligence systems, force protection, human-machine collaborative decision making, and command & control.  Two to three prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping of Autonomous or Semi-Autonomous systems for Human-Machine Combat Teaming"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses the need to develop new operational capabilities; speed up the observe, orient, decide, and act (OODA) loop; and, enhance situational awareness through the teaming of humans with autonomous or semi-autonomous robotic or software enabled systems.  The focus area is aimed at rapidly developing prototype technologies and demonstrations of systems to: (1) semi-autonomously detect, identify, track, prioritize, and engage targets with operator determination; (2) autonomously detect, classify threats or threat signals, then recommend defensive or offensive actions to the operator.\n\nPrototypes developed in this focus area will be delivered to Joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include assets such as Thunderstorm integration exercises and multi-domain demonstration venues across DoD.  Development of advanced prototypes will involve partnerships with industry and academia and permit operational users to gain insight into future technology-enabled strategies and tactics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2017 include pursuing development of concepts and designs that will result in innovative concept of operations (CONOPS) and prototype systems in one to three years.  Projects will be selected in the year of execution, two to three prototype efforts are anticipated in FY 2017 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.320"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.320"
                                            },
                                            "Text": {
                                                "val": "FY 2018 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force.  The focus will be on low-cost, innovative capabilities.  Two to three prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Autonomous Learning Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on cost-effective, mission-focused projects to design, develop, and deliver technology prototypes to enhance the capabilities of multi-domain, autonomous systems to meet the Department’s goal to rapidly drive innovation in aviation, space, maritime, and ground combat systems.  Autonomous systems range from software to aid the intelligence analyst in processing, exploitation, and dissemination, through very complex autonomous air systems networked in tandem with unmanned ground or undersea vehicles.  Related capabilities that enable autonomy are multiplying due to sensors that can understand the environment and software algorithms that can make a decision or seek human assistance.  This focus area supports projects that experiment with increased delegation to autonomous systems, pushing commercial and laboratory developments to the warfighter and allowing for faster than human reaction.  Through autonomy, the Department of Defense (DoD) will reduce the labor required to safely conduct missions.  Prototypes will be delivered to Joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and the Joint Experimental Range Complex (JERC).  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.700"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2017 include pursuing development of concepts and designs that will result in innovative concept of operations and prototype systems in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will look at science and technology to achieve autonomous systems with increased task delegation that reliably and safely accomplish complex tasks in all environments.  Projects under consideration include low-cost, prototype systems with autonomous behaviors to accelerate kill chains.  Three to four prototype efforts are anticipated in FY 2017 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.401"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.401"
                                            },
                                            "Text": {
                                                "val": "FY 2018 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at achieving autonomous systems that reliably and safely accomplish complex tasks, in all environments, or protect DoD assets from unmanned, autonomous threats.  Three to four prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping of Individual Warfighter Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on expedited delivery of field ready prototypes to directly support dismounted soldier systems.  Projects include capabilities for human assisted operations that increase soldier performance, resiliency, lethality, mobility, energy and power, communications, human-machine decisions making, and situational awareness.  These systems will support the Joint Force and Combatant Command priorities, in addition to emerging needs and opportunities as they are identified.  Technology development will counter emergent threats to the warfighter both while en-route to and operating within expeditionary environments alongside unified action partners.  Prototypes will be delivered to Joint and Service users to evaluate operational capabilities under realistic conditions and against current adversaries or anticipated threats.  Potential venues for prototype assessment include assets such as the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and multi-domain demonstration venues across the Department of Defense (DoD).  Knowledge and experience gained through those demonstrations will help develop new warfighting concepts and inform requirements and technical feasibility of future acquisition programs.  These initial prototype efforts will help reduce the cost of future acquisition programs and stimulate efforts beyond traditional defense industrial base activities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.697"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2017 include pursuing development of concepts and designs that will result in innovative concept of operations and prototype systems in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will look at dismounted soldier systems that support the Joint Force with critical enablers in capabilities for human assisted operations that increase soldier performance, resiliency, lethality, mobility, energy and power, communications, human-machine decisions making, and situational awareness  Two to three prototype efforts are anticipated in FY 2017 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.591"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.591"
                                            },
                                            "Text": {
                                                "val": "FY 2018 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force.  Two to three prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "India Science and Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "The India Science and Technology (S&T) Focus Area is a Secretary of Defense directed project designed to deepen and streamline defense cooperation between the U.S. and India.  By sharing research resources, capabilities, and expertise, the United States and India can jointly develop technological innovations needed to enable our defense industrial bases to support our militaries now and in the future.  Further, development of vibrant S&T cooperation is a key step in building an enduring partnership."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "The India Science and Technology Focus Area and related funding will continue to develop and execute cooperative S&T projects initiated in FY 2015 and FY 2016.  Additional cooperative S&T areas targeted include: munitions development, advanced manufacturing, micro-power grids, and other identified project areas.  In FY 2018, funding will be transferred from Joint Capability Technology Demonstration (JCTD) (Program Element 0603648D8Z) to enable proper alignment and execution of the allocated funds."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2018, generic performance metrics applicable to Emerging Capabilities Technology Development include transition of 40 percent of completing demonstrations program per year.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target dates, production measures, performance metrics, and demonstration goals.  In FY 2016, Emerging Capabilities Technology Development achieved a transition rate of approximately 85 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P713"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "18.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This initiative supports the U.S. Special Operations Command (SOCOM) effort to explore the operational capability for an AC-130 modified with a High Energy Laser (HEL).  This funding enables analysis and risk reduction efforts to accelerate development of a HEL weapon system for SOCOM missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AC-130 High Energy Laser (HEL)"
                                    },
                                    "Description": {
                                        "val": "This is a DoD directed effort initiated in FY 2018.  This project includes risk reduction efforts to help accelerate development and operational demonstration of an electric laser with a rechargeable magazine on an AC-130.  Activities covered by this funding include modeling, simulation, testing subsystems, and coordination with industry to support a subsequent SOCOM HEL development program.  Success for the subsequent program will be realized by integrating an HEL capability into the AC-130 Precision Strike Package (PSP).  The subsequent program will provide special operations forces with a materiel solution capable of addressing current warfighter gaps, resulting in an immediate impact to operations by providing a high precision, low collateral damage, non-kinetic strike option."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include modeling, simulation, system design, work on interface definitions, and subsystem testing.  Risk reduction efforts will continue, including characterization of aircraft exit window optic effects and mitigation for optimal beam quality, validation of coelostat inertial stabilization and pointing (anti-jitter), and characterization of the bio-effects and hazards necessary to support program planning for the HEL system.  After this initial risk reduction work the AC-130 HEL project will transition to Special Operation Command for further development."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A – SOCOM will support subsequent development and acquisition strategy."
                        },
                        "PerformanceMetrics": {
                            "val": "SOCOM defines specific performance metrics to evaluate the risk reduction effort and determine future investments.  The project results are reviewed by a senior review group comprised of representatives from the Office of the Secretary of Defense, SOCOM, other Combatant Commands, and outside subject matter experts.  The ultimate measure of success is transition to the SOCOM customer."
                        }
                    }
                }
            ]
        }
    }
}