{
    "id": "2018-MissileDefenseAgency-PB-0400-MJBOOK-0-0-8c1eaf5967c59856025b07e7d6babc7dab6223a7b48c27420216b0f6cedc489b-2",
    "meta": {
        "filename": "2018-BASE_PROCUREMENT-2018-DEFENSE_MDA_VOL2-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Missile_Defense_Agency_PB_2018.xml",
        "doctype": "2018-BASE_PROCUREMENT-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Missile Defense Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0603178C"
        },
        "ProgramElementTitle": {
            "val": "Weapons Technology"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "MdapCode": {
            "val": "362"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Missile Defense Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "106.664"
            },
            "PriorYear": {
                "val": "50.263"
            },
            "CurrentYear": {
                "val": "71.843"
            },
            "BudgetYearOne": {
                "val": "5.495"
            },
            "BudgetYearOneBase": {
                "val": "5.495"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Divert and Attitude Control System (DACS) was transferred to PE 0603294C Common Kill Vehicle Technology beginning in FY 2018."
        },
        "ProgramElementMissionDescription": {
            "val": "The Weapons Technology Program Element develops and tests a high-powered directed energy laser to build the foundation of the next-generation laser system on a high altitude unmanned airborne platform. The MDA's High Energy Laser (HEL) investment incrementally develops scalable, efficient, and compact HEL technology in the laboratory before beginning a high power laser flight test program.  The technology required for tracking the target, aiming the laser, and building flight demonstrators is developed under the Technology Maturation Initiatives (TMI) Program Element (0604115C).\n\nMDA collaborates with the Office of the Assistant Secretary of Defense for Research and Engineering, the Defense Advanced Research Projects Agency (DARPA), the High Energy Laser Joint Technology Office (HELJTO), and the Air Force in a systems engineering based strategy to research, develop and test directed energy weapons technology.  MDA is developing a set of common core technology that will enable both missile defense and air dominance missions. These core technologies include fiber launchers; high brightness, high efficiency diode pump modules; and high power, high efficiency fiber amplifiers.  In FY 2017, MDA, DARPA and the Air Force will complete a 30 kilowatt packaged Fiber Combined Laser (FCL) system at the Massachusetts Institute of Technology Lincoln Laboratory.  The system consists of the laser, batteries and thermal device. MDA will also upgrade the Diode Pumped Alkali Laser (DPAL) testbed at Lawrence Livermore National Laboratory to conduct a 30 kilowatt demonstration with improved beam quality. In FY 2018, MDA will complete these final milestones and conclude the FFRDC laboratory high-powered directed energy laser activity.  \n\nThe Agency will make the directed energy technology developed under this PE available to industry for incorporation into the Low Power Laser Demonstrator and for further laser scaling development to power levels required for robust, speed of light missile defense.\n\nDivert and Attitude Control System (DACS) was transferred to PE 0603294C Common Kill Vehicle Technology beginning in FY 2018."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "51.153"
                },
                "CurrentYear": {
                    "val": "71.843"
                },
                "BudgetYearOne": {
                    "val": "69.004"
                },
                "BudgetYearOneBase": {
                    "val": "69.004"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "50.263"
                },
                "CurrentYear": {
                    "val": "71.843"
                },
                "BudgetYearOne": {
                    "val": "5.495"
                },
                "BudgetYearOneBase": {
                    "val": "5.495"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.890"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-63.509"
                },
                "BudgetYearOneBase": {
                    "val": "-63.509"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.890"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-63.509"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-63.509"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY18 reflects the transfer of Divert and Attitude Control System (DACS) to PE 0603294C Common Kill Vehicle Technology beginning in FY 2018."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MD69"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "47.006"
                        },
                        "PriorYear": {
                            "val": "25.314"
                        },
                        "CurrentYear": {
                            "val": "47.691"
                        },
                        "BudgetYearOne": {
                            "val": "5.495"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.495"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "N\/A"
                        },
                        "ProjectMissionDescription": {
                            "val": "The MDA mission is to develop a robust system to defend the United States against ballistic missile attacks at all ranges, in all phases of flight.   Using Directed Energy weapons to negate a ballistic missile in boost phase, before a threat missile can deploy countermeasures, will revolutionize missile defense by dramatically reducing the role of interceptors.  In FY 2010, the Airborne Laser program proved it is possible to acquire, track and destroy a boosting missile, addressing many aspects of the boost phase kill, but also underscoring the complexity and challenges of fielding such a weapon system.  The experience gained from that successful first foray into directed energy system illuminates a new path that integrates a highly efficient, compact electric laser into a high altitude, low-Mach Unmanned Aerial Vehicle capable of flying in the stratosphere.  Flying at low speed in relatively calm air at 60,000 feet significantly reduces the need for the complex beam pointing and atmospheric jitter compensation systems that were challenges for the Airborne Laser program.  The key to realizing this future high altitude, unmanned directed energy system is the laser.\n \nThe Directed Energy Research project funds the laboratory development of two high energy laser technologies, the DPAL with Lawrence Livermore National Laboratory (LLNL) and FCL with the Massachusetts Institute of Technology Lincoln Laboratory (MIT\/LL).  Both laser technologies have considerable promise for scaling to very high average power while simultaneously achieving high system electrical-to-optical efficiencies, exceeding 40 percent, and very low system weight and volume.\n\nThe MDA strategy is to reduce technical risk through dual path laboratory development and transition the laboratory development to industry in FY 2018 for high altitude unmanned platform integration and test."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Research"
                                    },
                                    "Description": {
                                        "val": "Directed Energy Research funds two promising laser technologies:  LLNL's DPAL and MIT\/LL's FCL.  Each technology takes a unique approach to attaining high power.  The DPAL scales in power by increasing the size of a single laser gain cell.  This approach has the benefit of simplicity of design, but must address very high energy levels within the single cell.  LLNL successfully demonstrated over 16 kilowatts (kW) in FY 2016; will demonstrate 30 kWs in FY 2017.\n\nMDA's key fiber laser investments are targeted at driving the weight per kilowatt of power in the fiber amplifier system down while increasing the individual fiber amplifier power output.  MDA joined with DARPA and the Air Force to demonstrate 44 kWs in a room-sized, 40 kilogram per kilowatt configuration in FY 2015, to a packaged 7 kilograms per kilowatt 30 kW system in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Based on multiple successful FCL 40 kilowatt (kW) demonstrations and DPAL 10 kW demonstrations, the increase from FY 2015 to FY 2016 funds increased laser test bed power, laser packaging demonstrations, system robustness and megawatt-class scaling designs.\n\n- Upgraded the 10 kW DPAL laboratory demonstration system to a 30 kW-class test bed \n  -- Conducted beam quality characterization testing to validate gain cell flow uniformity\n  -- Validated gain cell waveguide scaling path to higher power operation \n  -- Demonstrated improved robustness and reliability of pump diode modules\n- In collaboration with DARPA and the Air Force, completed the critical design review and began fabrication and integration of the 7 kilograms (kg) per kW low size weight and power FCL system\n  -- Conducted FCL advanced beam combiner high power demonstration to verify the combiner can scale to required performance levels\n  -- Analyzed and evaluated laboratory and industry high energy laser test data for scaling to ballistic missile defense system relevant power levels\n- Implemented directed energy models and simulations to assess technology capability against expected threats, define technology gaps and identify and mitigate technical risks\n  -- In conjunction with HELJTO addressed real-time laser deconfliction procedures and implementation mechanisms"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The increase from FY 2016 to FY 2017 funds increased laser test bed power demonstrations, laser packaging demonstrations, and hundreds of kW class scaling designs based on successful > 40 kW FCL and > 30 kW DPAL system demonstrations \n\n- Demonstrate 30 kW operation with 30% electrical-to-optical (E-O) efficiency\n- Upgrade the 30 kW DPAL system laboratory test bed\n  -- Demonstrate a 30 kW DPAL beam with the ability to tightly focus on the target (beam quality at 1.5X diffraction-limited)  \n     --- Complete characterization of a deformable mirror beam correction system\n     --- Integrate and test beam correction system\n  -- Complete a preliminary design for a 120 kW DPAL system\n     --- Initiate design for a 120 kW DPAL gain cell and pump delivery system\n- In collaboration with DARPA and the Air Force; upgrade the FCL system\n  -- Deliver and demonstrate a flight qualified 1kg per kW compact fiber amplifier traceable to BMDS HEL system requirements \n  -- Demonstrate a 7 kg per kW compact, packaged FCL system\n     --- Conduct first light demonstration of the compact, packaged FCL system\n     --- Conduct a 30 kW Low Size Weight and Power (SWaP) demonstration validating a 7 kg per kW integrated FCL package\n  -- Conduct preliminary design reviews for a 50 kW low SWaP 5 kg per kW integrated FCL package"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.495"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.495"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The decrease from FY 2017 to FY 2018 reflects completion of final 30 kW milestone demonstrations and conclusion of the FFRDC laboratory high-powered directed energy laser activity.  Work in FY 2018 include testing to anchor DPAL and FCL performance and scaling potential and generation of DPAL and FCL final reports."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.853"
                                        },
                                        "CurrentYear": {
                                            "val": "17.880"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.996"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.996"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.741"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.048"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.319"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.361"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.981"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603179C"
                                    },
                                    "Title": {
                                        "val": "Advanced C4ISR"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.661"
                                        },
                                        "CurrentYear": {
                                            "val": "3.626"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "13.287"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.987"
                                        },
                                        "CurrentYear": {
                                            "val": "27.733"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.184"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.184"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.695"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.555"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.936"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.361"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "406.326"
                                        },
                                        "CurrentYear": {
                                            "val": "408.594"
                                        },
                                        "BudgetYearOne": {
                                            "val": "449.442"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "449.442"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "466.760"
                                        },
                                        "BudgetYearThree": {
                                            "val": "540.409"
                                        },
                                        "BudgetYearFour": {
                                            "val": "629.864"
                                        },
                                        "BudgetYearFive": {
                                            "val": "501.915"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604115C"
                                    },
                                    "Title": {
                                        "val": "Technology Maturation Initiatives"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "24.743"
                                        },
                                        "CurrentYear": {
                                            "val": "99.366"
                                        },
                                        "BudgetYearOne": {
                                            "val": "128.406"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "128.406"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "168.388"
                                        },
                                        "BudgetYearThree": {
                                            "val": "174.432"
                                        },
                                        "BudgetYearFour": {
                                            "val": "176.660"
                                        },
                                        "BudgetYearFive": {
                                            "val": "177.264"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy for the MD69, Directed Energy Research, consists of partnering with Industry, the DARPA, the Air Force, Federally Funded Research and Development Centers and University Affiliated Research Centers.  The MDA will leverage Agency and partner subject matter experts and use government model based assessments to inform Better Buying Power philosophy acquisition decisions. The MDA will then award contracts to industry and universities via the Advanced Technology Innovation Broad Agency Announcement and competitive procurements to develop and demonstrate promising components and integrated systems in realistic test environments."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD72"
                    },
                    "ProjectTitle": {
                        "val": "Interceptor Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "58.953"
                        },
                        "PriorYear": {
                            "val": "22.818"
                        },
                        "CurrentYear": {
                            "val": "22.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Divert and Attitude Control System (DACS) will be funded from PE 0603294C Common Kill Vehicle Technology beginning in FY 2018."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Interceptor Technology project developed Divert and Attitude Control System (DACS) technology to enhance operational performance of future Multi-Object Kill Vehicle (MOKV).  Technology investment focused on DACS subsystem and system elements that support longer operation, multiple discrete DACS firing events, precision attitude control, safe operation and minimum kill vehicle mass.  In FY 2017, MDA continued investment in a competitive next generation solid DACS development with industry to reduce propulsion component risk for the MOKV.  The concept(s) developed for MOKV application transitioned to implementation with the industry MOKV developers.  MDA continued to conduct testing of lightweight, long duration Cooled Gas and Multi-Pulse Attitude Control Systems having application to both a Kill Vehicle and a Third Stage Rocket Motor, while anchoring system sizing and performance prediction models.  MDA defined the baseline requirements using analytical tools to identify mature technology capable of supporting MOKV development.\n\nThe project also modeled and assessed electromagnetic rail gun projectile technology readiness, suitability, and integration requirements for ballistic missile defense applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interceptor Technology"
                                    },
                                    "Description": {
                                        "val": "Interceptor Technology focuses on development and test of component and sub-systems for a solid propulsion DACS, including propellant tanks, Attitude Control System and divert thrusters, and pressurant subsystems.  This project will also investigate electromagnetic rail gun suitability and integration requirements for ballistic missile defense applications. This is a continuation of systems engineering and analysis that began under the BMD Enabling Programs program element, 0603890C in FY 2014."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.818"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Delivered initial design of a next generation solid DACS technology concept(s) that support multiple object kill vehicle development\n- Conducted initial government review and assessment of contractor(s) concepts to determine utility of alternative technology\n- Initiated component development testing to support government assessment and finalize concept design\n- Conducted government review and update assessment of contractor's final concept(s) to identify remaining gaps\n- Investigated preliminary rail gun projectile technology suitability for ballistic missile defense applications"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Conduct DACS technology development and testing to further reduce propulsion component risk for industry MOKV concept development\n- Conduct component testing of lightweight, long duration Cooled Gas Attitude Control System\n- Investigate rail gun projectile technology suitability for ballistic missile defense applications"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "DACS development will be funded from PE 0603294C Common Kill Vehicle Technology beginning in FY 2018."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0603176C"
                                    },
                                    "Title": {
                                        "val": "Advanced Concepts and Performance Assessment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.853"
                                        },
                                        "CurrentYear": {
                                            "val": "17.880"
                                        },
                                        "BudgetYearOne": {
                                            "val": "12.996"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "12.996"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "13.741"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.048"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.319"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.361"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603177C"
                                    },
                                    "Title": {
                                        "val": "Discrimination Sensor Technology"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "27.981"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603179C"
                                    },
                                    "Title": {
                                        "val": "Advanced C4ISR"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "9.661"
                                        },
                                        "CurrentYear": {
                                            "val": "3.626"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "13.287"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603180C"
                                    },
                                    "Title": {
                                        "val": "Advanced Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.987"
                                        },
                                        "CurrentYear": {
                                            "val": "27.733"
                                        },
                                        "BudgetYearOne": {
                                            "val": "20.184"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "20.184"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "20.695"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.555"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.936"
                                        },
                                        "BudgetYearFive": {
                                            "val": "22.361"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603890C"
                                    },
                                    "Title": {
                                        "val": "BMD Enabling Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "406.326"
                                        },
                                        "CurrentYear": {
                                            "val": "408.594"
                                        },
                                        "BudgetYearOne": {
                                            "val": "449.442"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "449.442"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "466.760"
                                        },
                                        "BudgetYearThree": {
                                            "val": "540.409"
                                        },
                                        "BudgetYearFour": {
                                            "val": "629.864"
                                        },
                                        "BudgetYearFive": {
                                            "val": "501.915"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603892C"
                                    },
                                    "Title": {
                                        "val": "AEGIS BMD"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "804.211"
                                        },
                                        "CurrentYear": {
                                            "val": "959.066"
                                        },
                                        "BudgetYearOne": {
                                            "val": "852.052"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "852.052"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "805.051"
                                        },
                                        "BudgetYearThree": {
                                            "val": "789.217"
                                        },
                                        "BudgetYearFour": {
                                            "val": "656.164"
                                        },
                                        "BudgetYearFive": {
                                            "val": "695.306"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0603904C"
                                    },
                                    "Title": {
                                        "val": "Missile Defense Integration and Operations Center (MDIOC)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "46.191"
                                        },
                                        "CurrentYear": {
                                            "val": "54.750"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.265"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.265"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "54.505"
                                        },
                                        "BudgetYearThree": {
                                            "val": "57.588"
                                        },
                                        "BudgetYearFour": {
                                            "val": "58.574"
                                        },
                                        "BudgetYearFive": {
                                            "val": "59.738"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0604894C"
                                    },
                                    "Title": {
                                        "val": "Multi Object Kill Vehicle"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "71.513"
                                        },
                                        "BudgetYearOne": {
                                            "val": "6.500"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "6.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.500"
                                        },
                                        "BudgetYearThree": {
                                            "val": "229.524"
                                        },
                                        "BudgetYearFour": {
                                            "val": "209.830"
                                        },
                                        "BudgetYearFive": {
                                            "val": "265.898"
                                        },
                                        "CostToComplete": {
                                            "val": "0"
                                        },
                                        "TotalCost": {
                                            "val": "786.765"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MD40"
                    },
                    "ProjectTitle": {
                        "val": "Program-Wide Support"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.705"
                        },
                        "PriorYear": {
                            "val": "2.131"
                        },
                        "CurrentYear": {
                            "val": "2.152"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PWS contains non-headquarters management costs in support of MDA functions and activities across the entire BMDS.  It Includes Government Civilians, and Contract Support Services.  This provides integrity and oversight of the BMDS as well as supports MDA in the development and evaluation of technologies that will respond to the changing threat. Additionally, PWS includes Global Deployment personnel and support performing deployment site preparation and activation and, provides facility capabilities for MDA Executing Agent locations.  Other MDA wide costs includes:  physical and technical security; civilian drug testing; audit readiness; the Science, Technology, Engineering, and Mathematics (STEM) program; legal services and settlements; travel and agency training; office, equipment, vehicle, and warehouse leases; utilities and base operations; data and unified communications support; supplies and maintenance; materiel and readiness and central property management of equipment; and similar operating expenses. PWS is allocated on a pro-rata basis and therefore, fluctuates by year based on the adjusted RDT&E profile (which excludes: 0305103C Cyber Security Initiative, 0603274C Special Programs, 0603913C Israeli Cooperative Program and 0901598C Management Headquarters)."
                        }
                    }
                }
            ]
        }
    }
}