{
    "id": "2018-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-ae3ea60ac03f8c9799bc98c8f83e06e4896f2e6a0033c1af095049651907bcbc-40",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-OSD-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604132D8Z"
        },
        "ProgramElementTitle": {
            "val": "Missile Defeat Project"
        },
        "R1LineNumber": {
            "val": "95"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "185.500"
            },
            "BudgetYearOne": {
                "val": "98.369"
            },
            "BudgetYearOneBase": {
                "val": "98.369"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "This is a new program element in FY 2017. Previous funding was through various FY 2014, FY 2015, and FY 2016 OUSD program elements including: PE 0602234D8Z (Lincoln Laboratory), PE 0603160BR (Counter-proliferation Initiatives - DTRA), PE 0603699D8Z (Emerging Capabilities Technology Development), and a few classified program elements."
        },
        "ProgramElementMissionDescription": {
            "val": "The Missile Defeat Project counters the growing global advancement and proliferation of road-mobile ballistic missile threats. This effort develops and integrates new capability and architectures to optimize fielded weapon systems and C4ISR to defeat these emerging threats. \n\nThe Missile Defeat Project coordinates and integrates DoD and Intelligence Community (IC) efforts to develop counter threat capability. This effort measures the effectiveness of new architectures and revolutionary concepts against evolving threats by working with the IC, Combatant Commands, government labs, program offices, industry, and academia. \n\nTo meet this challenge the Missile Defeat Project leverages existing test and simulated environments to perform analysis of industry and government reference concepts and architectures to provide innovative technical solutions for missile defeat. We are developing virtual and physical testbeds to robustly test, evaluate, and prototype architectures and assess their ability to improve time critical targeting and defeat of road-mobile threats. The virtual testbed complements testing at physical ranges by providing an infrastructure for addressing different training, test, and evaluation needs. This effort also includes systems engineering and analysis to devolve technical requirements, identify promising solutions, and inform future investment decisions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "45.000"
                },
                "BudgetYearOne": {
                    "val": "46.000"
                },
                "BudgetYearOneBase": {
                    "val": "46.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "185.500"
                },
                "BudgetYearOne": {
                    "val": "98.369"
                },
                "BudgetYearOneBase": {
                    "val": "98.369"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "140.500"
                },
                "BudgetYearOne": {
                    "val": "52.369"
                },
                "BudgetYearOneBase": {
                    "val": "52.369"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "52.678"
                                },
                                "BudgetYearOneBase": {
                                    "val": "52.678"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "DTIC Offset"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.309"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.309"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2017 Request for Additional Appropriation"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "140.500"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Activities within this document reflect headquarter-wide efficiency initiatives.\nThe amended budget request for an additional $140.500 million is required to address emergency warfighting readiness requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P072"
                    },
                    "ProjectTitle": {
                        "val": "Missile Defeat Project"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "MdapCode": {
                        "val": "000"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "185.500"
                        },
                        "BudgetYearOne": {
                            "val": "98.369"
                        },
                        "BudgetYearOneBase": {
                            "val": "98.369"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new program element in FY 2017.  Previous funding was through various FY 2014, FY 2015, and FY 2016 OUSD program elements including: PE 0602234D8Z (Lincoln Laboratory), PE 0603160BR (Counter-proliferation Initiatives - DTRA), PE 0603699D8Z (Emerging Capabilities Technology Development), and a few classified program elements."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Missile Defeat Project coordinates and integrates joint DOD and Intelligence Community (IC) efforts to develop counter threat capability solutions in five key areas: 1) dynamic command and control; 2) intelligence, surveillance and reconnaissance; 3) responsive conventional counterforce; 4) national missile defense; and 5) an enduring demonstration and experimentation capability to integrate and measure the effectiveness of developed solutions. \n\nThe Missile Defeat Project performs system engineering, integration, and modeling and simulation in support of the development of a set of system architectures.  In addition, it develops integrated capability assessments with updated architectures and threat scenarios, defines and allocates options, expands functionality, and incorporates exercise results for missile defeat enterprise tools.  The end-to-end systems engineering informs capability investments and requirement allocations across the missile defeat enterprise.\n\nThe Missile Defeat Project is leveraging existing state of the art and emerging technology to offer game changing solutions for the department’s highest priorities.  This technology is evaluated using new and novel concepts of operation to rapidly deliver improved time critical targeting, concepts of operation, and missile defeat to the warfighter.  The Missile Defeat Project is developing an evolutionary roadmap to document an architecture that best utilizes the Nation’s resources to defeat the emerging threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Previous Missile Defeat Project efforts"
                                    },
                                    "Description": {
                                        "val": "The Missile Defeat Project counters the growing global advancement and proliferation of ballistic missile threats through development of counter threat capability solutions that monitor, coordinate and integrate the Department of Defense (DoD) efforts. Missile Defeat is integrating existing capacity and identifying and developing new capabilities to address these threats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "185.500"
                                            },
                                            "Text": {
                                                "val": "- In FY 2017, Missile Defeat Project will focus on development, integration and testing in five key areas: Dynamic command and control; Intelligence, surveillance and reconnaissance; Responsive conventional counterforce; National missile defense; and Enduring demonstration and experimentation capability.\n- Expand the time critical targeting end-to-end simulation to model additional architecture elements and functions.\n- Perform systems engineering to deliver initial overarching technical requirements documentation and analysis for candidate architectures. \n- Deliver detailed test objectives, test event planning, and post-test evaluation for time critical targeting test events in FY 2017.\n\n\nFY 2017 Request for Additional Appropriations (RAA) Plans ($140.500 Million):\n- Advanced airborne Time Critical Targeting surrogate test platforms, $48.000 million.\n- Game changing sensing demonstration satellite for find and fix, $22.000 million.\n- Find and Mark Experiment for Mobile Missiles, $7.200 million.\n- National security site modifications to test, evaluate, and prototype architectures and assess their ability to improve time critical targeting and defeat of road-mobile threats, $51.300 million.\n- Advanced risk reduction demonstrations to improve observational persistence, $12.000 million."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "98.369"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "98.369"
                                            },
                                            "Text": {
                                                "val": "- In FY 2018, Missile Defeat Project will evaluate results from development and testing to enhance experimental and existing system architectures for Missile Defeat.\n- Deliver architecture improvements to enhance time critical targeting. \n- Develop and deliver prototype hardware and software for evaluation during test events.\n- Deliver component, system, and architecture analysis to the warfighter for recommendations on improved time critical targeting, concepts of operation, and missile defeat.\n- Perform systems engineering to deliver technical requirements documentation and analysis of candidate architectures. \n- Deliver detailed test objectives, test event planning, and post-test evaluation for time critical targeting test events in FY 2018."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy consists of partnering with small businesses, industry, Federally Funded Research and Development Centers and University Affiliated Research Centers.  OSD will leverage DoD, the Intelligence Community, and government model-based assessments to inform Better Buying Power philosophy acquisition decisions."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "N\/A"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Various"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MULTI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MULTI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "185.500"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "98.369"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "98.369"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Missile Defeat Project"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "SIMEX"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "COCOM Exercise"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SIMEX 2"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Time Critical Targeting Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}