{
    "id": "2018-DefenseInformationSystemsAgency-PB-0400-MJBOOK-0-0-848dad0bc2edbfe661b511ad600db66bc0b3ee99ea54b2e231c3cb422e8a2f7a-0",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-DISA-U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2018.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Information_Systems_Agency_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Defense Information Systems Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0604764K"
        },
        "ProgramElementTitle": {
            "val": "Advanced IT Services Joint Program Office (AITS-JPO)"
        },
        "R1LineNumber": {
            "val": "121"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Defense Information Systems Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "180.919"
            },
            "PriorYear": {
                "val": "18.750"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0"
            },
            "TotalCost": {
                "val": "199.669"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced IT Services Joint Program Office (AITS-JPO) identifies and integrates new and mature commercial information technology (IT) and advanced operational concepts into net-centric battlespace capabilities to access and exchange critical information; exploit opportunities to enhance current force capabilities; and project future force IT requirements. AITS-JPO supports preparing for future joint force and coalition initiatives through developing and integrating a full range of data services and advanced IT applications to support cooperative activities between the US and its coalition partners. These emergent capabilities are technologies that can be rapidly infused into existing tools.  \n\nThe program uses three key mechanisms to streamline the process of fielding emergent requirements: (1) Joint Capability Technology Demonstrations (JCTDs) with the Office of the Secretary of Defense (OSD)\/Combatant Commands (COCOMs)\/Services\/Agency; (2) Joint Ventures with COCOMs\/Program of Record (POR); and (3) Risk Mitigation Pilots with POR\/Community of Interest. The JCTD process aligns with the revised Joint Capability Integration and Development System process, developed by the Joint Chiefs of Staff, by adapting technology and concept solutions to meet pressing warfighter needs. OSD approves new JCTDs annually and on a rolling start basis.  Defense Information Systems Agency participates in both a technical and transition manager role.  The JCTDs and the Joint Ventures and risk mitigation pilots use a teaming approach thereby sharing costs and reducing the risk to individual organizations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.388"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.750"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.362"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.362"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "No change explanation needed."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "T26"
                    },
                    "ProjectTitle": {
                        "val": "Leading Edge Pilot Information Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "180.919"
                        },
                        "PriorYear": {
                            "val": "18.750"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "199.669"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Advanced IT Services Joint Program Office (AITS-JPO) identifies and integrates Leading Edge commercial information technology (IT) and advanced operational concepts into net-centric battlespace capabilities to access and exchange critical information; exploit opportunities to enhance current force capabilities; and project future force IT requirements. These Leading Edge products provide the Department of Defense (DoD) and National Senior Leaders, (e.g., the President of the United States, Secretary of Defense, Chairman of the Joint Chiefs of Staff, Combatant Commanders, as well as inter-agency participants) with critical focus on long-term collaboration, planning and information sharing. The Leading Edge technology pilots support future joint and coalition initiatives by developing and integrating a range of data services and advanced IT applications. These emergent capabilities are technologies that can be rapidly infused into existing tools for use by the US and coalition partners.\n  \nProgram investments in advanced technology benefit strategic and tactical users in the intelligence, warfighting and business domains by providing them with reliable, persistent collaboration, and networking technologies including computing-on-demand to reduce the need to replicate data or services at the point of consumption. Investments also provide support for virtual end-user environments and semantic search capabilities which enhance the decision-making process. These capabilities provide the warfighter with technical superiority and to achieve interoperability and integration, while working in concert with joint, allied and coalition forces to effectively counter terrorism and enhance homeland security defense. \n\nThe program is further divided into major subprogram areas:  Command and Control (C2) and Combat Support (CS), Information Sharing (IS), Network Infrastructure (NI), Network Operations (NetOps), Cyber Threat Discovery and Program Management Support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Command and Control (C2) and Combat Support (CS)"
                                    },
                                    "Description": {
                                        "val": "Command and Control (C2) and Combat Support (CS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.524"
                                            },
                                            "Text": {
                                                "val": "CTO will continue to provide engineering, assessment and technical support to COCOMs, Services and DISA by critically analyzing C2 requirements; conducting technology and operational assessments; applying engineering best practices to expedite delivery of capabilities; and leveraging and integrating existing DISA and DoD C2 capabilities.  Will participate in the Deputy Under Secretary of Defense's Rapid Fielding Directorate to provide engineering support in the development, implementation, and transition of emerging technologies and Emergent Capability Technology Demonstrations (ECTDs) that align with COCOM requirements and DISA's Strategic Planning Guidance.\n\nThe decrease of -$0.791 from FY 2015 to FY 2016 is due to the change in DoD policy where the JCTD process will be used to satisfy seven OSD identified technology problem areas.  Because of this shift, there is a reduction in the number of longer-term JCTDs (18-48 months) with the program moving towards rapid delivery of technical capabilities with Emerging Capability Technology Demonstrations (ECTDs).  ECTDs are shorter in duration (12-36 months) and provide faster delivery of capability to mission partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The JCTD program at DISA has been disestablished as a result of Agency efficiencies.  \n\nThe decrease of -$2.524 from FY 2016 to FY 2017  is an Agency efficiency and results in the disestablishment of the JCTD program.  As a result, civilian pay and FTEs were realigned to RDT&E PE 0302019K (62 FTES), and O&M (31 FTEs).  In addition, non-pay funding was realigned to RDT&E PE 0302019K."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information Sharing (IS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.177"
                                            },
                                            "Text": {
                                                "val": "CTO will continue to provide engineering support and assured and ready access to information from multiple devices under diverse conditions to the COCOMs, Services and Agencies through JIE participation and analyzing DoD information requirements.  Continue providing engineering and Information Assurance capabilities to DISA on Cloud Broker, Mil Cloud and DISA's computing service offerings. Will provide engineering investigation and support for desktop virtualization, thin client environments, mobility service and enterprise service.\n\nThe decrease of -$0.876 from FY 2015 to FY 2016 is due to the change in DoD policy where the JCTD process will now be used to satisfy seven OSD identified technology problem areas.  Because of this shift, there is a reduction in the number of longer-term JCTDs (18-48 months) with the program moving towards rapid delivery of technical capabilities with Emerging Capability Technology Demonstrations (ECTDs).  ECTDs are shorter in duration (12-36 months) and provide faster delivery of capability to mission partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The JCTD program at DISA has been disestablished as a result of Agency efficiencies.  \n\nThe decrease of -$3.177 from FY 2016 to FY 2017  is an Agency efficiency and results in the disestablishment of the JCTD program.  As a result, civilian pay and FTEs were realigned to RDT&E PE 0302019K (62 FTES), and O&M (31 FTEs).  In addition, non-pay funding was realigned to RDT&E PE 0302019K."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Infrastructure (NI)"
                                    },
                                    "Description": {
                                        "val": "Network Infrastructure (NI)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.316"
                                            },
                                            "Text": {
                                                "val": "CTO will continue to provide COCOMs and Services engineering expertise to enable and institutionalize common technical standards, interfaces, design patterns and enterprise architectures that assure “built-in” interoperability of programs, initiatives and efforts. CTO will investigate and expand DOD’s Identity Management efforts to allow access to desktops from anywhere in the department. Will participate with Deputy Under Secretary of Defense's Rapid Fielding Directorate to provide engineering support in the development, implementation, and transition of emerging technologies and Emergent Capability Technology Demonstrations (ECTDs) that align with COCOM requirements.\n\nThe decrease of -$0.344 from FY 2015 to FY 2016 is due to the change in DoD policy where the JCTD process will now be used to satisfy seven OSD identified technology problem areas.  Because of this shift, there is a reduction in the number of longer-term JCTDs (18-48 months) with the program moving towards rapid delivery of technical capabilities with Emerging Capability Technology Demonstrations (ECTDs).  ECTDs are shorter in duration (12-36 months) and provide faster delivery of capability to mission partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The JCTD program at DISA has been disestablished as a result of Agency efficiencies.  Disestablishes pay, benefits, travel and other program costs, including contracting support. \n\nThe decrease of -$1.316 from FY 2016 to FY 2017  is an Agency efficiency and results in the disestablishment of the JCTD program.  As a result, civilian pay and FTEs were realigned to RDT&E PE 0302019K (62 FTES), and O&M (31 FTEs).  In addition, non-pay funding was realigned to RDT&E PE 0302019K."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Operations (NetOps)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The decrease of -$0.967 from FY 2015 to FY 2016 is due to the change in DoD policy where the JCTD process will now be used to satisfy seven OSD identified technology problem areas.  Because of this shift, there is a reduction in the number of longer-term JCTDs (18-48 months) with the program moving towards rapid delivery of technical capabilities with Emerging Capability Technology Demonstrations (ECTDs).  ECTDs are shorter in duration (12-36 months) and provide faster delivery of capability to mission partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management Support"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.733"
                                            },
                                            "Text": {
                                                "val": "CTO will continue to provide core program management support and a variety of engineering, technical innovation, information services, information assurance, and integration engineering.\n\nThe decrease of -$3.542 from FY 2015 to FY 2016 is due to the change in DoD policy where the JCTD process will now be used to satisfy seven OSD identified technology problem areas.  Because of this shift, there is a reduction in the number of longer-term JCTDs (18-48 months) with the program moving towards rapid delivery of technical capabilities with Emerging Capability Technology Demonstrations (ECTDs).  ECTDs are shorter in duration (12-36 months) and provide faster delivery of capability to mission partners."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The JCTD program at DISA has been disestablished as a result of Agency efficiencies.  \n\nThe decrease of -$11.733  from FY 2016 to FY 2017 is an Agency efficiency and results in the disestablishment of the JCTD program.  As a result, civilian pay and FTEs were realigned to RDT&E PE 0302019K (62 FTES), and O&M (31 FTEs).  In addition, non-pay funding was realigned to RDT&E PE 0302019K."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The program accomplishes its mission through a combination of strategies focused on operations, technical integration, program management, and financial tracking. Market research during the acquisition process includes a review of DISA contracts, other DoD contract vehicles, and other Government agency contracts which are advertised for Government-wide usage.  This market research also includes consideration of small businesses including, minority\/women owned (8A) businesses, Historically Black Colleges and Universities, mentor\/protégé and other specialized contract vehicles and processes.  It evaluates all contractors available from DISA sources for their ability to deliver the products specifically required for the unique program efforts.  The program works collaboratively with vendors to obtain generic cost data for planning and analysis purposes.  Past and current contract prices for similar work and other government-wide agency contracts provide additional sources of information.  Quotes from multiple sources help provide averages for more realistic cost estimates.  DISA makes a concerted effort to award many of its contracts to small businesses.  Additionally, many of the DISA contracts are awarded with multiple option periods. These have the benefit of fixing labor costs over an extended period and minimizing the administrative costs associated with re-issuing short-term contracts. CTO reviews existing contract vehicles and the number of contracts to minimize administrative overhead.  Instead of individual contracts for program management, business line improvement, asset management, and financial management, there is now one small business program services contract that provides services across DISA."
                        },
                        "PerformanceMetrics": {
                            "val": "OSD holds program reviews twice a year to review cost, schedule, performance and delivery. For JCTDs\/ECTDs, the \nprogram office develops an Implementation Directive and Management Plan. These guidance documents outline the \nproject objectives, schedule, and funding for the JCTD\/ECTDs. Military utility will be assessed by each JCTD\/ECTD to develop and document the detailed objectives. The Operational Sponsor (a COCOM) will evaluate the process and measure results. For technology investigation and piloting, DISA CTO uses standard operating procedures for identifying objectives and metrics. Key metrics used include: utility of technology, time to delivery of technologies to the field, percentage of improvement in transition of technologies, and percentage of improvement in collaborative efforts with other Science and Technology organizations. See below for specific metrics:\n\n1.  Metric: JCTDs\/ECTDs provide rapid capabilities to the warfighter that address urgent COCOM needs. Metrics include: time of delivery of technology to the field and utility of technology.\n\nMeasure\/Goal: Number of approved JCTDs\/ECTDs with CTO as the Technical Manager and the number of JCTDs\/ECTDs pending approval with CTO as TM. \nFY16 Actual: 3-5 potential ECTDs\/ETs (evaluating about 8 projects which may or may not become an ECTD\/ET)\nFY17 Target: N\/A\nFY18 Target: N\/A\n\n2.\tMetric: Infrastructure as a Service (IaaS)\/Dreamer - Implement a cloud computing infrastructure for app development, software experimentation, and pilot evaluation accessible from the corporate network. Low cost solution to help foster an innovative environment where our modern workforce can develop mobile and web apps and conduct software experimentations to meet mission requirements.\n\nFY16 Actual: 20 Additional Users - 5 each quarter \nFY17 Target: N\/A\nFY18 Target: N\/A"
                        }
                    }
                }
            ]
        }
    }
}