{
    "id": "2018-Army-PB-2040-JBOOK-4b1431d557244e9ea54e049cfbecfc8cdb410cfc025b821caca6b08b36a8ebb9-18",
    "meta": {
        "filename": "2018-BASE_RDTE-2018-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2018.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2018.xml",
        "doctype": "2018-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2018",
        "budget_cycle": "PB",
        "submission_date": "2017-05",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@classification": "UNCLASSIFIED",
        "ProgramElementNumber": {
            "val": "0605803A"
        },
        "ProgramElementTitle": {
            "val": "Technical Information Activities"
        },
        "R1LineNumber": {
            "val": "170"
        },
        "BudgetYear": {
            "val": "2018"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2017-05"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "25.991"
            },
            "CurrentYear": {
                "val": "33.323"
            },
            "BudgetYearOne": {
                "val": "33.934"
            },
            "BudgetYearOneBase": {
                "val": "33.934"
            },
            "BudgetYearTwo": {
                "val": "31.731"
            },
            "BudgetYearThree": {
                "val": "32.640"
            },
            "BudgetYearFour": {
                "val": "33.299"
            },
            "BudgetYearFive": {
                "val": "34.080"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports upgrading the accuracy, timeliness, availability, and accessibility of scientific, technical, and management information at all levels of the Army Research and Development (R&D) community. Management of this information is critical to achieve the goals established by the Army's Senior Leadership.  Use of accurate and timely technical information is essential to successfully meeting the milestones required on the path to the future force, allowing Army Science and Technology (S&T) leadership to refine investment strategy and quickly react to emerging opportunities and issues.  This program includes initiatives to improve information derivation, storage, access, display, validation, transmission, distribution, and interpretation; to develop and enhance a single business model for Army S&T knowledge management information technology; to provide for Independent Review Team analysis of technology maturity as part of the Technology Area Readiness Assessment as required by Department of Defense Instruction (DoDI) 5000.2 dated May 12, 2003 as well as the Army Science Board (ASB) (Projects 720 and 727). This program addresses the need to increase the competitiveness and availability of scientific, engineering, and technical skills in the DoD and National workforce through outreach programs aimed at middle school through college students and teachers. By providing direct working experience for these students in Army laboratories, the programs expose these students to the working world of science and engineering (Project 729). The program includes funding for assessments in attitudes and opinions, longitudinal trends in Soldier and leader perceptions, and emerging issues to provide senior Army leaders with information on Soldiers' perceptions to inform personnel policy and program decision-making concerning manpower, personnel, and training issues (Project 730).  The program includes funding for support for Army high performance computing centers (Project 731).  The program includes funding for improvements to the Army's acquisition process (Project 733).  This program supports combatant commanders and major Army commands by providing science advisors to address scientific and technical issues and by providing engineering teams to solve field Army technical problems (Project C16).  Finally, this program funds studies by the Board on Army Science and Technology (BAST) (Project C18).  Coordination of this program with the other Services is achieved through inter-service working groups.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Research, Development, and Engineering Command (RDECOM), Aberdeen Proving Ground, MD, the Army Research Institute for the Behavioral and Social Sciences (ARI), Ft. Belvoir, VA, the Army Corps of Engineers' Engineer Research and Development Center (ERDC), Vicksburg, MS, Medical Research and Materiel Command (MRMC), Ft. Detrick, MD, Space and Missile Defense Command (SMDC), Huntsville, AL, and the Information Management Office, Arlington, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "28.478"
                },
                "CurrentYear": {
                    "val": "33.323"
                },
                "BudgetYearOne": {
                    "val": "32.701"
                },
                "BudgetYearOneBase": {
                    "val": "32.701"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "25.991"
                },
                "CurrentYear": {
                    "val": "33.323"
                },
                "BudgetYearOne": {
                    "val": "33.934"
                },
                "BudgetYearOneBase": {
                    "val": "33.934"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.487"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.233"
                },
                "BudgetYearOneBase": {
                    "val": "1.233"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.984"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.503"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "1.192"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.192"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "CivPay Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0"
                                },
                                "CurrentYear": {
                                    "val": "0"
                                },
                                "BudgetYearOne": {
                                    "val": "0.041"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.041"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "720"
                    },
                    "ProjectTitle": {
                        "val": "Tech Info Func Actv"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.442"
                        },
                        "CurrentYear": {
                            "val": "6.289"
                        },
                        "BudgetYearOne": {
                            "val": "5.866"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.866"
                        },
                        "BudgetYearTwo": {
                            "val": "5.352"
                        },
                        "BudgetYearThree": {
                            "val": "5.459"
                        },
                        "BudgetYearFour": {
                            "val": "5.567"
                        },
                        "BudgetYearFive": {
                            "val": "5.731"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for technology transfer activities to support acquisition, storage, and utilization of technical information for both military and domestic applications.  Effective exploitation of science and technology (S&T) information is critical to achieving the goals established by senior Army leadership.  Activities include Army support for Federal Laboratory Consortium (FLC) as required by Public Law; the Army Science Board; the Army Science Conference; S&T database management efforts; and administration of the Army's Small Business Innovation Research (SBIR) and Small Business Technology Transfer Program (STTR) in accordance with the Small Business Innovation Development Act of 1982, the Small Business Research and Development Enhancement Act of 1992 and subsequent reauthorizing legislation.  Technology transfer activities make technical information available to both the public and private sectors to reduce duplication in Research and Development programs and to increase competitiveness in the United States (US) business community.  Database management efforts support development of decision aids, databases, and automation support for the management and execution of the Army Research, Development, Test and Evaluation (RDTE) appropriation.  In addition, this Project provides funding for patent legal expenses and fees for all US Army Research, Development, and Engineering Command (RDECOM) subordinate commands and laboratories, as required by the Omnibus Budget Reconciliation Act.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n  \nWork is performed by RDECOM, Aberdeen Proving Ground, MD and the US Army Research Laboratory (ARL), Adelphi, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Provide Army Funding Support for Federal Laboratory Consortium as Required by Public Law 104-113"
                                    },
                                    "Description": {
                                        "val": "Public Law 104-113 requires the Army to provide funding for the federal laboratory consortium which is a network of federal agencies that provide a platform where technologies can be strengthened and promoted to return dividends to our economy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.250"
                                            },
                                            "Text": {
                                                "val": "Provided Army Funding Support for Federal Laboratory Consortium as Required by Public Law 104-113https:\/\/pandr.altess.army.mil\/v7\/#\/items"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.256"
                                            },
                                            "Text": {
                                                "val": "Will provide Army funding support for Federal Laboratory Consortium as required by Public Law 104-113."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.260"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Will provide Army funding support for Federal Laboratory Consortium as required by Public Law 104-113."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Administrative Support for the Army's SBIR and STTR Programs"
                                    },
                                    "Description": {
                                        "val": "Army SBIR and Army STTR programs. In 1982, Congress, through the Small Business Innovation Development Act (P.L. 97-219) established the SBIR program to foster the involvement of US based small businesses in federal research and development (R&D).  The SBIR program is designed to increase the participation of small, high-technology firms in the federal R&D endeavor and give driven businesses the opportunity to provide innovative R&D solutions in response to critical Army needs.  The STTR program expands the public\/private sector partnership to include the joint venture opportunities for small business and the nation's premier nonprofit research institutions.  The most important role of the STTR program is to foster the innovation necessary to meet the nation's scientific and technological challenges in the 21st century.  The SBIR\/STTR support services include program and technical advisory support services on a broad level.  The Army SBIR\/STTR Program Management Office mission requires synergized, integrated business solutions that concentrates on small business technological advances, and eliminates redundancy in a codified and consistent method that reduces confusion and ambiguity for the thousands of small businesses that participate in the SBIR and STTR programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.857"
                                            },
                                            "Text": {
                                                "val": "Provided the Army SBIR\/STTR Program Offices with the resources necessary to execute these Congressionally mandated Programs.  The Army SBIR\/STTR Program Offices procured program management and technical services required to support the programs.  The support services included a broad range of program and technical assistance services such as programming; database support; drafting of letter reports, newsletters, briefings, presentation materials and correspondence; analyses; documentation for record keeping and reporting; and portal virtual machines development and support.  The services assisted the Program Offices in planning, coordinating, implementing, and orchestrating SBIR\/STTR functions to include current and new approaches, processes and procedures as required by United States Code, Title 15, Section 638, Fiscal Year 2012 National Defense Authorization Act, Public Laws 112-81, and in Public Laws 97-219, 99-443, 102-564 and 106-554."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.283"
                                            },
                                            "Text": {
                                                "val": "Will provide the Army SBIR\/STTR Program Offices with the resources necessary to execute Congressionally mandated programs.  The Army SBIR\/STTR Program Offices procure program management and technical services required to support the programs.  The support services include a broad range of program and technical assistance services such as programming; database support; drafting of letter reports, newsletters, briefings, presentation materials and correspondence; analyses; documentation for record keeping and reporting; and portal virtual machines (VM) development and support.  The services assist the Program Offices in planning, coordinating, implementing, and orchestrating SBIR\/STTR functions to include current and new approaches, processes and procedures as required by United States Code, Title 15, Section 638, Fiscal Year 2012 National Defense Authorization Act, Public Laws 112-81, and in Public Laws 97-219, 99-443, 102-564 and 106-554."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.266"
                                            },
                                            "Text": {
                                                "val": "Will provide the Army SBIR\/STTR Program Offices with the resources necessary to execute Congressionally-mandated programs.  The Army SBIR\/STTR Program Offices procure program management and technical services required to support the programs.  The support services include a broad range of program and technical assistance services such as programming; database support; drafting of letters, reports, newsletters, briefings, presentation materials and correspondence; analyses; documentation for record keeping and reporting; helpdesk; and web portal development and support.  The services assist the Program Offices in planning, coordinating, implementing, and orchestrating SBIR\/STTR functions to include current and new approaches, processes and procedures as required by United States Code, Title 15, Section 638, Fiscal Year 2012 National Defense Authorization Act, Public Laws 112-81, and in Public Laws 97-219, 99-443, 102-564 and 106-554."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide Funding for Patent Fees and Patent Legal Expenses for U.S. Army Materiel Command  (AMC) Commands and Laboratories"
                                    },
                                    "Description": {
                                        "val": "The Army Research Laboratory turns high-value Army investments in science and technology into patented technologies in an effort to convert research into jobs and innovations for the Warfighter. The funded efforts are used for patent fees and legal expenses required for the patent application process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.164"
                                            },
                                            "Text": {
                                                "val": "Provided funding for patent fees and patent legal expenses for AMC commands and laboratories."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.069"
                                            },
                                            "Text": {
                                                "val": "Will provide funding for patent fees and patent legal expenses for AMC commands and laboratories."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.069"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.069"
                                            },
                                            "Text": {
                                                "val": "Will provide funding for patent fees and patent legal expenses for AMC commands and laboratories."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide Funding for S&T Strategic Planning and Support"
                                    },
                                    "Description": {
                                        "val": "Science and technology strategic planning and support is a critical component to the overall Army mission as it reaffirms Army leadership guidance, reinforces commitment to basic research, and leverages a landscape of game-changing technologies that can provide future innovations and capabilities to the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.186"
                                            },
                                            "Text": {
                                                "val": "Provided funding for S&T Strategic Planning and Support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.326"
                                            },
                                            "Text": {
                                                "val": "Will provide funding for S&T Strategic Planning and Support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.332"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.332"
                                            },
                                            "Text": {
                                                "val": "Will provide funding for S&T Strategic Planning and Support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Administer S&T Database Computer Engineering Support Contract and Support RDECOM Databases S&T Management Support"
                                    },
                                    "Description": {
                                        "val": "The science and technology database computer engineering support contract provides management support of RDECOM's databases as well as supports the development of the Army Research Laboratory science and technology information activities to include campaign plans envisioned to lead to enhanced land power capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.985"
                                            },
                                            "Text": {
                                                "val": "Administered S&T database computer engineering support contract and support RDECOM databases S&T management support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.355"
                                            },
                                            "Text": {
                                                "val": "Will administer S&T database computer engineering support contract and support RDECOM databases S&T management support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.939"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.939"
                                            },
                                            "Text": {
                                                "val": "Will administer S&T database computer engineering support contract and support RDECOM databases S&T management support."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "727"
                    },
                    "ProjectTitle": {
                        "val": "Tech Info Activities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.381"
                        },
                        "CurrentYear": {
                            "val": "11.134"
                        },
                        "BudgetYearOne": {
                            "val": "11.535"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.535"
                        },
                        "BudgetYearTwo": {
                            "val": "10.107"
                        },
                        "BudgetYearThree": {
                            "val": "10.406"
                        },
                        "BudgetYearFour": {
                            "val": "10.612"
                        },
                        "BudgetYearFive": {
                            "val": "10.938"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the development of decision aids, databases, and automation support for the management and execution of the Army Research, Development, Test, and Evaluation (RDTE) Appropriation.  It includes the hardware, software, and contractor support required to develop and implement a set of management decision aids, databases, and hardware\/software tools to support technical and budgetary decisions at the Office of the Secretary of Defense (OSD) and Department of the Army (DA). Most of the efforts in this project are on-going activities to support Army Research, Development, and Acquisition programs.  Effective exploitation of Science and Technology (S&T) information is critical to achieving the goals established by Senior Army Leadership for the future force. Funding in this program supports Independent Review Team analysis of technology maturity as part of Technology Readiness Assessments as required by Department of Defense Instruction (DoDI) 5000.2.  \n\nThe cited work is consistent with the Assistant Secreatary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the Office of the Assistant Secretary of the Army, Acquisition, Logistics and Technology, The Pentagon, Washington, DC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Conduct and support S&T program portfolio assessments and analysis."
                                    },
                                    "Description": {
                                        "val": "Support identification, development and demonstration of technology options that inform and enable effective and affordable capabilities for the Soldier Providing Soldiers with the technology to win.  Support Air, Ground Maneuver and Lethality Portfolio Directors, responding to scientific, technical and programmatic challenges. Support Independent Review Team analysis of technology maturity as part of Technology Readiness Assessments as required by DoDI 5000.2. Serve as Office of the Deputy Assistant Secretary of the Army, Research and Technology (DASA(R&T)) central point of contact for Systems Red Teaming and Technology Vulnerability Assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.257"
                                            },
                                            "Text": {
                                                "val": "Attended Army Red Teaming working groups that identified and select high-priority threats for investigation that will demonstrate technology vulnerabilities and identify mitigation. Supported the Systems Adaptive Red Teaming\/Technical Support Operational Analysis Program Review ground vehicle\/unmanned aerial vehicle technologies; positioning, navigation and timing (PNT) technologies, Command, Control, Communications, Computers and Intelligence (C3I). Provided information papers to senior leaders, articles for publication in the Army Acquisition, Logistics, Technology (ALT) Magazine, and technical studies and assessments related to programs under S&T purview."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.720"
                                            },
                                            "Text": {
                                                "val": "Will conduct and support S&T program portfolio assessments and analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.770"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.770"
                                            },
                                            "Text": {
                                                "val": "Track, manage and provide programmatic support for applied research and advanced technology development efforts in vulnerability assessments. Act as the S&T Subject Matter Experts (SMEs) provide Portfolio leads what is forecasted for science and technology ‘outputs’ to align with Programs of Record (PoR).  ODASA (R&T) provide summary briefing in the SPAR, ensuring tight alignment and coupling to existing PoRs and identifying where misalignment between Portfolio technology projections\/timelines and\/or emerging technology options are not yet reflected at the PoR level. Identify technology for effective and affordable capabilities in the S&T portfolios; Basic Research, Innovation Enablers, Medical, Soldier\/Squad, Command, Communications and Command, Control, Communications, Computers and Intelligence (C3I), Air, Lethality and Ground Maneuver."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support Army S&T strategic planning, analysis, and prioritization."
                                    },
                                    "Description": {
                                        "val": "Coordinate efforts with and across the Army S&T portfolios; manage proposal nomination and selection process; track and provide oversight of ongoing efforts; recommend resolutions\/prioritization in the event of conflicting requirements and\/or resource constraints; support the full spectrum of Planning, Programming and Budget Execution (PPBE) as it relates to the Army S&T Program.  Provide senior level technical and analytical support for the Joint Capability Technology Demonstration (JCTD) program and Technology Maturation Initiative (TMI) by assisting with investment analysis, strategies and oversight. Provide financial management recommendations and insights with regards to JCTDs, TMI, Manufacturing Technology (ManTech) and DMIs. Provide technical support and database administration of the Army Science and Technology Management Information System (ASTMIS) database. A variety of scientific and technical taxonomies applied at the task level allow responsive reporting on S&T programs to Congressional, OSD and Army leadership."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.630"
                                            },
                                            "Text": {
                                                "val": "Supported the plan and execution for Army Science and Technology Advisory Group (ASTAG), Working Group (ASTWG) and Warfighter Technical Council (WTC) Meetings. Provided senior-level technical and analytical support to the office of the ODASA(R&T), and the Systems Special Programs Directorate (SAAL-SSP) in support of the Army's S&T Special Access Programs (SAPs).  Acted as the S&T Liaison for the Technology Information Exchange and Technology Update Focus Forum with Training and Doctrine Command (TRADOC) Army. Developed feedback for the Army Capability Enablers (ACEs) and Science and Technology Objectives (STOs). Provided industry conference participation support (Association of the United States Army (AUSA), National Defense Industry Association (NDIA)) and supported international S&T programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.432"
                                            },
                                            "Text": {
                                                "val": "Will support Army S&T strategic planning, analysis, and prioritization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.689"
                                            },
                                            "Text": {
                                                "val": "Develop strategic analyses to look across the S&T portfolios and provide recommendations to the Director of Integration for S&T efficiencies and collaborative opportunities. Support ODASA(R&T) lead for future force. Continue to coordinate efforts with and across the Army S&T portfolios.  Support the Program Decision Memorandum (PDM) process, tasks and guidance for EE Program Evaluation Group (PEG). Develop prioritized decrement lists and recommend alternatives for a balanced portfolio. Support the plan and execution for the ASTAG, the ASTWG and the WTC."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide funding and support for Army Acquisition Program Technology Readiness Assessments for Program Milestone Decisions."
                                    },
                                    "Description": {
                                        "val": "Coordination and alignment with Programs of Record (PoR).  Demonstrate technical feasibility at system and subsystem level.  As path for technology spirals to acquisition, ensure a rapid insertion of new technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.668"
                                            },
                                            "Text": {
                                                "val": "Conducted Science and Technology Objective (STO) Review of Portfolio resulting informed the in the proper priorities for future science and technology efforts. Prepared tasking to Commands for fall rollup of Transition Characteristics Index (TCI). Coordinated Technology Readiness Assessment (TRA) for CH-47.   TRA establishes the Technology Readiness Level (TRL) for programs of record entering Milestone (MS) B. Helped prepare for International Technology Transfer (T2) and for technical and management support for all Army T2 functions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.912"
                                            },
                                            "Text": {
                                                "val": "Will provide funding and support for Army Acquisition Program Technology Readiness Assessments for Program Milestone Decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.967"
                                            },
                                            "Text": {
                                                "val": "Support the S&T investment strategy for the entire Army.  Provide options for the future across to sustain overmatch against adversaries and create opportunities to meet new challenges and fight in new ways. Continue Independent Review Team (IPT) analysis of technology maturity as part of Technology Readiness Assessments as required by DoDI 5000.2.  Act as the central point of contact for Systems Red Teaming and Technology Vulnerability Assessments."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Provide Army support to Assistant Secretary of Defense for Research and Engineering Executive Staff for Department of Defense (DoD) wide Science and Technology oversight."
                                    },
                                    "Description": {
                                        "val": "Support for Army engagement in Department of Defense (DoD)\/Assistant Secretary of Defense (Research & Engineering) (ASD(R&E)) and cross agency Science Technology Engineering and Mathematics (STEM) and diversity initiatives, including support for historically black colleges and universities\/ minority-serving institutions (HBCU\/MSI) actions. provide subject matter expert support for educational and diversity outreach activities, to include targeted research, analysis, and studies in support of strategic planning, prioritizing, investment strategy and review criteria for the Army Educational Outreach Program (AEOP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.826"
                                            },
                                            "Text": {
                                                "val": "Supported for Army engagement in DoD\/Assistant Secretary of Defense (Research & Engineering) (ASD(R&E)) and cross agency Science Technology Engineering and Mathematics (STEM) and other diversity initiatives. Fulfilled DoD 5000 policy and Weapon System Acquisition Reform Act requirements. Assisted with the Manufacturing Technology (ManTech) Program and Defense Manufacturing Institutes (DMI)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.070"
                                            },
                                            "Text": {
                                                "val": "Will provide Army support to Assistant Secretary of Defense for Research and Engineering Executive Staff for DoD-wide Science and Technology oversight."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.109"
                                            },
                                            "Text": {
                                                "val": "Participate in Defense Advanced Research Projects Agency (DARPA) engagements and awareness of DARPA Programs with links to Army S&T, and support Army S&T Engagements with DARPA Program Managers and Leadership. Support execution of ongoing programs, events and functional responsibilities, effectively communicating with all Army stakeholders and partners including other services, OSD, industry and academia."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "730"
                    },
                    "ProjectTitle": {
                        "val": "Pers & Trng Analys Act"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.706"
                        },
                        "CurrentYear": {
                            "val": "2.025"
                        },
                        "BudgetYearOne": {
                            "val": "2.232"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.232"
                        },
                        "BudgetYearTwo": {
                            "val": "2.270"
                        },
                        "BudgetYearThree": {
                            "val": "2.315"
                        },
                        "BudgetYearFour": {
                            "val": "2.361"
                        },
                        "BudgetYearFive": {
                            "val": "2.427"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the Army's behavioral and social science research in attitudes and opinions assessment, longitudinal trends in Soldier and leader perceptions, and emerging issues. The research provides a unique capability to address a number of issues that directly or indirectly affect Soldier and unit performance and readiness, such as identifying the impact of personnel policies on Soldier outcomes and identifying emerging and potential personnel challenges. Requirements for this research is solicited on a recurring basis from the Secretary of the Army (SA), Chief of Staff of the Army (CSA), Army Deputy Chief of Staff (DCS G-1), and the Assistant Secretary of the Army for Manpower and Reserve Affairs (ASA(M&RA)). \n\nWork in this project is managed by the United States Army Research Institute for the Behavioral and Social Sciences (ARI), Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PERS & TRNG ANALYS ACT"
                                    },
                                    "Description": {
                                        "val": "This effort conducts attitude and opinion research to identify longitudinal trends and emerging issues to inform senior Army leader decision making and shape ARI's long-range science and technology program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.706"
                                            },
                                            "Text": {
                                                "val": "Research conducted based on critical issues identified by the SA, CSA, DCS G-1, and ASA(M&RA)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.025"
                                            },
                                            "Text": {
                                                "val": "Will conduct reserach based on critical issues identified by SA, CSA, DCS G-1, and ASA(M&RA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.232"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.232"
                                            },
                                            "Text": {
                                                "val": "Will conduct reserach based on critical issues identified by SA, CSA, DCS G-1, and ASA(M&RA)."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "731"
                    },
                    "ProjectTitle": {
                        "val": "Army High Performance Computing Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.890"
                        },
                        "CurrentYear": {
                            "val": "4.544"
                        },
                        "BudgetYearOne": {
                            "val": "4.535"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.535"
                        },
                        "BudgetYearTwo": {
                            "val": "4.644"
                        },
                        "BudgetYearThree": {
                            "val": "4.739"
                        },
                        "BudgetYearFour": {
                            "val": "4.841"
                        },
                        "BudgetYearFive": {
                            "val": "4.964"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for the high performance computing (HPC) research environment, research, education, outreach, and sustainment infrastructure sustainment, and outreach support associated with the Army High Performance Computing Centers at the United States (US) Army Research Laboratory (ARL) and the US Army Tank and Automotive Research, Development, and Engineering Center (TARDEC).  The Army High Performance Computing Centers provide high fidelity modeling, simulation, and analysis of materials, systems, and operational constructs.  The Centers work with researchers at Army laboratories and research, development, and engineering centers to explore new HPC computing environments, algorithms in the computational sciences to address critical technology issues in computational research areas.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork is performed by ARL, Aberdeen Proving Ground, MD and TARDEC, Warren, MI."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustain the High Performance Computing Environment and Infrastructure in Support of the US Army Research Laboratory (ARL)"
                                    },
                                    "Description": {
                                        "val": "The HPC center provides levels of computational capacity to Army's tactical operational realms and provide innovative HPC capabilities to increase the effectiveness of Army Soldiers around the world. Algorithm design and software engineering approaches are investigated to effectively partition and use binary processing cores to reduce time to solution for Army-relevant problems. Factors such as performance, portability, and power will be considered in conjunction with developing new models to quantify computing capabilities in hybrid systems to facilitate algorithm signature mapping to available resources."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.484"
                                            },
                                            "Text": {
                                                "val": "Sustained HPC environment and infrastructure for armor\/anti-armor, low observable technologies, large Army network data analytics for Army test and evaluation; validate and maintain software for emerging central processing unit graphics processing unit (CPU-GPU) based heterogeneous computing architectures; maintained software and hardware for ARL-specific applications, develop software engineering methods for maintaining scalable software tools for Army user; developed and provided software defined networking for HPC networking, classified Special Access Program (SAP) scientific visualization, and software maintenance for Army-specific SAP and related HPC projects; and research computer systems to support fundamental and applied HPC research for the Army.  This effort supported (a) sustainment of SAP systems, software, visualization, (b) infrastructure support to emerging\/future HPC systems (for example tactical cloudlet, heterogeneous computers), and (c) infrastructure for emerging networking (software defined networking)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.264"
                                            },
                                            "Text": {
                                                "val": "Sustain computing infrastructure for ARL-specific special access facilities and Open Campus HPC systems; support advanced computing research architectures; maintain scalable software repository for the software developed under various Army funded research programs (e.g., Army High Performance Computing Research Center program, Army Research Office funded programs, University Affiliated Research Centers, Collaborative Technology and Research Alliances – specifically armor\/anti-armor, low observable technologies, data intensive sciences software); support training and outreach activities (to facilitate training workforce in using new HPC technologies and parallel software); and support innovative hardware and software for next generation HPC networking, memory, and hierarchical storage pertaining to Supercomputers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.535"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.535"
                                            },
                                            "Text": {
                                                "val": "Will sustain HPC environment and infrastructure for advanced heterogeneous computing architecture including data sciences computing architectures, special access systems infrastructure, programmable HPC Networking infrastructure, and ARL computational sciences Open Campus systems. Sustain software so that the software can take advantage of advanced computing architectures, HPC networking, and visualization that are mission critical for Army S&E and T&E applications."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sustain the High Performance Computing Environment and Infrastructure in Support of the US Army Tank and Automotive Research Development and Engineering Center"
                                    },
                                    "Description": {
                                        "val": "The HPC center provides levels of computational capacity to Army's tactical operational realms and provide innovative HPC capabilities to increase the effectiveness of Army Soldiers around the world. Tactical HPC will be possible only through a combined effort of advanced computing architectures research, mathematical models and techniques to network and manage deployed friendly computing devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.406"
                                            },
                                            "Text": {
                                                "val": "Sustained at reduced levels the HPC environment and infrastructure, classified and unclassified, at the US Army Research, Development, and Engineering Command (RDECOM) Tank and Automotive Research, Development, and Engineering Center (TARDEC) in support of the execution of physics-based analyses performed on Army ground vehicles and platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.280"
                                            },
                                            "Text": {
                                                "val": "Transition from the HPC environment and infrastructure to utilizing the Department of Defense (DoD) Supercomputer Resource Center (DSRC) in support of the execution of physics-based analyses performed on Army ground vehicles and platforms."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "733"
                    },
                    "ProjectTitle": {
                        "val": "Acquisition Tech Act"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.624"
                        },
                        "CurrentYear": {
                            "val": "3.640"
                        },
                        "BudgetYearOne": {
                            "val": "3.760"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.760"
                        },
                        "BudgetYearTwo": {
                            "val": "3.395"
                        },
                        "BudgetYearThree": {
                            "val": "3.565"
                        },
                        "BudgetYearFour": {
                            "val": "3.636"
                        },
                        "BudgetYearFive": {
                            "val": "3.569"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds improvements to the Army's acquisition process by applying decision support and expert information systems, and by supporting analysis and evaluation of alternative acquisition strategies using techniques such as value-added analysis and analysis-of-alternatives.  This Project provides the environment for the analysis and evaluation of new information technologies, concepts, and applications for integrated management activities and support dynamic Army acquisition technology requirements.  This program supports analysis efforts to conduct critical analyses for Army leadership in support of Army Transformation.  These analyses are used by leadership in making acquisition, procurement, and logistics decisions in order to provide quality equipment and procedures to the Soldiers. \n\nThe cited work is consistent with the Assistant Secreatary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n\nWork in this project is performed by the Army Acquisition Support Center, Ft. Belvoir, VA."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ACQUISITION TECH ACT"
                                    },
                                    "Description": {
                                        "val": "Distribute and beta test application programs and user interface utilities for executive level information systems that offer Standard Query Language services to Army Acquisition Corps corporate and global databases. Analyze acquisition program financial programming and budgeting requirements. Continue development of Weapon Systems Handbook, long-range planning and policy analysis, resource allocation analysis, cost tracking, and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.624"
                                            },
                                            "Text": {
                                                "val": "Distribute and beta test application programs and user interface utilities for executive level information systems that offer Standard Query Language services to Army Acquisition Corps corporate and global databases. Analyze acquisition program financial programming and budgeting requirements. Continue development of long-range planning and policy analysis, resource allocation analysis, cost tracking, and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.640"
                                            },
                                            "Text": {
                                                "val": "Will distribute and beta test application programs and user interface utilities for executive level information systems that offer Standard Query Language services to Army Acquisition Corps corporate and global databases; will analyze acquisition program financial programming and budgeting requirements; will continue development of long-range planning and policy analysis, resource allocation analysis, cost tracking, and analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.760"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.760"
                                            },
                                            "Text": {
                                                "val": "Will distribute and beta test application programs and user interface utilities for executive level information systems that offer Standard Query Language services to Army Acquisition Corps corporate and global databases; will analyze acquisition program financial programming and budgeting requirements; will continue development of long-range planning and policy analysis, resource allocation analysis, cost tracking, and analysis."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C16"
                    },
                    "ProjectTitle": {
                        "val": "FAST"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.915"
                        },
                        "CurrentYear": {
                            "val": "1.596"
                        },
                        "BudgetYearOne": {
                            "val": "1.644"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.644"
                        },
                        "BudgetYearTwo": {
                            "val": "1.673"
                        },
                        "BudgetYearThree": {
                            "val": "1.707"
                        },
                        "BudgetYearFour": {
                            "val": "1.742"
                        },
                        "BudgetYearFive": {
                            "val": "1.794"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides support for the Field Assistance in Science and Technology (FAST) program. The FAST program provides Science Advisors, recruited from Army Materiel Command (AMC) headquarters and all AMC Major Subordinate Commands (MSC) to serve combatant commands and major commands worldwide.  FAST tours of duty provide significant professional growth opportunities for the Army's scientists and engineers and enable them to focus AMC resources on rapidly identifying and solving field technical problems that enable the improvement of readiness, safety, training, and reduce operations and support (O&S) costs.  The FAST activity is supported by Quick Reaction Coordinators within the engineering centers.  The FAST program recoups many times its cost in O&S savings.  FAST also provides emerging technology demonstration opportunities to the engineering centers an Annual Program Review to facilitate sharing of lessons learned between science advisors at combatant commands, assists Combatant Commanders (COCOMS) with their annual Science and Technology Conferences.  FAST also maintains close coordination with the Navy Science Advisor Program (Naval Fleet Forces Technology Integration Office).FAST supports warfighters in contingency operations with embedded Science and Technology Assistance Teams (STATs) as well as Science and Technology Acquisition Corps Advisors (STACAs).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by AMC, Redstone Arsenal, AL Research, Development and Engineering Command (RDECOM), Aberdeen Proving Ground, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Respond to combatant commanders worldwide with technological solutions."
                                    },
                                    "Description": {
                                        "val": "Funding is provided for the following effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.915"
                                            },
                                            "Text": {
                                                "val": "Respond to combatant commanders worldwide with technological solutions to urgent materiel problems they identify; deploy science advisors with United States (US) Task Forces in support of combatant commanders; execute annual Program Review. Provide additional support needed to participate in combatant commander exercises; respond to corresponding Warfighter Requests for Information (RFI's) project support to offset capability gaps identified by the Warfighter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.596"
                                            },
                                            "Text": {
                                                "val": "Will respond to combatant commanders worldwide with technological solutions to urgent materiel problems they identify; will deploy science advisors with US Task Forces in support of combatant commanders; will execute annual Program Review. Will provide additional support needed to participate in combatant commander exercises; will respond to corresponding Warfighter RFI's will provide project support to offset capability gaps identified by the Warfighter."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.644"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.644"
                                            },
                                            "Text": {
                                                "val": "Will respond to combatant commanders worldwide with technological solutions to urgent materiel problems they identify; will deploy science advisors with US Task Forces in support of combatant commanders; will execute annual Program Review. Will provide additional support needed to participate in combatant commander exercises; will respond to corresponding Warfighter RFI's will provide project support to offset capability gaps identified by the Warfighter."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "C18"
                    },
                    "ProjectTitle": {
                        "val": "BAST"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.399"
                        },
                        "CurrentYear": {
                            "val": "0.997"
                        },
                        "BudgetYearOne": {
                            "val": "1.061"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.061"
                        },
                        "BudgetYearTwo": {
                            "val": "1.067"
                        },
                        "BudgetYearThree": {
                            "val": "1.088"
                        },
                        "BudgetYearFour": {
                            "val": "1.109"
                        },
                        "BudgetYearFive": {
                            "val": "1.142"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the Board on Army Science and Technology (BAST).  The BAST functions under the auspices of the National Research Council (NRC) an organization within the National Academies of Sciences and provides an external, independent, and objective source of advice to the Army.  The BAST serves as a convening authority for the discussion of science and technology issues of importance to the Army and oversees independent Army-related studies conducted by the National Academies.  Working in close coordination with the Army, the BAST helps define problems, brings together experts to study these problems, and provides recommendations.  Committees are assembled in accordance with established NRC procedures and BAST studies often take 12 months or more to conclude.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy.\n\nWork in this project is executed extramurally by the United States (US) Army Research Laboratory, Army Research Office (ARO), Research Triangle Park, NC."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Provide Studies and Conduct Periodic Meetings to Help Identify, Assess, and Recommend Emerging Opportunities in Science and Technology (S&T) Fields Applicable to the United States (U.S.) Army."
                                    },
                                    "Description": {
                                        "val": "To acquire a greater understanding of emerging technology opportunities that support a plethora of Army-relevant capability gaps, technologies are continuously assessed both nationally and internationally.  In addition, periodic meetings are conducted to discuss and recommend strategic research areas critical to advancing the Warfighter's capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.399"
                                            },
                                            "Text": {
                                                "val": "Studied emerging topics based on Army S&T strategy and senior leader initiatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.997"
                                            },
                                            "Text": {
                                                "val": "Will study emerging topics based on Army S&T strategy and senior leader initiatives.  Planning to initiate a new National Academies study."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.061"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.061"
                                            },
                                            "Text": {
                                                "val": "Will study emerging topics based on Army S&T strategy and senior leader initiatives.  Planning to initiate a new National Academies study."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW3"
                    },
                    "ProjectTitle": {
                        "val": "Army Geospatial Enterprise Implementation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.634"
                        },
                        "CurrentYear": {
                            "val": "3.098"
                        },
                        "BudgetYearOne": {
                            "val": "3.301"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.301"
                        },
                        "BudgetYearTwo": {
                            "val": "3.223"
                        },
                        "BudgetYearThree": {
                            "val": "3.361"
                        },
                        "BudgetYearFour": {
                            "val": "3.431"
                        },
                        "BudgetYearFive": {
                            "val": "3.515"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides geospatial domain expertise to Mission Command (MC) in implementing the Army Geospatial Enterprise (AGE) across all MC Systems to ensure interoperability across the Army;  Ensures Army systems can consume geospatial data from National-Geospatial Intelligence Agency (NGA) and with National System for Geospatial-Intelligence (NSG) partners as required by Department of Defense Instruction (DoDI) 5000.56; Standardizes geospatial data between echelons and ensures Standard, Sharable Geospatial Foundation (a Mission Command Essential Capability) across Mission Command;  Sustains core mission of operations. Provides an interoperable geospatial baseline system of systems in theater, which is a near-term requirement that cannot be deferred. Geospatial is a Mission Command Essential Capability and a critical enabler for the Common Operating Environment (COE) and the warfighter."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Geospatial Acquisition Support Office"
                                    },
                                    "Description": {
                                        "val": "This effort supports the systems engineering, architecture, and test and certification of Army Acquisition Systems to support Program Executive Office (PEO)\/Program Manager (PM) Computing Environment geospatial requirements to ensure that system's acquisition processes address geospatial concepts, technology and standards early in their development processes and provide an interoperable geospatial baseline system of systems in theater, which is a near-term requirement that cannot be deferred."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.634"
                                            },
                                            "Text": {
                                                "val": "Develop geospatial end state for the AGE implementation within the COE version 3.0; Update geospatial data model ensuring integration between United States (US) Marine Corp and Army and alignment with updated NSG standards; Define National to tactical geospatial architecture for MC, Develop AGE certification processes (aligned with current and planned Army and NGA certification processes) to ensure MC systems align with AGE standards and architectures and therefore can exchange geospatial data. Develop profile for geopackage within the COE to ensure standard implementation within Mission Command.  Will identify implementation recommendations (standards profiles, architectures and data model improvements) for AGE for COE version 3.0. Will continue improving geospatial data exchange with users in a disconnected, intermittent, and limited network environment environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.098"
                                            },
                                            "Text": {
                                                "val": "Will extend the AGE implementation within the Command Post Computing Environment (CP CE), Mounted and Mobile Hand-Held CE's; will develop alternatives for providing Standard, Sharable Geospatial Foundation ((SSGF) a Mission Command Essential Capability) to Mission Command Systems in a disconnected, Intermittent or Limited (DIL) environment; Will develop and recommend standards to distribute SSGF from National to Tactical; will develop \"to be\" AGE roadmap for Mission Command ensuring interoperability between Mission Command systems, the NSG, and our Joint, Inter-Agency, Inter-Governmental and Multi-National (JIIM) partners; will provide geospatial domain expertise for Cross-Cutting Capabilities for the Common Operating Environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.301"
                                            },
                                            "Text": {
                                                "val": "Will extend the AGE implementation within the Command Post Computing Environment (CP CE), Mounted and Mobile Hand-Held CE's; will develop alternatives for providing Standard, Sharable Geospatial Foundation ((SSGF) a Mission Command Essential Capability) to Mission Command Systems in a disconnected, Intermittent or Limited (DIL) environment; Will develop and recommend standards to distribute SSGF from National to Tactical; will develop \"to be\" AGE roadmap for Mission Command ensuring interoperability between Mission Command systems, the NSG, and our Joint, Inter-Agency, Inter-Governmental and Multi-National (JIIM) partners; will provide geospatial domain expertise for Cross-Cutting Capabilities for the Common Operating Environment."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}