{
    "id": "2019-Navy-PB-1319-JBOOK-537288bb42cd06b820f36efcf65b2a737491c736bab4820c1757960e05e3c4ff-18",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603123N"
        },
        "ProgramElementTitle": {
            "val": "Force Protection Advanced Technology"
        },
        "R1LineNumber": {
            "val": "19"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "83.146"
            },
            "CurrentYear": {
                "val": "26.342"
            },
            "BudgetYearOne": {
                "val": "2.423"
            },
            "BudgetYearOneBase": {
                "val": "2.423"
            },
            "BudgetYearTwo": {
                "val": "2.447"
            },
            "BudgetYearThree": {
                "val": "2.503"
            },
            "BudgetYearFour": {
                "val": "2.518"
            },
            "BudgetYearFive": {
                "val": "2.561"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The funding decrease from FY18 to FY19 reflects the realignment and consolidation of resources from the current Program Element (PE) Project 2912 to the new FY19 Navy Advanced Technology Development (ATD) PE 0603671N, in the Navy Advanced Technology Project 3433. Specific efforts transferred from this PE include all planned continuing and initiating research associated with the Surface Ship and Submarine Hull Mechanical and Electrical, and Aircraft Technology research efforts."
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval S&T Strategic Plan approved by the S&T Corporate Board. This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nThis PE addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This program supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial and air) and the protection of those platforms. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.438"
                },
                "CurrentYear": {
                    "val": "26.342"
                },
                "BudgetYearOne": {
                    "val": "37.032"
                },
                "BudgetYearOneBase": {
                    "val": "37.032"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "83.146"
                },
                "CurrentYear": {
                    "val": "26.342"
                },
                "BudgetYearOne": {
                    "val": "2.423"
                },
                "BudgetYearOneBase": {
                    "val": "2.423"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "34.708"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-34.609"
                },
                "BudgetYearOneBase": {
                    "val": "-34.609"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.192"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-34.258"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-34.258"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.351"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.351"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-3.100"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "40.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2912"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection Advanced Technology"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "41.810"
                        },
                        "CurrentYear": {
                            "val": "23.568"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "65.378"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The funding decrease from FY18 to FY19 reflects the realignment and consolidation of resources from the current Program Element (PE) and Project 2912 into the new FY19 Navy Advanced Technology Development (ATD) PE 0603671N, and the Navy Advanced Technology Project 3433. Specific efforts transferred from this PE include all planned continuing and initiating research associated with the Surface Ship & Submarine Hull Mechanical & Electrical (HM&E), and Aircraft Technology research efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project addresses advanced technology development associated with providing the capability of Platform and Force Protection for the U.S. Navy. This project supports the development of technologies associated with all naval platforms (surface, subsurface, terrestrial, and air) and the protection of those platforms. For the new FY 2016 effort, Forward Deployed Energy and Communications Outpost (FDECO) INP, the project addresses advanced technology development associated with providing the undersea energy and communications infrastructure necessary to assure undersea dominance; extend the reach of undersea assets; enhance situational awareness (SA) and standoff advantage without reducing forward presence and; provide endurance for unmanned systems necessary for force multiplication in an anti-access\/area denial (A2\/AD) environment.  For the new FY 2016 effort, Medium Displacement Unmanned Surface Vehicle (MDUSV), the project will radically change the way the Navy does mine influence sweep, anti-submarine warfare (ASW) and electronic warfare (EW) missions; it will introduce larger unmanned surface vehicles (USV) to the Navy; and it will introduce advanced autonomy to the surface Navy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SURFACE SHIP & SUBMARINE HULL MECHANICAL & ELECTRICAL (HM&E)"
                                    },
                                    "Description": {
                                        "val": "Activity includes: advanced technology demonstrations to evaluate emerging energy technologies and advanced technology development for Unmanned Sea Surface Vehicles (USSV) in support of Naval S&T Focus Area on Autonomy and Unmanned Vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.283"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued the FDECO INP project.\n- Continued MDUSV effort to demonstrate the operational benefit of a highly autonomous, large USV with a modular payload capability and demonstrate at-sea three modular payloads. The activity will consist of advancements to  autonomous control, payload integration, and at-sea demonstration of vessel autonomous control and payloads supporting mine warfare, anti-submarine warfare and electronic warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.546"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Conduct advanced research related to critical S&T for development of autonomous navigation for USVs from host ship.\n\n-Expand research for conducting advanced technology demonstrations to evaluate emerging energy technologies using Navy and Marine Corps facilities as test beds and evolving the MDUSV effort to demonstrate the operational benefit of a highly autonomous, large USV with a modular payload capability and demonstrate at-sea three modular payloads.\n\n-Initiate efforts to fund a prototype and operational demonstration of At-Sea Rearm of Vertical Launch System (VLS) capability in a relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects the realignment of the funding for Surface Ship & Submarine Hull Mechanical & Electric (HME) to PE 0603671N Navy Advanced Technology Development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIRCRAFT TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "The Aircraft Technology activity develops technologies for enhanced capability of Naval aviation aircraft platforms in terms of mission effectiveness, platform range, responsiveness, survivability, observability, readiness, safety and life cycle cost. It also develops new Naval air vehicle concepts and high impact, scalable Naval air vehicle technologies, such as - autonomous air vehicle command and control, helicopter and tiltrotor rotor drive systems, aerodynamics, propulsion systems, materials, structures and flight controls for future and legacy air vehicles. This activity directly supports the Naval Aviation Enterprise Science and Technology Objectives and the Naval Science and Technology Strategic Plan, principally in the Autonomy and Unmanned Systems, Platform Design and Survivability, Power and Energy and Total Ownership Cost Focus Areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.527"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued demonstration of initial core software, sensor, air vehicle and capability applications for AACUS.\n- Continued the advanced technology demonstration portion of the Variable Cycle Advanced Technology (VCAT) Program.\nCritical technology development efforts will begin with major engine manufactures and system contractors to develop\/\nmature the highest priority, long lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier based Tactical Air (TACAIR) Intelligence, Surveillance and Reconnaissance(ISR) systems.\n- Continued VCAT Phase I variable cycle engine\/propulsion subsystem technology development efforts through completion.\n- Continued the joint TERN program to conduct an at sea demonstration of Vertical Take-Off and Landing (VTOL) enabling technologies in support of DDG-51 and LCS-2 based future long endurance Unmanned Air Vehicle (UAV) capabilities.\n- Continue the AACUS program by demonstrating the capability to perform the assault support mission from mission request to final landing on a multiple delivery flight."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the advanced technology development efforts and demonstrations of the VCAT Program. Critical technology development efforts continue with major engine manufactures and system contractors to develop\/mature the highest priority, long lead propulsion system technologies, including variable\/adaptive cycle engine components, for next generation carrier based TACAIR ISR systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects the realignment of the funding for Aircraft Technology to PE 0603671N Navy Advanced Technology Development."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goals of this advanced technology program are the development of technologies which focus on the warfighter and providing the ability to win or avoid engagements with other platforms or weapons and, in the event of engagement, to resist and control damage, while preserving operational capability. Overall metric goals are to transition the advanced technology projects into acquisition programs. Each Activity within this PE has unique goals and metrics, some of which include classified quantitative measurements. Specific examples of metrics under this PE include: - Advanced technology demonstrations to evaluate emerging energy technologies. \n\nFor the FDECO INP effort, the overall goals is the development of technologies which focus on energy management and transfer technologies that enable persistent undersea operations by unmanned vehicle (UxV) Fleet; provide system architectures that are persistent, scalable and mission agile; provide communication and energy infrastructure available in degraded and contested environments and; provide a platform-agnostic solution that reduces development and maintenance costs.  Overall metric goals are to transition the key advanced technology elements, Forward Deployed Energy (FDE), Forward Deployed Communications (FDC) and Forward Deployed Docking (FDD) into acquisition programs. Each Activity within this PE has unique goals and metrics, some of which include classified quantitative measurements. Specific examples of metrics include: - Advanced technology demonstrations to evaluate energy and data transmission and persistent connectivity.\n\nMedium Displacement Unmanned Surface Vehicle (MDUSV), the objectives are to 1) Demonstrate, using specific payloads, the multi-mission versatility of MDUSV, and identify key interface requirements for future payloads. 2) Provide a robust assessment of MDUSV's collision regulations (COLREGs) autonomy to build confidence in the reliability and safety of the autonomous control system and  3) Enable the evaluation of MDUSV's operational utility and design to support an acquisition transition decision."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3049"
                    },
                    "ProjectTitle": {
                        "val": "Force Protection"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.650"
                        },
                        "CurrentYear": {
                            "val": "2.774"
                        },
                        "BudgetYearOne": {
                            "val": "2.423"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.423"
                        },
                        "BudgetYearTwo": {
                            "val": "2.447"
                        },
                        "BudgetYearThree": {
                            "val": "2.503"
                        },
                        "BudgetYearFour": {
                            "val": "2.518"
                        },
                        "BudgetYearFive": {
                            "val": "2.561"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Develop advanced technologies, critical to protecting naval installations, to provide seamless full spectrum protection against asymmetric attack by improving the ability to: detect and identify developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "EMERGING THREATS"
                                    },
                                    "Description": {
                                        "val": "This activity includes development of advanced technologies critical to protecting naval installations, and will provide seamless, full spectrum protection against asymmetric terrorist attack by improving the ability to: sense developing and immediate threats; shape our responses through improved situational awareness and decision making; shield personnel, mission critical facilities, infrastructure, and operating fleet assets; maintain essential functions; and sustain and restore critical services in the aftermath of an incident.  Technologies developed will also seek to reduce the required manpower and skill levels devoted to the force protection mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of lower cost\/higher performance Force Protection sensors and automated detection algorithms,\nand decision support tools.\n- Continued research to reduce force protection manpower and equipment costs through automation and predictive learning\nalgorithms.\n-Continued threat characterization research and perception experiments for sensor performance optimization and model\ndevelopment and validation.\n- Continued development of all weather sensors optimized for installation of force protection.\n- Continued research into sensors for use in counter-surveillance around protected facilities.\n- Continued research to advance sensor fusion capabilities in high density networks with diverse sensor grids.\n- Continued development of assessment algorithms and information analysis technologies to augment skills or replace\npersons in operations centers.\n- Continued interim demonstration of acoustic sensors for perimeter and area surveillance in realistic environments.\n- Continued development of protection technology for naval installation power and energy infrastructure.\n- Continued expansion of research into sensors and countermeasures for use against unmanned underwater to include\nsurface swimmers, underwater divers, and underwater diver propulsion aids.\n- Continued demonstration of multi-band electro-optical sensors and fusion algorithms in adverse weather conditions.\n- Continued demonstration of sensors and countermeasures for use against underwater to include surface swimmers,\nunderwater divers, diver propulsion aids, and underwater unmanned vehicles.\n- Continued research in non-acoustic detection, tracking, classification, engagement of underwater threats to naval\ninstallations.\n- Continued development of autonomous unmanned harbor defense systems for perimeter patrol and threat interdiction.\n- Continued research into automated vehicle entry control point monitoring, automatic vehicle classification, risk assessment and logic system decision making.\n- Continued development of non-contact biometric verification technologies to support unmanned automated access control\nsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of lower cost\/higher performance Force Protection sensors and automated detection algorithms,\nand decision support tools.\n- Continue research to reduce force protection manpower and equipment costs through automation and predictive learning\nalgorithms.\n-Continue threat characterization research and perception experiments for sensor performance optimization and model\ndevelopment and validation.\n- Continue development of all weather sensors optimized for installation of force protection.\n- Continue research into sensors for use in counter-surveillance around protected facilities.\n- Continue research to advance sensor fusion capabilities in high density networks with diverse sensor grids.\n- Continue development of assessment algorithms and information analysis technologies to augment skills or replace\npersons in operations centers.\n- Continue interim demonstration of acoustic sensors for perimeter and area surveillance in realistic environments.\n- Continue development of protection technology for naval installation power and energy infrastructure.\n- Continue research in non-acoustic detection, tracking, classification, engagement of underwater threats to naval\ninstallations.\n- Continue development of autonomous unmanned harbor defense systems for perimeter patrol and threat interdiction.\n- Continue research into automated vehicle entry control point monitoring, automatic vehicle classification, risk assessment and logic system decision making.\n- Continue development of non-contact biometric verification technologies to support unmanned automated access control\nsystems.\n- Continue and expand development of Virtual Inductive Loop technology to include pedestrians, two wheeled vehicles, and\nmulti-lane automated gates\n- Complete development and demonstration of electro-optic sensors and fusion algorithms for installation surveillance in\nadverse weather conditions.\n- Complete development and conduct demonstration of sensors and countermeasures for use against underwater threats to\ninclude surface swimmers, underwater divers, diver propulsion aids, and underwater unmanned vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.423"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.423"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Finish development and conduct full demonstration of Virtual Inductive Loop technology to include automated perimeter surveillance in the region of the entry control point. Replacing in ground inductive loops with video based virtual inductive loops will improve reliability and performance and reduce maintenance costs associated with Naval Facilities Engineering Command (NAVFAC) automated gates.  \nOngoing development of Autonomous Maritime Asset Protection capabilities for detection, classification, and defeat of small unmanned air, surface, and subsurface threats to naval installations through fusion of electro-optic sensors, acoustic sensors and countermeasures technologies demonstrated under this program."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding and reduced program costs from FY2018 to FY2019 is associated with the completion of the Virtual Inductive Loop technology effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The overall goal of this program is to develop technologies which will provide protection for our naval installations against asymmetric attack.  Specific metrics include: a 50% reduction of manpower required to perform force protection surveillance, situational awareness, and decision making, a 2x improvement in electro-optical sensor performance in adverse weather conditions, a 50% reduction in sensor cost per square or cubic meter of detection at a given resolution, and a 50% reduction in false alarm rates for automated detection and tracking algorithms both on, above and below water."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "38.686"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.686"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Autonomous Surface Unmanned Vehicle Research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "38.686"
                                        },
                                        "Text": {
                                            "val": "Funds executed to further research and support for Autonomous Surface Unmanned Vehicles, including design and fabrication of a second SEA HUNTER (MDUSV) hull."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}