{
    "id": "2019-DefenseSecurityCooperationAgency-PB-0400-JBOOK-4eb253e9e2e44c8a70c7587eea9a712999f81c968436af0f264e97b0fb6a860f-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DSCA-U_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Security_Cooperation_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Security Cooperation Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605127T"
        },
        "ProgramElementTitle": {
            "val": "Partner Outreach and Collaboration Support (POCS)"
        },
        "R1LineNumber": {
            "val": "190"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Security Cooperation Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "14.161"
            },
            "PriorYear": {
                "val": "1.374"
            },
            "CurrentYear": {
                "val": "1.871"
            },
            "BudgetYearOne": {
                "val": "1.855"
            },
            "BudgetYearOneBase": {
                "val": "1.855"
            },
            "BudgetYearTwo": {
                "val": "2.109"
            },
            "BudgetYearThree": {
                "val": "2.033"
            },
            "BudgetYearFour": {
                "val": "1.827"
            },
            "BudgetYearFive": {
                "val": "1.864"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Partner Outreach and Collaboration Support (POCS) is an Office of the Secretary of Defense (OSD) initiative. The goal of the program is to provide a common information technology platform (GlobalNET) to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of Department of Defense (DoD) institutions and Partners to directly share participants and content across proprietary community websites - fostering networks of partner influencers and enabling better use of DoD resources through collaboration among the Regional Centers for Security Studies, Partnership for Peace (PfP) and international partners, and other DoD educational institutions and communities. GlobalNET currently supports over 80,000 users. The program uses spiral methodology to speed the delivery of open source collaboration technologies the user community. The Defense Security Cooperation Agency (DSCA) oversees execution of the research and development of the GlobalNET effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs.\n\nThe GlobalNET effort focuses on improving collaboration, supporting outreach efforts, and enabling communication among the Regional Centers for Security Studies, the Combatant Commanders (COCOMs), the DSCA, Office of the Under Secretary of Defense for Policy (OUSD(P)), North Atlantic Treaty Organization’s (NATO) Military Partnerships Directorate (MPD), the PfP Consortium of Defense Academies, PfP Partner countries, and other DoD institutions and communities. It provides DoD and international partner security practitioners an unclassified secure platform to share information, communicate and collaborate globally 24\/7, and supports administrative activities. It provides the ability to form collaborative communities of interest around security issues. GlobalNET facilitates information sharing and knowledge management concepts in accordance with U.S. policy. POCS implements the Congressional endorsement for the modernization of Defense capabilities in eligible PfP countries relative to their telecommunications infrastructure, and provides allies and partner countries the ability to team in critical cooperative activities that underpin the spirit of the PfP program. The program supports PfP coalition Initiatives through the development of distributive collaboration tools to assist U.S.\/NATO-approved PfP cooperative activities. This support is important to achieve the interoperability\/integration outlined in the Guidance for the Employment of the Force. POCS additionally supports internet-based education, collaboration, exercise simulations, and training center requirements."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.374"
                },
                "CurrentYear": {
                    "val": "1.871"
                },
                "BudgetYearOne": {
                    "val": "1.855"
                },
                "BudgetYearOneBase": {
                    "val": "1.855"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.374"
                },
                "CurrentYear": {
                    "val": "1.871"
                },
                "BudgetYearOne": {
                    "val": "1.855"
                },
                "BudgetYearOneBase": {
                    "val": "1.855"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "No change explanation required."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "000204"
                    },
                    "ProjectTitle": {
                        "val": "Partner Outreach and Collaboration Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.161"
                        },
                        "PriorYear": {
                            "val": "1.374"
                        },
                        "CurrentYear": {
                            "val": "1.871"
                        },
                        "BudgetYearOne": {
                            "val": "1.855"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.855"
                        },
                        "BudgetYearTwo": {
                            "val": "2.109"
                        },
                        "BudgetYearThree": {
                            "val": "2.033"
                        },
                        "BudgetYearFour": {
                            "val": "1.827"
                        },
                        "BudgetYearFive": {
                            "val": "1.864"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "POCS is an OSD initiative. The goal of the program is to provide a common information technology platform GlobalNET to improve international partner outreach and collaboration efforts in a federated environment. A federated environment – characterized by the capacity of DoD institutions and Partners to directly share participants and content across proprietary community websites - fostering networks of partner influencers and enabling better use of DoD resources through collaboration among the Regional Centers for Security Studies, PfP and international partners, other DoD educational institutions and communities. GlobalNET currently support over 80,000 users. The program uses spiral methodology to speed the delivery of open source collaboration technologies the user community. The DSCA oversees execution of the research and development of the GlobalNET effort and its operations, and ensures that the program addresses DoD security cooperation requirements in the context of defense, interagency, and international information sharing and collaboration needs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Partner Outreach and Collaboration Support (POCS)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.374"
                                            },
                                            "Text": {
                                                "val": "Add redundant\/additional user capacity. This includes expanding the hardware and software to an alternate site to allow additional users to access and use the system concurrently and be a backup site in the event of a disaster or failure. Because of all of the advanced graphics and expansion of the user base, it is expected that we will need this additional capacity and the best plan to distribute it out to an alternate location."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.871"
                                            },
                                            "Text": {
                                                "val": "Continue to update the GlobalNET implementation to the newest platform stable release - allowing greater functionality and better security across all members of the platform.\n\nRecertify the security accreditation process which also reflects the new and updated software capabilities as well newly integrated educational organizations.\n\nConduct the research and define the requirements for a gaming and exercise simulation module."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.855"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.855"
                                            },
                                            "Text": {
                                                "val": "Continue updates to the GlobalNET platform: functionality, security, e-Learning, and design.  Update and expand capabilities of the Ilias learning management system.  Develop the gaming and simulation module."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A decrease of -$16,000 from FY2018 to FY2019 is a result of the POCS program reduction in the GlobalNET effort.  Additional support to the War Colleges will also help create further reductions in NDU and other OSD organizations ."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The GlobalNET effort employs a spiral acquisition strategy ensuring a well-defined model for each institution\/community that can be exported globally. The program uses an organizational approach to ensure sustainable, and updated technology and information sharing procedures. By partnering with other U.S. Government activities, existing assets are leveraged to preserve U.S. investments, avoid duplication of effort between activities, and offer economically prudent solutions to improve information sharing and achieve U.S. security cooperation goals. Independent Operational Test teams are brought on to ensure that GlobalNET bears independent validation of the development team’s effort."
                        },
                        "PerformanceMetrics": {
                            "val": "POCS development performance is measured in several methods: the successful meeting of stated performance objectives in the statement of work, and meeting target dates in the project management plan; via a combination of statistics including the number of trouble tickets generated on the development site, operational user feedback on development site usability, and design; and the system’s performance during developmental and operational testing.  The use of a 3rd party to execute the operational test ensures that the system meets the performance metrics prior to moving to production."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Defense Security Cooperation Agency"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Civic Actions"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Berkeley, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.161"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.374"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.871"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.855"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.855"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "GlobelNet Update"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Upgrade Core and Maintenance Releases"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2016"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Deploy to Other Institutions"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2014"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}