{
    "id": "2019-Navy-PB-1319-JBOOK-537288bb42cd06b820f36efcf65b2a737491c736bab4820c1757960e05e3c4ff-23",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603673N"
        },
        "ProgramElementTitle": {
            "val": "(U)Future Naval Capabilities Advanced Tech Dev"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "254.203"
            },
            "CurrentYear": {
                "val": "231.772"
            },
            "BudgetYearOne": {
                "val": "232.996"
            },
            "BudgetYearOneBase": {
                "val": "232.996"
            },
            "BudgetYearTwo": {
                "val": "230.269"
            },
            "BudgetYearThree": {
                "val": "249.478"
            },
            "BudgetYearFour": {
                "val": "269.260"
            },
            "BudgetYearFive": {
                "val": "274.734"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The FNC program represents the requirements-driven, delivery-oriented piece of the DON S&T portfolio. The efforts described in this Program Element (PE) address the Advanced Technology Development associated with the Future Naval Capabilities (FNC) Program.  The objective of the work in this PE is to develop promising technologies emerging from the FNC Applied Research program funded in PE 0602750N Future Naval Capabilities Applied Research that have been matured to higher Technology Readiness Levels (TRLs).  The FNC Program was restructured for FY19 to accelerate transition to the Fleet and Force.  This restructuring involved a zero based review of all ongoing FNC projects, where each effort was assessed for its technology maturity and transition commitment.  Ongoing efforts were categorized as FNCs or Technology Candidates.  Some efforts were terminated and others were accelerated to achieve the goals of the restructured program.  Funding for FNCs, which have higher Technology Readiness Levels (TRLs of 4\/5 to 6) and transition funding commitments, is being resourced in this PE.  Funding for technology candidates at lower TRLs (3 to 4) is being resourced in PE 0602750N Future Naval Capabilities Applied Research .  ONR is working closely with the Resource Sponsors and acquisition stakeholders to develop high priority technological capabilities needed by the operational forces."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "249.092"
                },
                "CurrentYear": {
                    "val": "231.772"
                },
                "BudgetYearOne": {
                    "val": "233.894"
                },
                "BudgetYearOneBase": {
                    "val": "233.894"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "254.203"
                },
                "CurrentYear": {
                    "val": "231.772"
                },
                "BudgetYearOne": {
                    "val": "232.996"
                },
                "BudgetYearOneBase": {
                    "val": "232.996"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.111"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.898"
                },
                "BudgetYearOneBase": {
                    "val": "-0.898"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-6.711"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-5.105"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.898"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.898"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.073"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "17.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request was reduced by $0.202 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nTechnical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3346"
                    },
                    "ProjectTitle": {
                        "val": "Future Naval Capabilities Adv Tech Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "237.761"
                        },
                        "CurrentYear": {
                            "val": "231.772"
                        },
                        "BudgetYearOne": {
                            "val": "232.996"
                        },
                        "BudgetYearOneBase": {
                            "val": "232.996"
                        },
                        "BudgetYearTwo": {
                            "val": "230.269"
                        },
                        "BudgetYearThree": {
                            "val": "249.478"
                        },
                        "BudgetYearFour": {
                            "val": "269.260"
                        },
                        "BudgetYearFive": {
                            "val": "274.734"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Prior to FY19, FNC Program investments were selected almost two years in advance of execution.  It was determined by Navy and Marine Corps leadership that this approach limits DON's ability to exploit technology advances and respond quickly to naval needs.  As a result, future BA 3 investments supporting the FNC Program are now made less than one year before commencing execution. Because FNCs are now starting at higher TRLs, the typical duration of an FNC has been shortened to 3-years.  The FNC Program has been fully restructured in favor of a more direct and higher level of collaboration. R-2 Activities were modified for FY19 to align to warfare areas and the corresponding resource sponsors that will integrate FNC technologies into acquisition programs of record.  A complete accounting of the technologies being developed and a full disposition of each technology development effort referenced as continuing in the FY18 plans of this PE will be provided separately to the Congressional oversight committees."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CAPABLE MANPOWER (CMP)"
                                    },
                                    "Description": {
                                        "val": "The Capable Manpower R-2 Activity, modified for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N Future Naval Capabilities Applied Research .  These advanced technology investments align to acquisition programs of record principally under the purview of Deputy CNO for Manpower, Personnel, Training and Education and Marine Corps Training and Education Command (TECOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.322"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Continue Manpower Planning and Optimization Toolset - Develop software that produces a feasible set of shipboard event timelines, workload packages, and skills for each billet created for a given ship and system design.\n- Complete Platform Design and Acquisition Toolset - Demonstrate software to simulate the design and manpower interactions that are used to determine the trade spaces and cost commitments required for a given platform design and manning compliment.\n\nEC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Continue UAS Control Station Human Machine Interface - Deliver Human Machine Interface Prototype Software for supervisory control of unmanned systems to the submarine combat system.\n- Complete Selection for UAS Personnel (SUPer) - Develop and demonstrate unmanned aircraft operator selection and classification test batteries.\n- Complete Dynamic, Adaptive & Modular Training for UAS - Develop and demonstrate automated scenarios and clutter entity behaviors in the Navy's common training system technology for the Next Generation Threat System.\n\nEC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Continue Digital Integrated Representation of Tactical Environment (DIRTE) - Define Enterprise level Application Programming Interface (API) requirements to create Virtual Battlespace 2 (VBS2) terrain from government supplied source data (e.g., National Geospatial-Intelligence Agency products such as Digital Terrain Elevation Data and Digital Feature Analysis Data).\n- Continue Simulation Tailored Training and Assessment (ST2A) - Develop software and hardware prototypes to execute decision making programs of instructional scenarios in simulation.\n- Continue Decision Making-Learning Management System (DM-LMS) - Develop a Marine Corps Training Information Management System (MCTIMS) software prototype to provide repository and trend analysis of performance data to inform training readiness assessments, including the performance and development of individual Marines, small unit leaders, and small units over time.\n\nEC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Continue Environment Designed to Undertake Counter A2AD Tactics Training & Experimentation (EDUCAT2E) - Demonstrate simulated Electromagnetic Environmental Effects on Fleet training and operational systems in a networked Live, Virtual, and Constructive environment in a distributed scenario-driven Fleet Synthetic Training event.\n\nEC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop software to assist Carrier Strike Group staffs that support comprehensive\/collaborative planning through the use of decision support services, analytic tools, and common displays that assist planners during the creation of navigation and tactical plans.\n\nEC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Initiate Future Integrated Training Environment (FITE) - Develop technologies and techniques to integrate Marine Corps simulations to support Live, Virtual, and Constructive training events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.541"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: CMP-FY13-02 SIMULATION TOOLSET FOR ANALYSIS OF MISSION, PERSONNEL AND SYSTEMS (STAMPS)\n- Complete Manpower Planning and Optimization Toolset - Demonstrate the newly developed manpower planning and optimization functional enhancements targeted for transition.\n\nFNC: CMP-FY14-02 UNMANNED AERIAL SYSTEMS INTERFACE, SELECTION AND TRAINING TECHNOLOGIES (U-ASISTT)\n- Complete UAS Control Station Human Machine Interface - Integrate human machine interface and vehicle controller software into the Advanced Processor Build (APB) -17 software update for the AN\/BYG-1 combat control system.\n\nFNC: CMP-FY15-01 ACCELERATING DEVELOPMENT OF SMALL UNIT DECISION MAKERS (ADSUDM)\n- Complete Decision Making-Learning Management System (DM-LMS) - Assess the reliability and validity of DM-LMS design measures.\n- Complete Digital Integrated Representation of Tactical Environment (DIRTE) - Test and demonstrate the Graphical User Interface (GUI) to assess the ease of use and ability to modify the terrain and associated features. \n- Complete Simulation Tailored Training and Assessment (ST2A) - Test and evaluate the full ADSUDM concept using the integrated training simulation demonstration prototype.\n\nFNC: CMP-FY15-02 ENVIRONMENT DESIGNED TO UNDERTAKE COUNTER A2AD TACTICS TRAINING & EXPERIMENTATION (EDUCAT2E)\t\n- Complete Environment Designed to Undertake Counter A2AD Tactics, Training & Experimentation (EDUCAT2E) - Conduct a final demonstration and transition the newly developed, denied-and-degraded effects technology to platform sponsors, the training community, and combat system developers.\n\nFNC: CMP-FY16-01 OPERATIONAL PLANNING TOOL\n- Continue Operational Planning Tool - Develop new software tools that support comprehensive and collaborative planning through the use of decision support services, analytic tools, and common displays. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-01 under a new Information Warfare R-2 Activity)\n\nFNC: CMP-FY17-01 MANPOWER, PERSONNEL & TRAINING STRATEGIC PLANNING APPLICATION\n- Initiate Manpower, Personnel & Training Planning Application - For this FNC, delayed one year to start in FY18, develop decision support software to capture key interconnections, time delays and feedbacks between Manpower, Personnel, and Training stakeholders that serve as a common set of assumptions and boundaries for decision analyses. \n\nFNC: CMP-FY17-02 FUTURE INTEGRATED TRAINING ENVIRONMENT (FITE)\n- Continue Future Integrated Training Environment (FITE) - Develop synthetic environment language to communicate changes during run-time, and implement changes within the simulations.\n\nFNC: CMP-FY18-01 LEARNING CONTINUUM AND PERFORMANCE AID (LCAPA)\n- Initiate Learning Continuum and Performance Aid (LCaPA) - Commence development of a federated software system to manage an individualized learning continuum through on-the-job and other training events that includes career path guidance and performance tracking. \n\nFNC: CMP-FY18-02 MANNED AND UNMANNED COMMON PLANNING PICTURE\n- Initiate Manned and Unmanned Common Planning Picture - Commence development of software to enable a sailor to plan and brief manned (navigation, own ship, etc.) and unmanned (UUV and UAV) events simultaneously as an integrated planning tool that communicates the commander's intent. (In FY19, this FNC Product will be realigned within this PE to UW-FY18-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: CMP-FY19-03 Fleet Training Technologies (FleeT2)\n- Initiate FleeT2 - Commence development of adaptive, dynamic tools to capture and assess mission performance of warfare teams and operators to support high-velocity and ready relevant learning of representational techniques, model dynamics, and high computational tractability. (In FY19, this FNC Product will be realigned within this PE to SW-FY19-04 under a new Surface Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.723"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on the future integrated training environment for integrated air and ground operations of the marine air-ground task force, learning continuum and performance aids, manpower, personnel and training strategic planning, simulation tailored training and assessments, decision making and learning management systems, an assessment process for the selection of unmanned aerial systems personnel, simulation toolsets for analysis of mission, personnel and systems that includes techniques to optimize manpower planning, next generation perceptual training systems and tools, augmented immersive team training, behavioral and performance analysis for intelligent training, advanced technologies for automated performance assessment in games and tools for game-based training and assessment of human performance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY18 to FY19 decrease for this R-2 Activity is due to the modifications that were made to the overall FNC Program R-2 Activity Structure, which moved some investments previously aligned to this R-2 Activity to the Information Warfare, Surface Warfare and Undersea Warfare R-2 Activities as noted in the FY18 Plans section below."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENTERPRISE AND PLATFORM ENABLERS (EPE)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.306"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EPE-FY09-07 AFFORDABLE SUBMARINE PROPULSION AND CONTROL ACTUATION\n- Complete Advanced Material Propeller - Conduct Full Scale Testing on a Collins Class Submarine.\n\nEC: EPE-FY10-01: ADVANCED SHIPBOARD WATER DESALINATION\n- Complete Advanced Navy Reverse Osmosis System - 100K GPD - Complete final testing of a 100K Gallons Per Day (GPD) robust reverse osmosis based water purification system on a ship platforms that was delayed due to reliable issues that were subsequently corrected.\n\nEC: EPE-FY11-01 FLIGHT DECK THERMAL MANAGEMENT\n- Complete Integrated Thermal Management System Design - Demonstrate feasibility of flight deck thermal management system during at-sea test.\n\nEC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Continue Tools for Predicting Array Operational Loading & Distribution - Fabricate and use the previously designed highly instrumented towed array to validate the predictive model of the forces operating on a towed array.\n\nEC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Assess the effectiveness of the developed surface treatment and repair tools for desensitizing and repairing sensitized aluminum.\n- Continue Aluminum Alloy Corrosion Prediction Tool - Integrate the Degree of Sensitization (DoS) prediction algorithm software into the DoS detection tool.\n\nEC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Demonstrate, test, and down-select advanced coatings and alloy combinations that are suitable for higher temperature marine gas turbine engine service in the marine environment.\n\nEC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Construct new test methods for the materials being developed.\n\nEC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Initiate Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Perform initial laboratory verification and qualification studies on modified primer and topcoat chemistries, including chemical analysis and material interaction compatibility verification.\n\nFNC:  EPE-FY19-04 Signature Management System (SMS)\n- Initiate SMS - Conduct advanced technology development for submarine applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.559"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EPE-FY13-01 TOWED ARRAY SYSTEM RELIABILITY IMPROVEMENT\n- Complete Tools for Predicting Array Operational Loading & Distribution - Conduct at-sea testing of an instrumented towed array on a Virginia Class submarine and continue validation efforts on the numerical tool.  \n\nFNC: EPE-FY14-02 ALUMINUM ALLOY CORROSION CONTROL AND PREVENTION\n- Continue Aluminum Alloy Corrosion Mitigation Technologies - Demonstrate aluminum coating effectiveness to minimize Degree of Sensitization (DoS) and develop aluminum DoS repair tools to mitigate corrosion damage. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-01 under a new Surface Warfare R-2 Activity)\n- Complete Aluminum Alloy Corrosion Prediction Tool - Demonstrate integration of Degree of Sensitization (DoS) detection algorithms with the DoS detection tool and conduct testing of the integrated capability.\n\nFNC: EPE-FY15-02 GAS TURBINE UPGRADES FOR REDUCED TOTAL OWNERSHIP COST (TOC) AND IMPROVED SHIP IMPACT\n- Continue Shipboard Gas Turbine Marinization Package for Higher Temperature, Higher Pressure Operation - Conduct OEM qualification testing for environmental and mechanical properties, and ease of fabrication for engine components for a planned demonstration test. (In FY19, this FNC Product will be realigned within this PE to SW-FY15-01 under a new Surface Warfare R-2 Activity)\n\nFNC: EPE-FY15-03 SPECIAL HULL TREATMENT\n- Continue New Material(s) Development & Lab Characterization - Design and carry out experiments which fully characterize medium-scale material concepts. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: EPE-FY16-01 ADVANCED TOPCOAT SYSTEM (ATS)\n- Continue Advanced Topcoat Systems for Air Vehicle (ATS-AV) - Perform initial laboratory verification and qualification studies on modified primer and topcoat chemistries, including chemical analysis and material-interaction compatibility verification. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-01 under a new Air Warfare R-2 Activity)\n\nFNC:  EPE-FY19-04 Signature Management System (SMS)\n- Continue SMS - Continue developing advanced signature management technology for submarine applications. (In FY19, this FNC Product will be realigned within this PE to UW-FY19-01 under a new Undersea Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EXPEDITIONARY MANEUVER WARFARE (EMW)"
                                    },
                                    "Description": {
                                        "val": "The Expeditionary Maneuver Warfare R-2 Activity, modified for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Deputy Commandant for Combat Development and Integration (CD&I) and the Director of Expeditionary Warfare (OPNAV N95)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.920"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: EMW-FY12-02 FUTURE JOINT COUNTER RADIO-CONTROLLED IED ELECTRONIC WARFARE (JCREW)\n- Complete Distributed Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (D-JCREW) - Demonstrate tactical-level distributed jamming on multiple ground-based Electronic Warfare (EW) systems using realistic scenarios.\n- Complete Integrated Joint Counter Radio-Controlled Improvised Explosive Device Electronic Warfare (I-JCREW) - Demonstrate the simultaneous reception and transmission of Electronic Warfare (EW) and blue-force communication waveforms using realistic scenarios.\n\nEC: EMW-FY16-01 DENSIFIED PROPELLANT FIRE FROM ENCLOSURE - CONFINED SPACE (FFE\/CS)\nPROPULSION TECHNOLOGIES\n- Continued in PE 0603640M Marine Corps Advanced Technology Demonstration\n\nEC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Initiate High Reliability DPICM Replacement - Demonstrate with the 155mm M777A2 gun launch through modeling and simulation that High Reliability Dual-purpose Improved Conventional Munitions hardware will survive setback and gun balloting forces in order to activate the on-board power supply and initialize the arming sequence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: EMW-FY17-01 HIGH RELIABILITY DPICM REPLACEMENT (HRDR)\n- Continued High Reliability DPICM Replacement in PE 0603640M."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.551"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.551"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on autonomous unmanned surface vehicles for mine warfare, off-board refueling and data transfer for unmanned surface vehicles, automated data analysis for expeditionary mine-countermeasures, advanced undersea weapon systems for mine warfare, ground based air defense on-the-move high energy laser systems, advanced sonar technology for high clearance rate mine countermeasures, defense of harbor and near-shore naval infrastructure against asymmetric threats, fuel efficient tactical vehicles, renewable and sustainable expeditionary power, exchange of actionable information at the tactical edge, actionable intelligence enabled by persistent surveillance, densified propellants for fire from enclosed\/confined spaces, spectral and reconnaissance imagery, azimuth and inertial navigation systems, counter radio-controlled improvised explosive device electronic warfare, and precision universal mortars."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY18 to FY19 for this R-2 Activity is due to the modifications that were made to the overall FNC Program R-2 Activity Structure, which moved some investments previously aligned to the Sea Shield FY18 R-2 Activity into this R-2 Activity as noted in the FY18 Plans section of the Sea Shield R-2 Activity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCE HEALTH PROTECTION (FHP)"
                                    },
                                    "Description": {
                                        "val": "The Force Health Protection R-2 Activity focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities Applied Research.  These advanced technology investments align to programs under the purview of the Surgeon General of the Navy (OPNAV N093) and the Defense Health Agency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.364"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FHP-FY12-01 AUTOMATED CRITICAL CARE SYSTEM\n- Complete Automated Critical Care System (ACCS) - Complete integration of software algorithms and hardware, and perform FDA tests\/trials as required.  \n\nEC: FHP-FY12-02 SAVING LIVES WITH EMERGENCY MEDICAL PERFLUOROCARBONS IN THE FIELD (SEMPER FI) FOR SEA, AIR & LAND DYSOXIA\n- Complete SEMPer Fi for Air Dysoxia - Finish down-select of candidate drugs based on small and large animal testing for treatment of pulmonary hypertension.\n- Complete SEMPer Fi for Land Blast Kit - Conduct final demonstration of an optimal treatment application and overall duration of therapeutic hypothermia for immediate treatment of blast overpressure in small and large animals, including injury to the brain and\/or internal organs.\n\nEC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH\n- Continue Hypoxia Alert and Mitigation System - Develop hypoxia alert system hardware and software to guide treatment of casualties in order to sustain performance during high-altitude mountain operations.\n\nEC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Continue Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate the bioactive coating and external conformal cover, conclude pre-clinical studies, and prepare for initiation clinical studies.  \n\nEC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Continue Blast Load Assessment: Sense and Test (BLAST) (formerly sensor, algorithm, and neurofunctional assessment tool) - Formulate algorithms to guide medical evaluation decisions after exposure to potential traumatic brain injuries and provide scientific evidence for the development of safe blast exposure limits, enhance the neuro-functional assessment tool to discriminate between traumatic brain injury and other operational impacts, and integrate blast force data from the sensor into the predictive traumatic brain injury algorithm.\n\nEC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Initiate I-PREDICT - Incorporate the high strain rate characteristics of human tissues to allow accurate prediction of military type injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FHP-FY13-03 EXTREME OPERATIONS: MITIGATING OXYGEN IMBALANCE AT ALTITUDE AND AT DEPTH \n- Continue Hypoxia Alert and Mitigation System - Continue activities to adapt the hypoxia alert system hardware\/software to guide treatment of casualties in order to sustain performance during high-altitude mountain operations.\n\nFNC: FHP-FY14-01 ACUTE CARE COVER FOR SEVERELY INJURED LIMBS (ACCSIL)\n- Complete Acute Care Cover for Severely Injured Limbs (ACCSIL) - Integrate the bioactive coating and external conformal cover, which will conclude the pre-clinical studies.  \n\nFNC: FHP-FY14-03 BLAST LOAD ASSESSMENT: SENSE AND TEST (BLAST)\n- Complete Blast Load Assessment: Sense and Test (BLAST) - Integrate blast force sensor technologies with algorithms relating blast force exposures to the likelihood of injury, and conduct clinical testing of the neuro-functional assessment tool.\n\nFNC: FHP-FY16-01 INCAPACITATION PREDICTION FOR READINESS IN EXPEDITIONARY DOMAINS - AN INTEGRATED COMPUTATIONAL TOOL (I-PREDICT)\n- Continue I-PREDICT - Conduct measurements of the high strain rate characteristics of human tissues to allow an accurate prediction of the severity of battlefield injuries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.802"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on enabling new practices, procedures, medical devices and pharmaceuticals for the improvement of personnel performance, casualty prevention and combat casualty care. These technologies aim to decrease the logistical burden of forward medical operations, mitigate and prevent combat-related illness and injury, and provide cutting-edge medical applications for Navy and Marine Corps warfighters on land, at sea and in the air."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY18 to FY19 decrease in this R-2 Activity is due to the completion in FY18 of FHP-FY14-01 Acute Care Cover for Severely Injured Limbs (ACCSIL) and FHP-FY14-03 Blast Load Assessment Sense and Test (BLAST)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FORCENET (FNT)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.919"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Continue EW Battle Management (EWBM) - Integrate Blue and Red force monitoring in Electronic Warfare (EW) planning and execution, and Navy communication and control doctrine.\n\nEC: FNT-FY13-03 SILK THREAD\n- Continue Silk Thread Product 1 - Conduct advanced technology development.\n- Continue Silk Thread Product 2 - Conduct advanced technology development.\n\nEC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Continue Adaptive Multi-Int Correlation & Identification (AMICA) - Develop, test and modify algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n- Complete Detection & Classification Algorithms (DCA) - Develop, test and modify algorithms to provide enhanced detection and classification metrics and robust performance under stressing environmental conditions.\n\nEC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Continue Adaptive TCPED for ASW Services - Develop algorithms and software to assure network connectivity for low latency data sharing and autonomous and adaptive Command and Control (C2) services for coordination of data collection and sharing.\n- Continue Data Exfiltration and Networked Platform Interaction - Demonstrate and assess the performance of the radio components and waveforms in the host platform in simulated environments.\n\nEC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue from PE 0603640M Actionable Information Tactical Applications from PE 0603640M - Develop algorithms to assess the content of a machine produced product to a reference Information Requirement (IR) ontology.\n\nEC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Implement techniques to improve Advanced Hawkeye E2-D electronic protection capability.\n\nEC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Test and evaluate new analytic services based on multi-source correlation (Environment, Combat Systems, C2, ISR, EW, Cyber and national\/offboard ISR) using property graphs, applying probabilistic analytic models for improved target detection and for historical and predictive analytics supporting ASW, IAMD and EXW amphibious missions.\n\nEC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate the ability to simultaneously run and change in real time different Electronic Warfare\/Electronic INTelligence (EW\/ELINT) processing capabilities on the same modular hardware.\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Demonstrate in the laboratory an initial modular Broadband Radio Frequency (RF) front end coupled to a small Intelligence, Surveillance, and Reconnaissance (ISR) collection payload.\n- Continue Electronic Warfare Tactical Decision Aid (EW-TACAID) - Develop an intuitive Electronic Warfare display with an onboard integrated adaptive training capability to improve the ability of Electronic Support Measures to manage increasingly complex Radio Frequency environments.\n\nEC: FNT-FY16-01 BUGLE\n- Continue Bugle - Develop and test algorithms for integration into communication systems.\n\nEC: FNT-FY16-02 Combined EO\/IR Surveillance and Response System (CESARS)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Begin fabrication of staring, panoramic situational awareness sensors.\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Begin fabrication of the high resolution sensor.\n\nEC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Initiate Communications as a Service (CaaS) - Develop, emulate and prototype multi-commodity flow optimization techniques and routing\/bridging between Internet Protocol (IP) and non-IP networks with end-to-end Quality of Service (QoS).\n- Initiate Mission-based Networking for DDS (MiND) - Develop power-control, medium-access control and network topology\/routing to enhance bandwidth and scalability, while creating a new Internet Protocol (IP) interface and maintaining interoperability with legacy Cooperative Engagement Capability (CEC) systems.\n\nEC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Initiate Submarine Simultaneous Transmit and Receive (SubSTAR) - Verify concept of submarine broadband antenna enabling simultaneous transmit and receive capability.\n\nEC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Initiate SCRAM - Develop and demonstrate software algorithms that protect naval Hull, Mechanical and Electrical (HM&E) systems against cyber threats.\n- Initiate SCAMM - Develop and demonstrate information shaping cyber capabilities for tactical platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "61.657"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: FNT-FY13-01 EW BATTLE MANAGEMENT FOR SURFACE DEFENSE\n- Complete EW Battle Management (EWBM) - Automate blue and red force monitoring in Electronic Warfare (EW) planning and develop techniques to integrate that information into force level tactical decision making.\n\nFNC: FNT-FY13-03 SILK THREAD\n- Complete Silk Thread Product 1 - Complete hardware development and transition to designated programs of record.\n- Complete Silk Thread Product 2 - Complete hardware development and transition to designated programs of record.\n\nFNC: FNT-FY13-04 DETECTION AND FUSION FOR REMOTE SENSORS\n- Complete Adaptive Multi-Int Correlation & Identification (AMICA) - Extended into FY18 to complete the modification of algorithms to enable cross-domain information fusion and optimization of theater and tactical battlespace assets to conduct anti-surface warfare.\n\nFNC: FNT-FY14-02 ADAPTIVE TASKING, COLLECTION, PROCESSING, EXPLOITATION AND DISSEMINATION (TCPED) SERVICES\n- Complete Adaptive TCPED for ASW Services - Develop algorithms and software to ensure network connectivity for low latency data sharing and autonomous and adaptive Command and Control (C2) services for coordination of data collection and sharing.  \n- Complete Data Exfiltration and Networked Platform Interaction - Demonstrate and assess the performance of the radio components and waveforms in a host platform in simulated environments.\n\nFNC: FNT-FY14-03 EXCHANGE OF ACTIONABLE INFORMATION AT THE TACTICAL EDGE (EAITE)\n- Continue Actionable Information Tactical Applications - Develop gisting algorithms to assess the content of a machine produced product to a reference ontology. (In FY19, this FNC Product will be realigned within this PE to IW-FY14-02 under a new Information Warfare R-2 Activity) \n\nFNC: FNT-FY15-01 ADVANCED AIRBORNE EARLY WARNING ELECTRONIC PROTECTION (AAEWEP)\n- Continue Advanced AEW Electronic Protection - Test and improve Airborne Early Warning (AEW) electronic protection capabilities within a relevant environment. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-01 under a new Air Warfare R-2 Activity)\n\nFNC: FNT-FY15-02 DATA FOCUSED NAVAL TACTICAL CLOUD\n- Continue Data Focused Naval Tactical Cloud - Develop predictive motion models, enemy course-of-action and intent analytics with multi security levels for integrated fires and integrated air and missile defense operational intelligence. (In FY19, this FNC Product will be realigned within this PE to IW-FY15-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY15-04 SCALABLE INTEGRATED RF SYSTEM FOR UNDERSEA PLATFORMS (SIRFSUP)\n- Continue Compact, Scalable Integrated RF (Compact-SIRF) - Implement and evaluate spectral interference mitigation and coordination techniques during laboratory and at-sea tests. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity)\n- Complete Electronic Warfare Tactical Decision Aid (EW-TACAID) - Implement and test techniques developed to provide efficient operator interfaces in support of netted sensor and coordinated EW operations.  \n- Continue Scalable Integrated RF for Submarines (SIRF-Sub) - Demonstrate prototype effectiveness via testing in laboratory and at-sea scenarios. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-02 under a new Undersea Warfare R-2 Activity)\n\nFNC: FNT-FY16-01 BUGLE\n- Continue Bugle - Conduct testing and a demonstration of advanced waveforms. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY16-02 COMBINED EO\/IR SURVEILLANCE AND RESPONSE SYSTEM (CESARS)\n- Continue Multispectral EO\/IR Countermeasures against Advanced Threats (MEIRCAT) - Implement final designs through the fabrication of the high resolution sensor and optics hardware, laser hardware, turret hardware, and processing and system controls. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity)\n- Continue Shipboard Panoramic EO\/IR Cueing and Surveillance System (SPECSS) - Demonstrate a large Focal Plane Array (FPA) stitching and panoramic capability. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-03 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY17-01 COMMUNICATIONS AND INTEROPERABILITY FOR INTEGRATED FIRES (CIIF)\n- Continue Communications as a Service (CaaS) - Emulate, test and develop software for date forwarding and routing protocols between IP and non-IP networked data links. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity)\n- Continue Mission-Based Networking for DDS (MiND) - Initiate firmware porting and the porting of waveform software code to the emulation platform. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-01 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY17-02 SUBMARINE SIMULTANEOUS TRANSMIT AND RECEIVE (SUBSTAR)\n- Continue Submarine Simultaneous Transmit and Receive (SubSTAR) - Test and improve the prototype broadband simultaneous transmit and receive subsystems. (In FY19, this FNC Product will be realigned within this PE to UW-FY17-01 under a new Undersea Warfare R-2 Activity)\n\nFNC: FNT-FY17-04 RESILIENT HULL\/INFRASTRUCTURE MECHANICAL & ELECTRICAL SECURITY (RHIMES)\t\n- Continue SCAMM - Demonstrate proactive information shaping capabilities in the laboratory. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-02 under a new Information Warfare R-2 Activity)\n- Continue SCRAM- Demonstrate resilient software to protect redundant controllers and controllers without redundancy in a laboratory environment. (In FY19, this FNC Product will be realigned within this PE to SW-FY17-01 under a new Surface Warfare R-2 Activity)\n\nFNC: FNT-FY18-04 NANOSAT COMMUNICATIONS FOR A2AD OPERATIONS\n- Initiate Nanosat Communications Payloads - Integrate and test a nanosat payload to verify communications performance in the UHF-band in a laboratory environment. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n- Initiate Shipboard Integration - Integrate and test UHF networking with a digital mobile radio using a shipboard antenna and tracking. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-02 under a new Information Warfare R-2 Activity)\n\nFNC: FNT-FY18-05 ADVANCED COORDINATION TECHNIQUES FOR DISTRIBUTED EW\n- Initiate Coordinated Radio Frequency EW (CRFEW) - Implement precision geo-location and coordinated engagement techniques to surface ship applications in order to provide surface ships with emitter geo-location capabilities and the ability to coordinate electronic attack engagements on battlespace emitters. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)\n- Initiate Next Generation Surface Electronic Warfare User Interface - Begin a domain analysis for familiarization with relevant Navy systems, programs of record, technical performers, and the system constraints imposed on human machine interface development. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)\n- Initiate Propagation Channel Assessment and Prediction (PCAP) - Implement techniques for providing real-time propagation channel assessments using shipboard and netted radio frequency sensors and data communication infrastructures. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-03 under a new Information Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "POWER AND ENERGY (P&E)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.884"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Continue Air Independent Propulsion System - Continue conduct Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nEC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Continue High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Select the appropriate 20kV semiconductor devices and develop the related circuit topology and fault sensing algorithms.\n\nEC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop a ship multi-function energy storage module integrated system and complete development of a safe non-propagating battery subsystem.\n- Continue Compact High Density Tactical Energy Storage - Initiate development of a full scale multifunction energy storage module with hybrid power system interface.\n\nEC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Initiate Torpedo Advanced Propulsion System (TAPS) - Initiate limited component development and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.817"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: P&E-FY12-03 LONG ENDURANCE UNDERSEA VEHICLE PROPULSION\n- Complete Air Independent Propulsion System - Complete Phase II fuel cell energy system integration into a UUV energy section and conduct TRL-6 land-based testing and transition planning. \n\nFNC: P&E-FY14-01 EFFICIENT AND POWER DENSE ARCHITECTURE AND COMPONENTS\n- Complete High Power Solid State Circuit Protection for Power Distribution and Energy Storage - Complete circuit protection component testing in a relevant system environment.\n\nFNC: P&E-FY15-03 MULTIFUNCTION ENERGY STORAGE FOR NAVY \/ USMC APPLICATIONS TO MAXIMIZE OPERATIONAL EFFECTIVENESS AND EFFICIENCY\n- Complete Compact High Density Tactical Energy Storage - Complete development, demonstration, and testing of a full-scale Technology Readiness Level (TRL) 6 Compact High Density Tactical Energy Storage module with a hybrid power system interface.\n- Continue Multi-Function High Density Shipboard Energy Storage - Develop and demonstrate a megawatt scale multifunction energy storage system with an incorporated non-propagating battery subsystem. \n\nFNC: P&E-FY17-02 TORPEDO ADVANCED PROPULSION SYSTEM (TAPS)\n- Continue Torpedo Advanced Propulsion System (TAPS) - Conduct limited component development and testing, preparing for a down-selection to one technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA SHIELD (SHD)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "65.738"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Continue Compact Modular Sensor-Processing Suite (CMSS) - Complete Compact Modular Sensor-Processing Suite (CMSS) - Demonstrate multi-sensor detection of ocean mines from a manned helicopter.\n\nEC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Initiate test and demonstration planning for software algorithms and techniques for cross-platform radar operation that will deliver enhanced sensitivity.\n\nEC: SHD-FY13-05 HIGH ALTITUDE ASW (HAASW) FROM THE P-8\n- Complete Next Generation Multistatic Active Capability (NGMAC) - Demonstrate the Next Generation Multistatic Active Capability sonobuoys in a relevant at sea Navy environment.\n\nEC: SHD-FY13-07 USV PAYLOADS FOR SINGLE SORTIE MINE COUNTERMEASURES\n- Complete USV-based Mine Neutralization - Perform final system demonstration of Neutralizer Test Bed and associated technologies.\n- Complete Single Sortie MCM Detect-to-Engage Payload - Perform final system demonstration of launch, recovery, communications,  recharging systems, and associated algorithms\/vehicle payload support hardware.\n- Complete MCM Payload Automation for Data Analysis - Demonstrate system-level Automatic Target Recognition (ATR) capability at technology development exit event.\n- Complete MCM Payload Automation for Planning - Demonstrate component level risk analysis in war game exit event.\n\nEC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Conduct in-water component testing and data collection.\n- Continue Concept C Countermeasure - Conduct bench testing of array design improvements and prepare for in-water tests.\n\nEC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Tactical Positioning & Fire Control - Demonstrate node deployment modules & weapons payload integration.\n- Continue Autonomous Threat Detection and Localization - Develop final sensor node hardware\/software and perform functional testing.\n- Continue Remote Command & Control - Demonstrate an integrated communications package.\n\nEC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S (formerly Terminator E, R and S) - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools.\n\nEC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue MCM Task Force Planning - Develop approach to automate data management from Naval message traffic to support re-planning, scheduling, and situational awareness.\n- Continue Expeditionary MCM Automated Data Analysis - Extend in situ retraining algorithms to multi-band advanced sonar systems.\n\nEC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Continue Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launches.\n\nEC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Build mockups of the fuselage, rotor, and antenna cavity for RF payload antenna isolation experiments.\n\nEC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Customize hardware interfaces for assembly and integration of system level components.\n\nEC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Integrate algorithms with hardware for field communications, control, health monitoring, mission planning and contact separation and correlation.\n\nEC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms and align them with a pending system requirements review.\n\nEC: SHD-FY16-OSD MODULAR UNDERSEA EFFECTORS (MUSE)\n- Continued in PE 0603782N.\n\nEC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Initiate Autonomous Situational Awareness and Hazard Avoidance System for USVs - Integrate autonomous control on an Unmanned Surface Vehicle (USV) and demonstrate at-sea.\n- Initiate High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Integrate the superconducting system on an Unmanned Surface Vehicle (USV) and demonstrate at-sea.\n- Initiate Underway Refueling and Data Transfer for USVs and RMMVs - Integrate underway refueling and data transfer technology with Unmanned Surface Vehicles (USVs) and Remote Multi-Mission Vehicles (RMMVs) and demonstrate at-sea.\n\nEC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Initiate Deep Reliable Acoustic Path Exploitation System (DRAPES) - Integrate algorithms and hardware for undersea communications, health monitoring, and contact separation and correlation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "59.974"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC:  SHD-FY12-04 DETECTION AND NEUTRALIZATION OF NEAR-SURFACE DRIFTING-OSCILLATING MINES\n- Complete Compact Modular Sensor-Processing Suite (CMSS) - Finish the final Demonstration of the multi-sensor detection of ocean mines that had to be extended into FY18.\n\nFNC: SHD-FY13-01 COOPERATIVE NETWORKED RADAR\n- Continue Cooperative Networked Radar - Conduct testing and demonstrating software algorithms and techniques for cross-platform radar operation deliver enhanced sensitivity. (In FY19, this FNC Product will be realigned within this PE to SW-FY13-02 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY14-02 FULL SECTOR TORPEDO DEFENSE\n- Continue ATT Timeline Compression (ATTTC) - Conduct a static in-water demonstration. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity)\n- Continue Concept C Countermeasure - Conduct an at-sea static assessment of the complete subsystem. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-03 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY14-04 ADVANCED UNDERSEA WEAPON SYSTEM (AUWS)\n- Continue Autonomous Threat Detection and Localization - Conduct testing and preparations for an at-sea demonstration of the full detection, classification, localization, and tracking sequence on an Extra Large Unmanned Undersea Vehicle (XLUUV). (In FY19, this FNC Product will be realigned within this PE to EMW-FY14-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue Remote Command & Control - Conduct testing and preparations for an at-sea demonstration of full command and control functionality on an Extra Large Unmanned Undersea Vehicle (XLUUV). (In FY19, this FNC Product will be realigned within this PE to EMW-FY14-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue Tactical Positioning & Fire Control - Conduct testing and preparations for an at-sea demonstration of the sensor placement and firing solution functionality on an Extra Large Unmanned Undersea Vehicle (XLUUV). (In FY19, this FNC Product will be realigned within this PE to EMW-FY14-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY14-08 TERMINATOR (T3)\n- Continue Terminator S - Validate the Ship Self-Defense System (SSDS) algorithm and the fire control loop concept using modeling and simulation tools. (In FY19, this FNC Product will be realigned within this PE to SW-FY14-04 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY15-03 AUTOMATION FOR UXV-BASED MCM\n- Continue Expeditionary MCM Automated Data Analysis - Collect at-sea training data for multi-band automatic target recognition and fusion algorithms. (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue MCM Task Force Planning - Conduct experiments and a table-top war-game on the re-planning and planning of risk, using the results to update the algorithms and human-machine interface approach. (In FY19, this FNC Product will be realigned within this PE to EMW-FY15-03 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY15-07 HYPER VELOCITY PROJECTILE\n- Complete Hyper Velocity Projectile - Design, fabricate and begin assembly of hypervelocity projectiles in preparation for a full-up launch to validate common interfaces for powder gun and railgun launches.\n\nFNC: SHD-FY16-04 SHIP-LAUNCHED EW EXTENDED ENDURANCE DECOY (SEWEED)\n- Continue Ship-launched EW Extended Endurance Decoy (SEWEED) - Conduct flight testing of the decoy demonstrator vehicle and isolation testing of the payload module. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-04 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY16-05 SURFACE SHIP PERISCOPE DETECTION AND DISCRIMINATION (SSPDD)\n- Continue Surface Ship Periscope Detection and Discrimination (SSPDD) - Continue development and commence preparation of an initial test plan for the government-reference prototype sensor and data fusion system. (In FY19, this FNC Product will be realigned within this PE to SW-FY16-01 under a new Surface Warfare R-2 Activity)\n\nFNC: SHD-FY16-06 NEXT GENERATION AIRBORNE PASSIVE SYSTEM (NGAPS)\n- Continue Next Generation Airborne Passive System (NGAPS) - Test and integrate hardware for field communications, control, health monitoring, mission planning and contact separation\/correlation. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-02 under a new Air Warfare R-2 Activity)\n\nFNC: SHD-FY16-07 SOFTKILL PERFORMANCE AND REAL-TIME ASSESSMENT (SPARTA)\n- Continue Softkill Performance and Real-Time Assessment (SPARTA) - Develop and optimize performance assessment algorithms and align them with a pending system requirements review. (In FY19, this FNC Product will be realigned within this PE to IW-FY16-05 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY17-02 AUTONOMOUS UNMANNED SURFACE VEHICLES FOR MINE WARFARE (MIW)\n- Continue Autonomous Situational Awareness and Hazard Avoidance System for USVs - Demonstrate with an Unmanned Surface Vehicle (USV) an autonomous situational awareness and avoidance capability that enables avoidance of fixed and moving hazards, with the ability to regain track and revisit missed areas using low bandwidth communications. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue High Temperature Superconducting (HTS) Magnetic Influence Sweep Payload for USVs - Demonstrate improved clearance rates and reduced risk to Unmanned Surface Vehicles (USVs) from mine detonation, and improved mean time between maintenance. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n- Continue Underway Refueling and Data Transfer for USVs and RMMVs - Demonstrate automated\/unmanned refueling of an Unmanned Surface Vehicle (USV) with data download\/upload using a second unmanned platform in up to sea state 3. (In FY19, this FNC Product will be realigned within this PE to EMW-FY17-02 under a new Naval Expeditionary Maneuver Warfare R-2 Activity)\n\nFNC: SHD-FY17-05 DEEP RELIABLE ACOUSTIC PATH EXPLOITATION SYSTEM (DRAPES)\n- Continue Deep Reliable Acoustic Path Exploitation System (DRAPES) - Integrate algorithms and hardware for undersea communications, health monitoring, and contact separation\/correlation. (In FY19, this FNC Product will be realigned within this PE to IW-FY17-03 under a new Information Warfare R-2 Activity)\n\nFNC: SHD-FY18-08 FORCE-LEVEL INTEGRATED FIRES REAL-TIME ENGAGEMENT COORDINATION AND PERFORMANCE ESTIMATION (FIRECAPE)\n- Initiate FIRECAPE Algorithms - Begin development of prototype tactical software and testing on tactical hardware to validate the performance of algorithms against complex threat raids. (In FY19, this FNC Product will be realigned within this PE to IW-FY18-04 under a new Information Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEA STRIKE (STK)"
                                    },
                                    "Description": {
                                        "val": "The investments that would have continued in this R-2 Activity have been moved into the activities of the restructed FNC Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "45.308"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "EC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Continue Long Range Find, Fix and ID - Test and verify performance of algorithms for achieving Radio Frequency (RF) identification of moving maritime contacts.\n\nEC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Continue Anti-Surface Warfare (ASuW) Weapon Upgrade - Evaluate system performance based during in-water testing.\n\nEC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Continue SMOKE - Design, develop and demonstrate an advanced propulsion system for a future Air-to-Air missile.\n\nEC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nEC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Continue Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and interoperability for flexible weapon behaviors at the salvo level in an Anti-Access, Area-Denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Perform lab testing of Collaborative Peer-to-Peer Adaptable Electronic Warfare (EW) Mission Prioritization and threat classification algorithms.\n\nEC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Test algorithms and techniques to improve synthetic aperture radar electronic protection.\n\nEC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability.\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Begin subcomponent design integration of the Electro-Optic (EO) source to be used in combination with an existing Infra-Red CounterMeasures (IRCM) Laser to support transition.\n\nEC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct open-loop in-water demonstrations of autonomy algorithms for mission planning, waypoint navigation, and vehicle health assessment.\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water demonstrations of multiband and hybrid sonar, inertial navigation, and fiber optic systems.\n\nEC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Continue Extended-Range Targeting (E-RAT) - Conduct technology concept demonstrations of subsystem models to assess the feasibility and operability of new technologies for the targeting and fire control modes at extended ranges.\n\nEC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Design and integrate adaptive capabilities into an advanced prototype within an existing Electronic Attack (EA) suite subsystem and adaptive threat simulator.\n\nEC: STK-FY17-04 ALPO\n- Continue ALPO - Continue technology development of an advanced signal processing system in a relevant tactical environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.314"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FNC: STK-FY13-01 LONG RANGE RF FIND, FIX AND ID\n- Complete Long Range Find, Fix and ID - Conduct testing, mitigate exceptions, and demonstrate the Long Range Find, Fix, and ID capability.\n\nFNC: STK-FY13-03 ANTI-SURFACE WARFARE (ASUW) WEAPON UPGRADE\n- Complete Anti-Surface Warfare (ASuW) Weapon Upgrade - Demonstrate a phase II capability in a tactically relevant environment.\n\nFNC: STK-FY13-04 AIM-9X ENABLERS (AXE)\n- Complete SMOKE - Design, develop and demonstrate an advanced propulsion system for a future air-to-air missile.\n\nFNC: STK-FY14-01 BANK SHOT\n- Complete Bank Shot - Develop the software architecture and associated algorithms that provide for data fusion.\n\nFNC: STK-FY14-03 INTELLIGENT COLLABORATIVE ENGAGEMENT (ICE)\n- Complete Collaborative Anti-Surface Warfare Engagement (CASE) - Demonstrate software operability and interoperability for flexible weapon behaviors at the salvo level in an anti-access area-denial environment.\n- Continue Collaborative Electronic Attack (CEA) - Perform bench-top and hardware-in-the-loop testing of the electronic support\/electronic attack hardware and cognitive components. (In FY19, this FNC Product will be realigned within this PE to IW-FY14-03 under a new Information Warfare R-2 Activity)\n\nFNC: STK-FY15-01 SYNTHETIC APERTURE RADAR ELECTRONIC PROTECTION (SAREP)\n- Continue Synthetic Aperture Radar Electronic Protection - Test, assess, and improve the synthetic aperture radar electronic protection capability in relevant littoral environments. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-03 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY15-02 ROTOR-CRAFT ADVANCED PROTECTION FROM IR\/EO\/RPG (RAPIER)\n- Continue Helicopter Active RPG Protection (HARP) - Demonstrate the technological feasibility of a Rocket Propelled Grenade (RPG) hard-kill defense system and its component operability. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity)\n- Continue Multi-Spectral EO\/IR Seeker Defeat - Build and test the final Infra-Red Countermeasures (IRCM) prototype system to be used in the field test demonstration of countermeasures techniques, build expendables based on derived expendable requirements, and perform radiometric measurements in the field. (In FY19, this FNC Product will be realigned within this PE to AW-FY15-04 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY15-03 EXTENDED RANGE MODULAR UNDERSEA HEAVYWEIGHT VEHICLE (ER MUHV)\n- Continue MUHV Autonomy Suite - Conduct in-water testing and assessment of autonomy algorithms for mission planning, waypoint navigation and vehicle health. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare R-2 Activity)\n- Continue MUHV Sensors, Navigation and Guidance - Conduct in-water demonstrations for maturation assessment of the multiband and hybrid sonar, inertial navigation, and fiber optic systems. (In FY19, this FNC Product will be realigned within this PE to UW-FY15-03 under a new Undersea Warfare R-2 Activity)\n\nFNC: STK-FY16-01 EXTENDED-RANGE TARGETING (E-RAT)\n- Complete Extended-Range Targeting (E-RAT) - Conduct concept and technology demonstrations of subsystem models to assess the feasibility and operability of new technologies for targeting and fire control modes at extended ranges.\n\nFNC: STK-FY16-02 REACTIVE ELECTRONIC ATTACK MEASURES (REAM)\n- Continue Reactive Electronic Attack Measures (REAM) - Test and improve reactive electronic attack measures in the representative environment. (In FY19, this FNC Product will be realigned within this PE to AW-FY16-04 under a new Air Warfare R-2 Activity)\n\nFNC: STK-FY17-04 ALPO\n- Complete ALPO - Complete the proof of technological feasibility and assessment phase of an advanced signal processing system in a relevant tactical environment.\n\nFNC: STK-FY18-01 PRECISION ELECTRONIC ATTACK TECHNOLOGIES (PEAT)\n- Initiate Multi-platform Retrodirective EW - Develop and implement Electronic Warfare (EW) techniques and supporting technology for multi-platforms effects. (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)\n- Initiate Single Platform Coherent Arrays - Develop and implement Electronic Warfare techniques and supporting technologies for intra-platform synchronized EW effects. (In FY19, this FNC Product will be realigned within this PE to AW-FY18-01 under a new Air Warfare R-2 Activity)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "AIR WARFARE (AW)"
                                    },
                                    "Description": {
                                        "val": "The Air Warfare R-2 Activity, new for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Director of Air Warfare (OPNAV N98)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.127"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.127"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on extended range targeting, advanced protection from infrared and electro-optic threats, radar electronic attack protection, intelligent collaborative engagements, multifunction capabilities for missile warning sensors, advanced threat aircraft countermeasures, technologies that discriminate and provide terminal guidance for weapons that engage moving targets, numerous advanced weapons technologies, high altitude anti-submarine warfare (ASW), placement and operation of active ASW distributed systems, data exfiltration and networked platform interaction, advanced topcoat systems for air vehicles, air platforms safety and affordability technologies, virtual-constructive representations on live avionics displays for training, and dynamic adaptive and modular training for unmanned aerial systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INFORMATION WARFARE (IW)"
                                    },
                                    "Description": {
                                        "val": "The Information Warfare R-2 Activity, new for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Deputy Chief of Naval Operations for Information Warfare (N2N6)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "82.718"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "82.718"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity cover a broad range of rapidly evolving technological areas and include, but are not limited to, those that focus on next-generation command, control and decision support services, cyber security, cyber operations, real-time engagement coordination and performance estimation, next generation countermeasure technologies for ship missile defense, extended distributed weapons coordination, cross field processing and smart use of distributed systems, network collaborative precision navigation and timekeeping, communications and interoperability for integrated fires, shipboard panoramic infrared and electro-optic cueing and surveillance systems, a tactical cloud that exploits cross warfare area data sources, electronic warfare battle management for surface defense, autonomous persistent tactical surveillance, mission-based waveform controls and networking, satellite vulnerability mitigation, comprehensive maritime operational and navigational planning via decision support services, collaborative algorithms for non-GPS-based navigation, technologies that enable real-time situational awareness of tactic-edge internet protocol (IP) networks operating in contested environments, technologies enabling coordination between shipboard and expendable electro-optical\/infrared countermeasures, automation technologies that improve theater level anti-submarine warfare operations and multi-domain battle management capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURFACE WARFARE (SW)"
                                    },
                                    "Description": {
                                        "val": "The Surface Warfare R-2 Activity, new for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Director of Surface Warfare (OPNAV N96)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "36.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "36.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on hyper velocity projectiles, full sector torpedo defense, cooperative networked radars, sonar automation, radar resource management for integrated air and missile defense, periscope detection and discrimination, high fidelity active sonar training, anti-ship missile defense, long range detection and tracking, naval interceptor improvements, unmanned systems common control, digital array radars, multifunction shipboard energy storage and power distribution, high power solid state circuit protection, compact power conversion for advanced surface machinery systems, resilient hull and infrastructure mechanical and electrical security, phased array antennas, human injury and treatment models, aluminum alloy corrosion control and prevention, affordable common radar architectures, total ship survivability damage tolerance and recoverability, adaptive training to enhance individual and team learning, and platform design and acquisition tools that reduce manpower."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "UNDERSEA WARFARE (UW)"
                                    },
                                    "Description": {
                                        "val": "The Undersea Warfare R-2 Activity, new for FY19, focuses on the advanced technology development of new capabilities that leverage the underlying applied research investments in PE 0602750N, Future Naval Capabilities Applied Research.  These advanced technology investments align to acquisition programs of record principally under the purview of the Director of Undersea Warfare (OPNAV N97)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.791"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.791"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The advanced technologies being developed under this R-2 Activity include, but are not limited to, those that focus on extended range modular undersea heavyweight vehicle technology for submarine-launched torpedoes, coherent electronic attack capabilities for submarines, vector sensors and signal processing for acoustic arrays, panoramic infrared sensors, technologies for rapid and covert surveillance, electronic sensors for detection of low probability of intercept periscope detection radars, torpedo advanced propulsion systems, simultaneous transmit and receive capabilities for submarines, scalable integrated radio frequency systems for undersea platforms, electronic warfare tactical decision aids, tools for predicting array operational loading and distribution, acoustic damping systems, corrosion mitigation technologies that increase operational availability, panoramic photonics mast technologies, hyper-spectral scanning imagery, low light level video cameras, new material development and lab characterization, unmanned aerial system control technologies, adaptive training for submarine navigation and piloting, signature management technologies, and information architectures for improved decision making."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY18 to FY19 was due to the Navy's restructuring of the FNC Program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The performance metric for this PE is measured by the number of FNCs that transition through an acquisition POR to deploy new capabilities into the Fleet or Force."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "16.442"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.442"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The efforts described in this Project address the Advanced Technology Development associated with the Future Naval Capabilities (FNC) Program.  The FNC Program represents the requirements-driven, delivery-oriented portion of the Navy Science and Technology (S&T) portfolio.  FNC investments respond to Naval S&T Gaps that are identified by the Navy and Marine Corps after receiving input from Naval Research Enterprise (NRE) stakeholders. Future Naval Capabilities (FNCs) and their associated technology product investments are competitively selected by the Chief of Naval Research under the guidance of a 3-Star oversight group consisting of Navy and Marine Corps senior leaders."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "ASW Research Prog - Cong"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6.770"
                                        },
                                        "Text": {
                                            "val": "Funds will be used for system development of sensors which will take advantage of the 3D nature of the upper ocean sound structure."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "9.672"
                                        },
                                        "Text": {
                                            "val": "EMW-FY14-01 Compact Wide Area Reconnaissance and Spectral Sensor (CWARSS). Develop the  SPRITE CWARSS prototype system, which will provide SWaP-design-traceable sensors and pointing capabilities housed in a dual-pod configuration.\n\nEMW-FY15-01 Radar \/ Context Fusion. Complete the acoustic trade study to determine the type, types, or mix of sensors that best satisfy the TTA metrics within the scenarios provided by the Technology Transfer Agreement.\n\nFNT-FY14-03 Data Conditioning. Enhance the MSTI analytic to include METOC forecast model gap-filling, ad-hoc sensor reports, line-of-bearing geo-temporal feature queries, and additional sensor types and characteristic analytics.\n\nFNT-FY14-03 Network Adaptive Communication Services. Improve the network health monitoring graphical user interfaces.\n\nFNT-FY15-01 Advanced AEW Electronic Protection. Develop, integrate, and test an electronic protection capability. \n\nSHD-FY16-05 Surface Ship Periscope Detection and Discrimination (SSPDD)\t. Perform advanced data processing and data fusion development.\n\nP&E-FY15-03 Multi-Function High Density Shipboard Energy Storage. Characterize the battery module thermal properties, develop a hybrid energy storage module, and perform an integrated Heat Transfer Analysis.\n\nP&E-FY17-02 Torpedo Advanced Propulsion System (TAPS). Conduct an assessment of Stored Chemical Energy Propulsion System (SCEPS) technology in regards to safety and cost of the system.\n\nSHD-FY16-04 Ship-launched EW Extended Endurance Decoy (SEWEED). Develop a design of the SEWEED platform and payload bay.\n\nSHD-FY16-07 Softkill Performance and Real-Time Assessment (SPARTA). Coordinate and conduct requirements analysis, RF propagation studies and measurements, M&S and algorithm software development."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of FNC technologies within this PE.  In all cases, these FNCs support the Department of the Navy's FNC Program and are managed at the Office of Naval Research.  At the lowest level, each FNC technology is measured against both technical and financial milestones on a bimonthly basis.  Annually, each FNC is reviewed in depth for technical performance and development status by the Chief of Naval Research against goals established when the FNC was first funded.  Also annually, each FNC is reviewed by its transition stakeholders for transition commitment.  Transition issues and required adjustments are made by the Chief of Naval Research."
                        }
                    }
                }
            ]
        }
    }
}