{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-18",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602720A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology"
        },
        "R1LineNumber": {
            "val": "23"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.553"
            },
            "CurrentYear": {
                "val": "21.678"
            },
            "BudgetYearOne": {
                "val": "13.242"
            },
            "BudgetYearOneBase": {
                "val": "13.242"
            },
            "BudgetYearTwo": {
                "val": "13.503"
            },
            "BudgetYearThree": {
                "val": "13.773"
            },
            "BudgetYearFour": {
                "val": "14.051"
            },
            "BudgetYearFive": {
                "val": "14.329"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "112.129"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates and evaluates enabling tools and methodologies that support the long-term sustainment of Army training and testing activities. Specific focus is on maintaining regulatory compliance while limiting future Army liability to installation operations and training, and maintaining resilient and adaptive ranges. Project 048 improves the Army's ability to comply with requirements mandated by federal, state, and local environmental\/health laws and to reduce the cost of this compliance. Project 835 develops enabling technologies for advanced life cycle analysis, advanced sensing, technologies to empower rapid fielding of next generation energetics, propellants and munitions with focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond, and enable decision making based on accurate environmental conditions in sparse data environments.  Project 895 focuses on reducing hazardous waste generation through process modification and control, materials recycling and substitution, and developing technologies to predict and mitigate range and maneuver constraints associated with current and emerging weapon systems, doctrine, and regulations. Project 896 investigates technologies for ecosystem vulnerability assessment, and ecosystem analysis, monitoring, modeling, and mitigation to support sustainable use of Army lands to reduce or eliminate environmental constraints to military missions, and develops environmental sensor capabilities to enable rapid collection and analysis of data for real-time environmental situational awareness.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priorities for Long Range Precision Fires and Network\/C3I, and supports the Army Strategy for the Environment.  \n\nTechnologies developed in this PE are transitioned to PE 0603728A (Environmental Quality Technology Demonstrations).  \n\nWork in this PE is performed by the Army Engineer Research and Development Center, Vicksburg, MS, and the Army Research, Development, and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "22.151"
                },
                "CurrentYear": {
                    "val": "21.678"
                },
                "BudgetYearOne": {
                    "val": "21.818"
                },
                "BudgetYearOneBase": {
                    "val": "21.818"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.553"
                },
                "CurrentYear": {
                    "val": "21.678"
                },
                "BudgetYearOne": {
                    "val": "13.242"
                },
                "BudgetYearOneBase": {
                    "val": "13.242"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.598"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-8.576"
                },
                "BudgetYearOneBase": {
                    "val": "-8.576"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.59"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.576"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.576"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "PE decrease to support Army Modernization Priorities, including robotic engineering for Next Generation Combat Vehicle, and removal of pollution prevention tasks."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "048"
                    },
                    "ProjectTitle": {
                        "val": "Ind Oper Poll Ctrl Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.686"
                        },
                        "CurrentYear": {
                            "val": "2.86"
                        },
                        "BudgetYearOne": {
                            "val": "0.992"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.992"
                        },
                        "BudgetYearTwo": {
                            "val": "1.01"
                        },
                        "BudgetYearThree": {
                            "val": "1.03"
                        },
                        "BudgetYearFour": {
                            "val": "1.05"
                        },
                        "BudgetYearFive": {
                            "val": "1.07"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.698"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad. These new and innovative technologies are essential for the effective control and reduction of military unique hazardous and non-hazardous wastes on military installations and associated with contingency operations bases worldwide. To develop the required technologies, this Project has a focus on developing sustainable environmental protection technologies that help the Army maintain environmental compliance for sources of pollution such as production facilities, facility contamination, and other waste streams; a focus on Army-unique ecosystem vulnerability assessment, and ecosystem analysis, modeling, adaptation, and mitigation technologies for installations associated with air quality and endangered species management and their impacts on training and testing missions; a focus on designing and developing technologies for deployed forces with environmentally safe, operationally enhanced, and cost effective technologies or processes to achieve maximum diversion, minimization, or volume reduction of base camp and field waste; and a focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond. The resultant technologies reduce the impact of legal and regulatory environmental restrictions on installation facilities, training and testing lands and ranges, as well as provide a means to avoid fines and facility shutdowns within the United States and reduce environmental impacts to the Warfighter abroad.\n\nThe work in this Project supports the Army Science and Technology (S&T) Environment and Terrain Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priority for Next Generation Combat Vehicle, and supports the Army Strategy for the Environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort supports management of operations on ranges and training lands with the intent to reduce constraints and restrictions resulting from environmental regulations. Technologies are targeted toward solutions for environmental compliance and associated requirements, as well as solutions that will enhance training and testing operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.747"
                                            },
                                            "Text": {
                                                "val": "Will develop methodologies for identifying and quantifying potential impacts to training by current and future TES. Will develop novel training land conflict analysis algorithms that quantify and predict military training land use requirements to identify conflicts between TES and training on Army installations and mitigation strategies. Will develop innovative and cost-effective techniques to implement regional and installation TES conflict mitigation strategies that facilitate species movement from areas in conflict with training to areas not in conflict. Will explore biologically inspired sensing capabilities to enhance endangered species management strategies on Army lands and ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.893"
                                            },
                                            "Text": {
                                                "val": "Investigate relationships and relational patterns between physical and social data in select contingency areas of concern to enable Military security planners to anticipate climate and extreme weather induced impacts to security and readiness threats. Research relational changes in environmental variability data and changes in human behavior to assess correlation with social-environmental trends and conflict trends as seen in hazard and conflict models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive & Resilient Installations"
                                    },
                                    "Description": {
                                        "val": "This effort develops sustainable, cost efficient, and effective facilities; and provides technologies and techniques for achieving resilient and sustainable installation and base operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.939"
                                            },
                                            "Text": {
                                                "val": "Will investigate biologically inspired materials and concepts for fouling resistance, as well as microbes that enhance in situ performance for water sustainment technologies to minimize external net water demand at Army contingency bases."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.967"
                                            },
                                            "Text": {
                                                "val": "Investigate new coatings that promote water vapor deposition and shedding coupled with current waste vapor streams\/sources. Investigate closed loop water treatment process technologies to determine best candidates in Army relevant conditions for contingency bases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.992"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.992"
                                            },
                                            "Text": {
                                                "val": "Will follow a system of systems approach to develop an integrated installation computational model which fuses data from existing systems and programs of record to capture management business processes. Business intelligence dashboards will integrate and support synthesis and reporting across business processes and at all echelons, and will fully integrate information infrastructure that presents and provides decision-ready knowledge."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of funds due to economical adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "835"
                    },
                    "ProjectTitle": {
                        "val": "Mil Med Environ Crit"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.524"
                        },
                        "CurrentYear": {
                            "val": "8.005"
                        },
                        "BudgetYearOne": {
                            "val": "8.043"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.043"
                        },
                        "BudgetYearTwo": {
                            "val": "8.2"
                        },
                        "BudgetYearThree": {
                            "val": "8.364"
                        },
                        "BudgetYearFour": {
                            "val": "8.534"
                        },
                        "BudgetYearFive": {
                            "val": "8.704"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "57.374"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops tools and methods to enable the Army to reduce or eliminate environmental impacts both in the United States and abroad. These new and innovative technologies are essential for the effective control and reduction of military-unique hazardous and non-hazardous wastes associated with contingency operations worldwide. These new and innovative technologies empower rapid fielding of next generation energetics, propellants and munitions with focus on the impacts of new materiel that will enter the Army inventory within the next decade and beyond, and deliver the capability to shape and protect Army investments in next generation fires by delivering proactive, scientifically sound risk and environmental impact management strategies. This Project will also provide integrated knowledge of environmental factors in mission planning activities creating a unified, comprehensive and integrated battlefield landscape of future threats, opportunities and impacts to mission success in sparse data environments enabling mission planners to identify the industrial\/commercial resources used as components of weapons development. These resultant technologies streamline the acquisition process, enabling rapid fielding of new materials, increase Army readiness through proactive hazard management strategies for military materials, enhance the Army's ability to improve decision-making based on accurate environmental conditions in sparse data environments, and reduce Army liabilities associated with unforeseen environmental impacts.\n\nWork in this Project supports the Army Science and Technology (S&T) Military Engineering and Environmental Technology, Simulation and Computing Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy Priorities for Long Range Precision Fires, Air Missile Defense, and Network\/C3I."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Life Cycle of Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort provides a quantitative means to determine the environmental and human health effects resulting from exposure to existing and emerging compounds and materials produced in Army industrial, field, and battlefield operations or disposed of through past activities. Results of this research will be integrated into the life cycle analysis process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.46"
                                            },
                                            "Text": {
                                                "val": "Will investigate environmental life cycle, health, and safety impacts from potential exposure to evolving insensitive military munitions, constituents, and unique materials impacting next generation weapons systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.2"
                                            },
                                            "Text": {
                                                "val": "Develop a new eco-toxicity life cycle assessment framework designed to optimize the cost-benefit of environmental data collections to address pre-Milestone B environmental assessment guidelines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.203"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.203"
                                            },
                                            "Text": {
                                                "val": "Will investigate environmentally-friendly signature tonedown\/alteration concepts for critical assets that integrate novel materials such as organics and nanomaterials, and characterize life cycle and environmental health and safety impacts of concealment\/countermeasure technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Significant reduction to mature development of components."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials and Nanotechnology: Environmental Effects previously called Nanotechnology-Environmental Effects"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army's ability to field advanced nano-based technologies by appropriate identification and assessment of the environmental impacts of nanomaterials. The end result of this research is the development of tools that guide and influence the design of nanomaterials based on such factors as adverse effects on human health or on the environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.905"
                                            },
                                            "Text": {
                                                "val": "Will investigate the unique properties of nanomaterials utilized in munitions to determine environmental fate and impact. Will utilize understanding of nanomaterial properties to develop next generation remediation technologies for Army unique contaminants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.062"
                                            },
                                            "Text": {
                                                "val": "Investigate and categorize technologies of military relevant advanced and additive materials, including nanotechnologies and additive manufacturing techniques, to discriminate high and low risk areas as relevant to Chemical Data Reporting under the Toxic Substances Control Act."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Prediction and Decision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort enables the Army to predict and understand the fate and transport of Army-unique compounds and materials which improves the capability to detect, control, and remediate. This effort develops advanced engineering concepts utilizing advanced materials, biological processes, and nanomaterials in remediation processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.159"
                                            },
                                            "Text": {
                                                "val": "Will research data driven predictive frameworks and tools for assessment of on-site bioremediation technologies for contaminated soils and groundwater that facilitate adaptive installation management under the paradigm of changing Arctic\/Subarctic climates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.743"
                                            },
                                            "Text": {
                                                "val": "Develop empirical datasets of soil structure, geochemistry, and microbial community composition and function from bench and medium-scale studies to identify on-site contaminant degradation processes and limitations in arctic and subarctic climates. Investigate the most relevant metrics needed to characterize synthetic biology environmental impacts of military relevance and quantify their relative importance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Risk Analysis of Fires"
                                    },
                                    "Description": {
                                        "val": "Develop proactive environment, safety, and occupational health risk assessment tools to ensure rapid fielding of energetics, propellants, and munitions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.079"
                                            },
                                            "Text": {
                                                "val": "Will develop robust procedures for the detection and quantification of carbon-based advanced materials at concentrations relevant to sustainability analysis; identify current and future trends in additive manufacturing technologies and materials of interest to the Army to evaluate environment, health, and safety impacts during development, transition, and acquisition. Proactive environment, safety, and occupational health risk assessment tools will facilitate rapid fielding of energetics propellants and munitions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort initiates in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligent Environmental Battlefield Awareness"
                                    },
                                    "Description": {
                                        "val": "Develop technologies to provide geo-environmental infrastructure and hazard awareness in urban environments to provide decision-makers with data and information for mission planning."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.094"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.094"
                                            },
                                            "Text": {
                                                "val": "Will investigate environmental forensic methodologies to provide geo-chemical resources to mission planners. Will quantify contaminant microbial degradation\/transformation activity in arctic and subarctic climates as a function of soil geochemistry and environmental flux to model contaminate fate and transport prediction for intelligence preparation on the battlefield."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort Initiates in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding the Environment as a Threat"
                                    },
                                    "Description": {
                                        "val": "Develop predictive tools to inform engineer reconnaissance and provide environmental situational awareness for mission planning."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.765"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.765"
                                            },
                                            "Text": {
                                                "val": "Will develop predictive models of environmental impact to inform environmental situational awareness and source analysis by investigating microbial products of synthetic biology and acquire a diverse variety of synthetic constructs to conduct lab-scale microcosm experiments with known microbes to assess potential for spread\/transfer of synthetic component."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort initiates in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "Develop advanced environmental sensor technologies to enable rapid collection and analysis for persistent surveillance in contested areas.  This project will provide significant advances in research and development of each of the component steps (improved selectivity for passive samplers, functionalization of printable adsorption components, novel signal generation techniques, sensor arrays, etc.) to enable rapid collection and analysis."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.902"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.902"
                                            },
                                            "Text": {
                                                "val": "Will develop advanced environmental sensor technologies to enable rapid collection and analysis for persistent surveillance in contested areas"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort initiates in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "895"
                    },
                    "ProjectTitle": {
                        "val": "Pollution Prevention"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.34"
                        },
                        "CurrentYear": {
                            "val": "2.473"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.813"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Project develops pollution prevention technologies required to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use, and surveillance of Army ordnance and other weapon systems. This Project researches and develops revolutionary technologies to eliminate or significantly reduce the environmental impacts that threaten the sustainment of production and maintenance facilities, training ranges and operational areas. The Project supports the transformation of the Army by ensuring that advanced energetic materials required for high-performance munitions (gun, rocket, missile propulsion systems, and warhead explosives) are devised to meet weapons lethality\/survivability stretch goals in parallel with, and in compliance to, foreseeable sustainment requirements. Specific technology thrusts include environmentally-benign explosives developed with computer modeling using Department of Defense high-performance computing resources; novel energetics that capitalize on the unique behavior of nano-scale structures; chemically engineered explosive and propellant formulations produced with minimal environmental waste, long-storage lifetime, rapid\/benign environmental degradation properties, and efficient extraction and reuse; and fuses, pyrotechnics, and initiators that are free from toxic chemicals. Other focus areas include toxic metal reductions from surface finishing processes, sustainable military paints and coatings to meet evolving environmental requirements and low global warming potential alternatives for refrigerants, fire suppressants and solvents. \n\nWork in this Project supports the Army Science and Technology Environment and Terrain Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.\n\nTechnologies developed in this Project are fully coordinated and complementary to Program Element (PE) 0603728A, Project 025."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops pollution prevention technologies to reduce\/eliminate the environmental footprint resulting from the manufacture, maintenance, use and surveillance of Army ordnance and other weapon systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.34"
                                            },
                                            "Text": {
                                                "val": "Will develop novel green chemistry approaches to energetic material synthesis; will reformulate metal-rich primers to reduce harmful pollutants while improving corrosion protection; will explore candidate fire suppressants with low global warming potential to determine their viability in military applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.473"
                                            },
                                            "Text": {
                                                "val": "Optimize green synthesis methods for melt cast explosives as potential alternatives to trinitrotoluene (TNT); explore synthesis of novel high nitrogen primary explosive compounds to replace lead used in primers and detonators; develop sustainable coatings for magnesium protection and electromagnetic shielding of aircraft; conduct laboratory-scale performance testing on alternative fire suppressants with low global warming potential."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "896"
                    },
                    "ProjectTitle": {
                        "val": "Base Fac Environ Qual"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.003"
                        },
                        "CurrentYear": {
                            "val": "8.34"
                        },
                        "BudgetYearOne": {
                            "val": "4.207"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.207"
                        },
                        "BudgetYearTwo": {
                            "val": "4.293"
                        },
                        "BudgetYearThree": {
                            "val": "4.379"
                        },
                        "BudgetYearFour": {
                            "val": "4.467"
                        },
                        "BudgetYearFive": {
                            "val": "4.555"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "38.244"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops tools as well as identification and assessment methodologies for ecosystem vulnerability assessment, analysis, monitoring, modeling, and mitigation to support real-time dynamic environmental situational awareness to enable the Army to reduce or eliminate environmental constraints to military use both in the United States and abroad and how the use of those resources impacts mission support. The Project investigates, designs, and develops novel methods and missions, providing the Army with the technical capability to manage, protect, and improve the biophysical characteristics; and the computational understanding of the Battlefield environment conditions and stressors in order to provide actionable information supporting situational awareness and influencing tactical operations. Technologies within this Project enable insertion of accurate environmental data into current intelligence and planning frameworks creating an integrated picture of the battlespace for operational decision making. This project also enhances environmental reconnaissance with advanced environmental sensing technologies to enable rapid collection and analysis of environmental data providing situational awareness for mission response.\n\nThe work in this Project supports the Army Science and Technology (S&T) Military Engineering and Environmental Technology, Simulation and Computing Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priority for Network C3I."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment, analysis, monitoring, modeling, and mitigation technologies to support sustainable use of Army facilities, training lands, firing ranges, and airspace to reduce or eliminate environmental constraints to military missions. This effort targets integrated military land-appropriate management and control technologies for selected high priority Army land management issues including Threatened and Endangered Species (TES), Species at Risk (SAR), and invasive species. This effort enables effective management of training lands by understanding the cumulative impacts of training and non-training land use activities on critical natural resources under current and potential future climate conditions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.98"
                                            },
                                            "Text": {
                                                "val": "Will complete development of a suite of analysis tools that will provide climate-sensitive metrics using underlying models that are based on the best scientific understanding of climate-change impacts and related dynamics. These tools will integrate climate-change forecasts and data to assess impacts to installation decision metric values that affect Army enterprise planning decisions. Will develop innovative noise detection, classification, and location algorithms that translate raw discrete multi-sensor noise monitoring data into source specific event groups of known identities and locations to cost effectively automate management of installation noise monitoring systems. Will develop data driven, self-learning, adaptive military noise forecast algorithms that utilize installation site-specific noise monitoring data for improved prediction of noise levels, certainty, and community impact."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.15"
                                            },
                                            "Text": {
                                                "val": "Investigate tools, algorithms, procedures and guidance to manage installation noise in real-time; develop integrated simulation tools that incorporate weather, terrain, and mission activity into forecasting models for probability of noise complaints; investigate alternative TES management strategies and supporting technologies to respond to emerging TES mitigation policies; develop methodologies for prioritizing regional-level TES management strategies to minimize training impacts due to listed species."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Materials in the Environment"
                                    },
                                    "Description": {
                                        "val": "This effort develops models to predict chemical behavior in simple and complex environmental media (e.g. soils, water). These models will allow for improved understanding of how compounds and materials will move, bind, and degrade when introduced into the environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.023"
                                            },
                                            "Text": {
                                                "val": "Will determine soil designations among soil taxonomy systems to form the basis for developing calibrated soil process models. Will devise a robust predictive model that is capable of using inherent soil characteristics to determine the potential risks associated with environmentally relevant military activities (i.e. fate and transport of contaminants). The model design will address a large array of environmental quality problems associated with both the Continental United States (CONUS) and Outside of the Continental United States (OCONUS) military activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.19"
                                            },
                                            "Text": {
                                                "val": "Validate a robust predictive model that is capable of using inherent soil characteristics to determine the potential risks associated with environmentally relevant military activities (i.e. fate and transport of contaminants). Investigate computational approaches for important physical and chemical properties of insensitive munitions compounds in water, arid, and semi-arid environments to predict their fate and effects in natural water and in arid or semi-arid soils. Generate a computational model to predict potential chemical-biological interactions at the molecular level for assessment of military compounds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Risk Analysis of Fires"
                                    },
                                    "Description": {
                                        "val": "Develop proactive assessment tools to shape and protect Army investments in next generation fires by delivering science based risk and environmental impact management strategies."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.207"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.207"
                                            },
                                            "Text": {
                                                "val": "Will explore potential environmental, health and safety hazards associated with emerging chemical and material developments to counter advanced conventional threats. Standardize methods for predicting ecological hazards of military materials early in the acquisition development process enabling potential replacement chemicals and other materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start program in FY19"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding the Environment as a Threat"
                                    },
                                    "Description": {
                                        "val": "This effort advances the state of the science associated with computational understanding of the Battlefield environment conditions and stressors in order to provide actionable information supporting situational awareness for mission planning."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will investigate computational chemistry predictions of the physical and chemical properties of insensitive munitions compounds and their degradation products, to determine their fate and effects in arid and semiarid environments and to provide actionable information supporting situational awareness and influence tactical operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start program in FY19"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}