{
    "id": "2019-Army-PB-2040-JBOOK-79b591210fd408c628921aca85d0d9ff79c726d2b3f64254da15763996a4ed4f-14",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA5A-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604713A"
        },
        "ProgramElementTitle": {
            "val": "Combat Feeding, Clothing, and Equipment"
        },
        "R1LineNumber": {
            "val": "98"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "1.975"
            },
            "CurrentYear": {
                "val": "3.702"
            },
            "BudgetYearOne": {
                "val": "4.507"
            },
            "BudgetYearOneBase": {
                "val": "4.507"
            },
            "BudgetYearTwo": {
                "val": "6.141"
            },
            "BudgetYearThree": {
                "val": "4.863"
            },
            "BudgetYearFour": {
                "val": "4.740"
            },
            "BudgetYearFive": {
                "val": "4.510"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "30.438"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Projects under this Program Element support the development, demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance soldier efficiency, improve soldier survivability, and reduce food service logistics requirements for all four services. These Projects support multi-fuel, rapidly deployable field food service equipment initiatives. Efforts also support the Engineering and Manufacturing Development (EMD) phase of programs to improve equipment, enhance safety in food service, and decrease fuel and water requirements. The Projects develop critical enablers that support the Joint Future Capabilities and Joint Expeditionary mindset, by maintaining readiness through integrating new equipment, enhancing the field soldier's well-being, and providing soldiers usable equipment. The Projects also reduce sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\n\nThis PE\/Project supports Field Feeding programs for all the services."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.054"
                },
                "CurrentYear": {
                    "val": "3.702"
                },
                "BudgetYearOne": {
                    "val": "4.141"
                },
                "BudgetYearOneBase": {
                    "val": "4.141"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.975"
                },
                "CurrentYear": {
                    "val": "3.702"
                },
                "BudgetYearOne": {
                    "val": "4.507"
                },
                "BudgetYearOneBase": {
                    "val": "4.507"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.079"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.366"
                },
                "BudgetYearOneBase": {
                    "val": "0.366"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.001"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.078"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.366"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.366"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 variation  due to FFRDC (-1K) and STTR\/SBIR reduction ($78K).\n-------------------------------------------------------\nThe FY 2019 funding request was increased by $0.366 million.  Project EL2 increased by $0.123 million and Project 548 increased by $0.243 million."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "548"
                    },
                    "ProjectTitle": {
                        "val": "Mil Subsistence Sys"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.73"
                        },
                        "CurrentYear": {
                            "val": "0.7"
                        },
                        "BudgetYearOne": {
                            "val": "1.093"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.093"
                        },
                        "BudgetYearTwo": {
                            "val": "1.893"
                        },
                        "BudgetYearThree": {
                            "val": "1.942"
                        },
                        "BudgetYearFour": {
                            "val": "1.817"
                        },
                        "BudgetYearFive": {
                            "val": "1.531"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "9.706"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project enables system development and demonstration of Joint Service combat rations and field feeding equipment\/systems designed to improve warfighter performance and reduce the logistics burden of subsistence support. Efforts funded in this Project support all four Services, the Special Operations Command, and the Defense Logistics Agency (DLA).  The Army serves as the Executive Agent for this Department of Defense (DoD) program, with oversight and coordination provided by the DoD Combat Feeding Research and Engineering Board (CFREB) as required by DoD Directive (DoDD) 3235.02E. Centralized execution of the DoD Combat Feeding Research and Engineering Program (CFREP) with Joint Service review and approval eliminates unnecessary duplication of efforts across the Services and maximizes use of common materiel solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fielded Individual Ration Improvement Project (FIRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project for the Meal Ready to Eat (MRE). Integrate prototype components\/technologies into the MRE menu systems to improve operational effectiveness. Demonstrate system integration and producibility, develop component specifications and transition to Defense Logistics Agency ? Troop Support (DLA-Troop Support) for procurement."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.115"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies into MRE menu system to improve quality, acceptability, nutrition and expand variety. Will plan and complete field testing of new ration menus for MRE (2020 date of pack) in an operationally relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.075"
                                            },
                                            "Text": {
                                                "val": "Based on field test results, present recommendations to Joint Services (2Q18) for continued product improvement of ration components\/packaging\/technologies for MRE (2020 date of pack). Finalize MRE procurement documents and initiate transition to DLA-Troop Support. Obtained Surgeon General approval of revised MRE menus. Execute production testing with industry to ensure consistent ration quality, understand Performance Contract Requirements (PCR), and resolved vendor\/supplier issues. Obtain selected new items for field test. Conduct field evaluation of new candidate ration components for MRE (2021 date of pack) to improve quality, acceptability, nutrition and expand variety."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort as titled ended in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assault\/Special Purpose Ration Improvement Project (ASPIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement of special purpose rations by the integration of new technologies in nutrition, processing and packaging. Special purpose rations include the Meal, Cold Weather\/Long Range Patrol (MCW\/LRP), First Strike Ration (FSR), and Modular Operational Ration Enhancement (MORE)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.056"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies (e.g., commercial brick pack packaging, Multi- Purpose Individual Heating Technology (MIT)) into First Strike Ration (FSR), MCW\/LRP and\/or MORE menu systems to improve quality, acceptability, nutrition and expand variety. Plan and complete field testing of new ration menus in an operationally relevant environment. Continue to populate Combat Rations Database with nutritional\/menu data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.039"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies into FSR, MCW\/LRP and\/or MORE menu systems to improve quality, acceptability, nutrition and expand variety. Execute production testing with industry to ensure consistent ration quality, understand Performance Contract Requirements (PCR), and resolve vendor\/supplier issues. Continue to populate Combat Rations Database with nutritional\/menu data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort as titled ended in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fielded Group Ration Improvement Project (FGRIP)"
                                    },
                                    "Description": {
                                        "val": "Continuous product improvement project to update\/improve group ration components, menus, and packaging by integrating state-of-the-art military\/commercial packaging and technology base transitions. The family of Unitized Group Rations (UGRs) includes the Unitized Group Ration - Heat & Serve (UGR-H&S), Unitized Group Ration - Express (UGR-E), Unitized Group Ration - A (UGR-A), and Unitized Group Ration - M (UGR-M)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.108"
                                            },
                                            "Text": {
                                                "val": "Integrate prototype components\/technologies into UGR-H&S, UGR-E, UGR-M and UGR-A menu systems to improve quality, acceptability, nutrition and expand variety. Complete field testing of new ration menus in an operationally relevant environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.078"
                                            },
                                            "Text": {
                                                "val": "Finalize UGR (A, H&S, E) procurement documents and standards for verification and initiated transition to DLA-Troop Support based on BA4 Joint Service approvals. Obtain Surgeon General approval of revised UGR menus. Support DLA-Troop Support Limited First Article production testing of new H&S and E items with industry to ensure consistent ration quality, understand PCR requirements, resolve vendor\/supplier issues, and conduct confirmatory sensory, chemical, physical and shelf life testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort as titled ended in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Group Ration Airdrop Survivability Project (GRASP)"
                                    },
                                    "Description": {
                                        "val": "Quantify baseline airdrop performance characteristics for current group combat ration (UGR-H&S\/M\/E) configurations\/designs; identify survival rates (based on caloric loss and packaging damage\/loss) under defined operational conditions; provide knowledge base and supporting data to generate executable load configuration changes; identify capability gaps that might warrant product\/package\/assembly configuration redesign and reengineering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.039"
                                            },
                                            "Text": {
                                                "val": "Conduct review\/analysis of airdrop test data on additional UGR configurations\/versions. Will re-test\/assess data and recommend packing\/rigging changes. Transition updated technical data\/rigging changes to DLA - Troop Support and Airdrop partners."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block Upgrades and Operational Improvements for Expeditionary Field Feeding Equipment"
                                    },
                                    "Description": {
                                        "val": "Eliminate the sole sourcing of tray ration heater component parts. Reduce overall water consumption through the use of non-immersive cooking technologies and more efficient ware-washing equipment. Increase Kitchen flexibility through appliance upgrades. To reduce the overall fuel consumption of Expeditionary Field Feeding Equipment through enhanced combustion technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.079"
                                            },
                                            "Text": {
                                                "val": "Develop reports, Engineering Change Proposals (ECPs) and logistical data to facilitate integration of cooking appliances into United States Marine Corp (USMC) Expeditionary Field Kitchen (EFK), Enhanced Tray Ration Heating System (ETRHS), and\/or Tray Ration Heater (TRH). Transition prototype equipment and technical data to USMC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.154"
                                            },
                                            "Text": {
                                                "val": "Develop reports, Engineering Change Proposals (ECP)s and logistical data to facilitate integration of cooking appliances into USMC EFK, ETRHS, and\/or TRH. Transition prototype equipment and technical data to USMC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort as titled ended in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support to Air Force Field Feeding Modernization Efforts"
                                    },
                                    "Description": {
                                        "val": "Provide continuous R&D efforts for all Expeditionary Air Force squadrons. Modernize and standardize field foodservice equipment to reduce labor, maintenance, pack-out volume and cost. Increase reliability, efficiency and sustainability. Develop comprehensive specifications and technical data packages for recommended Food Service Equipment (FSE) items; test and evaluate newer commercial FSE items for expeditionary use and smaller transportation footprint; develop total overall life cycle cost of each system; test Energy Star certified FSE items that use less power; and investigate\/develop appliances that use less water, increase competition on standardized designs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.158"
                                            },
                                            "Text": {
                                                "val": "Conduct Energy Management System (EMS) Critical Design Reviews and in-house test and evaluation. Complete the development of the Joint Service Expandable Refrigerated Container System (JSERCS). Integrate JSERCS into the BEAR kitchen system to conduct operational testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.147"
                                            },
                                            "Text": {
                                                "val": "Complete T&E of Energy Management System prototype. Transition performance results to the Basic Expeditionary Airfield Resources (BEAR) Program Management Office.  Integrate heat recovery system technical data into the BEAR Kitchen System Technical Data Package."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort as titled ended in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Navy Food Storage Analysis Tool (NFSAT)"
                                    },
                                    "Description": {
                                        "val": "Software analysis tool for Navy Foodservice that will automatically calculate all storage space factors and requirements for naval vessels based off the specific Navy Standard Core Menu (NSCM), crew size, Naval Ship's Technical Manual 096, Weights and Stability, Naval Vessel Requirements Food Service Facility Design Manual, Build Specifications 671, 672, and Type Commander established endurance levels. Develop automated subsistence inventory management, tracking and storeroom locations for all storage areas with mobile scanning technology capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.175"
                                            },
                                            "Text": {
                                                "val": "Complete development of updated software, which will provide automated subsistence inventory management, tracking, and storeroom locations for all storage areas with mobile scanning technology capabilities. Conduct operational testing and will transition Technical Data Package, Commercial Item Descriptions, and equipment to the Navy."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modular Integrated Kitchen System (MIKS)"
                                    },
                                    "Description": {
                                        "val": "Design a standardized mounting system for all Galley equipment to significantly reduce technical labor skills required to complete deck modifications. MIKS will standardize electrical and water requirements, enhance procurement options, decrease operating and support (O&S) costs, and increase the speed of installing new technologies into the Galley\/Scullery areas."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.207"
                                            },
                                            "Text": {
                                                "val": "Conduct land-based user evaluation of new integrated mounting system, prepare technical data package (TDP), and provided documentation to Navy (USN) for procurement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort as titled ended in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Combat Ration System Development"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates mature Joint Service combat ration systems that enable warfighter maneuver, readiness and effectiveness during highly mobile, dispersed operations.  Prototypes are transitioned from PE 0603747\/Project 610 to develop combat rations with improved capabilities including improved warfighter physical and cognitive performance through optimized nutrition and reduced logistics burden through weight and cube reduction.  This effort completes operational test and evaluation (OT&E) to confirm system level performance, and develops ration specifications for transition to Defense Logistics Agency - Troop Support (DLA - Troop Support) for procurement."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.633"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.633"
                                            },
                                            "Text": {
                                                "val": "Will integrate prototype components\/technologies into menu systems to improve quality, optimize nutritional content, decrease weight\/cube and\/or improve modularity; conduct OT&E on ration systems to validate system level performance; present recommendations to the Joint Services Operational Ration Forum for Milestone C approval; finalize procurement documents and initiate transition to DLA-Troop Support; obtain Surgeon General approval of revised menus; execute production testing with industry to ensure consistent ration quality, understand Performance Contract Requirements (PCR), and resolve vendor\/supplier issues; and conduct confirmatory sensory, chemical, physical and shelf life testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Lines of effort previously reported separately (i.e., FIRIP; ASPIP and FGRIP) have been merged into a single line starting in FY 2019 titled ?Joint Service Combat Ration System Development?."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Field Feeding Systems Development"
                                    },
                                    "Description": {
                                        "val": "This effort integrates and demonstrates field feeding equipment systems in support of the Navy (USN), Air Force (USAF), and Marine Corps (USMC) that reduce the logistics burden, improve efficiency, and decrease operation and support costs as directed by the DoD CFREB and Joint Service partners.  Validated systems, specifications, and technical data packages are transitioned to the appropriate Service partner for procurement and fielding.  Service partners include Product Manager Combat Support Equipment (PdM-CSE), Naval Sea Systems Command (NAVSEA), Naval Supply Systems Command (NAVSUP), and USAF Basic Expeditionary Airfield Resources (BEAR) Program Office."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.46"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.46"
                                            },
                                            "Text": {
                                                "val": "Will conduct OT&E of new integrated mounting system for galley equipment to reduce operation and support costs in support of the USN; support integration and demonstration of efficient refrigeration assets and an Energy Management System (EMS) in support of the USAF BEAR Type I & II kitchen systems; develop reports, Engineering Change Proposals (ECPs) and logistical data to reduce overall fuel and water consumption in support of the USMC; transition validated prototype equipment and technical data to USN, USMC and USAF."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Lines of effort previously reported separately (i.e., Block Upgrades and Operational Improvements for Expeditionary Field Feeding Equipment; Support to Air Force Field Feeding Modernization Efforts; NFSAT; MIKS) have been merged into a single line starting FY 2019 titled ?Joint Service Field Feeding Equipment and Menu Development?."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "610"
                                    },
                                    "Title": {
                                        "val": "Food Adv Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "5.095"
                                        },
                                        "CurrentYear": {
                                            "val": "6.548"
                                        },
                                        "BudgetYearOne": {
                                            "val": "4.599"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "4.599"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.11"
                                        },
                                        "BudgetYearThree": {
                                            "val": "4.223"
                                        },
                                        "BudgetYearFour": {
                                            "val": "4.175"
                                        },
                                        "BudgetYearFive": {
                                            "val": "4.972"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "33.722"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete Engineering and Manufacturing Development (EMD) and Demonstration of food items and equipment for transition into competitive procurement contract. Complete advanced research efforts to support Engineering Change Proposals for previously developed equipment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Combat Feeding Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.827"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.175"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.376"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Service Rations and Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.155"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.381"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.444"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.698"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.698"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Joint Service Rations and Combat Feeding Equipment"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM, NSRDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.174"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.117"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.16"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.16"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260713_548.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Conduct operational testing of combat ration systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition combat ration procurement documents to DLA"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition prototype equipment, ECPs and technical data to USMC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct in-house T&E of Beta version and transition NFSAT to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prepare TDP and obtain high fidelity MIKS prototype system"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of BEAR Type II kitchen system and transition to USAF"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct land-based user evaluation of MIKS and transition data to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition Mobile Feeding Galley to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition labor & energy saving galley\/scullery upgrades to USN"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of Improved Tray Ration Heater and transition to USMC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Obtain Aerial Delivery Certification of Inflatable Refrigerated Space (IRefS)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT&E of intuitive kitchen equipment and transition to Services"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EL2"
                    },
                    "ProjectTitle": {
                        "val": "Army Field Feeding Equipment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.245"
                        },
                        "CurrentYear": {
                            "val": "3.002"
                        },
                        "BudgetYearOne": {
                            "val": "3.414"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.414"
                        },
                        "BudgetYearTwo": {
                            "val": "4.248"
                        },
                        "BudgetYearThree": {
                            "val": "2.921"
                        },
                        "BudgetYearFour": {
                            "val": "2.923"
                        },
                        "BudgetYearFive": {
                            "val": "2.979"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.732"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the development, demonstration and Non-Developmental Item (NDI) Commercial Off The Shelf (COTS) evaluation of combat feeding equipment to enhance Soldier efficiency, improve Soldier survivability, and reduce food service logistics requirements for the Army. The Project supports multi-fuel, rapidly deployable field food service equipment initiatives. Efforts also support the Engineering and Manufacturing Development (EMD) phase of programs to improve equipment, enhance safety in food service, and decrease fuel and water requirements. The Projects develop critical enablers that support the Army's Strategic Planning Guidance by developing and integrating critical expeditionary capabilities that maintain readiness, providing effective solutions that reduce the resource and operational energy footprint, providing modernized equipment, and enhancing the field Soldier's well being. This project reduces sustainment requirements, related Combat Support\/Combat Service Support (CS\/CSS) demands on lift, the combat zone footprint, and costs for logistical support.\n\n\nThis PE\/Project supports Field Feeding programs for the Army."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Battlefield Kitchen (BK)"
                                    },
                                    "Description": {
                                        "val": "Provide replacement of the obsolete Mobile Kitchen Trailer (MKT) system. The BK shall replace the MKT with a kitchen that provides fuel efficient, thermally controlled, closed combustion appliances within an environmentally controlled workspace. The BK shall provide rations for up to 300 Soldiers within 4 hours of setup. The BK provides refrigeration, running water and a heated serving line using the same off-road prime mover as the MKT as well as transportability by rail, sea, fixed and rotary wing aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.245"
                                            },
                                            "Text": {
                                                "val": "Oversee contractor integration of developmental components and mature government supplied components into working BK prototype. Maintain concurrent development of Integrated Logistics Support (ILS) documentation and provisioning of government supplied mature components and subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.002"
                                            },
                                            "Text": {
                                                "val": "Complete integration of BK subsystems and fabricate final BK system prototypes.  Conduct Production Prove-out Testing and initiate Limited User Test in accordance with approved Test& Evaluation Master Plan."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.484"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.484"
                                            },
                                            "Text": {
                                                "val": "Complete Limited User Test.  Complete logistics documentation and prepare Milestone C package to obtain Milestone C decision and transition program into Low Rate Initial Production (LRIP)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Significant hardware development, fabrication, and testing efforts in FY18 to meet accelerated program schedule.  Decreased funding in FY19  supports completion of testing and transition into production."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Containerized Food Sanitation Center"
                                    },
                                    "Description": {
                                        "val": "Develop, test and field a containerized food sanitation center using the modular burner and the modular appliance concept that meets the requirements of Tri Service Food Code and the Force Provider Expeditionary (FPE) Capabilities Production Document (CPD)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.788"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.788"
                                            },
                                            "Text": {
                                                "val": "Prototype target sanitation sinks using commercially available sinks and the Army's modular burner technology. Develop performance specification for complete development of the required sinks and burners integrated into TRICON sized containers. Award development contract or delivery order for comprehensive prototyping."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New RDT&E start for modification to field equipment incorporating new technology."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Containerized Kitchen, Modular"
                                    },
                                    "Description": {
                                        "val": "Integrate the Anny's new Modular Appliance Burner and modular appliances developed for the Battlefield Kitchen into the Containerized Kitchen Platform. Replacing the open combustion appliances on the CK eliminates a key safety issue and the modular appliances are 20-40% more fuel efficient. Sharing the modular concept across all Army Field Feeding Platforms cuts the life cycle support costs significantly."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.142"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.142"
                                            },
                                            "Text": {
                                                "val": "Use the government owned technical data package developed by the Army and updated by the BK kitchen development effort to award an integration contract to govern integration of modular burners and appliances onto the Containerized Kitchen Platform. Oversee the Systems Engineering required to develop a comprehensive design for a Containerized Kitchen, Modular."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding required to support transition of effort from 6.4 RDT&E due to technology maturity and initiation of EMD."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "EL1"
                                    },
                                    "Title": {
                                        "val": "Army Field Feeding Programs"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "1.873"
                                        },
                                        "CurrentYear": {
                                            "val": "0.447"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.362"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.362"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.504"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.646"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2.1"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.5"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "R62830"
                                    },
                                    "Title": {
                                        "val": "Battlefield Kitchen, Field Feeding"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "2.049"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.049"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.749"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.838"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.954"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.581"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "M65801"
                                    },
                                    "Title": {
                                        "val": "Refrigerated Container Systems"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.124"
                                        },
                                        "CurrentYear": {
                                            "val": "10.877"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.177"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.177"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "6.527"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.3"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.726"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.723"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Complete Engineering Manufacturing Decisions (EMD) of food items and equipment for transition into competitive procurement contract. Complete advanced research efforts to support Engineer Change Proposals for previously developed equipment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMFSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.115"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.125"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.25"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.437"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.437"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.927"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Battlefield Kitchen"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMFSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.081"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.302"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.302"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.503"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Containerized Food Sanitation Center (FSC)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMFSS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Natick, MA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.46"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.46"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.460"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Deployable Sustainable Efficient Refrigeration Technology"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.054"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.054"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.054"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Ice Making System"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATC\/Ft Lee"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Virginia"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.205"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.205"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Battlefield Kitchen"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ATC\/FT Lee"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Virginia"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.671"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.161"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.161"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.832"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260713_EL2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20180202_1_260713_EL2.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20180202_2_260713_EL2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Design and build Battlefield Kitchen prototypes"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct PPT on the Battlefield Kitchen"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct Limited User Testing on the Battlefield Kitchen"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete Milestone C and transition Battlefield Kitchen into LRIP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop FSC-III prototype and logistics support materials"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct required developmental testing on FSC III"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct Limited User Testing and log demo on FSC III"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete ECP and transition a containerized FSC to FPE"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prepare technical data package from BK program for use in CK Modular development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award development contract for modification of fielded CK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop testable system prototypes for CK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop logistics support and TM modification support packages for CK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Comprehensive production verification testing for CK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct log demo and operational testing for CK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop ECP and finalize Logistics and MWO configuration for CK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition mature ECD technology into development and demonstration phase"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop units for test of ECD for MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct developmental testing to include reliability on ECD for MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct limited user evaluation on ECD for MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Complete ECP for ECD and transition into Army refrigerated systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Award AK prototype integration contract"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop hardware to meet system requirements including UGR-A capability for AK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Execute production verification testing on approved hardware for AK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct OT to verify effectiveness and suitability for AK"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop ECP and modify ILS to allow insertion to ongoing AK production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition CO2 RU design into MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct production verification level testing on CO2 MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct suitable OT to verify suitability and effectiveness  of CO2 MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Develop contract change documentation for CO2 MTRCS"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Transition component development for ECD infused TRCS over road cooling capabili"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct system testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}