{
    "id": "2019-Army-PB-2040-JBOOK-d3d3f82921b489871a1a4e67a87dc7ea6efd7f320a6682df27ed06f0007d5b08-25",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0203801A"
        },
        "ProgramElementTitle": {
            "val": "Missile\/Air Defense Product Improvement Program"
        },
        "R1LineNumber": {
            "val": "206"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.925"
            },
            "CurrentYear": {
                "val": "17.723"
            },
            "BudgetYearOne": {
                "val": "3.643"
            },
            "BudgetYearOneBase": {
                "val": "1.643"
            },
            "BudgetYearOneOCO": {
                "val": "2"
            },
            "BudgetYearTwo": {
                "val": "1.287"
            },
            "BudgetYearThree": {
                "val": "1.289"
            },
            "BudgetYearFour": {
                "val": "0.128"
            },
            "BudgetYearFive": {
                "val": "0"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "48.995"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Avenger Air Defense System is a lightweight, ground-to-air missile and gun weapon system mounted on a High Mobility Multi-purpose Wheeled Vehicle. The Avenger's mission is to protect fixed critical assets and Corps\/Echelons above Corps Maneuver forces from Unmanned Aircraft Systems (UAS), Cruise Missiles (CM), and Fixed Wing and Rotary Wing aircraft. Avenger provides day\/night adverse weather operations, shoot on the move capability, rapid target engagement, and remote firing capability.\n\nThe Avenger Modification - Service Life Extension Program (MOD - SLEP) consists of Project 038: Avenger Production Improvement Program (PIP) and Program Element CE8710: Avenger MODS. Avenger MOD-SLEP ensures that Avenger is viable and sustainable through the end of program life. Avenger MOD-SLEP maintains operational capability of Avenger until replaced by the Indirect Fire Protection Capability Increment 2- Intercept (IFPC Inc 2-I) in the Fiscal Year (FY) 31 timeframe.  \n\nThe Stinger Block I missile is an advanced, fire-and-forget, short-range, man-portable, air defense weapon system. Stinger's mission is to provide the force with low- altitude air defense against fixed and rotary wing aircraft, unmanned aircraft systems (UAS) and cruise missiles (CM). Stinger is deployable from the shoulder or from a variety of platforms that includes vehicles, helicopters and UAS. The missile is delivered as a certified round and requires no field testing or maintenance. \n\nFunding provided for the Stinger Product Improvement completes design, development, test and integration of the Proximity Fuze (PROX) and addresses obsolescence. This will make PROX available for incorporation into the existing Stinger Block I missile. The PROX will improve effectiveness by eliminating the need for a hit-to-kill against UAS threats. UAS defense is a requirement of the Operational Requirements Document (ORD) for the Stinger Guided Missile System and validated by the Deputy Chief of Staff, G-3\/5\/7, Current and Future Warfighting Capabilities Division (DAMO-CIC) in a memo dated 28 May 2013.\n\nAlso funded under DT5 (Stinger Product Improvement), the Maneuver - Short Range Air Defense (M-SHORAD) demonstration in 4QFY17 assessed available industry solutions for mitigating the M-SHORAD gap in the near term. The intent is to inform requirements and identify what capability could be fielded by FY21 in order to help mitigate this critical air defense gap. This project moved to its own PE, 0604117A (Short Range air Defense(M-SHORAD)), Project FI4 (Maneuver - Short Range Air Defense (M-SHORAD)), starting in FY18."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.722"
                },
                "CurrentYear": {
                    "val": "11.173"
                },
                "BudgetYearOne": {
                    "val": "1.661"
                },
                "BudgetYearOneBase": {
                    "val": "1.661"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.925"
                },
                "CurrentYear": {
                    "val": "17.723"
                },
                "BudgetYearOne": {
                    "val": "3.643"
                },
                "BudgetYearOneBase": {
                    "val": "1.643"
                },
                "BudgetYearOneOCO": {
                    "val": "2"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-28.797"
                },
                "CurrentYear": {
                    "val": "6.55"
                },
                "BudgetYearOne": {
                    "val": "1.982"
                },
                "BudgetYearOneBase": {
                    "val": "-0.018"
                },
                "BudgetYearOneOCO": {
                    "val": "2"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.002"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.195"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "6.55"
                                },
                                "BudgetYearOne": {
                                    "val": "2"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "2"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Amended FY2017 not appropriated"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-28.6"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.018"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The $28.6M was part of the FY17 Request for Additional Appropriations but was not appropriated.  The FY18 $6.55M is an administrative correction to balance the R-2 with the R-1.  The $2.0M is an OCO increase to support Avenger MOD-SLEP."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "038"
                    },
                    "ProjectTitle": {
                        "val": "Avenger PIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.925"
                        },
                        "CurrentYear": {
                            "val": "2.723"
                        },
                        "BudgetYearOne": {
                            "val": "3.643"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.643"
                        },
                        "BudgetYearOneOCO": {
                            "val": "2"
                        },
                        "BudgetYearTwo": {
                            "val": "1.287"
                        },
                        "BudgetYearThree": {
                            "val": "1.289"
                        },
                        "BudgetYearFour": {
                            "val": "0.128"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "13.995"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Avenger PIP consists of the ongoing Avenger Modification - Service Life Extension Program (MOD-SLEP). Avenger MOD-SLEP provides development and testing of six key Line Replaceable Units (LRUs) to ensure Avenger maintains operational capability through FY31, when the IFPC Inc 2-I system is fielded. The six LRUs are: Targeting Console (TC), .50 Caliber Machine Gun (M3P), Avenger Fire Control Computer - Revised (AFCC-R), Mode 5 Identification Friend or Foe (IFF), Vehicle Internal Communications (VIC-5) and the Environmental Control Unit\/Prime Power Unit (ECU\/PPU) governor and starter. \n\nFY2019 Base dollars in the amount of $1.643 million supports activities to ensure the Avenger is viable and sustainable through FY31, the end of its program life.  The funding will contribute to the testing, test support and materiel release package for the AFCC-R, IFF, VIC-5 and ECU\/PPU.\n\nFY2019 OCO dollars in the amount of $2.000 million supports redesign of Training Aids, Devices, Simulators and Simulations (TADSS) for the European Deterrence Initiative (EDI)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avenger MOD-SLEP"
                                    },
                                    "Description": {
                                        "val": "The Avenger MOD-SLEP consists of development activities for platform integration, software upgrades, and capability enhancements.  Develops and executes test requirements and conducts limited contractor and government testing. Performs technical assessments, concept studies, cost reduction, risk reduction and development documentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.925"
                                            },
                                            "Text": {
                                                "val": "Finish development activities for platform integration, software upgrades, and capability enhancements. Develop and execute test requirements and conduct limited contractor and government testing on developing modernization parts.  Perform technical assessments, concept studies, cost reduction, risk reduction and development documentation. Increase testing activities on integration studies to ensure compatibility."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.723"
                                            },
                                            "Text": {
                                                "val": "Executed test requirements and conducted limited contractor and government testing. Performed technical assessments, concept studies, cost reduction, and risk reduction. The Army Interoperability Certification (AIC) testing ensured that Avenger could properly interface, with other systems, and execute its mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.643"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.643"
                                            },
                                            "Text": {
                                                "val": "Complete test requirements and initiate materiel release package."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Funding will be used for redesign of Training Aids, Devices, Simulators and Simulations (TADSS) for EDI."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY18 completed development of MOD SLEP Phase II Components. FY19 is for redesign of TADDS for EDI."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CE8710"
                                    },
                                    "Title": {
                                        "val": "AVENGER MODS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "35.979"
                                        },
                                        "CurrentYear": {
                                            "val": "62.931"
                                        },
                                        "BudgetYearOne": {
                                            "val": "48.67"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "48.67"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "86.807"
                                        },
                                        "BudgetYearThree": {
                                            "val": "165.928"
                                        },
                                        "BudgetYearFour": {
                                            "val": "454.994"
                                        },
                                        "BudgetYearFive": {
                                            "val": "291.6"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1146.909"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The Avenger MODS procures MOD-SLEP LRUs for the Avenger system to ensure that Avenger is viable and sustainable through FY31. This program is an integral part of the Army Air and Missile Defense Modernization strategy."
                        },
                        "AcquisitionStrategy": {
                            "val": "The Avenger Modification - Service Life Extension Program (MOD-SLEP) addresses obsolescence of key Line Replaceable Units (LRUs) and ensures that Avenger is viable and sustainable through FY31, filling a capability gap to counter Unmanned Aircraft Systems (UAS), Cruise Missiles (CM), and Fixed Wing and Rotary Wing aircraft.  The Avenger capability will be permanently filled by the IFPC Inc 2-I.  The MOD-SLEP provides new M3P machine guns and TCs.  The MOD-SLEP will upgrade the AFCC, IFF, the VIC system and the ECU\/PPU governor and starter.\n\nMOD-SLEP Phase II will be installed as a single installation package.  MOD-SLEP Phase II components are the Avenger Fire Control Computer- Revised (AFCC-R), the Mode 5 Identification Friend or Foe (IFF) and the Vehicle Internal Communications (VIC-5)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Avenger Modification Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.752"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.254"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.228"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.164"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.164"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Avenger Modification Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Raytheon, The Boeing Company and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds, MD and Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.14"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.558"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.424"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Avenger Modification \nTest Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Boeing Company, Aviation and Missile Research Development and Engineering Center (AMRDEC) and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL and Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.054"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.113"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.071"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.479"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.479"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260716_038.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Mode 5 Identification Friend or Foe (IFF) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Internal Communication (VIC-5) Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Avenger Fire Control Computer-Revised (AFCC-R) Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Integration and Testing (MOD-SLEP Phase II)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Flight Test Engagement (MOD-SLEP Phase II)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Maintainability Demo \/ Logistics Demo (MOD-SLEP Phase II)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Materiel Release (MOD-SLEP Phase II)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Future Modifications to Address Evolving Threat"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Modification - Service Life Extension Program (MOD-SLEP) Phase II components are the AFCC-R, IFF and VIC-5."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DT5"
                    },
                    "ProjectTitle": {
                        "val": "Stinger Product Improvement"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20"
                        },
                        "CurrentYear": {
                            "val": "15"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "35.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Stinger Block I missile is an advanced, fire-and-forget, short-range, man-portable, air defense weapon system. Stinger's mission is to provide the force with low- altitude air defense against fixed and rotary wing aircraft, Unmanned Aircraft Systems (UAS) and cruise missiles (CM). Stinger is deployable from the shoulder or from a variety of platforms to include vehicles, helicopters and UAS. The missile is delivered as a certified round and requires no field testing or maintenance.\n\nFunding provided for the Stinger Product Improvement completes design, development, test and integration of the Proximity Fuze (PROX) and addresses obsolescence. This will make PROX available for incorporation into the existing Stinger Block I missile. The PROX will improve effectiveness by eliminating the need for a hit-to-kill against UAS threats. UAS defense is a requirement of the Operational Requirements Document (ORD) for the Stinger Guided Missile System and validated by the Deputy Chief of Staff, G-3\/5\/7, Current and Future Warfighting Capabilities Division (DAMO-CIC) in a memo dated 28 May 2013.\n\nThe Stinger Product Improvement also funded the Short Range Air Defense (SHORAD) demonstration in 4QFY17. This assessed available industry solutions for mitigating the Maneuver SHORAD gap in the near term. The intent is to inform requirements and identify what capability could be fielded by FY21 in order to help mitigate this critical air defense gap. Starting in FY18, the Maneuver SHORAD effort has been moved to its own PE, 0604117A, for all future requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Proximity Fuze (PROX) Development and Integration"
                                    },
                                    "Description": {
                                        "val": "These funds will be used to complete test and integration of the PROX which will be incorporated into existing Stinger Block I missiles during Stinger SLEP."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.45"
                                            },
                                            "Text": {
                                                "val": "There are no base dollars.  Continued the design, development, test and integration of a PROX fuze into existing Singer Block 1 missiles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY18 to FY19 is due to anticipated completion of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Obsolescence and Improvements"
                                    },
                                    "Description": {
                                        "val": "This effort funds the obsolescence and improvements to the Stinger Block I missile."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.55"
                                            },
                                            "Text": {
                                                "val": "This effort funds the obsolescence and improvements of Stinger Block I missile and redesign of Training Aids, Devices, Simulators and Simulations (TADSS) for EDI."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort does not require FY19 funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "M-SHORAD Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort funded the M-SHORAD Demonstration that was completed in 4QFY17.  The M-SHORAD funding line was moved to its own line (PE 0604117A) beginning in FY18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "C21300"
                                    },
                                    "Title": {
                                        "val": "STINGER BLK I UPGRADES"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.578"
                                        },
                                        "CurrentYear": {
                                            "val": "91.09"
                                        },
                                        "BudgetYearOne": {
                                            "val": "94.756"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "94.756"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "81.615"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.457"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.072"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "278.568"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Stinger Block 1 Upgrades program provides for Service Life Extension Program (SLEP) of Stinger Block 1 missiles and the PROX fuze."
                        },
                        "AcquisitionStrategy": {
                            "val": "In Fiscal Year (FY) 12 the Stinger Based Systems (SBS) Product Office utilized Picatinny Arsenal to award a Proximity Fuze (PROX) development contract for the design, development, test and integration of the PROX capability. This capability will be incorporated into the existing Stinger Block I missile SLEP."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Mgt\/Admin"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Trident, Intuitive Research and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.981"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.981"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PROX Development and Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Aviation and Missiles Research Development and Engineering Center, Redstone Test Center and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "22.977"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "15"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "37.977"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M-SHORAD Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Letterkenny Army Depot, Anniston Army Depot and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Chambersburg, PA, and Anniston, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.938"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.938"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "M-SHORAD Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Trident, Intuitive Research, Aviation and Missiles Research Development and Engineering Center and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntsville, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.305"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.305"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PROX Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Redstone Test Center and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Redstone Arsenal, AL and Eglin Air Force Base, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.414"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.414"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M-SHORAD Government Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "White Sands Missile Range (WSMR), Target Manangment Office (PEO STRI) and others"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "WSMR, NM and Redstone Arsenal, AL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.032"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.032"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "M-SHORAD Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Target Management Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.725"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.725"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260716_DT5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Technology Demonstrations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2012"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Proximity (PROX) Fuze Critical Design Review (CDR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Component Level Qualifications (CLQ)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Proximity Flight Readiness Reviews (PFRR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "PROX Development and Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}