{
    "id": "2019-ChemicalandBiologicalDefenseProgram-PB-0400-JBOOK-9e38ae0091140c0534657cc0867e23431690c03369a2d2d94356a61b91e6fff3-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-CBDP-U_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (BASIC RESEARCH)"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "43.750"
            },
            "CurrentYear": {
                "val": "43.898"
            },
            "BudgetYearOne": {
                "val": "42.103"
            },
            "BudgetYearOneBase": {
                "val": "42.103"
            },
            "BudgetYearTwo": {
                "val": "45.311"
            },
            "BudgetYearThree": {
                "val": "45.449"
            },
            "BudgetYearFour": {
                "val": "45.487"
            },
            "BudgetYearFive": {
                "val": "45.490"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Advances fundamental knowledge and promotes theoretical and experimental research in life and physical sciences.\n\nThe projects within this BA reflect the research areas of Life Sciences (LF1) (e.g. microbiology, biochemistry, pathogenic mechanisms, cell and molecular biology, immunology, nanoscale science, and information science) which focus on fundamental efforts to understand living systems' response to biological or chemical agents, to support detection, diagnostics, protection, and medical treatment. \n\nThe projects within this BA also include efforts in Physical Sciences (PS1) (e.g. chemistry, physics, materials science, nanotechnologies, nanoscale science, and environmental science) which focus on fundamental scientific phenomena.  These support investigation of physical and chemical properties and interactions for enhanced functionalities important to detection, diagnostics, protection, and decontamination.\n\nBA1 also supports the DoD Science, Technology, Engineering, and Math (STEM) Strategic Plan to attract, inspire, and develop exceptional STEM talent across the education continuum to enrich our current and future DoD workforce to meet defense technological challenges.  This includes the Joint Science and Technology Institute (JSTI) which is a 2-week residential program for high school students and teachers who conduct a research project from a STEM field with a DoD scientist.  In addition, the National Research Council Research Associateship Program and the Military Internship Program provide unique opportunities for talented scientists and engineers, and promising midshipmen\/cadets, to conduct research at DoD service laboratories on projects that are of interest to the Chemical and Biological Defense Program Enterprise in an effort to develop the future DoD workforce.\n\nThe projects in this PE are placed in BA1 because they are basic research efforts directed towards non-specific or non-unique military applications.  Basic research technological breakthroughs support applied research (PE 0602384BP) activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "44.800"
                },
                "CurrentYear": {
                    "val": "43.898"
                },
                "BudgetYearOne": {
                    "val": "43.004"
                },
                "BudgetYearOneBase": {
                    "val": "43.004"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.750"
                },
                "CurrentYear": {
                    "val": "43.898"
                },
                "BudgetYearOne": {
                    "val": "42.103"
                },
                "BudgetYearOneBase": {
                    "val": "42.103"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.050"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.901"
                },
                "BudgetYearOneBase": {
                    "val": "-0.901"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.293"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.343"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.901"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.901"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY17 (+$0.293M): Reprogramming to support core competencies at the U.S. Army Medical Research Institute for Infectious Diseases.\nFY17 (-$1.343M): Transfer of funding to support Small Business Innovative Research\/Small Business Technology Transfer efforts.\nFY19 (-$0.901M): Application of revised inflation guidance.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "LF1"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL\/BIOLOGICAL DEFENSE - LIFE SCIENCES (BASIC RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "29.502"
                        },
                        "CurrentYear": {
                            "val": "27.996"
                        },
                        "BudgetYearOne": {
                            "val": "26.815"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.815"
                        },
                        "BudgetYearTwo": {
                            "val": "29.778"
                        },
                        "BudgetYearThree": {
                            "val": "29.866"
                        },
                        "BudgetYearFour": {
                            "val": "29.891"
                        },
                        "BudgetYearFive": {
                            "val": "29.893"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (LF1) focuses on fundamental efforts to understand living systems' responses to biological or chemical agents, to support detection, protection, diagnostics, and medical treatment.  Research focuses on understanding factors which influence the behavior of chemicals, toxins, and pathogens in relation to the host or target.  Understanding of host\/agent interactions can drive exploration of novel approaches to detect, diagnose or protect against threats.  Research also focuses on medical countermeasures for improved efficacy against a wide array of current and future threat agents."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Life Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental efforts to understand living systems' responses to biological or chemical agents, to support detection, protection, diagnostics, and medical treatment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.502"
                                            },
                                            "Text": {
                                                "val": "Continued efforts to understand pathogens, novel threats, and host responses (including human and zoonotic) to prevent\/minimize host injury.  Continued to investigate and evaluate systemic biological responses following exposure of living systems to Chemical Biological (CB) agents.  Improved understanding of how polymicrobial interactions interfere with bacterial activities to influence discovery of novel antagonists for medical countermeasures.  Continued to explore nano- and nano-structured materials as approaches to the needs of chemical and biological countermeasures, including behavior in biological systems and how morphology relates to biological interaction and function.  Continued to evaluate various global processes and mechanisms which lead to bacterial persistence and resistance.  Identified biomarkers indicative of resistance and persistence.  Investigated novel therapeutics developed and collected from novel sources.  Investigated the influence of glycosylation patterns on biologic stability and pharmacologic characteristics.  Continued evaluation of role of gene amplification and duplication in the development of multiple drug resistance in bacterial pathogens.  Investigated alpha-virus glycoprotein tertiary structure and other viral immunodominant epitopes for improved development of immune assays, which support identification of an immune correlate of protection for vaccine licensure.  Examined mucosal immunity, particularly in the lung, for future development of mucosal vaccines.  Investigated new transport mechanisms of the blood-brain barrier, including specific interactions regulating viral entry into the central nervous system.  Investigated new biomarkers accessible in a minimally-invasive manner, characteristic of CB threats and the development of antimicrobial resistance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.996"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to understand pathogens, novel threats, and host responses (including human and zoonotic) to prevent\/minimize host injury.  Complete, test, and validate primers and probes for filovirus animal model and develop in vitro and in vivo inflammatory response models.  Continue to develop robust genetic control architectures for guidance of antimicrobials against bio threats.  Evaluate gut-on-a-chip devices for diagnostic capability and build capacity for multiple pathogens.  Validate nano-structured material drug delivery in various tissues and measure bio-distribution for optimal therapeutic delivery.  Conduct in vivo validation against agent challenge to demonstrate proof of concept.  Continue evaluation of role of gene amplification and duplication in the development of multiple drug resistance in bacterial pathogens.  Replicate environmental factors of persistence and validate mechanism against animal models.  Continue to investigate the influence of glycosylation patterns on biologic stability and begin pharmacokinetic and immunogenicity studies to validate animal model efficacy.  Continue to investigate filovirus glycoprotein tertiary structure and other viral immunodominant epitopes for improved development of immune assays which will support identification of an immune correlate of protection for vaccine licensure.  Begin validation of in silico transport mechanisms of the blood-brain barrier studies, in vitro, and in vivo to screen for potential therapeutic targets.  Evaluate gene duplication and amplification as a specific mechanism for antimicrobial resistance and horizontal gene transfer.  Begin development of a gene amplification detection system that can identify changes in antimicrobial and multidrug resistance.  Investigate novel inhibitory mechanisms that circumvent efflux pumps.  Explore the application of microfluidics to examine the host-immune response in the microenvironment and biomarker discover for infection onset and response to therapy.  Examine the impact of modulated olfactory, respiratory, and alveolar molecular & cell population variation on uptake of inhaled particulates, progression of toxicological & pathogenic effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.815"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.815"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to understand pathogens, novel threats, and host responses (including human and zoonotic) to prevent\/minimize host injury.  Complete, test, and validate primers and probes for filovirus animal model and develop in vitro and in vivo inflammatory response models.  Continue to develop robust genetic control architectures for guidance of antimicrobials against bio threats.  Evaluate gut-on-a-chip devices for diagnostic capability and build capacity for multiple pathogens.  Continue evaluation of role of gene amplification and duplication in the development of multiple drug resistance in bacterial pathogens.  Replicate environmental factors of persistence and validate mechanism against animal models.  Continue to investigate the influence of glycosylation patterns on biologic stability and continue pharmacokinetic and immunogenicity studies to validate animal model efficacy.  Continue to investigate filovirus glycoprotein tertiary structure and other viral immunodominant epitopes for improved development of immune assays which will support identification of an immune correlate of protection for vaccine licensure.  Continue validation of in silico transport mechanisms of the blood-brain barrier studies, in vitro, and in vivo to screen for potential therapeutic targets.  Evaluate gene duplication and amplification as a specific mechanism for antimicrobial resistance and horizontal gene transfer.  Continue development of a gene amplification detection system that can identify changes in antimicrobial and multidrug resistance.  Investigate novel inhibitory mechanisms that circumvent efflux pumps.  Explore the application of microfluidics to examine the host-immune response in the microenvironment and biomarker discover for infection onset and response to therapy.  Examine the impact of modulated olfactory, respiratory, and alveolar molecular & cell population variation on uptake of inhaled particulates, progression of toxicological & pathogenic effects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "53.726"
                                        },
                                        "CurrentYear": {
                                            "val": "71.654"
                                        },
                                        "BudgetYearOne": {
                                            "val": "67.994"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "67.994"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "68.078"
                                        },
                                        "BudgetYearThree": {
                                            "val": "68.279"
                                        },
                                        "BudgetYearFour": {
                                            "val": "68.311"
                                        },
                                        "BudgetYearFive": {
                                            "val": "68.307"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "59.042"
                                        },
                                        "CurrentYear": {
                                            "val": "56.187"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.720"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.720"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.986"
                                        },
                                        "BudgetYearThree": {
                                            "val": "50.200"
                                        },
                                        "BudgetYearFour": {
                                            "val": "52.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "52.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.096"
                                        },
                                        "CurrentYear": {
                                            "val": "73.212"
                                        },
                                        "BudgetYearOne": {
                                            "val": "70.960"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "70.960"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "72.997"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.989"
                                        },
                                        "BudgetYearFour": {
                                            "val": "81.306"
                                        },
                                        "BudgetYearFive": {
                                            "val": "79.218"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.584"
                                        },
                                        "CurrentYear": {
                                            "val": "18.093"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.675"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.735"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.740"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.737"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.055"
                                        },
                                        "CurrentYear": {
                                            "val": "23.655"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.219"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.349"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.155"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.150"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "88.629"
                                        },
                                        "CurrentYear": {
                                            "val": "92.846"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "93.271"
                                        },
                                        "BudgetYearThree": {
                                            "val": "104.285"
                                        },
                                        "BudgetYearFour": {
                                            "val": "103.753"
                                        },
                                        "BudgetYearFive": {
                                            "val": "97.215"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "PS1"
                    },
                    "ProjectTitle": {
                        "val": "CHEM\/BIO DEFENSE - PHYSICAL SCIENCES (BASIC RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.248"
                        },
                        "CurrentYear": {
                            "val": "15.902"
                        },
                        "BudgetYearOne": {
                            "val": "15.288"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.288"
                        },
                        "BudgetYearTwo": {
                            "val": "15.533"
                        },
                        "BudgetYearThree": {
                            "val": "15.583"
                        },
                        "BudgetYearFour": {
                            "val": "15.596"
                        },
                        "BudgetYearFive": {
                            "val": "15.597"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project (PS1) advances fundamental scientific knowledge in physical science areas that include chemistry, physics, materials science, environmental sciences, and nanotechnology that could potentially lead to transformational CB defensive capabilities enhancing Warfighter performance and safety.  Research results in physics, chemistry, and materials sciences that have potential application in point and standoff detection, diagnostics, as well as protection and decontamination.  Surface and environmental sciences focus on the study of physical and chemical properties and phenomena of interactions, especially with regard to Non Traditional Agents (NTAs), that seek to improve capabilities such as detection, protection, and decontamination.  Research in nanotechnology and nanoscale sciences, such as nanoelectromechanical systems, molecular motors, nano-mechanical resonance sensing, and nano-meter imaging, has potential application across CB capability areas to provide significant enhancement by, for example, decreasing detection response times, increasing medical countermeasure effectiveness against a wider array of threat agents, and providing currently unavailable modalities like detection imbedded in fabrics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Physical Sciences"
                                    },
                                    "Description": {
                                        "val": "Focuses on fundamental scientific phenomena including chemistry, physics, materials science, environmental science, and nanotechnology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.248"
                                            },
                                            "Text": {
                                                "val": "Continued to examine the impact of processing parameters in designing large scale membranes, which respond to multiple CB threats via deactivation and conformation change to enable novel means of protection and minimization of thermal burden.  Continued designing and synthesizing novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continued to investigate the impact of morphology on approaches to mitigate chemical and biological threats on CB relevant substrates such as fibers and yarns.  Continued exploring materials and integration of functionality that may provide adaptive materials and capabilities for CB defense countermeasures that bind, catalyze, respond and\/or mitigate threats.  Continued to study fundamental mechanisms between CB threats and surfaces at ambient pressure in order to elucidate its impact on reaction mechanisms between CB threats and state-of-the-art and novel CB mitigating surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.902"
                                            },
                                            "Text": {
                                                "val": "Continue to examine the impact of processing parameters in designing large scale membranes, which respond to multiple CB threats via deactivation and conformation change to enable novel means of protection and minimization of thermal burden.  Continue designing and synthesizing novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continue to investigate the impact of morphology on approaches to mitigate chemical and biological threats on CB relevant substrates - such as fibers and yarns.  Continue to investigate the impact of composition on structure and activity of materials to mitigate chemical and biological threats on CB relevant substrates.  Continue to study fundamental mechanisms between CB threats and surfaces at ambient pressure in order to elucidate its impact on reaction mechanisms between CB threats and state-of-the-art and novel CB mitigating surfaces.  Continue investigation of ecological and environmental drivers of Burkholderia pseudomallei virulence and persistence using multiplexed barcoded high throughput sequencing.  Continue to examine biomarkers from interstitial fluid and begin microneedle biosensor development to identify protein analytes.  Optimize catalytic polyelectrolyte and metal organic framework structures for hydrolysis or oxidation of toxic agents.  Evaluate and model self-decontaminating catalytic properties of materials for further testing against real agents.  Continue to assess and evaluate the efficacy of short chain fatty acids as a means of inactivating B.  anthraces vegetative cells, endospores, and other microorganisms under a variety of environmental conditions and surfaces.  Continue to investigate the elementary reactions, fundamental process parameters, and material mechanisms of a new means of neutralizing chemical warfare agents using a single-step, continuous supercritical water oxidation platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.288"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.288"
                                            },
                                            "Text": {
                                                "val": "Continue to examine the impact of processing parameters in designing large scale membranes, which respond to multiple CB threats via deactivation and conformation change to enable novel means of protection and minimization of thermal burden.  Continue designing and synthesizing novel decontamination options that are broadly applicable to multiple chemicals or biologicals and are less harmful to equipment.  Continue to investigate the impact of morphology on approaches to mitigate chemical and biological threats on CB relevant substrates such as fibers and yarns.  Continue to investigate the impact of composition on structure and activity of materials to mitigate chemical and biological threats on CB relevant substrates.  Continue to study fundamental mechanisms between CB threats and surfaces at ambient pressure in order to elucidate its impact on reaction mechanisms between CB threats and state-of-the-art and novel CB mitigating surfaces.  Continue investigation of ecological and environmental drivers of Burkholderia pseudomallei virulence and persistence using multiplexed barcoded high throughput sequencing.  Continue to examine biomarkers from interstitial fluid and begin microneedle biosensor development to identify protein analytes.  Optimize catalytic polyelectrolyte and metal organic framework structures for hydrolysis or oxidation of toxic agents.  Evaluate and model self-decontaminating catalytic properties of materials for further testing against real agents.  Continue to assess and evaluate the efficacy of short chain fatty acids as a means of inactivating B.  anthracis vegetative cells, endospores, and other microorganisms under a variety of environmental conditions and surfaces.  Continue to investigate the elementary reactions, fundamental process parameters, and material mechanisms of a new means of neutralizing chemical warfare agents using a single-step, continuous supercritical water oxidation platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB2"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "53.726"
                                        },
                                        "CurrentYear": {
                                            "val": "71.654"
                                        },
                                        "BudgetYearOne": {
                                            "val": "67.994"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "67.994"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "68.078"
                                        },
                                        "BudgetYearThree": {
                                            "val": "68.279"
                                        },
                                        "BudgetYearFour": {
                                            "val": "68.311"
                                        },
                                        "BudgetYearFive": {
                                            "val": "68.307"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "59.042"
                                        },
                                        "CurrentYear": {
                                            "val": "56.187"
                                        },
                                        "BudgetYearOne": {
                                            "val": "53.720"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "53.720"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "52.986"
                                        },
                                        "BudgetYearThree": {
                                            "val": "50.200"
                                        },
                                        "BudgetYearFour": {
                                            "val": "52.503"
                                        },
                                        "BudgetYearFive": {
                                            "val": "52.500"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM2"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "73.096"
                                        },
                                        "CurrentYear": {
                                            "val": "73.212"
                                        },
                                        "BudgetYearOne": {
                                            "val": "70.960"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "70.960"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "72.997"
                                        },
                                        "BudgetYearThree": {
                                            "val": "78.989"
                                        },
                                        "BudgetYearFour": {
                                            "val": "81.306"
                                        },
                                        "BudgetYearFive": {
                                            "val": "79.218"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.584"
                                        },
                                        "CurrentYear": {
                                            "val": "18.093"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.675"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.735"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.740"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.737"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.055"
                                        },
                                        "CurrentYear": {
                                            "val": "23.655"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.219"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.349"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.155"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.150"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "88.629"
                                        },
                                        "CurrentYear": {
                                            "val": "92.846"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "93.271"
                                        },
                                        "BudgetYearThree": {
                                            "val": "104.285"
                                        },
                                        "BudgetYearFour": {
                                            "val": "103.753"
                                        },
                                        "BudgetYearFive": {
                                            "val": "97.215"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}