{
    "id": "2019-AirForce-PB-3600-JBOOK-ff3ce798fd66c1fdf15074778cc17eeee0864d783490f920850ed1e15fcb218d-13",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602890F"
        },
        "ProgramElementTitle": {
            "val": "High Energy Laser Research"
        },
        "R1LineNumber": {
            "val": "14"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "39.545"
            },
            "CurrentYear": {
                "val": "43.049"
            },
            "BudgetYearOne": {
                "val": "43.359"
            },
            "BudgetYearOneBase": {
                "val": "43.359"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "44.221"
            },
            "BudgetYearThree": {
                "val": "45.103"
            },
            "BudgetYearFour": {
                "val": "46.019"
            },
            "BudgetYearFive": {
                "val": "46.948"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.300"
                },
                "CurrentYear": {
                    "val": "43.049"
                },
                "BudgetYearOne": {
                    "val": "43.685"
                },
                "BudgetYearOneBase": {
                    "val": "43.685"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "39.545"
                },
                "CurrentYear": {
                    "val": "43.049"
                },
                "BudgetYearOne": {
                    "val": "43.359"
                },
                "BudgetYearOneBase": {
                    "val": "43.359"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.755"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.326"
                },
                "BudgetYearOneBase": {
                    "val": "-0.326"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.269"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.486"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.326"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.326"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2017 reflects reprogramming to support Research and Development Projects, 10 U.S.C. Section 2358."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "625096"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "39.545"
                        },
                        "CurrentYear": {
                            "val": "43.049"
                        },
                        "BudgetYearOne": {
                            "val": "43.359"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.359"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "44.221"
                        },
                        "BudgetYearThree": {
                            "val": "45.103"
                        },
                        "BudgetYearFour": {
                            "val": "46.019"
                        },
                        "BudgetYearFive": {
                            "val": "46.948"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program funds Department of Defense high energy laser applied research through the Joint Directed Energy Transition Office.  This program is part of an overall Department of Defense high energy laser Science and Technology program.  High energy laser weapon systems have many potential advantages including speed-of-light delivery, precision target engagement, significant magazine depth, low-cost per kill, and reduced logistics requirements.  High energy lasers have the potential to perform a wide variety of military missions including high value asset and base protection, precision strike and platform self-protection vs. a wide variety of missile, rocket, artillery, mortar and air platforms.  Efforts funded under this program are generally chosen for their potential to have an impact on multiple high energy laser systems and multiple Service missions while complementing Service\/Agency programs that are directed at specific Service needs.  A broad range of technologies are addressed in key areas such as laser sources, laser beam control, modeling and simulation, and laser lethality mechanisms.  This program supports the Senior Official as required.  Efforts in this program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nThis program is in Budget Activity 2, Applied Research because this budget activity includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Solid State Laser Technologies"
                                    },
                                    "Description": {
                                        "val": "Mature technologies that will provide system level performance commensurate with fieldable laser devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.650"
                                            },
                                            "Text": {
                                                "val": "Continue to develop high reliability, lower cost, efficient and high temperature diode pump sources. Scale alternate laser wavelengths to additional militarily relevant power levels. Investigate high power fiber technologies. Continue risk reduction in solid state lasers for their inclusion in future laser systems. Monitor performance of the RELI lasers as integrated onto relevant military platforms. Conduct analysis of trade space to understand performance, fielding, robustness and integration issues for future platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.650"
                                            },
                                            "Text": {
                                                "val": "Develop high reliability, lower cost, efficient and high temperature diode pump sources.  Scale alternate laser wavelengths to additional militarily relevant uses and power levels.  Investigate high power fiber technologies.  Reduce technical risk in solid state lasers for inclusion in future laser weapon systems.  Conduct trade space analysis to understand performance, fielding, robustness and integration issues for military platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.185"
                                            },
                                            "Text": {
                                                "val": "Continue to develop high reliability, lower cost, efficient and high temperature diode pump sources.  Continue to scale alternate laser wavelengths to additional militarily relevant uses and power levels.  Investigate high power fiber technologies.  Continue to reduce technical risk in solid state lasers for inclusion in future laser weapon systems.  Continue trade space analysis to understand performance, fielding, robustness and integration issues for military platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $1.535 million.  Justification for this increase is increased emphasis in solid state laser technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced High Energy Laser Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate new technologies that have revolutionary potential for high energy lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.210"
                                            },
                                            "Text": {
                                                "val": "Explore novel laser technologies to improve efficiency and decrease mass\/volume for future laser weapon systems. Evaluate additional materials for high energy laser applications. Continue to improve understanding of short pulse laser technology to include material interaction and propagation. Continue to scale electrically pumped alkali lasers to higher KW-class power levels. Continue efforts to characterize and understand the physics of HEL propagation in adverse weather conditions. Conduct verification and validation for airspace de-confliction (AD), integrate AD with predictive avoidance tools to support an integrated demonstration. Establish a technical transition partner for program of record status designation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.210"
                                            },
                                            "Text": {
                                                "val": "Explore advanced concepts for laser technologies that will improve efficiency and decrease mass and volume for future laser weapon systems.  Evaluate materials for high energy laser applications.  Improve understanding of short-pulse laser technologies to include material interaction and propagation.  Scale electrically-pumped alkali vapor lasers to higher kilowatt class power levels.  Characterize and understand the physics of high energy laser atmospheric propagation in adverse environmental conditions such as fog, rain, smoke and dust.  Evaluate and test Avoidance and Air Space De-confliction systems on high energy laser test ranges.  Collaborate with the international laser development community.  Validate predictive models through analysis of atmospheric propagation data and measurements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "Continue to explore advanced concepts for laser technologies that will improve efficiency and decrease mass and volume for future laser weapon systems.  Continue to evaluate materials for high energy laser applications.  Continue to improve understanding of short-pulse laser technologies to include material interaction and propagation.  Continue to scale electrically-pumped alkali vapor lasers to higher kilowatt class power levels.  Continue to characterize and understand the physics of high energy laser atmospheric propagation in adverse environmental conditions such as fog, rain, smoke and dust.  Continue to evaluate and test Avoidance and Air Space De-confliction systems on high energy laser test ranges.  Continue to collaborate with the international laser development community.  Validate predictive models through analysis of atmospheric propagation data and measurements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decrease compared to FY 2018 by $0.110 million. Justification for this decrease is described in plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser Beam Control Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop technology to support high performance beam control systems and integrated demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "18.325"
                                            },
                                            "Text": {
                                                "val": "Continue development of beam control technologies for laser weapon use on multiple platforms (aircraft, ground vehicles and shipboard systems) in stressing environments. Continue development of a predictive avoidance fire control system for use on multiple platforms. Continue execution of a program for kill assessment technologies. Continue joint beam control efforts to develop hardware and technologies to improve throughput efficiency through the beam director, decrease component weight, and improve tracking and compensation through the atmosphere. Select additional programs for Service specific applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.080"
                                            },
                                            "Text": {
                                                "val": "Develop beam control technologies for laser weapon use on multiple platforms (aircraft, ground vehicles and shipboard systems) in stressing environments. Develop  predictive avoidance fire control systems for use on multiple platforms. Develop kill assessment technologies. Develop hardware and technologies to improve throughput efficiency through the beam director, decrease component weight, and improve tracking and compensation through the atmosphere for joint beam control. Select additional programs for service-specific applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.174"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.174"
                                            },
                                            "Text": {
                                                "val": "Continue development of beam control technologies for laser weapon use on multiple platforms (aircraft, ground vehicles and shipboard systems) in stressing environments. Continue development of a predictive avoidance fire control system for use on multiple platforms. Continue execution of a program for kill assessment technologies. Continue joint beam control efforts to develop hardware and technologies to improve throughput efficiency through the beam director, decrease component weight, and improve tracking and compensation through the atmosphere. Select additional programs for service-specific applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increase compared to FY 2018 by $1.094 million.  Justification for this increase is increased emphasis laser bean control technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Lethality Research"
                                    },
                                    "Description": {
                                        "val": "Conduct laser vulnerability experiments on materials, components, and targets. Develop a lethality database, and integrate into a systems-level architecture plan and lethality models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.720"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate recent lethality data into campaign-level HEL system models. Conduct laser vulnerability experiments on additional materials, components, and targets. Continue the development of a suite of DEW tools to be used in a database from which the warfighter can assess target vulnerabilities and mission utility for a given DEW platform and engagement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.095"
                                            },
                                            "Text": {
                                                "val": "Integrate lethality data into campaign-level high energy laser system models. Conduct laser vulnerability experiments on materials, components, and targets. Develop a suite of directed energy weapon tools to be used in a database from which the warfighter can assess target vulnerabilities and mission utility for given directed energy weapon platform and engagement. Develop warfighter tools employing service and agencies metrics and criteria such as the Joint Munitions Effectiveness Standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Continue to integrate lethality data into campaign-level high energy laser system models. Continue to conduct laser vulnerability experiments on materials, components, and targets. Continue to develop a suite of directed energy weapon tools to be used in a database from which the warfighter can assess target vulnerabilities and mission utility for given directed energy weapon platform and engagement. Continue to develop warfighter tools employing service and agencies metrics and criteria such as the Joint Munitions Effectiveness Standards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.595 million.  Justification for this decrease is described in plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Modeling"
                                    },
                                    "Description": {
                                        "val": "Maintain and evaluate high-fidelity engineering models for high energy laser system scenario evaluation and incorporation into the high energy laser toolkit. Provide atmospheric propagation and high energy laser system modeling for mission-level war-gaming activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.640"
                                            },
                                            "Text": {
                                                "val": "Provide continued maintenance, verification, validation, and accreditation for updated system level HEL models. Conduct additional mission-level HEL engagement scenarios and wargame HEL concepts. Continue to update atmospheric data into theater models to support performance characterization tables. Support risk assessment for the unintentional illumination of air and space objects by tactical laser weapons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.014"
                                            },
                                            "Text": {
                                                "val": "Provide maintenance, verification, validation, and accreditation for updated system level atmospheric propagation and high energy laser models. Collaborate with service-sponsored field-test planning to correlate model predictions with measured data for surface, maritime and aerospace environments. Incorporate atmospheric data into theater models to support performance characterization tables. Conduct verification and validation planning to support advanced beam control objectives, diagnostics and warfighter tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "Continue to provide maintenance, verification, validation, and accreditation for updated system level atmospheric propagation and high energy laser models. Continue to collaborate with service-sponsored field-test planning to correlate model predictions with measured data for surface, maritime and aerospace environments. Continue to incorporate atmospheric data into theater models to support performance characterization tables. Continue to conduct verification and validation planning to support advanced beam control objectives, diagnostics and warfighter tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $1.614 million.  Justification for this decrease is decreased emphasis in high energy laser modeling."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}