{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-8",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602751D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI) Applied Research"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.105"
            },
            "CurrentYear": {
                "val": "8.955"
            },
            "BudgetYearOne": {
                "val": "9.300"
            },
            "BudgetYearOneBase": {
                "val": "9.300"
            },
            "BudgetYearTwo": {
                "val": "9.608"
            },
            "BudgetYearThree": {
                "val": "9.692"
            },
            "BudgetYearFour": {
                "val": "9.791"
            },
            "BudgetYearFive": {
                "val": "9.844"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "Software is a key to meeting the Department of Defense's (DoD) increasing demand for high-quality, affordable, and timely national defense systems.\tWith growing global parity in software engineering, the DoD must maintain leadership to avoid strategic surprise.\tTo assist the DoD in retaining a long-term differential advantage over potential adversaries, the Software Engineering Institute (SEI) Applied Research program element (PE) develops and evaluates the feasibility and practicality of software and computer science concepts, with the potential to improve future DoD systems.\tThe research conducted by this PE directly benefits the technical domains such as Command, Control, Communications, Computers, and Intelligence (C4I), Autonomy, Cyber, and Engineered Resilient Systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.420"
                },
                "CurrentYear": {
                    "val": "8.955"
                },
                "BudgetYearOne": {
                    "val": "9.365"
                },
                "BudgetYearOneBase": {
                    "val": "9.365"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.105"
                },
                "CurrentYear": {
                    "val": "8.955"
                },
                "BudgetYearOne": {
                    "val": "9.300"
                },
                "BudgetYearOneBase": {
                    "val": "9.300"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.315"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.065"
                },
                "BudgetYearOneBase": {
                    "val": "-0.065"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.305"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.003"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.062"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.062"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "278"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI) Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.105"
                        },
                        "CurrentYear": {
                            "val": "8.955"
                        },
                        "BudgetYearOne": {
                            "val": "8.300"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.300"
                        },
                        "BudgetYearTwo": {
                            "val": "8.608"
                        },
                        "BudgetYearThree": {
                            "val": "8.692"
                        },
                        "BudgetYearFour": {
                            "val": "8.791"
                        },
                        "BudgetYearFive": {
                            "val": "8.844"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Work conducted under this PE will enable resilient mission assurance in heterogeneous and contested environments through the verification and validation of system performance and architecture.\tThe program will also assist the DoD in retaining a long-term advantage in the areas of software-intensive systems and cybersecurity by enhancing assurance, exploiting automation, and understanding human-computer interaction.\n\nThe SEI Applied Research PE has two main research thrusts with known military applications: 1) Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance) and 2) Information Assurance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SEI Applied Research in the Area of Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance)"
                                    },
                                    "Description": {
                                        "val": "This thrust seeks to develop verification techniques for requirements identification, systems of systems architectures, and virtual integration of components.  Additionally, research in this area will enable requirements verification for software assurance, analysis and control of unverified code, and automated repair of damaged code.  Software production and code analysis methods developed through this program will also improve the accuracy of behavior prediction of complex software system in untested environments.  Increasingly numerous lines of code will require a commensurate increase in sophistication of verification and validation mechanisms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.686"
                                            },
                                            "Text": {
                                                "val": "• Develop tools and techniques to validate software’s operational reliability through cost-effective model checking.\n• Develop machine learning and static analysis tools and techniques to identify and characterize technical debt in software systems.  Additionally, develop documentation templates and software technical debt management methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.152"
                                            },
                                            "Text": {
                                                "val": "In FY 2018 there will be two main lines of effort: create verification and validation research solutions focused on time-sensitivity and reliability for safety-critical systems; and create containment technology that will enable software systems to continue to function under duress."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.023"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, plans will include developing formal methods for explaining decision patterns in planning and learning systems, thus maximizing human-machine teaming effectiveness, developing and building benchmarks and datasets, using emerging machine learning computing technologies for evaluating and enhancing decision making systems, and developing techniques to assess risks and greatly increase the pervasiveness and adaptability of programmability in devices and Information Technology systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in budget from FY 2018 to FY 2019 reflects the release of resources as prototyping efforts in containment technologies conclude."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SEI Applied Research in the areas of Information Assurance (IA)"
                                    },
                                    "Description": {
                                        "val": "Information assurance ensures the integrity of information and data produced by software.\tSoftware developed from an unknown supply chain may include intentionally or unintentionally introduced vulnerabilities.\tThis thrust seeks to develop scalable automated methods to locate, understand, and mitigate the effects of these vulnerabilities.  Automated solutions developed through this thrust will be used to discover vulnerabilities in system software (binary only) and to generate proofs of correctness or fault.  Additionally, they will be used to model and simulate operational environments to support software and cyber tactics, techniques, and procedures testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.419"
                                            },
                                            "Text": {
                                                "val": "• Create and transition new, scalable techniques, algorithms, and tools for understanding the behavior of programs in binary form, including malware and other software of unknown provenance. \n• Automate the security evaluation of network-facing applications without requiring source code. \n• Research and create tools and techniques for automatic detection and semi-automatic mitigation of potential security vulnerabilities introduced by configuration and software development errors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.803"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, this project will develop technologies to increase the resiliency and assurance of software intensive systems.  This includes improvement in data analytics development and deployment, including scalability, data bias control and mitigation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.277"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.277"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, this project plans to develop advanced analytics and machine learning technologies to enable self-adaptive cyber defenses that can evade and confuse adversaries."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in budget from FY 2018 to FY 2019 reflects additional resources required for technology maturation efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 3, PE# 0603781D8Z"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute (SEI)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "13.726"
                                        },
                                        "CurrentYear": {
                                            "val": "15.047"
                                        },
                                        "BudgetYearOne": {
                                            "val": "15.151"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "15.151"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.267"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.398"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.570"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.874"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The SEI Applied Research PE represents a pivot toward more fundamental research that enables the DoD to address longer-term challenges in software technology and engineering.\tThe SEI Applied Research PE bolsters the organic research at the SEI Federally Funded Research and Development Center (FFRDC), enables stronger collaborations between the SEI FFRDC and academia, attracts top researchers to the SEI, and gives the DoD access to top experts in information science, which generally enhances the DoD’s ability to benefit from the military applications of research in software and computer science."
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics for this project include the transition of solutions, methods, and practices for use in DoD technology development programs and programs of record; the transition of solutions, methods, and practices to the Defense Industrial Base to support DoD technology development programs and programs of record, the number of citations in peer reviewed journals and reports, and the number of external research collaborations and interactions with the broader software and computer science community."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "817"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security, Applied Research"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.000"
                        },
                        "BudgetYearThree": {
                            "val": "1.000"
                        },
                        "BudgetYearFour": {
                            "val": "1.000"
                        },
                        "BudgetYearFive": {
                            "val": "1.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Work conducted under this project will enable resilient mission assurance in heterogeneous and contested environments through the verification and validation of system performance and architecture.  The program will also assist the DoD in retaining a long-term advantage in the area of cybersecurity by enhancing assurance, exploiting automation, and understanding human-computer interaction."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security"
                                    },
                                    "Description": {
                                        "val": "Warfighting in the cyber domain often operates at sub-second timescales and across multiple domains of authority.  Methods used to accomplish many tasks (e.g., malware analysis, coordinating multiple agents) demand large amounts of time, attention, and special skills and are not scalable.  This thrust seeks to develop and increase the use of automation to simplify the completion of these tasks.  Example activities include automation of moving target defenses, code artifact reverse engineering, analysis of network flows at enterprise scale, and development and assessment of workforce skills."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "This program will create tools and methods to automatically identify, mitigate, and repair unique vulnerabilities (including those from malware or deliberate nefarious interference) in software-enabled DoD systems (including emerging systems reliant on machine learning)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no notable change in the Cyber investment between FY 2018 and FY 2019.  Note the Cyber effort was funded in Project P781 in FY 2018."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Metrics for this program include transition of tools, methods, and practices for use in DoD technology development programs and programs of record; transition of tools, methods, and practices to the Defense Industrial Base to support DoD technology development programs and programs of record; the number of citations in peer reviewed journals and reports; and the number of external research collaborations and interactions with the broader software and computer science community."
                        }
                    }
                }
            ]
        }
    }
}