{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-5",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605326A"
        },
        "ProgramElementTitle": {
            "val": "Concepts Experimentation Program"
        },
        "R1LineNumber": {
            "val": "157"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "24.668"
            },
            "CurrentYear": {
                "val": "29.820"
            },
            "BudgetYearOne": {
                "val": "30.430"
            },
            "BudgetYearOneBase": {
                "val": "30.430"
            },
            "BudgetYearTwo": {
                "val": "61.024"
            },
            "BudgetYearThree": {
                "val": "60.790"
            },
            "BudgetYearFour": {
                "val": "61.948"
            },
            "BudgetYearFive": {
                "val": "65.663"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "334.343"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Army Concepts Experimentation Program Element (PE) supports current and future concepts and capabilities involving Soldiers and Leaders within live, virtual, and constructive environments by exploring concepts, capability requirements and solution across Doctrine, Organization, Training, Materiel, Leadership and Education, personnel, and Facilities (DOTMLPF) domains in order to learn and mitigate risk for current and future forces. Experiments and projects inform the Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent the user's requirements in the future Army. Army experiments use the combined resources of Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinements, and assessment of future force concepts - to inform capability developments and validate concepts for current and future force. Simulated Experiments (SIMEX) will integrate and assess Army Concepts, Force Designs phases, with Army level issues across the breadth of a campaign that highlights validation and integration of Force 2025 outcomes.\n\nEnables Army Training and Doctrine Command (TRADOC) Capability Development and Integration Directorates (CDID)\/TRADOC Capability Managers (TCM) Joint Capabilities Integration and Development System (JCIDS) development to support Program Executive Offices (PEOs) and Program Managers (PMs) for acquisition milestone decisions. The Assistant Secretary of the Army for Acquisition, Logistics, and Technology (ASA(ALT)) organizational community of PEOs\/PMs supplemented manpower shortfalls to TRADOC for many years. This was necessary to ensure work affecting their materiel development programs, specifically the mandated JCIDS process necessary for Milestone acquisition Army Requirements Oversight Council\/Joint Requirements Oversight Council (AROC\/JROC) decisions, was executed in a timely manner. Funding ensures TRADOC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all DOTMLPF consideration for warfighting functional areas. Provides for TRADOC to serve as the lead for Accelerated Capability Development (ACD) to address current critical operational needs enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force. Early Synthetic Prototyping enables wargaming, experimentation capability that engages soldiers across the Army through early-fidelity game environments to gain their insights and recommendations in the development of future doctrine, organization, and materiel solutions. Enables TRADOC to serve as the central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments and integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination. Provides Army Warfighter Assessments (AWA), which will allow TRADOC to physically integrate, assess and evaluate the network, capability sets and other adaptive capabilities to accelerate the systems acquisition process of providing DOTMLPF recommendations to the Army. Provides support to the Army Warfighting Challenges (AWFC) that are used by the Army to frame learning and collaboration.\n\nThe Soldier-Centered Analysis For Future Force will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. Design analyses, constructive simulations and Soldier-in-the loop assessments will ensure that manpower requirements and workload and skill demands are considered to avoid information and physical task overloads, and take optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.596"
                },
                "CurrentYear": {
                    "val": "29.82"
                },
                "BudgetYearOne": {
                    "val": "35.321"
                },
                "BudgetYearOneBase": {
                    "val": "35.321"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.668"
                },
                "CurrentYear": {
                    "val": "29.82"
                },
                "BudgetYearOne": {
                    "val": "30.43"
                },
                "BudgetYearOneBase": {
                    "val": "30.43"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.928"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-4.891"
                },
                "BudgetYearOneBase": {
                    "val": "-4.891"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.916"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.891"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.891"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.012"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request was reduced by $3.961 million to account for the availability of prior year execution balances. Additional reductions represent revised economic assumptions and civilian pay adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "312"
                    },
                    "ProjectTitle": {
                        "val": "Army\/Joint Experimentation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.312"
                        },
                        "CurrentYear": {
                            "val": "7.099"
                        },
                        "BudgetYearOne": {
                            "val": "6.534"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.534"
                        },
                        "BudgetYearTwo": {
                            "val": "7.725"
                        },
                        "BudgetYearThree": {
                            "val": "7.887"
                        },
                        "BudgetYearFour": {
                            "val": "8.051"
                        },
                        "BudgetYearFive": {
                            "val": "8.218"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "45.826"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Army \/ Joint Experimentation supports current and future concepts and capabilities involving Soldiers and Leaders within live, virtual, and constructive environments by exploring concepts, capability requirements and solutions across Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, and Facilities (DOTMLPF) domains in order to learn and mitigate risk for current and future forces. Experiments inform Army future concepts and assess high-risk conceptual assumptions in order to focus required capabilities and represent the user's requirements in the future Army. Army experiments use the combined resources of Army battle laboratories, operational units, research labs, materiel developers, industry and academia to collaborate in the development, refinements, and assessment of future force concepts - to inform capability developments and validate concepts for current and future force. Since FY 2015 this Project has supported the Army's Simulated Experiments (SIMEX) to integrate and assess Army Force 2025 and Beyond (F2025B) Concepts, Capabilities, Force Designs, Operational and Organizational Plans in the near (2014-2020), mid (2020-2030) and far (2030-2040) term."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimentation - High-Fidelity Live-Virtual-Constructive Experiments"
                                    },
                                    "Description": {
                                        "val": "Experiments address concept and capability developments including integration of capabilities for all Brigade Combat Team (BCT) types; development of future DOTMLPF requirements and solutions; and acceleration and integration of capabilities for current force BCTs and above brigade."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.312"
                                            },
                                            "Text": {
                                                "val": "Simulated Experiments (SIMEX) will become the focus to integrate and assess Army Concepts, Force Designs, and Capabilities to support  Force 2025B Maneuvers to develop, refine, and validate rerequisite Force 2025 and Beyond Concepts, Operational and Organizational Plans, and DOTMLPF solutions to achieve the vision of the Army's Force in the near (2014-2020), mid (2020-2030), and far (2030-2040) terms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.099"
                                            },
                                            "Text": {
                                                "val": "Enables the Army to conduct early fidelity exploration of Doctrine, Organization and Materiel solution through exposure of Soldiers to new innovative ideas and material. Establishes a continuing collaboration, feedback, and electronic analytical collection capability which captures, through simulated application of future force prototype concepts, explicit qualitative feedback of Soldiers experience gathered from simulated environments intertwined with surveys, polls, and discussion boards. Directed SIMEX leverage unique support analytics which capture Soldier and Team interaction during virtual small unit, first-person operating environment events from shooter engagements to high tempo teaming events which will become the focus to integrate and assess Army Concepts, Force Designs, and Capabilities to support Force 2025B Maneuvers to develop, refine, and validate prerequisite Force 2025 and Beyond Concepts, Operational and Organization Plans, and DOTMLPF solutions to achieve the vision of the Army's Force in the near (2014-2020), mid (2020-2030)(( and far (2030-2040) terms. Empowers participants to explore innovative techniques and participate in equipment and material design options which enables the Maneuver Battle Lab to be innovative in partnering with Department of Defense (DoD) Research and Development organizations in the development of solutions to Army Warfighting Challenges that would be assessed through Army Experimentation assessments. Leverages design of a high echelon, strategy environment which examines how units organize and employ future capabilities on the battlefield. The Army Capabilities Integration Center (ARCIC) continues, through a distributive network capability to support the Army Level Acquisition Design and merge with the Experimentation Mission while leveraging and sharing the expense of the Battle Labs to interject a new dynamic interactive process into proponent mission to engage Soldiers to select academia and industry solutions into a research opportunity through virtual exploration of the introduced concepts and equipment throughout a simulated operational environment selected from any location in the world. As Soldiers explore new ideas, concepts, material, and doctrine, they employ new techniques in coordination with the development of requirements documents provide improved insight to environment solutions to techniques and material during the conceptual development stage rather than post construction."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.534"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.534"
                                            },
                                            "Text": {
                                                "val": "Experiments will address concept and capability developments including integration of capabilities for all BCT types; development of future DOTMLPF requirements and solutions; and acceleration and integration of capabilities for current force BCTs and above brigade."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Revised economic assumptions."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "317"
                    },
                    "ProjectTitle": {
                        "val": "Current Force Capability Gaps"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.864"
                        },
                        "CurrentYear": {
                            "val": "20.898"
                        },
                        "BudgetYearOne": {
                            "val": "22.244"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.244"
                        },
                        "BudgetYearTwo": {
                            "val": "51.387"
                        },
                        "BudgetYearThree": {
                            "val": "50.951"
                        },
                        "BudgetYearFour": {
                            "val": "51.906"
                        },
                        "BudgetYearFive": {
                            "val": "55.413"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "275.663"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project enables Army Capability Development and Integration Programs through TRADOC\/ARCIC Capability Managers (TCM) to implement the Joint Capabilities Integration and Development System (JCIDS) in support of Program Executive Offices (PEOs) and Program Managers (PMs) for acquisition milestone decisions. The Assistant Secretary of the Army for Acquisition, Logistics, and Technology (ASA(ALT)) requires mandated work enabling their materiel development programs, specifically the mandated JCIDS process necessary for Milestone acquisition AROC\/JROC decisions, executed in a timely manner. Funding ensures TRADOC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all doctrine, organization, training, materiel, leadership and education, personnel, and facilities (DOTMLPF) consideration for warfighting functional areas. Provides for TRADOC to execute its assigned responsibilities as the lead for Accelerated Capability Development (ACD) to address current critical operational needs enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force. Supports critical research, development, test, and evaluation for Early Synthetic Prototyping enables wargaming, experimentation capability that engages soldiers across the Army through early-fidelity game environments to gain their insights and recommendations in the development of future doctrine, organization, and materiel solutions. Enables TRADOC execution of its responsibilities as central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments. Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination. Provides Army Warfighter Assessments (AWA), which will allow TRADOC to physically integrate, assess and evaluate the network, capability sets and other adaptive capabilities to accelerate the systems acquisition process of providing DOTMLPF recommendations to the Army. Provides support to the Army Warfighting Challenges (AWFC) that are used by the Army to frame learning and collaboration."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CDID\/TCM Joint Capabilities Integration and Development System (JCIDS) Development in support of PEOs and PMs for acquisition milestone decisions."
                                    },
                                    "Description": {
                                        "val": "Funding ensures TRADOC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all DOTMLPF considerations for warfighting functional areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.864"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Capabilities Initiatives in support of Force 2025 and Beyond"
                                    },
                                    "Description": {
                                        "val": "Accelerated Capabilities Initiatives in support of Force 2025 and Beyond."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will provide for TRADOC to serve as the lead Accelerated Capability Developments (ACD) to address current critical operational needs in enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force.  Serve as TRADOC central coordinating organization for Headquarters Department of the Army (HQDA) staff support requirements related to accelerated capabilities developments.  Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources.  Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Warfighting Assessments (Executed as part of NIE '.1' Events)"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.085"
                                            },
                                            "Text": {
                                                "val": "Support Joint Expeditionary Maneuver and Entry Operations, Set the Theater, Special Operations Forces\/Coalition Forces Interoperability, Air-Ground Reconnaissance and Security, Joint\/Multinational Operations, Sea Basing\/Joint Logistics Over the Shore (JLOTS), Mobile Command Posts (Expeditionary), Man Unmanned Teaming, (Ground\/Air) (MUM-T), Accelerated Capabilities Developments, Early Synthetic Prototyping and Architecture Army Warfighting Assessments (AWA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.118"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.118"
                                            },
                                            "Text": {
                                                "val": "Support Joint Expeditionary Maneuver and Entry Operations, Set the Theater, Special Operations Forces\/Coalition Forces Interoperability, Air-Ground Reconnaissance and Security, Joint\/Multinational Operations, Sea Basing\/Joint Logistics Over the Shore (JLOTS), Mobile Command Posts (Expeditionary), Man Unmanned Teaming, (Ground\/Air) (MUM-T), Accelerated Capabilities Developments, Early Synthetic Prototyping and Architecture Army Warfighting Assessments (AWA)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Revised economic assumptions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Capabilites Develpment"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.52"
                                            },
                                            "Text": {
                                                "val": "Provide for TRADOC to serve as the lead Accelerated Capability Development to address current critical operational needs in enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force. Serve as TRADOC central coordinating organization for Headquarters Department of the Army HQDA staff support requirements related to accelerated capabilities developments. Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources. Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.544"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.544"
                                            },
                                            "Text": {
                                                "val": "Provide for TRADOC to serve as the lead Accelerated Capability Development to address current critical operational needs in enabling development and deployment\/employment of accelerated capabilities (both materiel and non-materiel) to the current force. Serve as TRADOC central coordinating organization for Headquarters Department of the Army HQDA staff support requirements related to accelerated capabilities developments. Integrate ACD activities to ensure unity and priority of effort and synchronization and optimization of resources. Integrate accelerated capabilities development activities between proponent force modernization domains to include Joint\/Service coordination."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Revised economic assumptions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CDID\/TCM JCIDS Requirements Documentation"
                                    },
                                    "Description": {
                                        "val": "In Fiscal Year 2014 the TRADOC Capability Development Integration Directorate (CDID) Capability Manager began finalizing a transfer of JCIDS Requirements Documentation Mission responsibility from the Assistant Secretary of the Army for Acquisition, Logistics, and Technology. This activity provides essential Joint Capabilities Integration and Development System Requirements Documentation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.281"
                                            },
                                            "Text": {
                                                "val": "Ensure TRADOC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all DOTMLPF consideration for warfighting functional areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.538"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.538"
                                            },
                                            "Text": {
                                                "val": "Ensure TRADOC acts independently as the voice of the warfighter, the user, in complement with the materiel developer in providing total capability management including integration of all DOTMLPF consideration for warfighting functional areas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Revised economic assumptions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ArCADIE New Requirements"
                                    },
                                    "Description": {
                                        "val": "Army Capability-based Architecture Development and Integration Environment (ArCADIE) is the Army's authoritative source for architecture data and supports the community of practice requirement. ArCADIE provides a robust collaborative and common enterprise environment for architecture-related efforts in support of critical institutional processes throughout the TRADOC Centers of Excellence and Army\/Joint\/DOD partners. Offers a single, federated web-based environment for the development and discovery of integrated architectures across warfighting functions, and organizations throughout the Army Enterprise."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.012"
                                            },
                                            "Text": {
                                                "val": "Enable ARCIC to maintain ArCADIE and develop, verify, and validate operational architecture for 8 major BCT formations. Provide storage, accessibility, production, and certification of authoritative architecture data and supporting systems in accordance with DoD and DA information Assurance and management standards."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.044"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Text": {
                                                "val": "Enable ARCIC to maintain ArCADIE and develop, verify, and validate operational architecture for 8 major BCT formations. Provide storage, accessibility, production, and certification of authoritative architecture data and supporting systems in accordance with DoD and DA information Assurance and management standards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Revised economic assumptions."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "33B"
                    },
                    "ProjectTitle": {
                        "val": "Soldier-Centered Analyses For Future Force"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.492"
                        },
                        "CurrentYear": {
                            "val": "1.823"
                        },
                        "BudgetYearOne": {
                            "val": "1.652"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.652"
                        },
                        "BudgetYearTwo": {
                            "val": "1.912"
                        },
                        "BudgetYearThree": {
                            "val": "1.952"
                        },
                        "BudgetYearFour": {
                            "val": "1.991"
                        },
                        "BudgetYearFive": {
                            "val": "2.032"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.854"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project will provide early application of human performance and human figure modeling tools in the development of Soldier-focused requirements to shape technology for Future Force development. Design analyses, constructive simulations and Soldier-in-the-loop assessments will ensure that manpower requirements and workload and skill demands are considered to avoid information and physical task overloads, and take optimum advantage of aptitudes, individual and collective training, and numbers of Soldiers for an affordable Future Force. The cited work is consistent with the Strategic Planning Guidance, the Army Science and Technology Master Plan (ASTMP), the Army Modernization Plan, and the Defense Technology Area Plan (DTAP). Work in this Project is performed by the Army Research Laboratory (ARL)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Manpower and Personnel Integration (MANPRINT)"
                                    },
                                    "Description": {
                                        "val": "Provide dedicated modeling and analysis cell for early and accurate MANPRINT estimates to Army Materiel Command (AMC), Research, Development, and Engineering Command (RDECOM) and its Research, Development, and Engineering Centers (RDECs), Training and Doctrine Command (TRADOC) Centers, Schools and Centers of Excellence (CoEs), Army Test and Evaluation Command (ATEC) and other service laboratories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.492"
                                            },
                                            "Text": {
                                                "val": "Conducting analysis to determine appropriate parameters to capture Soldier information for system engineering that will improve system design and analysis progresses; expand scenario development and model based decision analysis framework to support Soldier system engineering methodology; develop and expand human performance apps for HSI data collection and analysis; expand the digital library by developing 3D models of vehicle Soldier clothing and equipment items to perform early human figure modeling assessments of future vehicle platform designs and enhancements; and demonstrate a virtual physical accommodation analysis concept by integrating a virtual human figure embedded in a space with a CAD representation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.823"
                                            },
                                            "Text": {
                                                "val": "Perform verification and validation of fixed-heel point accommodation model that will enable early assessment of driver?s crew station designs for future combat vehicles; develop human figure modeling methodology for determining seat placement of encumbered manikin sets for improved assessment of future aviation and ground platforms; develop rapid modeling technique incorporating portable handheld laser scanning technology and point cloud reduction software to construct vehicle models compatible with human figure modeling analysis to support the Route Clearance Interrogation System (RCIS) program; conduct an analysis into the Army?s Preventative Maintenance Checks and Services (PMCS) process to identify Human System Integration issues; develop algorithms to automate the PMCS level ten process, conduct experiments to demonstrate that the PMCS process can be automated resulting in a reduction of training requirements, entry errors to Global Combat Support System (GCSS)-Army, incorrect maintenance work orders, incorrect parts order, and significant reduction in maintenance man hours to perform the PMCS mission; and improve the accuracy of threat prediction algorithm to support command mission planning and course of action analyses. Develop Apps to support anthropometric data collection and analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.652"
                                            },
                                            "Text": {
                                                "val": "Will develop cognitive workload models to assess next-generation combat vehicle (NGCV) crewman ability to control multiple unmanned assets in a combined Manned-Unmanned Teaming (MuM-T) environment to allow crewman to think and act decisively to shoot, move and communicate more effectively.  Will collect dynamic motion data for NGCV crewman and format motion data for input into computer-assisted design (CAD) models to determine if proper crew offset exists in the design to minimize risk of injury. Will incorporate scanned human body shape geometry into current 3D human figure boundary manikin models for improved analysis capability to shape technology for NGCV."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 adjustment reflects decrease for civilian labor and associated travel, training and supplies."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}