{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c6d4730c5f45a9998742a765fe5a52840fa01fae9e79d847b7e2f989ef6d2407-23",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_A-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603716D8Z"
        },
        "ProgramElementTitle": {
            "val": "Strategic Environmental Research and Development Program (SERDP)"
        },
        "R1LineNumber": {
            "val": "52"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "292.110"
            },
            "PriorYear": {
                "val": "63.177"
            },
            "CurrentYear": {
                "val": "71.832"
            },
            "BudgetYearOne": {
                "val": "76.514"
            },
            "BudgetYearOneBase": {
                "val": "76.514"
            },
            "BudgetYearTwo": {
                "val": "75.088"
            },
            "BudgetYearThree": {
                "val": "76.791"
            },
            "BudgetYearFour": {
                "val": "78.286"
            },
            "BudgetYearFive": {
                "val": "80.007"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Resilience, and Weapons Systems and Platforms.  SERDP does this by addressing high priority DoD environmental technology requirements.  SERDP enhances military operations, improves military systems` effectiveness, enhances military training\/readiness, sustains DoD’s training and test ranges and installation infrastructure, and helps ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "65.078"
                },
                "CurrentYear": {
                    "val": "71.832"
                },
                "BudgetYearOne": {
                    "val": "77.756"
                },
                "BudgetYearOneBase": {
                    "val": "77.756"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "63.177"
                },
                "CurrentYear": {
                    "val": "71.832"
                },
                "BudgetYearOne": {
                    "val": "76.514"
                },
                "BudgetYearOneBase": {
                    "val": "76.514"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.901"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.242"
                },
                "BudgetYearOneBase": {
                    "val": "-1.242"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "General Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.901"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustment (EA-008)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.630"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.630"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Realignment to O&M (REPI Offset)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.612"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.612"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Economic Adjustment (EA-008) is the comptroller budget decision that reflected OMB directed inflation adjustments.  REPI Offset is an OMB decision that EI&E's REPI program be funded at a higher level."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "470"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Environmental Research and Development Program (SERDP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "292.110"
                        },
                        "PriorYear": {
                            "val": "63.177"
                        },
                        "CurrentYear": {
                            "val": "71.832"
                        },
                        "BudgetYearOne": {
                            "val": "76.514"
                        },
                        "BudgetYearOneBase": {
                            "val": "76.514"
                        },
                        "BudgetYearTwo": {
                            "val": "75.088"
                        },
                        "BudgetYearThree": {
                            "val": "76.791"
                        },
                        "BudgetYearFour": {
                            "val": "78.286"
                        },
                        "BudgetYearFive": {
                            "val": "80.007"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Congress established the Strategic Environmental Research and Development Program (SERDP) in 1990 (10 U.S.C. Section 2901-2904) to address Department of Defense (DoD) and Department of Energy (DOE) environmental concerns.  It is conducted as a DoD program, jointly planned and executed by the DoD, DOE, and the Environmental Protection Agency (EPA), with strong participation by other Federal agencies, industry, and academia.  SERDP`s objective is to improve DoD mission readiness and environmental performance by providing new scientific knowledge and cost-effective technologies in the areas of Environmental Restoration, Munitions Response, Resource Conservation and Resilience, and Weapons Systems and Platforms.  SERDP does this by addressing high-priority DoD environmental technology requirements.  Technologies developed by SERDP enhance military operations, improve military systems’ effectiveness, enhance military training\/readiness, sustain DoD’s training and test ranges and installation infrastructure, and help ensure the safety and welfare of military personnel and their dependents by eliminating or reducing the generation of pollution and use of hazardous materials and by reducing the cost of remedial actions and compliance with environmental laws and regulations.  As a secondary benefit, SERDP helps solve significant national and international environmental problems.  The keys to a growing list of SERDP technological successes are the ability to respond aggressively and proactively to priority defense environmental needs; the pursuit of world-class technical excellence; and an emphasis on constant technology transfer."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental Restoration"
                                    },
                                    "Description": {
                                        "val": "Environmental Restoration (ER) reduces DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.342"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  Specific Statements of Need were released and proposals selected that will address 1) Improved Strategies for Remediating Mixed Contaminants in Groundwater, 2) Development of Standardized Sampling and Analytical Techniques for Munitions Constituents,  and 3) Improved Understanding of the Fate and Effects of Insensitive Munitions Constituents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.070"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  Specific Statements of Need were released that address 1) Improved Understanding of Per- and Polyfluoroalkyl Substance Source Zones, 2) In Situ and Ex Situ Remediation of Per- and Polyfluoroalkyl Substance Contaminated Groundwater, 3) Improved Understanding of Stormwater Impacts and Control on Sediment Recontamination and Recovery, and 4) Innovative Approaches for Monitoring and Implementing In Situ Remediation of Contaminated Aquatic Sediments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.244"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.244"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to reduce DoD’s liabilities by developing technologies for the cost-effective detection, characterization, containment, and remediation of contamination in soil, sediments, and water.  The planned increase will support projects related to the detection, quantification, treatment, and bioavailability of per- and polyfluoroalkyl substances."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased emphasis on PFOS and PFOA contamination on DoD installations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Response (MR)"
                                    },
                                    "Description": {
                                        "val": "Munitions Response (MR) develops detection, classification, and remediation technologies for Unexploded Ordnance (UXO) to address the significant DoD liability in the Military Munitions Response Program.  Investments are also made to improve active range clearance and to reduce generation of UXO during live fire testing and training operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.232"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and protocols to reduce the costs associated with detecting and remediating UXO underwater.  Specific Statements of Need were released and projects selected that address 1) Detection, Classification, and Remediation of Military Munitions Underwater and 2) Preliminary Design Study for Munitions Response Underwater Test Site."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.835"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and protocols to reduce the costs associated with detecting, remediating, or managing UXO underwater. A specific Statement of Need was released that addresses Detection, Classification, and Remediation of Military Munitions Underwater."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.730"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.730"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements in underwater UXO detection and protocols to reduce the costs associated with detecting, remediating, or managing UXO underwater with a focus on low-frequency acoustic imaging as a detection\/classification system.  Several projects will also be initiated aimed at constructing a physics-based model of munitions penetration on land to aid DoD project managers assess the suitability of competing remediation technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Several research projects in underwater acoustics have matured to the point of at-sea data collection.  Funding increase required for these tests."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resource Conservation and Resilience (RC)"
                                    },
                                    "Description": {
                                        "val": "Resource Conservation and Resilience (RC) develops the science and technologies required to sustain training and testing ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "28.350"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges and respond to requirements in the 2014 QDR, including the assessment of climate change impacts to DoD installations.  Specific Statements of Need were released and proposals were selected for funding to address: 1) Phenological Response to a Changing Climate on Department of Defense Lands and Waters: Implications for Management and 2) Long-Term Ecological Studies: Testing Previous Hypotheses and Conclusions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.487"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop the science and technologies required to sustain training and testing ranges.  Specific Statements of Need were released to address 1) Advanced Approaches for Managing Individual Species and Ecosystems Across Jurisdictional Boundaries in a Non-Stationary World and 2) Climate Change Vulnerability Assessment of Major Habitats on and Around DoD lands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "27.193"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "27.193"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on understanding wildfire initiation and spread to construct models to be used by installation natural resource managers in planning their managed fire programs, understanding the role of a changing environment on the management of threatened and endangered species, and resiliency initiatives for installations in the Arctic."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY-18 is the final year for a suite of projects focused to sustainability to sea-level rise.  Reduced funding reflects the end of these projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons Systems and Platforms (WP)"
                                    },
                                    "Description": {
                                        "val": "Weapons Systems and Platforms (WP) develops technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.253"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts.  Specific Statements of Need were released and proposals were selected for funding to address: 1) Fluorine-Free Aqueous Film Forming Foam, 2) No\/Low Global Warming Potential Alternatives to Ozone Depleting Refrigerants, and 3) Surface Morphology Modification by Non-Chemical Methods to Enhance Coating Adhesion and Mechanical Bonding of Metal Surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.440"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on the highest priority DoD requirements to develop technologies and materials that reduce the waste and emissions associated with the manufacturing, maintenance, and use of DoD weapons systems and platforms to reduce future environmental liabilities and their associated costs and impacts.  Specific Statements of Need were released to address: 1) Advancing Emulsion Science for Application in Armed Forces Vessels, 2) Non-Chemical, Non-Media Removal Process for Thick, Elastomeric Specialty Coatings Used on DoD Weapon Systems, 3) Systems Approaches in Propulsion and Explosives Toward Replacing Materials Such as Ammonium Perchlorate (AP), RDX, and TNT, and 4) Development of Agile, Novel Expeditionary Battlefield Manufacturing Processes Using Recycled and Reclaimed Materials."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.347"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.347"
                                            },
                                            "Text": {
                                                "val": "New research initiatives will focus on jet engine noise measurement and control, additive manufacturing for battlefield applications, sustainable pyrotechnics, and corrosion assessment and prediction applied to DoD weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding reflects the planned jet engine noise projects."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance in this program is monitored at two levels.  At the lowest level, each of the more than 160 individual projects is measured against both technical and financial milestones on a quarterly and annual basis.  At a program-wide level, progress is measured against DoD's environmental requirements and the development of technologies that address these requirements as well as the transition of these technologies to either to demonstration and validation programs or to direct use in the field."
                        }
                    }
                }
            ]
        }
    }
}