{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-24",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602787A"
        },
        "ProgramElementTitle": {
            "val": "Medical Technology"
        },
        "R1LineNumber": {
            "val": "29"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "78.341"
            },
            "CurrentYear": {
                "val": "83.434"
            },
            "BudgetYearOne": {
                "val": "90.075"
            },
            "BudgetYearOneBase": {
                "val": "90.075"
            },
            "BudgetYearTwo": {
                "val": "94.708"
            },
            "BudgetYearThree": {
                "val": "93.828"
            },
            "BudgetYearFour": {
                "val": "96.041"
            },
            "BudgetYearFive": {
                "val": "97.431"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "633.858"
            }
        },
        "ProgramElementNote": {
            "val": "Funding for Medical Simulation and Information Sciences in project XV5 begins in FY19"
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports application of knowledge gained through basic research to refine drugs, vaccines, medical devices, diagnostics, medical practices\/ procedures, and other preventive measures essential to the protection and sustainment of Warfighter health. Research is conducted in five principal areas: Combat Casualty Care, Military Operational Medicine, Military Relevant Infectious Diseases, Clinical and Rehabilitative Medicine, Medical Simulation and Information Sciences, and Systems Biology\/Network Sciences.\n\nResearch is funded in six projects.\n\nProject 869 refines knowledge and technologies on screening tools and preventive measures for post-traumatic stress disorder (PTSD) and mild traumatic brain injuries, physiological monitors, and interventions to protect Warfighters from injuries resulting from operational stress, and exposure to hazardous environments and materials. Also conducts research on medically valid testing devices (i.e., the test mannequins that are true to the human form and physiologically and anatomically accurate) and predictive models used for the refinement of Warfighter protective equipment. This project is being coordinated with the Defense Health Agency. \n\nProject 870 designs and refines drugs, vaccines, medical diagnostic assays\/tests devices, other preventive measures for protection and treatment against naturally occurring infectious diseases as identified by worldwide medical surveillance and military threat analysis. This project is being coordinated with the Defense Health Agency.\n\nProject 874 identifies and evaluates drugs, biologics (medical products derived from living organisms), medical devices, and diagnostics for field trauma care systems, resuscitation, and life support, and post-evacuation restorative and rehabilitative care. Focus is identifying more effective critical care technologies and clinical practice guidelines to treat severe bleeding, traumatic brain injury, burns and other combat related traumatic injuries, and treatments for ocular (eye) injury and visual system dysfunction. Additional focus areas are laboratory and animal studies of regenerating skin, muscle, nerves, vascular and bone tissue for the care and treatment of wounded Service Members. This project is being coordinated with the Defense Health Agency. \n\nProject ET4 identifies and evaluates drugs, biologics, medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focus is on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of wounded Service Members. This project is coordinated with the Defense Health Agency.\n\nProject VB4 includes applied research in systems biology to provide a highly effective mechanism to integrate biological tests and computer simulations in clinical trials and in animal studies. The PTSD and coagulopathy exemplars have demonstrated the power of an iterative systems biology approach and are moving projects related to objective diagnostics and improved and personalized therapeutic strategies. Development of the SysBioCube (a data analysis, management and integration system) has provided the ability for complex collaborative efforts to share, process, and evaluate data using innovative technologies. These concerted refinement efforts using systems biology are showing reduction of time and funding for solutions to intractable problems of critical military importance. \n\nProject XV5 conducts applied research on health information technologies that support combat casualty care under conditions of dispersed small-unit operations or requiring prolonged field care before evacuation. Technologies include autonomous casualty care systems and virtual health communications for Roles of Care one (combat medic and battalion aid station) through three (field hospital).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nAll medical applied research is conducted in compliance with Food and Drug Administration (FDA) or Environmental Protection Agency (EPA) regulations. The FDA requires thorough testing in animals (preclinical testing) to ensure safety and, where possible, effectiveness prior to evaluation in controlled human clinical trials (upon transition to 6.3 Advanced Technology Development). This PE focuses on research and refinement of technologies such as product formulation and purification and laboratory test refinement with the aim of identifying candidate solutions. This work often involves testing in animal models. The EPA also requires thorough testing of products, such as sterilants, disinfectants, repellents, and insecticides to ensure the environment is adequately protected before these products are licensed for use.\n\nProgram refinement and execution is externally peer-reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defenses (DoD) biomedical research and refinement community, as well as their associated enabling research areas.\n\nWork funded in this PE is fully coordinated with efforts undertaken in PE 0603002A (Medical Advanced Technology) and the Defense Health Program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "77.111"
                },
                "CurrentYear": {
                    "val": "83.434"
                },
                "BudgetYearOne": {
                    "val": "88.575"
                },
                "BudgetYearOneBase": {
                    "val": "88.575"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "78.341"
                },
                "CurrentYear": {
                    "val": "83.434"
                },
                "BudgetYearOne": {
                    "val": "90.075"
                },
                "BudgetYearOneBase": {
                    "val": "90.075"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "1.23"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "1.5"
                },
                "BudgetYearOneBase": {
                    "val": "1.5"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "2"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.582"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.832"
                                },
                                "BudgetYearOne": {
                                    "val": "1.5"
                                },
                                "BudgetYearOneBase": {
                                    "val": "1.5"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.02"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increase in VB3 Medical Technology Initiatives"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "869"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Health Prot & Perf Stnds"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.586"
                        },
                        "CurrentYear": {
                            "val": "40.201"
                        },
                        "BudgetYearOne": {
                            "val": "35.777"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.777"
                        },
                        "BudgetYearTwo": {
                            "val": "39.136"
                        },
                        "BudgetYearThree": {
                            "val": "41.246"
                        },
                        "BudgetYearFour": {
                            "val": "42.11"
                        },
                        "BudgetYearFive": {
                            "val": "42.803"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "277.859"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Starting in Fiscal Year (FY) 2019 a number of efforts were consolidated into the four main thrust areas."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project conducts research to prevent and protect Warfighters from training and operational injuries, refine mechanisms for detection of physiological (human physical and biochemical function) and psychological (mental) health problems, evaluate hazards to head, neck, spine, eyes, and ears, set the standards for rapid return to duty, and determine new methods to sustain and enhance performance across the operational spectrum. This research provides medical information important to the design and operational use of military systems, and this work forms the basis for behavioral, training, pharmacological (drug actions), and nutritional interventions. \nThe four main areas of study are:\n\n(1)\tEnvironmental Health and Protection\n(2)\tPhysiological Health and Performance\n(3)\tInjury Prevention and Reduction\n(4)\tPsychological Health and Resilience\n\nAdditionally the Warfighter Systems Engineering Architecture task advances medical science and technology (S&T) in the areas of injury prevention and performance sustainment in the context of human interaction with new Soldier systems, and provides greater insight into informing new research in developing Warfighter systems and the interactions between Warfighters and the systems they employ.\nPromising efforts identified in this project are further matured under PE 0603002A, project MM3.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork in this project is performed by the US Army Aeromedical Research Laboratory (USAARL), Fort Rucker, AL; US Army Center for Environmental Health (USACEHR), Ft. Detrick, MD; US Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; US Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; Naval Health Research Center (NHRC), San Diego, CA; and the Biotechnology High Performance Computing Software Institute (BHSAI), Frederick, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological Health - Nutritional Sustainment and Fatigue Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Warfighter operational performance and the impact of nutritional strategies to optimize operational performance. Starting in Fiscal Year (FY)19 this effort moves to Physiological Health."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.569"
                                            },
                                            "Text": {
                                                "val": "Will perform field experiments to establish nutritional parameters that can enhance resistance to stress and augment wound healing. Will evaluate how nutritional interventions can enhance recovery of brain function following caloric deficit. Will determine the effectiveness of a prophylactic (treatment for prevention of disease) nutrient or dietary nutrient cocktail for improving deleterious effects of impact, acceleration, and\/or blast ?induced head injury. Will validate a preliminary descriptive model outlining factors linking the central nervous system and other organs\/ systems that impact resilience, using data from field studies. Will down select candidate physiological biomarkers (indicator of a process, event, condition or change within the body) of resilience based upon objective measures of success during relevant Military scenarios. Will conduct laboratory study to evaluate intra-individual (trait) responsivity under varied sleep loss conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.679"
                                            },
                                            "Text": {
                                                "val": "Conduct one or more field studies to determine the efficacy of energy and\/or protein supplementation for preventing declines in lean body mass and cognition during and after caloric deficit (shortage of calories consumed). From the results of field studies, will continue to develop a descriptive model outlining factors linking the central nervous system and other organs\/systems that impact resilience. Assess the effect of nutritionally optimized snack products for maintaining body composition and nutritional status during and after military training and operations in a field study. Develop interventions promoting resistance to physical, cognitive and environmental stressors. Evaluate the role of nutritional factors in the maintenance of physiological and neurobehavioral health under operationally relevant conditions. Analyze the effects of nutritional interventions on indicators of nutritional status. Demonstrate the effectiveness of nutrient and dietary strategies (e.g., omega-3 polyunsaturated fatty acids, zinc, and hydration) for reducing the vulnerability to and\/or accelerating the recovery from mild TBI."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Physiological Health - Nutritional Sustainment and Fatigue Interventions is reduced due to movement of funding for Nutrition & Weight Balance, Cognitive Health and Resilience, Nutrition to Accelerate Physiological Recovery Physical and Cognitive Readiness STO and Optimizing Mental Acuity STO to Physiological Health and Performance in order to reduce the number of R-Form Research Areas addressing Physiological Health."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Health and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates methods for managing and controlling the effects of fatigue on Soldier operational performance and the impact of nutritional strategies to optimize operational performance. Efforts will also contribute to human health and performance optimization and enhancement."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.649"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.649"
                                            },
                                            "Text": {
                                                "val": "Will develop nutritional interventions for resistance to stress (environmental\/physical\/cognitive) in the field. Will evaluate individual differences of environmental influences on Soldier eating behavior. Will improve the health of muscle and bone through characterization of protein source effects on metabolic kinetics. Will develop a military-specific eating questionnaire for evaluation of nutritional approaches to resist military stress. Will conduct studies to determine the effectiveness of energy and\/or protein supplementation for preventing declines in lean body mass and cognition during and after caloric deficit. Will continue to develop a descriptive model outlining factors linking the central nervous system and other organs\/systems that impact resilience. Will investigate physiological aspects of human health and performance optimization and enhancement."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding for Physiological Health and Performance is available due to 1) movement of funding for Nutrition & Weight Balance, Cognitive Health and Resilience, Optimizing Mental Acuity STO, Nutrition to Accelerate Physiological Recovery Physical and Cognitive Readiness STO and Brain Health and Performance Risk is moved from Physiological Health - Nutritional Sustainment and Fatigue Interventions to Physiological Health and Performance to this task in order to reduce the number of R-Form Research Areas addressing Physiological Health and Performance; 2) increased funding for Nutrition & Weight Balance due to normal progression of the effort.  reduced funding for Cognitive Health and Performance due to realignment of a sub-task to another CMI task and 3) reduced funding for Optimizing Mental Acuity due to normal progression and winding down of the effort as a result of realignment of funds in FY20 and beyond in support of new high priority programs and 4) reduced funding for Nutrition to Accelerate Physiological Recovery Physical and Cognitive Readiness STO due to planned progression of the effort and 5) increased funding for Brain Health & Performance Risk due to realignment of a sub-task from another CMI task and 6) increased funding for Biomedical Performance Enhancement due to normal progression of the effort and the fact that it became a new high priority program in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates methods to detect and treat concussion as well as identify and evaluate the effects of cognitive deficits (decreases in the ability of individuals to acquire knowledge and understanding through thought experience and the senses) and risk factors for spinal injury in Military vehicle occupants during operations. Starting in FY19 this effort moves to Injury Prevention and Reduction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.34"
                                            },
                                            "Text": {
                                                "val": "Will determine incidence and risk factors for spinal injury and evaluate the military vehicle occupant environment. Will develop provisional spinal injury criteria and assessment methods for occupant protection. Will determine the severity and duration of neurobehavioral and neuropathological (behavioral traits and structure of the brain) disruptions resulting from re-exposure to blast and\/or impact-induced head injuries with intervals between insults ranging from 1 to 72 hours and compared to single head insults. Will determine if a traumatic underwater stressor or intermittent electric shock can infer heightened vulnerability to mTBI by comparison of the magnitude and duration of functional impairments resulting from blast mTBI alone using a small animal model."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.302"
                                            },
                                            "Text": {
                                                "val": "Develop models of military vehicle occupant exposures that will be used for predicting cervical spine injury risk. Will collect exposure outcome data from the operational environments to improve provisional spinal injury criteria and assessment methods for occupant protection. Assess the effects of sleep duration, timing, and continuity of Mild Traumatic Brain Injury (mTBI) patients versus controls using actimetry sensors (non-invasive method of monitoring human activity\/rest cycles) with the goal of determining differences in baseline sleep between mTBI patients, non-mTBI controls, and recovered mTBI controls in their home environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions is due to movement of funding for Blunt, Blast, & Accelerative Injury & Protection to Injury Prevention and Reduction in order to reduce the number of R-Form Research Areas addressing Injury Prevention and Reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates the combined impact of extreme temperatures, humidity, and altitude on human health and performance and determines novel mitigation strategies to enhance tolerance, sustain performance, and protect the Warfighter against environmental injury. This effort provides evidence-based practice recommendations, biomarkers of adaptation, and models for protecting health and performance against combinations of environmental threats. Starting in FY19 this effort is combined into Environmental Health and Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.351"
                                            },
                                            "Text": {
                                                "val": "Will determine the combined impact of heat, humidity, and altitude on human health and performance and will research mitigation strategies to enhance tolerance and sustain performance against environmental injury or environmental threats. Will determine the reliability, reproducibility, and validity of a militarily-relevant dexterity assessment instrument during cold-air exposures. Will determine the scientific basis for developing focused heating and cooling solutions for improved peripheral blood circulation to maintain fine motor hand dexterity, core and skin temperatures, and optimize physical and cognitive performance during extreme climate operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.38"
                                            },
                                            "Text": {
                                                "val": "Evaluate the reliability, reproducibility, and validity of a novel militarily-relevant dexterity assessment instrument during cold- air exposures. Develop a low-power microclimate forearm heating prototype to maintain finger blood flow and hand dexterity during cold-air exposures. Determine the areas on the human that, when warmed, cause a physiological reflex response that increases finger blood flow and maintains manual dexterity in a cold environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Environmental Health and Protection - Physiological ( human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments is reduced due to movement of funding for Heat, Cold & Terrestrial Altitude to Environmental Health & Protection in order to reduce the number of R-Form Research Areas addressing Environmental Health & Protection."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection"
                                    },
                                    "Description": {
                                        "val": "This effort involves applied research addressing the physiological (human physical and biochemical functions) mechanisms of exposure to extreme heat, cold, altitude, and other environmental stressors. This effort establishes scientific evidence for specific and sensitive diagnostics of exertional heat illness to optimize Soldier performance in austere environments. This effort also supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold-weather and hot-humid operations. This effort will develop knowledge and materiel solutions that enable Soldier individualized metabolic assessments and optimization during training and operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.757"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.757"
                                            },
                                            "Text": {
                                                "val": "Will determine the combined impact of heat, humidity, and high altitude on human health and performance. Will quantify Heat Tolerance Test specificity to include the effects of heat acclimation on the prediction of heat illness susceptibility and return to duty guidelines. Will quantify how physiological adaptations and acquired thermal tolerance to heat stress protect against acute mountain sickness susceptibility as well as physical and cognitive performance at high altitude. Will develop new technologies that enable quantitative measurements at a point-in-time during training and operational activities. Will increase dexterity performance in cold environments by combining facial and forearm microclimate heating interventions. Will develop computational models of individualized Soldier health, readiness, and physiological performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Environmental Health and Protection increased due to movement of funding from Physiological Awareness Tools and Warrior Sustainment in Extreme Environments: Heat, Cold & Terrestrial Altitude to Environmental Health & Protection in order to reduce the number of R-Form Research Areas addressing Environmental Health and Protection."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomarkers of Exposure and Environmental Biomonitoring (measurement of the body?s response to toxic chemical compounds, elements, or their metabolites, in biological substances)"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement and evaluation of methods to detect exposure to environmental contaminants and toxic chemicals during military operations. This effort develops an integrated experimental and computational platform to characterize host responses to environmental hazards in terms of pathogenic (disease causing) and adaptive processes, yielding mechanistically based drug targets and molecular diagnostics. Starting in FY19 this effort is combined into Environmental Health and Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.249"
                                            },
                                            "Text": {
                                                "val": "Will utilize an integrated experimental and computational platform to evaluate host responses to environmental hazards in terms of pathogenic and adaptive processes. Will evaluate target mechanisms for drug efficacy and molecular diagnostics. Will determine candidate biomarkers of liver and kidney injury caused by military relevant chemicals and other environmental stressors. Will evaluate mathematical models that predict dose and time based host response biomarkers, in serum or urine, to metal and volatile organic compound toxicity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.889"
                                            },
                                            "Text": {
                                                "val": "Utilize an integrated experimental and computational platform to evaluate host responses to exposure (through the mouth, nose and skin) to environmental hazards (including toxic industrial chemicals [TICs] and metals such as chromium) in terms of pathogenic and adaptive processes. Develop several physiological-based dosimetery models of toxicity for TICs and heavy metals with adverse outcome pathways of liver, kidney, cardiac, and\/or neural injury based on published and experimentally- derived data. Model output will guide small unit decision making through the generation of actionable health risk information that can predict the risk of adverse health effects in Warfighters with high sensitivity and specificity. Develop a methodology of evaluating central nervous system toxicity in order to determine sensitive and specific indicators of central nervous system injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Biomarkers of Exposure and Environmental Biomonitoring  is due to: 1) movement of funding for Environmental Toxicant Exposure to Environmental Health and Protection; and 2) elimination of funding for the Environmental Toxicant Exposure STO in order to accelerate new high priority programs within MRMC."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Neurosensory Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This area includes research efforts to develop prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develop and evaluate neurosensory operational risk factors, develop medically based guidelines to assess neurosensory performance and model the effects of acoustic and impact trauma, as stressors on vision and hearing. Starting in FY19 this effort is combined into Injury Prevention and Reduction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.569"
                                            },
                                            "Text": {
                                                "val": "Will continue collecting data from human volunteers on the middle ear's response to impulsive sounds; will begin evaluating the complex interaction between auditory and vestibular protective systems. Will determine threshold blast overpressure and impulse exposure leading to cellular level ocular injury and refine scaling laws to be able to relate experiments conducted in small animal models to exposure conditions in humans."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.752"
                                            },
                                            "Text": {
                                                "val": "Assess the complex interaction between auditory and vestibular protective systems. Validate blast exposure conditions that lead to cellular level ocular injury and continue to refine scaling laws to be able to relate experiments conducted in small animal models to exposure conditions in humans, which will enable the development of computational models that can help predict the effects of the primary blast wave on the eyes and visual system in humans. Analyze potential neuroprotective (preserve nerve function) chemicals against primary blast injuries to the visual system. Evaluate provisional mandible blunt impact injury risk using two models (Facial and Ocular Countermeasures for Safety Headform (FOCUS) and Post Mortem Human Subjects (PMHS) to improve standards requirements for Warfighter protective gear."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Injury Prevention and Reduction - Neurosensory Injury Prevention is due to: 1) elimination of funding for Sensory Performance, Injury & Protection in order to accelerate new priority programs within MRMC; 2) movement of funding for Aircrew Health and Performance to the Injury Prevention and Reduction in order to reduce the number of R-Form Research Areas addressing Injury Prevention and Reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction - Musculoskeletal Injury Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Warfighters following injury. Starting in FY19 this effort is combined into Injury Prevention and Reduction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.594"
                                            },
                                            "Text": {
                                                "val": "Will determine the roles of endocrine (hormones) and intracellular signaling molecules (within the cell) involved in skeletal muscle and bone development, regeneration, and repair utilizing cell based animal and human models for transition to clinical trials. Will develop a mathematical model of ideal bone density and structure that offsets risk of stress fracture. Will evaluate situations that create unnecessary musculoskeletal risk hazards, and make recommendations for improvement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.248"
                                            },
                                            "Text": {
                                                "val": "Consolidate results from animal- and human-based studies to refine the roles of endocrine (i.e., hormonal) and intracellular (i.e., within the cell) signaling molecules that are involved in skeletal muscle and bone development, utilizing animal and human models for transition to clinical trials. Refine a mathematical model of ideal bone density and structure that offsets risk of stress fracture. Utilize the Total Army injury and Health Outcomes Database (TAIHOD) to evaluate situations that create unnecessary musculoskeletal risk-hazards, and provide recommendations for mitigation. Analyze incidence and risk factors during the last 10 years for spinal injury in military personnel. Study the military vehicle occupant environment for the development of vibration health hazard assessment models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduced funding for Injury Prevention and Reduction - Musculoskeletal Injury Prevention is due to movement of funding for Musculoskeletal Injury to Injury Prevention & Reduction in order to reduce the number of R-Form Research Areas addressing Injury Prevention & Reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the Army?s number one priority of readiness by improving musculoskeletal injury prevention efforts as well as contributing to preparing Soldiers for potential threats (e.g., directed energy) in and developing capabilities for the multi domain battle environment; evaluates and assesses the effects of repetitive motion during military operations and training on the human body; provides mathematical models to predict the likelihood of physical injuries following continuous operations and muscle fatigue; evaluates current standards for return-to-duty; and establishes improved medical test methods with the goal of rapid return to duty of Soldiers following injury. This effort also develops prevention based strategies and medically based injury criteria for hearing, vestibular (sensory system supporting movement and sense of balance, located in the inner ear), and ocular\/facial protection devices, develops and evaluates neurosensory operational risk factors, develops medically based guidelines to assess neurosensory performance and models the effects of acoustic and impact trauma, as stressors on vision and hearing. Efforts will investigate the medical aspects of manned\/unmanned teaming (MUM-T) and medical aspects of and protection against directed energy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.258"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.258"
                                            },
                                            "Text": {
                                                "val": "Will develop injury criteria for the prevention of acute and chronic cervical neck injury and pain that will guide the development of helmets and technologies added to the helmet. Will develop mTBI injury thresholds for repetitive blast exposure that can guide the development of head protection. Will refine physical performance thresholds for potential improvements to the Occupational Physical Assessment Test (OPAT) which will improve how well recruits are screened to do DoD relevant physically demanding tasks. Will develop countermeasures to reduce the risk of overuse injury within the training and operational environment. Will identify cognitive and sensory performance metrics associated with optimal manned\/unmanned teaming (MUM-T) and identify physiological and behavioral fitness for duty metrics to operate in MUM-T paradigms. Will develop medical standards and health hazard assessment algorithms for exposure to directed energy threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Injury Prevention and Reduction is available due to: 1) movement of funding from Musculoskeletal Injury, Aircrew Health and Performance and Blunt, Blast, & Accelerative Injury to this task; 2) increased funding for Musculoskeletal Injury due to normal progression of the effort and high priority of the task; 3) eliminated funding for Sensory Performance, Injury & Protection to accelerate new priority programs within MRMC; 4) movement of funding from Aircrew Health & Protection to MM3 funding to support normal progression of task; 5) reduced funding for Blunt, Blast, & Accelerative Injury due to realignment of subtask to another CMI task; 6) increased funding for Medical Aspects of Man-Machine Teaming (MUM-T) due to normal progression of the effort and the fact that it became a new high priority program in FY18; and 7) increased funding for Directed Energy Health Hazard Assessment due to normal progression of the effort and the fact that it became a new high priority program in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health - Psychological Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, post-concussive symptoms, and other health risk behaviors. Also assesses and refines tools and interventions to enhance and sustain psychological resilience throughout the Warfighter's career. Starting in FY19 this effort moves to Psychological Health and Resilience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.403"
                                            },
                                            "Text": {
                                                "val": "Will initiate studies to determine if a diet formulated with a balanced omega-3\/6 fatty acids ratio, glutamine, and antioxidants provides enhanced resiliency against psychological stressors (collaborative effort across task areas). Will compare animal models of PTSD to identify model strengths and weaknesses (biologic changes underlying behavioral response correlation) facilitating optimal matching\/utilization of models to specific research objectives. Will evaluate PTSD diagnostic biomarkers specific to females, will evaluate PTSD disease trajectory (stages\/subtypes) to inform early intervention and treatment selection. Will continue work to evaluate risk and resilience markers for Warfighters including those deploying to non-combat operations. Will document linkages between sleep problems and mission-related mistakes as well as suicide-related thoughts. Will continue to determine the risk and resilience markers for family functioning, specifically, the impact of military community transformation (downsizing and increasing) and deployment on family member health and marital functioning. Will continue to provide resilience training best practices by validating a measure of resilience training utilization and sleep awareness training. Will continue work to deliver a revised Unit Behavioral Health Needs Assessment tool. Will continue to conduct studies to verify whether a computer-based tool can help Warfighters deal with occupational stress and have more positive post-deployment outcomes, to include a reduction in anger symptoms and optimize cognitive flexibility. Will deliver recommendations for implementation of unit-based social fitness training. Will develop measures of leadership behaviors for improving behavioral health, anger and risk-taking in units. Will deliver recommendations for increasing positive attitudes toward behavioral health care. Will provide recommendations for a provider toolkit to assist in return-to-duty decisions. Will continue studies to increase treatment engagement and adherence and determine best model for increasing provider use of evidence-based practices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.467"
                                            },
                                            "Text": {
                                                "val": "Determine if a diet formulated with a balanced omega-3\/6 fatty acids ratio, glutamine, and antioxidants provides enhanced resiliency against psychological stressors in humans. Evaluate the effects of novel compounds active in the glucocorticoid system (steroid hormones that are essential for the utilization of carbohydrate, fat and protein by the body and for the normal response to stress) and the endocannabinoid system (brain receptors that are involved in various physiological processes including appetite, pain sensation, mood and memory) for their ability to mitigate the adverse behavioral effects of traumatic stress and traumatic conditioning processes. Evaluate at least one drug candidate modulating the activity of orexin\/hypocretin (a peptide found in the nervous system that regulates arousal, wakefulness and appetite) for its ability to mitigate the adverse behavioral effects of traumatic stress and traumatic conditioning processes. Continue studies focused upon identification of PTSD subtypes, stage of disease progression, and development of associated biomarkers for use in the identification and development of matched risk-based prevention interventions and development of a precision medicine algorithm approach to PTSD treatment. Determine the influence of sleep history on the efficacy and durability of Attention Bias Modification Training (ABMT), which is a computerized treatment that involves retraining an individual?s interpretation of other?s facial expressions away from predisposed perceptions of hostility, shifting interpretations in the direction of neutrality, to reduce his or her level of anxiety. Conduct a study with Soldiers in an operational unit to determine the predictive validity of trial-by-trial attention bias analytics versus traditional measures. Develop and pilot an evidence-based, self-discipline education program that positively influences Soldier outcomes related to resilience and readiness through the development of adaptive self-control and emotion regulation. Develop and pilot emotion regulation leadership training modules for unit leaders. Develop and pilot an evidence-based, team-level intervention that positively influences Soldier outcomes related to behavioral health, resilience, and unit readiness through the regulation of small-team dynamics (e.g., group-affect). Develop and pilot an individual-to-tool matching paradigm that allows leaders to optimally tailor intervention strategies to precisely meet their personnel and operational health needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Concussion\/Mild Traumatic Brain Injury (mTBI) Interventions is due to movement of funding for Blunt, Blast, & Accelerative Injury & Protection to Injury Prevention and Reduction in order to reduce the number of R-Form Research Areas addressing Injury Prevention and Reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health & Resilience - Suicide Prevention"
                                    },
                                    "Description": {
                                        "val": "This effort supports methods to identify and modify causative and preventive factors in military suicides. Starting in FY19 this effort moves to Psychological Health and Resilience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.389"
                                            },
                                            "Text": {
                                                "val": "Will complete a study examining predictive ability of screening tools. Will continue the effort to deliver guidelines for leaders and complete analyses of study data to begin drafting guidelines on how to best handle suicide events. Will finish data collection and analysis to deliver a short cognitive behavioral intervention to encourage treatment seeking. Will begin work to target key high risk emotional and behavioral transition points to decrease suicide behaviors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.873"
                                            },
                                            "Text": {
                                                "val": "Assess key high risk emotional and behavioral transition points to decrease suicide behaviors. Develop and refine guidelines and tools for leaders, which will include evidence-based recommendations for identifying and addressing difficulties with post-combat adjustment and military community transformation and a revised Unit Behavioral Health Needs Assessment tool with metrics from combat operations, non-combat operations, and garrison. Develop a non-contact screening tool that identifies Service members at-risk for suicidal behaviors. Evaluate a theory-based suicide screen and clinical decision-making tool that identifies at-risk Service members. Conduct studies to develop tools to decrease suicide behaviors during key transition points of Service Members careers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Psychological Health & Resilience - Suicide Prevention is due to movement of funding for Behavioral Health, Wellness & Resilience to Psychological Health and Resilience in order to reduce the number of R-Form Task areas related to Psychological Health & Resilience."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort refines and evaluates early interventions to prevent and reduce combat-related behavioral health problems, including symptoms of post-traumatic stress disorder (PTSD), depression, anger problems, anxiety, substance abuse, suicide, and other health risk behaviors. This effort assesses and refines tools and interventions to enhance and sustain psychological resilience throughout Soldiers? careers. Efforts also address the health and well-being of families."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.113"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.113"
                                            },
                                            "Text": {
                                                "val": "This effort will assess risk and resilience markers (e.g., moral injury) for male and female Soldiers? psychological and behavioral health; determine the optimal dosing of Attention Bias Modification Training, a computerized treatment that reduces anxiety. Will evaluate evidence-based individual (e.g., self-distancing education, emotion regulation leadership training) and team-level (e.g., regulation of small-team dynamics) interventions that positively influence behavioral health, resilience, and unit readiness. Will assess key high-risk emotional and behavioral transition points, develop a non-contact screening tool and other interventions to decrease suicide behaviors. Will adapt and evaluate a diet formulated with a balanced omega-3\/6 fatty acid ratio, glutamine, and antioxidants in an animal model for pilot study in humans in order to provide neuroprotection against military stressors. Will develop molecular pharmacological approaches and novel compounds to mitigate the adverse behavioral effects of traumatic stress. Will continue studies focused upon identification of PTSD subtypes, stage of disease progression, and development of associated biomarkers in order to develop a precision medicine approach to PTSD treatment. Will initiate studies for enhancing behavioral health treatment engagement, improving provider clinical support tools for return-to-duty decisions and  identifying dissemination models for optimal behavioral health provider education."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Psychological Health and Resilience is available due to: 1) movement of funding for Behavioral Health, Wellness & Resilience and Psychiatry & Clinical Psychology Disorders to this task in order to reduce the number of R-Form Research Areas addressing Psychological Health and Resilience; 2) reduced funding for Behavioral Health, Wellness & Resilience due to realignment of a subtask to another CMI task; 2) reduced funding for Psychiatry & Clinical Psychology Disorders is reduced due to realignment of funds to new high priority programs within MRMC."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millennium Cohort Research"
                                    },
                                    "Description": {
                                        "val": "This effort supports a long-term study of Warfighters that includes psychological and physical impacts of military service throughout their lifetime. The Millennium Cohort and Deployment Health Task area employs prospective epidemiological (study of health-event patterns in a society) surveillance research designed to address mental health and comorbid (multiple concurrent) disorders, including neurological and other chronic degenerative disorders, fitness and readiness performance outcomes, and longer-term physical and mental health illnesses and disease over the life cycle of military Service Members."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.134"
                                            },
                                            "Text": {
                                                "val": "Will continue to evaluate the impact of military service on Warfighter and Family physical and psychological health. Specifically, will assess the long-term impact of sexual assault experiences among military men and women. Will assess the long-term health outcomes among individuals with a history of traumatic brain injury. Will examine the Performance Triad components (sleep, diet, and exercise) and association with health outcomes. Will investigate the long-term effects of military service on the risk and prevalence of cardiopulmonary (link between the cardiovascular and respiratory systems) and metabolic diseases (anomalies in the way the body processes food sources to generate energy) and continue work to identify populations with greater likelihood of utilizing Department of Veterans Affairs (VA) health services. Will continue to collect follow-up survey data on participants in the 2017-2018 survey cycle."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.618"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate the impact of military service on Warfighter and Family physical and psychological health. Specifically, will determine factors associated with persistent and long-term mental health and evaluate factors moderating or mediating associations between service-related experiences and mental disorders. Evaluate associations between behavioral health characteristics (e.g. physical activity, alcohol and tobacco use, and sleep hygiene) and short- and long-term outcomes among Service members and Veterans. Establish a program to investigate chronic disease risk among Service members and Veterans. Develop a program area focusing on environmental exposures experienced during deployments. Evaluate the representativeness and generalizability of the Millennium Cohort Family Study and initiate a study examining the impact of family relations on the Service member spouse. Develop a program area focusing on physical injury (traumatic and chronic) experienced during military service and mental health resilience, and establish agreements for access to objective data sources. Initiate processing of completed 2017-2018 paper surveys.."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding for Millennium Cohort Research was eliminated in FY19 to fund higher priority research in Medical Aspects of Man-Machine Teaming, Directed Energy Health Hazard Assessments, and Biomedical Performance Enhancement."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Systems Engineering Architecture"
                                    },
                                    "Description": {
                                        "val": "This effort will advance medical science in the areas of injury prevention to optimize and sustain performance. This effort develops bio- mathematical models and networked physiological sensor systems that accurately predict metabolic cost, thermal strain and other negative health impacts to the Warfighter during physical challenges, i.e., during load carriage or operating in extreme environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.988"
                                            },
                                            "Text": {
                                                "val": "Will develop bio-mathematical models and networked physiological sensor systems that accurately predict human metabolism rates, thermal strain and negative health impacts of Warfighters during physical challenges i.e. complex operational scenarios in extreme environments. These medical research tools will help prevent injuries and optimize physiological and cognitive performance of the Warfighter integrated with the new Warfighter systems. Will inform new research across the research and development community (medical and non-medical) in development of optimized systems and the interactions between the Warfighter and the systems they employ. Will leverage research in Physiological Health, Injury Prevention and Reduction, both musculoskeletal and neurosensory, Psychological Health and Resilience and Environmental Health and Protection to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.993"
                                            },
                                            "Text": {
                                                "val": "Evaluate newly developed bio-mathematical models, algorithms, and networked physiological sensor systems that accurately predict human metabolism rates, thermal strain and negative health impacts of Warfighters during physical challenges (i.e., complex operational scenarios in extreme environments). Computationally-intelligent network-capable sensors will have the ability to monitor and predict individual Warfighter physiological status (thermal, hydration, sleep status) in response to environmental conditions. Inform new research across the research and development community in the development of optimized systems and the interactions between Warfighters and the systems they employ. Leverage research in the Military Operational Medicine portfolio areas of Physiological Health and Protection, Injury Prevention and Reduction (both musculoskeletal and neurosensory), Psychological Health and Resilience and Environmental Health and Protection to inform the Warfighter Systems Engineering Architecture initiative."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Soldier Systems Engineering Architecture is due to: 1) movement of funding for Warfighter Physical Performance to Environmental Health & Protection in order to reduce the number of R-Form Research Areas addressing Environmental Health & Protection."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "870"
                    },
                    "ProjectTitle": {
                        "val": "Dod Med Def Ag Inf Dis"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.841"
                        },
                        "CurrentYear": {
                            "val": "22.234"
                        },
                        "BudgetYearOne": {
                            "val": "21.651"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.651"
                        },
                        "BudgetYearTwo": {
                            "val": "22.081"
                        },
                        "BudgetYearThree": {
                            "val": "19.405"
                        },
                        "BudgetYearFour": {
                            "val": "19.813"
                        },
                        "BudgetYearFive": {
                            "val": "20.209"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "146.234"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Diagnostics Systems funding ends in FY18 and the remaining FY19 funds are for Vector Identification and Control."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research for medical countermeasures to naturally occurring infectious diseases that pose a significant threat to the operational effectiveness of forces deployed outside the United States. Effective preventive countermeasures (protective\/therapeutic drugs and vaccines and insect repellents and traps) protect the Force from disease and sustain operations by avoiding the need for evacuations from the theater of operations. Diseases of military importance are malaria, bacterial diarrhea, and viral diseases (e.g., dengue fever and hantavirus). In addition to countermeasures, this project funds refinement of improved diagnostic tools to facilitate early identification of infectious disease threats in an operational environment, informing Commanders of the need to institute preventive actions and improve medical care. Major goals are to integrate genomics (deoxyribonucleic acid (DNA)-based) and proteomics (protein-based) as well as other new biotechnologies into the refinement of new concepts for new vaccine, drug, and diagnostics candidates.\n\nResearch conducted in this project focuses on the following four areas:\n\n(1) Prevention\/Treatment of Parasitic (organisms living in or on another organisms) Diseases\n(2) Bacterial Disease Threats (diseases caused by bacteria)\n(3) Viral Disease Threats (diseases caused by viruses)\n(4) Diagnostic Systems and Vector Identification and Control\n \nFor the refinement of drugs and biological products, studies in the laboratory and in animal models provide a proof-of-concept for these candidate products, including safety, toxicity (degree to which a substance can damage an organism), and effectiveness, and are necessary to provide evidence to the Food and Drug Administration (FDA) to justify approval for a product to enter into future human subject testing. Additional non-clinical studies are often needed in applied research even after candidate products enter into human testing during advanced technology development, usually at the direction of the FDA, to assess potential safety issues. Drug and vaccine refinement bears high technical risk. Of those candidates identified as promising in initial screens, the vast majority are eliminated after additional safety, toxicity, and\/or effectiveness testing. Similarly, vaccine candidates have a high failure rate, because animal testing may not be a good predictor of human response, and therefore candidate technologies\/products are often eliminated after going into human trials. Because of this high failure rate, a continuing effort to identify other potential candidates to sustain a working pipeline of countermeasures is critical for replacing those products that fail in testing.  \n\nWork is managed by the United States Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.   \n\nPromising medical countermeasures identified in this project are further matured under PE 0603002A, Project 810.\n \nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.   \n \nWork in this Project is performed by the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD, and its overseas laboratories; the United States (U.S.) Army Medical Research Institute of Infectious Disease (USAMRIID), Fort Detrick, MD; and the NMRC, Silver Spring, MD, and its overseas laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort assesses and improves on candidate drugs coming from the Department of Defense (DoD) discovery program and from other collaborations for prevention and treatment of malaria; to counter the continuing spread of drug resistance to current drugs; assesses currently available drugs for use against cutaneous leishmaniasis (a skin-based disease transmitted by sand flies) in animal models; and select the most effective and safe candidates for continued refinement and possible clinical testing. This effort also conducts studies to investigate new candidate vaccines for preventing malaria and selects the best candidate(s) for continued refinement. A highly effective vaccine would reduce or eliminate the use of anti-malarial drugs and would minimize the progression and impact of drug resistance to current\/future drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.122"
                                            },
                                            "Text": {
                                                "val": "Will use small animals to further analyze performance of a single lead candidate malaria prophylaxis (measures taken to prevent health problems) drug based on the Triazine (six-sided ring molecule composed of three carbon and three nitrogen atoms) class of compounds from initial three candidates recently evaluated in clinical trials. This initial testing will allow picking one candidate to advance, and then optimize this lead for human use. Will conduct safety testing in validated animal models in order to test reformulated and down selected compound to human trials. Will also begin studies in small animals to assess P. vivax formulated vaccine candidate for human use. Will assess formulation of new protein candidate antigens in collaboration with Glaxo SmithKline RTS,S (also known as Mosquirix (TM)) malarial vaccine platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.902"
                                            },
                                            "Text": {
                                                "val": "Continue studies in validated animal models to test reformulated chemical compounds for safety and efficacy against malarias.  Continue assessment of pyramidinlyguanidine compounds (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) for the treatment of malaria. Continue assessment of primaquine-like compounds (Primaquine is an FDA-licensed drug capable of preventing relapsing malaria) for use in treatment of relapsing malarias in the monkey model. Complete safety testing in validated animal models in order to test reformulated and down-selected vaccines against falciparum malaria (the most lethal of four types of malaria species). Continue to evaluate new vaccine candidates against vivax malaria (the most common of four types of malaria species) in small animals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.086"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.086"
                                            },
                                            "Text": {
                                                "val": "Will complete studies in validated animal models to test reformulated triazine lead compound for safety and the dissemination in blood and tissues. These studies are required by FDA to enable oral dosing studies in humans. Will complete testing of pyrimidinylguanidine (a newly discovered family of similar chemical compounds that are active against malaria parasites in experimental animals) and primaquine-like compounds in primate malarias to enable initial human testing. Will complete laboratory based analyses of human immune cells from Plasmodium falciparum malaria vaccine trials to enable down selection of a lead vaccine for transition to advanced development. Will conduct initial effectiveness trials of potential lead vaccine formulations in primate models of a relapsing malaria, Plasmodium vivax."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostic Systems and Vector Identification and Control"
                                    },
                                    "Description": {
                                        "val": "This effort designs and prototypes new medical diagnostic and surveillance tools for the field, focusing on bedside and field-deployable diagnostic systems and refines interventions that protect Warfighters from biting insects such as sand flies (transmitters of leishmaniasis) and mosquitoes (transmitters of dengue, Japanese encephalitis, malaria, etc.). Note: Diagnostics Systems funding will end in Fiscal Year (FY) 2018."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.358"
                                            },
                                            "Text": {
                                                "val": "Will develop multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) that are cost effective, sustainable and usable to screen for priority emerging or re-emerging pathogens. These must support broad, routine surveillance programs or be focused on targeted, outbreak investigations to confirm specific pathogens. Will conduct product screening on new or existing Rapid Human Diagnostic Devices (RHDDs) that are FDA-cleared devices or devices intended to be FDA approved for the rapid (2 hours or less) diagnosis of military-relevant infectious diseases. These will be usable at Battalion Aid Station. Will develop new generation of vector repellant and control methods. Will develop spatial repellent efficacy testing protocols and systems that enable testing and development of best candidates for military use. Will develop bite-protection\/resistance testing capability for fabrics treated with repellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.438"
                                            },
                                            "Text": {
                                                "val": "Develop new vector repellant and control methods. Confirm spatial repellent efficacy testing protocols and systems that enable testing and development of best candidates for military use. Advance the capability for fabrics treated with repellants to protect or resist against biting insects and other arthropod vectors. Develop the multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) that are cost effective, sustainable and usable to screen for priority emerging or re-emerging pathogens."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.524"
                                            },
                                            "Text": {
                                                "val": "Will further develop and evaluate the capability for fabrics treated with repellants to protect or resist against biting insects and other arthropod vectors. Will continue to evaluate multiplexed pathogen detection systems (capable of detecting multiple pathogens at the same time) to screen for priority emerging or re-emerging pathogens."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A change in the priority of the effort.  The civilian market is driving much of the innovation in this area of diagnostic research.  As such, it is cost effective to let the market develop diagnostic platforms and the DoD develop the military relevant test menu of assays.  This approach was successful with the BioFire FilmArray (Next Generation Diagnostic System).  While a dedicated diagnostic capability will be eliminated within the Military Infectious Diseases Research Program, many of the existing task areas have the knowledge and proficiency to develop diagnostic assays."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Threats Research"
                                    },
                                    "Description": {
                                        "val": "This effort designs and laboratory tests new vaccine candidates against hemorrhagic fever viruses, i.e. Dengue Virus, Hantaviruses Lassa fever Virus and Crimean-Congo hemorrhagic fever virus, and assesses other non-vaccine technologies to protect against hemorrhagic fever viruses. Efforts also include establishing and maintaining of clinical trial sites worldwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.685"
                                            },
                                            "Text": {
                                                "val": "Will assess host immune responses against dengue virus antigens among experimental vaccine recipients. Will expand vaccine test site infrastructure in selected communities at risk for dengue virus exposure. Will improve methods for identification and characterization of protective antibodies. Will assess immune vaccinated or un-vaccinated and exposure risk factors among human population groups in areas where dengue exposure is historically prevalent. Will assess alternative vaccine (e.g. DNA) delivery strategies such as muscle and skin electroporation (introduction of a substance into skin and muscle by electric current), needle-free jet injection for Hantavirus vaccine. Upon success with the DNA vaccine approach, will further develop additional DNA vaccines and combination vaccines against viruses-of-interest, e.g. Crimean Congo Hemorrhagic Fever) Will continue investigation of DNA vaccines to produce antibody products that could be used as post-exposure prophylactics (given after a subject is exposed to the disease pathogen to prevent further disease progression)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.319"
                                            },
                                            "Text": {
                                                "val": "Expand vaccine test site infrastructure in selected communities at risk for dengue virus exposure and support research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Continue to assess new vaccine formulations for safety and immunogenicity. Further develop additional DNA vaccines and combination vaccines against viruses of interest, e.g. Crimean Congo Hemorrhagic Fever. Explore multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-hantavirus vaccine, Rift Valley Fever, Crimean Congo Hemorrhagic Fever vaccine. Develop an animal model of disease to test drugs and vaccines for protection against Hantavirus."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.852"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.852"
                                            },
                                            "Text": {
                                                "val": "Will sustain field sites as part of ongoing research partner efforts in testing dengue vaccine immunogenicity (ability to provoke an immune response) and effectiveness. Will conduct immune cell and antibody assessments in human subjects exposed to dengue by dengue human infection model. Will conduct immune cell and antibody assessments in human subjects immunized with purified inactivated virus and live attenuated virus vaccines. Will explore multi-agent (combination of two or more molecules capable of inducing an immune response) vaccine concepts e.g., pan-hantavirus vaccine, Rift Valley Fever, Crimean Congo Hemorrhagic Fever vaccine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to economic adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Threats"
                                    },
                                    "Description": {
                                        "val": "This effort conducts studies to refine bacterial countermeasures, including vaccine candidates, to prevent diarrhea (most commonly caused by enterotoxigenic E. coli, Campylobacter and Shigella), wound infection and scrub typhus (a debilitating mite-borne disease)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.676"
                                            },
                                            "Text": {
                                                "val": "Will continue to refine and evaluate additional vaccine candidates against Shigella and enterotoxigenic E. coli organisms. Will continue to test these additional diarrheal vaccine candidates in small animals for the assessment of their safety and effectiveness. Will continue to identify and prepare new clinical field sites for evaluation of candidate vaccines. Will continue to maintain core capabilities in scrub typhus research."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.575"
                                            },
                                            "Text": {
                                                "val": "Continue with the development of additional vaccine candidates against Shigella, Campylobacter and enterotoxigenic E.coli. Down-select vaccine candidates for further testing in animal models of diarrhea caused by Shigella, Campylobacter and enterotoxigenic E.coli. Continue to test the feasibility of clinical field sites for evaluation of vaccine candidates. Conduct studies on mechanisms of immune response to scrub typhus infection. Maintain an animal model for scrub typhus and will characterize host-pathogen interactions in animal models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.189"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.189"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and advance additional vaccine candidates against Shigella, Campylobacter and enterotoxigenic E. coli (ETEC). Will continue to down select vaccine candidates for testing in animal models of diarrhea caused by Shigella, Campylobacter and ETEC. Will perform an assessment of multivalent (different types) vaccine candidates for Shigella and ETEC in animal models of diarrhea. Will produce vaccine candidates for testing in humans using Good Manufacturing Processes. Will continue to evaluate the feasibility of clinical field sites for the assessment of vaccine candidates in humans. Will continue to maintain the animal model for scrub typhus infection and will continue studies on characterization of host-pathogen interactions in these animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to economic adjustment."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "874"
                    },
                    "ProjectTitle": {
                        "val": "Cbt Casualty Care Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.849"
                        },
                        "CurrentYear": {
                            "val": "11.127"
                        },
                        "BudgetYearOne": {
                            "val": "12.781"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.781"
                        },
                        "BudgetYearTwo": {
                            "val": "14.944"
                        },
                        "BudgetYearThree": {
                            "val": "15.063"
                        },
                        "BudgetYearFour": {
                            "val": "15.431"
                        },
                        "BudgetYearFive": {
                            "val": "15.615"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "94.810"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project refines and assesses concepts, techniques, and materiel that improve survivability and ensure improved treatment outcomes for Warfighters wounded during combat operations, as well as treatment under austere field conditions. Combat casualty care research addresses control of severe bleeding, resuscitation and stabilization, predictive indicators and decision support technologies for life support systems, treatment of burns, and traumatic injuries to hard and soft tissues of the face, mouth, and extremities and traumatic brain injury (TBI). \nThis project is coordinated with the Military Departments and other government organizations to avoid duplication.\nResearch conducted in this project focuses on Combat Casualty Care Research in the following four areas:\n\n(1)\tDamage Control Resuscitation\n(2)\tCombat Trauma Therapies\n(3)\tCombat Critical Care Engineering\n (4)\tTraumatic Brain Injury\n\nAll drugs, biological products, and medical devices are refined in accordance with US Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\nPromising efforts identified in this project are further matured under Program Element (PE) 0603002A, Project 840.\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork on this project is performed by US Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX, and the Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort develops and refines knowledge products (such as clinical practice guidelines, manuals, protocols, studies, and media), materials, and systems for control of internal bleeding; minimizing the effects of traumatic blood loss; preserving, storing, and transporting blood and blood products; and resuscitation following trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.026"
                                            },
                                            "Text": {
                                                "val": "As a follow on to the FY16 work, will continue to evaluate consequences of long-term application of hemorrhage control products and devices. Will evaluate novel products and approaches to treat bleeding from chest, abdominal, arm pit, and groin wounds and large, soft tissue wounds. Will assess drugs and key molecular components of blood required to optimize initial pre-hospital low volume hemostatic (acting to arrest bleeding) damage control resuscitation and tissue stabilization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.234"
                                            },
                                            "Text": {
                                                "val": "Conduct studies to optimize performance metrics and assays of stem cells for treatment of trauma- or infection- induced impairment of blood clotting ability.  Develop sensor technology for early assessment of blood clot strength.  Evaluate novel products and approaches, including aortic balloon occlusion, automatically operated tourniquets, and new wound packing materials, to treat bleeding from chest, abdomen, arm pit and groin wounds and large, soft tissue wounds. Work to investigate drugs and key molecular components of blood required to optimize low volume resuscitation adjuncts to control bleeding and stabilize tissues in the pre-hospital phase of care."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.822"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.822"
                                            },
                                            "Text": {
                                                "val": "Will begin study of new techniques to control bleeding using catheters or other devices that are introduced into damaged blood vessels. Will conduct studies of new hemostatic (stops bleeding) dressings to determine if they may be safely left in place on wounds to control bleeding for extended periods of time. Will start a new research focus area on endovascular (refers to device that is directly introduced into a major blood vessel) hemorrhage control and resuscitation. Will continue studies to optimize performance metrics and assays of stem cells for treatment of trauma- or infection-induced impairment of blood clotting ability. Will continue development of new technologies for early assessment of blood clot strength. Will continue work to investigate drugs and blood products to optimize treatment of impaired blood clotting and destabilized tissues due to traumatic bleeding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This research area was expanded to include new research on endovascular hemorrhage control technologies.  This new applied research work was originally planned to begin in Fiscal Year (FY) 2019; however, funds became available in FY18 to accelerate the effort.  Project 874 funding for the Battlefield Platelets STO ended in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort conducts research to enhance the ability to diagnose, stabilize, and accelerate wound healing and repair of damaged tissue for casualties with severe wounds to the face, mouth and extremities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.539"
                                            },
                                            "Text": {
                                                "val": "Will develop and test combined agents (a bacteria-killing protein in combination with a chemical that disperses bacterial colonies) to treat contaminated facial, mouth, and extremity wounds using a quantifiable small animal model of acutely (sudden onset) inflamed wounds. Will perform studies of human, naturally occurring anti-inflammatory agents to treat uncontrolled inflammation harmful to wound healing and skin graft success after burn injury of the face and mouth area."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.374"
                                            },
                                            "Text": {
                                                "val": "Develop preclinical wound model to examine effect of various resuscitation strategies (e.g., fluids, timing, volume) on healing of injured muscle and bone.  Continue work from FY17 to develop and test combined agents (containing agents to kill bacteria, prevent bacteria from becoming infective, and to control inflammation) to treat contaminated facial, mouth and extremity wounds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.567"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.567"
                                            },
                                            "Text": {
                                                "val": "Will conduct animal studies to assess adverse effects of inflammation factors released in response to blast injury. Will examine potential treatments to mitigate adverse effects of hemorrhage resuscitation on severe extremity wounds. Will evaluate stem cell therapy and drugs to promote healing in severe extremity injuries. Will continue development and testing of combined agents (containing agents to kill bacteria, prevent bacteria from becoming infective, and to control inflammation) to treat contaminated facial, mouth and extremity wounds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned decrease in Project 874 funding for Combat Trauma Therapies research area as elements of the work mature towards Project 840 funding for advanced technology development and clinical evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort refines diagnostic and therapeutic medical devices as well as associated algorithms, software, and data-processing systems for resuscitation, stabilization, life support, surgical support and preservation of vital organ function that can be applied across the pre-hospital, operational field setting, and initial definitive care facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.371"
                                            },
                                            "Text": {
                                                "val": "Will evaluate an algorithm for prediction of need for life saving interventions in an animal model of burn injury. Will develop a severe injury animal model to evaluate closed loop and automated resuscitation systems (medical devices that automatically provide treatment to the patient based on physiological changes without direct input from care provider). Will model the physiology of extracorporeal life support devices (devices that oxygenate and purify the blood outside of the body) in conjunction with different modes of mechanical ventilation. Will evaluate technologies to reduce preventable deaths from difficult airway management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.476"
                                            },
                                            "Text": {
                                                "val": "Study means to mitigate risk of blood clot formation within the tubing of external life support devices (devices that oxygenate and purify the blood outside of the body) while at the same time allows normal blood clotting to occur in the patient.  Continue work from FY17 to validate treatment algorithms in animal burn injury model.  Continue work from FY17 to validate technologies to reduce preventable deaths due to difficult airway management."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.628"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.628"
                                            },
                                            "Text": {
                                                "val": "Will conduct animal studies to determine whether currently used pain-relieving drugs produce detrimental cardiovascular effects during hemorrhage resuscitation.  Will study use of different stem cell products in animal models of lung injury. Will develop a small animal model of acute kidney injury caused by cessation of kidney blood flow due to severe, prolonged blood loss in which to assess new agents that protect the blood-deprived kidney. Will determine the whole-body effects of tourniquet release after prolonged use. Will design an automated, closed-loop burn and trauma resuscitation system that continuously monitors the patient's condition and automatically executes, without human intervention, an immediate and appropriate therapeutic response whenever the patient's condition deviates from normal. Will examine the ability of different critical care treatment algorithms to accurately detect and diagnose changes in patient condition and elicit an appropriate therapeutic response. Will develop and evaluate new technologies that will enable combat medics to provide basic critical care in out-of-hospital settings when medical evacuation is either delayed or prolonged. Will continue work to mitigate risk of blood clot formation within the tubing of external life support devices (devices that oxygenate and purify the blood outside of the body) while at the same time allow normal blood clotting to occur in the patient. Will continue work to assess physiological responses to airway compromise and to test new airway management techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned increase in Project 874 funding for Combat Critical Care Engineering research area as elements of the work mature towards Project 840 funding for advanced technology development and clinical evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury"
                                    },
                                    "Description": {
                                        "val": "This effort supports refinement of drug (includes mature drug technologies; Food and Drug Administration [FDA] approved for other indications) and therapeutic (i.e. novel use of stem cells or selective brain cooling) strategies to manage traumatic brain injury (TBI) resulting from battlefield trauma."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.913"
                                            },
                                            "Text": {
                                                "val": "Will examine the correlation of neuroplasticity (ability of the nervous system to adapt to injury) markers to changes in neural cell connections and growth during recovery from TBI. Will conduct studies to determine key molecular targets for neural cell protection and brain tissue regeneration following brain injury."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.043"
                                            },
                                            "Text": {
                                                "val": "Use data from neuroplasticity (ability of the nervous system to adapt to injury) marker studies to refine current animal models of military relevant brain injury to support studies of TBI treatments that work by affecting the injured brain?s ability to use energy and repair itself.  Refine animal models of acute, severe TBI in combination with severe bleeding and lung and other vital organ injuries for evaluation of neurotherapeutic (therapies to protect brain tissue from further damage following a TBI event) resuscitation strategies for treatment of TBI and hemorrhagic (bleeding) shock."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.361"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.361"
                                            },
                                            "Text": {
                                                "val": "Will evaluate mild TBI treatment strategies using animal models. Will evaluate potential stem cell therapies in a severe TBI animal model. Will complete development of large animal models of TBI and TBI-polytrauma (TBI in combination with severe bleeding and lung and other vital organ injuries). Will perform studies to determine which biomarkers effectively indicate whether a particular therapy works and recovery is occurring."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is a planned decrease in Project 874 funding for Traumatic Brain Injury research as elements of the work mature towards Project 840 funding for clinical evaluation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prolonged Field Care"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research to study the physiological implications of delayed medical evacuation and limited access to definitive surgical care in severely injured casualties"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.403"
                                            },
                                            "Text": {
                                                "val": "This is a new effort originally planned to begin in FY19; however, funds became available in FY18 to accelerate the work."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This is a new start for FY19. There is a planned reduction in Project 874 funding for this area in FY19 as supportive Project S14 funded efforts begin (Project S14 funding for this new area does not begin until FY19).  The Project S14 funded research will be necessary to support further advancement in the Project 874 funded research in this new research area."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET4"
                    },
                    "ProjectTitle": {
                        "val": "Appl Resch in Clinical and Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.993"
                        },
                        "CurrentYear": {
                            "val": "7.871"
                        },
                        "BudgetYearOne": {
                            "val": "12.138"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.138"
                        },
                        "BudgetYearTwo": {
                            "val": "7.133"
                        },
                        "BudgetYearThree": {
                            "val": "6.392"
                        },
                        "BudgetYearFour": {
                            "val": "6.402"
                        },
                        "BudgetYearFive": {
                            "val": "6.241"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "53.170"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Battlefield Pain Management effort begins in FY19."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project identifies and evaluates drugs, biologics (products derived from living organisms), medical devices, treatments and diagnostics for post-evacuation restorative, regenerative and rehabilitative care, as well as systems for use by field medics and surgeons for ocular trauma. Research focus is on identifying more effective technologies and protocols to treat ocular injury and visual system dysfunction, as well as laboratory and animal studies for regenerating skin, muscle, nerves, vascular and bone tissues for the care and treatment of traumatic injury. This Project is being coordinated with the Defense Health Program. Research involves extensive collaboration with multiple academic institutions to refine treatments for combat wounds through Armed Forces Institute of Regenerative Medicine (AFIRM). This Project is coordinated with the Military Departments and other government organizations to avoid duplication. Research conducted in this Project focuses on Clinical and Rehabilitative Medicine.\n\nAll drugs, biological products, and medical devices are refined in accordance with Food and Drug Administration (FDA) regulations, which govern testing in animals to assess safety, toxicity, and effectiveness and subsequent human subject clinical trials.\n\nPromising efforts identified in this project are further matured under Program Element (PE) 0603002A, Project ET5.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork on this Project is performed by United States Army Institute of Surgical Research (USAISR), Joint Base San Antonio, TX; and the AFIRM, at Multiple Institutions across the United States."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort conducts laboratory and animal studies for the purpose of regenerating and restoring traumatically-injured tissues, including skin, muscle, nerve, bone tissue, and the ocular system. This research moved from Project 874 to Project ET4 starting in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.993"
                                            },
                                            "Text": {
                                                "val": "Will conduct pre-clinical screening, down-selection and further development of drug delivery, diagnostics, tissue repair, and treatment strategies including drugs and stem cell therapies for eye trauma. Will advance therapeutic and treatment strategies for eye injuries to safety and efficacy preclinical trials. Will further evaluate promising candidate strategies for burn injury, bone and soft tissue repair, and therapies that address injury to the extremities, face, genital and abdominal body regions. Will evaluate advanced cell-based therapies (e.g. stem cells) that repair or restore skin, testicular, muscle, and bone tissues in animal models. Will further develop novel immunomodulation (modification of the immune response \/ immune system functioning) technologies and strategies to improve outcomes in hand and face transplant procedures. Will further develop improved vascular technologies that reduce the requirement for vein harvest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.871"
                                            },
                                            "Text": {
                                                "val": "Optimize preclinical design of a novel ocular medical device designed to deliver therapeutics, protect, and preserve vision post-injury.  Establish the effects of treatment of  up to three promising pharmaceuticals designed to restore vision in the scarred eye after injury for down selection.  Conduct pre-clinical safety and efficacy testing of an eye bandage with therapeutics to optimize vision restoration post-injury.  Evaluate methods for enhancing skin substitute performance for improvement of skin function following burns and loss from trauma.  Examine pharmacologic (drug) treatments to prevent scarring from deep partial-thickness burns.  Establish effectiveness of treatment methodologies for large volume muscle loss to restore muscle form and function.  Develop devices and biologics for regeneration or restoration of genitourinary (genital and urinary) tissues lost or damaged due to traumatic injury."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.439"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.439"
                                            },
                                            "Text": {
                                                "val": "Will continue to optimize the preclinical design of a novel ocular medical device designed to deliver therapeutics, protect, and preserve vision post-injury. Will advance evaluations of stem-cell based therapies to regenerate damaged eye tissues into pre-clinical animal testing. Will utilize intra-eye large animal drug delivery system to deliver and evaluate effectiveness of nerve therapeutics to preserve and regenerate injured optic nerves. Will continue to conduct pre-clinical safety and effectiveness testing of an eye bandage with therapeutics to optimize vision restoration post-injury. Will continue to develop and evaluate methods for enhancing skin substitute performance for improvement of skin function following burns and loss from trauma. Will continue the examination of pharmacologic (drug) treatments to prevent scarring from deep partial-thickness burns. Will examine the effectiveness of treatment methodologies for large volume muscle loss to restore muscle form and function. Will continue to develop devices and biologics for regeneration or restoration of genitourinary (genital and urinary) tissues lost or damaged due to traumatic injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Adjustment due to inflation for Regen and Sensory. New Task Area created for Battlefield Pain Management to accelerate research of several potential novel drugs for elimination of acute and battlefield pain."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Battlefield Pain Management"
                                    },
                                    "Description": {
                                        "val": "This effort performs applied research in laboratory and animal studies to develop novel, non-opioid drugs to treat pain in the austere battlefield environment with minimal side effects."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.699"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.699"
                                            },
                                            "Text": {
                                                "val": "Will conduct animal studies to investigate the role of ion channel receptors and pain signaling; will develop peripheral nerve or antagonist analgesics to preserve the fighting force and maximize pain relief from combat wounds in austere and prolonged care environments while minimizing adverse side effects such as tolerance, dependence and chronification (occasional\/intermittent pain that progresses to a chronic state) of acute pain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Accelerate research of several potential novel drugs for elimination of acute and battlefield pain."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB3"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Medical Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Military operational medical research program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VB4"
                    },
                    "ProjectTitle": {
                        "val": "System  Biology And Network Science Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.072"
                        },
                        "CurrentYear": {
                            "val": "2.001"
                        },
                        "BudgetYearOne": {
                            "val": "2.008"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.008"
                        },
                        "BudgetYearTwo": {
                            "val": "2.05"
                        },
                        "BudgetYearThree": {
                            "val": "2.099"
                        },
                        "BudgetYearFour": {
                            "val": "2.143"
                        },
                        "BudgetYearFive": {
                            "val": "2.187"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.560"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports biological and clinical applied research using the data analysis and integration grid (SysBioCube) as an overarching means of complex data usage to solve critical health problems. The primary capability of systems biology (field of study that focuses on complex interactions within biological systems, using a holistic approach) is the integration and analysis of complex human and animal study data and development of computational disease models, using global multi-omic methods to identify and discriminate unique combinations of biological molecules corresponding to clinical conditions (physiologic, immunologic, endocrine, etc.), supporting transition of research to clinical applications. This capability applies a systematic integrated approach to trace progression of illnesses and diseases and has already shown that the approach significantly reduces time, funds and effort invested in medical product development and refinement as seen in biomarker development for Post-Traumatic Stress Disorder (PTSD) and enhanced analyses of coagulopathy. Another application of systems biology is to characterize physiological pathways altered by toxic substances enabling identification of the causative toxic substances as well as to understand the injury mechanisms. The detection\/identification of physiological markers of exposure to toxic substances can then be used to support medical countermeasure decisions or development of targeted therapeutic drugs.\n\nThese examples of more complex, yet integrated approaches to Projects studying biological systems (PTSD) Project have been shown to reduce both the time and expense of medical product development for the Army.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork in this Project is performed by the United States Army Medical Research and Materiel Command (USAMRMC), Fort Detrick, MD \/ United States Army Center for Environmental Health Research (USACEHR)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Biology"
                                    },
                                    "Description": {
                                        "val": "The core capability for multidisciplinary applied research in systems biology enables integration and analysis of complex data from human and animal studies and development of computational network models, allowing researchers to differentiate among molecular signatures (unique combinations of biological molecules corresponding to clinical conditions) of disease, and supports transition of research to clinical applications to diseases of military relevance. Applied research is being conducted to identify biological networks that are causative of illness in Post-Traumatic Stress Disorder (PTSD) and co-morbidities (presence of one or more diseases or disorders), coagulopathy (impaired ability to clot blood) of trauma, Traumatic Brain Injury, pain, suicide, infectious disease, and immune responses. In particular, the studies of PTSD are directed to refine biomarkers for screening, early diagnosis and therapeutic target discovery."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.072"
                                            },
                                            "Text": {
                                                "val": "Will continue to expand Systems Biology (SB) scientific efforts and to facilitate collaborative partnerships with Army, Department of Defense (DoD) and extramural laboratories. Will continue overseeing data sharing and data integration activities and continue to expand the SysBioCube capabilities to accommodate usage growth and integration of large, complex data sets. For coagulopathy, will complete the collection of time-course samples from trauma patients and proceed to determine the molecular effects of various clinical treatments to improve (or not) the clinical status. Will conduct data analyses of findings with chronic pain, suicidality, infection and effects of microgravity (functions as a stressor) to integrate with clinical results. Will evaluate nutritional supplements in the mouse model simulating features of PTSD in order to assess improved resolution or recovery. Will integrate clinical and multi-molecular studies of PTSD in humans to confirm a candidate panel(s) to diagnose chronic PTSD for advancement to a LDT which will be confirmed by a commercial lab; will identify three to four DoD clinical sites which will have the facilities to evaluate the LDT as a precursor for moving forward with an FDA product. Will evaluate clinical trials using standard PTSD therapy regimens to determine which aspects of PTSD are improved (or not) and to begin to associate initial status of the patients in order to inform therapeutic strategies ?personalized? for the individual?s condition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.001"
                                            },
                                            "Text": {
                                                "val": "Expand Systems Biology capabilities, to facilitate collaborative intramural and extramural partnerships, and to accommodate an expected increase in the number of end-users of the SysBioCube (USAMRMC?s information management suite, hosted by the National Cancer Institute (NCI) \/ National Institutes of Health (NIH) via the Frederick National Laboratory for Cancer Research).  Oversee data sharing and data integration of large, complex datasets. Increase capabilities to develop novel methods that integrate different systems biology data (e.g., genetics and metabolism data) that, in turn, lead to new knowledge products.  Provide support to the Integrative Systems Biology Program at United States Army Center for Environmental Health Research (USACEHR) for oversight of research efforts. Time-dependent clinical data collections and integrated omics analyses of treatment efficacies to be used in a wide range of studies including biomarker development and the understanding the altered molecular mechanisms that underlie PTSD, coagulopathy (blood?s ability to form clot is impaired), chronic pain perception, infectious diseases, and micro-gravitational stress on bone. Build a data-repository capability within the SysBioCube that will initially be for publications and associated datasets from 6.1 (Basic Research)-funded intramural research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.008"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.008"
                                            },
                                            "Text": {
                                                "val": "Will expand Systems Biology capabilities through collaborative intramural and extramural partnerships, and accommodate an expected increase in the number of end-users of the SysBioCube (USAMRMC?s information management suite, hosted by the National Cancer Institute (NCI)\/National Institutes of Health (NIH) via the Frederick National Laboratory for Cancer Research (FNLCR)). Will expand the data repository capability within the SysBioCube. Will continue to oversee data sharing and data integration of large, complex datasets. Will continue to increase capabilities to develop novel methods that integrate different systems biology data (e.g., genetics, microbiome, and metabolism data) that, in turn, will lead to new knowledge products. Will continue to provide support to the Integrative Systems Biology Program at USACEHR for oversight of research efforts. Will continue development of SysBioCube capabilities and functions such as integration and harmonization of additional data types (variant level Next Generation Sequencing data), browse and filtering functions to search for and sort specific assay types and associated data, tracking of assays conducted, and additional tools for longitudinal analysis and visualization of integrated data. Will use time-dependent clinical data collections and integrated omics (omics refers to the collective technologies used to explore the roles, relationships, and actions of the various types of molecules that make up the cells of an organism) analyses of treatment efficacies to support a wide range of research efforts that will include additional biomarker development and understanding of the underlying altered molecular mechanisms of a) PTSD (including changes in the microbiome (gut microbes) and in metabolism) that will begin to correlate co-morbid (concurrent) conditions, and b) infectious diseases."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Starting in FY19, the effort for refinement and evaluation of methods to detect exposure to environmental contaminants and toxic chemicals during military operations is combined into Environmental Health and Protection of MOMRP. The remaining VB4 effort will have adjustment to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XV5"
                    },
                    "ProjectTitle": {
                        "val": "Medical Capabilities to Support Dispersed Operations"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.72"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.72"
                        },
                        "BudgetYearTwo": {
                            "val": "9.364"
                        },
                        "BudgetYearThree": {
                            "val": "9.623"
                        },
                        "BudgetYearFour": {
                            "val": "10.142"
                        },
                        "BudgetYearFive": {
                            "val": "10.376"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "45.225"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a new start in FY19."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project line will support the following three new medical task areas: 1) Autonomous and Unmanned medical capability - will focus on developing the ability to deliver emergency resupply of CLVIII by ground or air, such as blood products, and, utilization of platforms to perform evacuations, 2) Virtual Health - will enable prolonged care and deciding faster by exploiting emerging communications and information technology for remote telemonitoring and telementoring, 3) Medical Aspects of man-machine teaming - will enable teaming to deliver medical care, and establish medical performance criteria to ensure Soldiers have the physiological, cognitive, and psychological capacity to perform man-machine teaming."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous and Unmanned Medical Capability"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype autonomous and unmanned capabilities to deliver high quality combat casualty care in dispersed operations with limited or absent medical care personnel in support of the Army Multi-Domain Battle concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.721"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.721"
                                            },
                                            "Text": {
                                                "val": "Will utilize invasive and non-invasive sensor systems to define new models for human physiologic responses to injury.  Data from these models will be used to define new algorithms that drive resuscitation and critical care procedures in animal models. Algorithms will be defined for implementation across a full spectrum of automation capabilities. Will define the physiological process associated with injury in trauma simulations that would be amenable to automated therapeutics with autonomous medical systems. Will explore feasibility of integrating medical capabilities and information systems with Army unmanned systems (UMS) Programs of Record in order to leverage multipurpose robotic platforms for medical capabilities. Will research standardization of medical device interfaces for use in an autonomous platform. Will research feasibility of Unmanned Aerial Systems (UAS) to support remote patient monitoring research prototypes, closed-loop patient support systems, and prototype automated diagnostic and therapeutic en route care capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The MCSDO program (XV5) is a new start in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual  Health"
                                    },
                                    "Description": {
                                        "val": "To develop future Virtual Health enterprise process architectures and integrated physical solutions capable to supporting prolonged field care in conditions with limited or lacking traditional field communications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.998"
                                            },
                                            "Text": {
                                                "val": "Will generate an overall Virtual Health technology research plan with detailed research tasks to support the Multi-Domain Battlefield Concept to include potential cross-domain with other research task areas. Will research and model novel Virtual Health enterprise process architectures to provide new intersections of health information and knowledge far forward to support the Multi-Domain Battlefield Concept. Will conduct a gap analysis of mechanisms for Virtual Health secure data transmission and communications in the tactical environment leveraging novel means to reduce virtual health encounter data packet sizes through novel compression algorithms to facilitate use in very limited communication scenarios to support the Multi-Domain Battlefield Concept. Will determine key physiological constructs that are predictive of health status and readiness for development of a micro-footprint biosensor-based assessment tools."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The MCSDO program (XV5) is a new start in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical Aspects of Man-Machine Teamining\/Medical Robotics"
                                    },
                                    "Description": {
                                        "val": "Research, design, and prototype future medical robotic systems capable of providing autonomous combat casualty care while optimizing the medical logistic footprint in far-forward and dispersed geographic environments in support of the Army Multi-Domain Battle concept and the Army Force 2025 and Beyond vision."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.001"
                                            },
                                            "Text": {
                                                "val": "Will research the design of robotic systems, including physical interfaces and hardware configurations, to effectively implement and control resuscitation and critical care procedures driven by algorithms defined by complementary research described in the Autonomous and Unmanned Medical Capability Task Area. Will research and design a proof of concept field robotic fold-up litter to show the feasibility of deploying soft robotics sensors and also show the capability to apply pressure using a soft robotics manipulator. Will model and characterize the problems caused by signal latency and constrained bandwidth on complex tele-robotic surgical tasks. Will research and prioritize procedures amenable to full automation of tele-robotic operations. Will research and explore the feasibility of using robotic perception systems to detect casualties from a standoff distance and at closer ranges using both conventional computer vision approaches and recent advancements in deep learning techniques. Will research and prioritize procedures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The MCSDO program (XV5) is a new start in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}