{
    "id": "2019-TheJointStaff-PB-0400-MJBOOK-0-0-ffce3191c7eefb8562d2a34cc99fec96721f2a4642336d58234fb945beaef3c0-2",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0204571J"
        },
        "ProgramElementTitle": {
            "val": "Joint Staff Analytical Support"
        },
        "R1LineNumber": {
            "val": "172"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "10.393"
            },
            "PriorYear": {
                "val": "5.462"
            },
            "CurrentYear": {
                "val": "7.712"
            },
            "BudgetYearOne": {
                "val": "6.658"
            },
            "BudgetYearOneBase": {
                "val": "6.658"
            },
            "BudgetYearTwo": {
                "val": "4.959"
            },
            "BudgetYearThree": {
                "val": "4.959"
            },
            "BudgetYearFour": {
                "val": "4.957"
            },
            "BudgetYearFive": {
                "val": "4.957"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Staff Analytical Support (JSAS) family of programs provides defense analytical support capabilities for the Joint Staff and Combatant Commands (CCMDs).  JSAS encompasses the developmental tools and infrastructure required to conduct analyses and formulate results to best assist the Chairman in fulfilling his statutory responsibilities.  Key deliverables provided by JSAS include development and implementation of Joint Concepts, wide-ranging force structure assessments, course of action development for the joint force environment, analyses and studies to aid in decision-making, and other analysis efforts to implement timely, low-cost joint force development initiatives."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.464"
                },
                "CurrentYear": {
                    "val": "7.712"
                },
                "BudgetYearOne": {
                    "val": "6.870"
                },
                "BudgetYearOneBase": {
                    "val": "6.870"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.462"
                },
                "CurrentYear": {
                    "val": "7.712"
                },
                "BudgetYearOne": {
                    "val": "6.658"
                },
                "BudgetYearOneBase": {
                    "val": "6.658"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.002"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.212"
                },
                "BudgetYearOneBase": {
                    "val": "-0.212"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-2.002"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Revised economic assumtions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.212"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.212"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017: Decrease in funding due to $2,000K Congressional mark to Joint Staff Analytical Support and a $2K undistributed Congressional mark to FFRDC. Total mark ($2,002K)\n\nFY 2018: Increase in funding to P003 GFM DI to complete development and fielding of Joint Planning Services pilot that is fully integrated with Joint Planning and Execution Services framework.\n\nFY 2019 thru FY 2022: Decrease in funding for FY 2019 thru FY 2022 is a result of (1) mandated 25% Major Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA and (2) changes in economic assumptions for non-fuel and non-pay inflation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Future Joint Force Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.393"
                        },
                        "PriorYear": {
                            "val": "3.562"
                        },
                        "CurrentYear": {
                            "val": "5.712"
                        },
                        "BudgetYearOne": {
                            "val": "5.301"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.301"
                        },
                        "BudgetYearTwo": {
                            "val": "4.959"
                        },
                        "BudgetYearThree": {
                            "val": "4.959"
                        },
                        "BudgetYearFour": {
                            "val": "4.957"
                        },
                        "BudgetYearFive": {
                            "val": "4.957"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Staff Analytical Support (JSAS) program supports the Chairman of the Joint Chiefs of Staff Title 10, Section 153 statutory responsibilities for the analytical support, management, development, evaluation, and implementation of joint concepts in order to advance the operational effectiveness of the future Joint Force and enable the introduction of new capabilities. The Joint Concepts program supports the Chairman's statutory responsibility to provide “best military advice” to the SECDEF and POTUS by expressing his vision for the future joint force; addressing operational problems on a 20 year horizon; identifying joint force development implications; and identifying capabilities required to mitigate and solve future joint warfighting gaps. The overarching goal is to enable investment decisions between near and far term. Concepts drive horizontal integration for force development across the Services, Combatant Commands, Defense agencies, OSD and Joint Staff. An intent of the Joint Concepts program is to support senior leader decisions in balancing today’s requirements and future force requirements. Key deliverables include:  \n\nCapstone Concept for Joint Operations (CCJO) that provides the Chairman's vision for the future joint operations and establishes aim points for the development of the future Joint Force. The key theme is globally integrated operations. \n\nFamily of Joint Concepts, based on National Military Strategy (NMS), provides operational approaches to future challenges or opportunities with respect to Russia, China, Iran, North Korea, and Countering Violent Extremist Organizations in order to guide current and future Joint Force development. \n\nJoint Concept Transition Plans, developed for each joint concept, document approaches for Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities (DOTMLPF) changes in the future Joint Force and identifies conceptual ideas that may require further exploration.  \n\nJoint Operating Environment (JOE) describes the future security environment and projects the implications of change for the Joint Force so it can anticipate and prepare for potential conflicts. The JOE articulates the circumstances that are likely to alter the security environment and explores how the intersection and interaction of these changes might impact the character of war in the future. Finally, the JOE provides a framework to think about the full range of Joint Force missions and how they may evolve over time.\n\nThe International Force Development Division’s (IFDD) mission is to ensure collaboration and integration throughout the spectrum of joint force development, so that both the Joint Staff and its Allies and partners invest in any required reforms to ensure continued, interoperable and seamless operations together to meet the objectives in the NMS. The Multinational Capability Development Campaign (MCDC) is an initiative led by the United States Joint Staff which partners with 22 countries and international organizations designed to develop and assess non-materiel force development solutions and close capability gaps in multinational operations. Funds are used solely for travel in support of U.S. led projects and events with multinational and coalition partners."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Joint Force Development"
                                    },
                                    "Description": {
                                        "val": "Current efforts focus on updating the Capstone Concept for Joint Operations (CCJO) so it extends the strategic approach developed in the 2016 NMS out to 2035. The CCJO modification will provide a common view of the future operating environment and a vision for how the future joint force will conduct globally integrated operations.  Also, the revised CCJO will identify force development implications and required capabilities to maintain U.S. competitive advantage against emerging threats out to 2035. In partnership with selected Combatant Commands and the Services, development of the Joint Operating Concepts to address strategic challenges has begun.  The Joint Operating Concept (JOC) – China and JOC - Russia prospectuses have been approved. The Director Joint Staff has endorsed the framework and authorized the continued development of two JOCs.  The initial research on JOC – North Korea has begun and the prospectus is expected to be approved in early FY 2018.  The concept prospectus describes the compelling military challenge and how it will be addressed in the future. JOC – Iran is in the very early stages of prospectus development. Study of the 2035 operating environment continues and informs understanding of military challenges associated with the common view of the future operating environment.  Work with Five Eyes (FVEY) countries is focused on developing a FVEY common view of the future operating environment.  Development support was completed for the Joint Concept for Integrated Campaigning and the Joint Concept for Operating in the Information Environment.  Concept implementation is underway for the Joint Concepts for rapid aggregation, robotic and autonomous systems, human aspects of military operations, access and maneuver in the global commons, preventing the transfer and use of weapons of mass Destruction, and operational contract support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.562"
                                            },
                                            "Text": {
                                                "val": "Complete CJCS approval of the CCJO.  In partnership with selected CCMDs and the Services, begin developing the approved Family of Joint Concepts needed to address the 4+1 strategic challenges expressed in the NMS, out to 2035.  Continue futures study to inform our understanding of the challenges of the future operating environment. Complete development of 5 new Joint Concepts from FY 2016 and initiate 2 new Joint Concepts aligned to the National Military Strategy (NMS).  Continue implementing approved Joint Concepts IAW CJCSI 3010.  Expand multinational partnerships in futures and concept development.  Support Joint Staff 2017 efforts by integrating Joint Concepts across the Joint Staff to inform capability development decisions.  Continue to lead execution and oversight of the DepSecDef directed WLIF program to spur innovative force development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.712"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept Program.  Continue support for the NMS and execution of senior leader direction to develop a Capstone Concept for Joint Operations. In partnership with selected CCMDs, the Services and other Joint Staff directorates, obtain Vice CJCS approval of the JOC for China and Russia.  Begin final official staffing of JOC – North Korea and complete the prospectus and initial draft of JOC – Iran. Support the development of JOC – Counter Violent Extremist Organizations.  Continue futures study to inform our understanding of the challenges of the future operating environment. Continue implementing approved Joint Concepts in accordance with CJCS Instruction 3010.  Continue multinational partnerships in futures and concept development.  Continue integrating Joint Concepts across the Joint Staff to inform DOTMLPF capability development decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.301"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.301"
                                            },
                                            "Text": {
                                                "val": "Execute the Chairman's Joint Concept program.  In partnership with CCMDs, the Services and other Joint Staff directorates, obtain Vice CJCS approval of the Joint Operating Concepts for North Korea and Iran.  Provide support to U.S. Special Operations Command to develop transition plan of JOC – Counter Violent Extremist Organizations.  Continue futures study to inform our understanding of the challenges of the future operating environment.  Continue implementing approved Joint Concepts as described in CJCS Instruction 3010.  Maintain and enhance multinational partnerships in concept development.  Integrate Joint Concepts across the Joint Staff to inform DOTMLPF capability development decisions.  \n\nMajor events and projects in 2019 will include the International Concept Development and Experimentation Conference, a U.S. \/ NATO co-led event that is the annual forum of Supreme Allied Command Transformation and Joint Staff to provide a unique opportunity for the international concept development and experimentation community and stakeholders to discuss the most current issues of concept development and experimentation in the capability development process. Additional projects and events include travel to the MCDC Executive Steering Group (ESG) and National Directors’ meetings to provide governance for the MCDC program as well as travel in support of U.S. led projects in the areas of logistics, personnel recovery, cyber, command and control and information sharing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding for FY 2019 thru FY 2022 is a result of mandated 25% Major Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Concept development performance metrics are derived from the Chairman’s Title 10 responsibilities and guidance for developing and implementing Joint Concepts. These measures and metrics inform the Department’s senior leadership by providing an azimuth for future joint force development. \n\nPerformance measure 1 – Joint Concepts were developed to examine military challenges and propose innovative joint solutions and associated capabilities in support of defense needs and priorities.\nMetric: Joint Concepts align and inform the National Military Strategy, informed by rigorous futures analysis. The Joint Concepts Program resulted in relevant and timely advocacy among operations, plans, and force development communities.  \n\nPerformance measure 2 – Joint Staff provided leadership for the development of Joint Concepts in collaboration with joint and multinational partners.\nMetric: Joint Concepts governance system promote “best military advice” for the CJCS.  Ideas and solutions are rigorously and objectively evaluated within a joint and multinational context.  Joint concepts are continually monitored to ensure consistency, relevancy, and utility throughout their life cycle.  \n\nPerformance measure 3 – Implement Joint Concepts. \nMetric:  Transition plans promote informed decisions for joint force development that leverage, integrate or inform related DOTMPLF capability development programs for maximum efficiency and effectiveness."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "GFM DI Enterprise Force Structure (EFS) Integration"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.900"
                        },
                        "CurrentYear": {
                            "val": "2.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.357"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.357"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Force Management Data Initiative (GFM DI) Enterprise Force Structure (EFS) integration effort provides the next steps for GFM mission application enhancements required to balance global force demand against available military force. This complex and multi-variant task requires modernized technologies that provide integrated information linking authoritative force structure data (derived from the GFM DI Organizational Servers) to C2 data (resident in GFM mission applications). The Joint Staff Operations Directorate is responsible for GFM allocation and is the functional manager of the GFM mission applications. Accordingly, the Joint Staff will employ a strategy for efficiently fulfilling Enterprise Force Structure (EFS) data utility.\n\nThe DoD must quickly transition from legacy force management systems that promulgate data disparity across the Defense enterprise in order to meet national military objectives that have evolved from large force scenarios to operations that include small-to-full scale activities. As stated in both the NSS and NMS, our adversaries demonstrate the ability to readily transition from non-kinetic to kinetic means. Consequently, Information Technology (IT) superiority, capabilities, and recognition of associated vulnerabilities are an operational imperative. Yet, warfighters, strategic planners and GFM decision makers are unable to exchange information in a manner that keeps pace with globally changing threats to rapidly and accurately accomplish force sourcing activities to support SecDef allocation decisions. The Joint Staff is mandated to utilize the Service’s Organizatonal Server EFS data to enhance managing, assessing, and displaying the worldwide disposition of U.S. Forces. Key deliverables include incrementally developed, operationally realistic capability enhancements focused on resource-informed planning and GFM sourcing functionality required by JROCMs, the Capability Development Document (CDD) for GFM DI; Joint Command and Control (JC2) Capability Definition Package (CDP); Joint Operation Planning Process (JOPP) and Assessment CDP; and Force Planning & Deployment Planning\/Execution CDP."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GFM Data Initiative (GFM DI) Enterprise Force Structure Integration (EFS)"
                                    },
                                    "Description": {
                                        "val": "The GFM DI EFS integration effort requires RDT&E funds to upgrade GFM mission applications in order to operationalize force structure data from the Service's Organizational Servers to actual forces for employment within the purview of allocation and Joint command and control. This GFM DI effort within the Joint Staff Analytical Support (JSAS) family of programs will immediately streamline the SECDEFs \"Forces for Unified Commands\" memorandum Assignment Tables. RDT&E efforts for assignment and apportionment functions ended in FY 2015 with the declaration of Full Operation Capability (FOC) for the Automated Global Force Management Tool. GFM DI planned milestones must be met to enable a global visibility capability. GFM applications managed by the Joint Staff are used by the JSAS family of programs. This effort to fund critical upgrades is a precondition to GFM DI EFS integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.900"
                                            },
                                            "Text": {
                                                "val": "Specific RDT&E work will focus on development of a Joint Force Capabilities Catalog (JFCC) that draws upon authoritative Service force structure and GFM data aggregated in a prototype Global Laydown Server (GLS). This approach is essential in a budget constrained environment to fulfill the DoD CIO \"DoD Cloud Way Forward\" focused on service-oriented architecture that flattens the legacy \"Silos of Databases\" paradigm by leveraging decentralized infrastructure services. It will enable DoD CIO foundational IT changes with enhanced cybersecurity that provides information sharing within the Joint Command and Control mission partner environment without redundant or duplicative resources. The strategy will result in initial incremental development of the Joint Force Capability Catalog (JFCC) virtual application with a Force Element Inventory Predictive Analysis Tool (FEI PAT) utilizing dynamic force visibility that provides timely, accurate and dynamic data representing U.S. Forces in motion for the 34 GFM leading indicators and Combatant Commanders initial force requirements as identified in the NMS priority OPLANS.  The Initial Operating Capability (IOC) will be achieved by first aggregating the Service Org Server data into the Global Laydown Server to link Service generated Organization Unique Identifiers (OUIDs) for  force elements identified to establish the Joint C2 relationships to the Allocation process (OPCON and TACON Links). This will provide the capability to establish the OUID\/ Unit Identification Code (UIC) linkages in Joint Operation Planning and Execution System (JOPES) Time-Phased Force Deployment Data (TPFDDs), then map them to GFM allocation information (Force Tracking Number [FTN], Request for Forces [RFF], Deployment Order\/Line Number [DEPORD\/LNR]), and Assignment of the Forces For Unified Commands"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "RDT&E work will focus on the continued incremental development of the Joint Force Capabilities Catalog (JFCC) to operationalize the GFM DI by linking DoD Service force structure to dynamic GFM factors (capabilities, readiness, availability, employment and location) within the Global Laydown Server (GLS). This capability will provide a dynamic representation of military force disposition. GLS algorithms will enable the GFM mission applications to present meaningful information required for timely and accurate decision making to assist the Chairman in providing military advice. The JFCC will serve as a user interface that uses the GLS algorithms to streamline operations planning and GFM execution in support of Combatant Commander requirements. \n\nThe FY 2018 strategy will focus on a unit type capabilities registration functionality within the JFCC that will unify the unit-based readiness and unit type reporting process by obtaining on-hand forces (personnel and equipment) via the EFS (GFM DI) standard format. The FY 2018 incremental development of the JFCC virtual application and associated dynamic force visibility will provide the true inventory of force availability based on Service employable entities (unit types) and sustainability factors, to enable the use of on-hand Service force capabilities identified down to the Service-defined lowest deployable entities for executive decision making and GFM mission execution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.357"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.357"
                                            },
                                            "Text": {
                                                "val": "FY 2019 work will focus on efforts to implement timely, low-cost initiatives and Global Force Management (GFM) focused tools delivering a global visibility of the disposition of DoD forces. This supports the preferred munitions and engineering and cross-servicing arrangements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This program recieved an increase of $1.4M in both FY 2018 and FY 2019 to fund modification of GFM to interface with Joint Planning and Execution Services applications. Before the increase, the program was funded at $0.6M in FY 2018 and $0 in FY 2019. The resulting funding profile is $2.0M in FY 2018 and $1.4M in FY 2019.  Also, this program received a $.04M reduction due to changes in economic assumptions for non-fuel and non-pay inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The JSAS efforts will result in a Global Laydown Server and Joint Force Capabilities Catalog that supports a global visibility capability allowing for joint future force integration with information requirements needed to support timely and dynamic response to Combatant Commanders’ unforeseen contingency requirements.   This is a cost-effective yet full spectrum approach to support and assist the Chairman in fulfilling his statutory responsibilities while improving current and future joint force management. Program measures include the following:\n\n1. Meet IOC that enables rapid generation of Global Force Management (GFM) decision-making information for policy-makers and Combatant Commands based on authoritative Service force capability, readiness, availability and current employment data.\n\n2. Reduce the manual process of assembling capability, readiness, availability, employment as the first step to providing enhanced force management decision-making. Mining this data is currently a labor-intensive, time-consuming process and significantly impedes rapid response capabilities.\n\n3. Services, CCMDs, Joint Staff and OSD will be able to efficiently collect and analyze force generation data supporting GFM in far less time than the current process, and with an authoritative common view of the sourcing-to-employment tracking of forces. \n\n4. The JFCC will enable the rapid generation of information when making time-sensitive decisions and allow a joint planner to use standard and consistent force structure data in the GFM sourcing solution generation and deployment planning, execution, and distribution processes.\n\n5. Ability to meet the VCJCS guidance to meet the GFM DI Full Operating Capability (FOC) by FY 2020."
                        }
                    }
                }
            ]
        }
    }
}