{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-18",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603607A"
        },
        "ProgramElementTitle": {
            "val": "Joint Service Small Arms Program"
        },
        "R1LineNumber": {
            "val": "48"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "5.615"
            },
            "CurrentYear": {
                "val": "5.796"
            },
            "BudgetYearOne": {
                "val": "5.885"
            },
            "BudgetYearOneBase": {
                "val": "5.885"
            },
            "BudgetYearTwo": {
                "val": "4.604"
            },
            "BudgetYearThree": {
                "val": "4.696"
            },
            "BudgetYearFour": {
                "val": "6.249"
            },
            "BudgetYearFive": {
                "val": "6.374"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "39.219"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates advanced technologies that provide greater lethality, target acquisition, fire control, and range at a significantly reduced weight. These technologies lighten the Soldier's load, provide improved battlefield mobility, and reduce logistics burden while maintaining or improving current levels of performance.     \n \nEfforts in this PE support the Army Science and Technology Lethality Portfolio. \n\nWork in this PE is related to and fully integrated with the efforts funded in PE 0602623A (Joint Service Small Arms Program), PE 0602624A (Weapons and Munitions Technology) and PE 0602618A (Ballistic Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \nThe work in this PE is performed by the Army Research, Development and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.839"
                },
                "CurrentYear": {
                    "val": "5.796"
                },
                "BudgetYearOne": {
                    "val": "5.885"
                },
                "BudgetYearOneBase": {
                    "val": "5.885"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "5.615"
                },
                "CurrentYear": {
                    "val": "5.796"
                },
                "BudgetYearOne": {
                    "val": "5.885"
                },
                "BudgetYearOneBase": {
                    "val": "5.885"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.224"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.221"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "627"
                    },
                    "ProjectTitle": {
                        "val": "Jt Svc Sa Prog (JSSAP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.615"
                        },
                        "CurrentYear": {
                            "val": "5.796"
                        },
                        "BudgetYearOne": {
                            "val": "5.885"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.885"
                        },
                        "BudgetYearTwo": {
                            "val": "4.604"
                        },
                        "BudgetYearThree": {
                            "val": "4.696"
                        },
                        "BudgetYearFour": {
                            "val": "6.249"
                        },
                        "BudgetYearFive": {
                            "val": "6.374"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "39.219"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies that provide greater lethality, target acquisition, fire control, training effectiveness and range at a significantly reduced weight. These technologies lighten the Soldier's load, provide improved battlefield mobility, and reduce logistics burden while maintaining or improving current levels of performance.     \n \nEfforts in this Project support the Army Science and Technology Lethality Portfolio.  \n\nWork in this Project is related to and fully integrated with the efforts funded in Program Element (PE) 0602623A (Joint Service Small Arms Program) and PE 0602624A (Weapons and Munitions Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Volume Effects"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the maturation and demonstration of emerging small arms technologies from PE 0602623A efforts into current and next generation weapon systems to address Volume (sustained suppressive and lethal fires for area targets) capability gaps for improved effectiveness at extended ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.272"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate weapon systems, fire control and ammunition technologies to support the Next Generation Squad Automatic Rifle (NGSAR) requirements for a lightweight medium machine gun (up to 1200 meters range) with increased lethality, reduced weight, and decreased detection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.373"
                                            },
                                            "Text": {
                                                "val": "Continue to support technology development for Next Generation Squad Automatic Rifle (NGSAR) requirements; investigate weapon systems, fire control, and ammunition technologies to increase the current performance of the lightweight medium machine gun."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.945"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.945"
                                            },
                                            "Text": {
                                                "val": "Will mature technology concepts to inform NGSAR requirements and optimize designs for the next generation carbines and Squad Designated Marksman (SDM) weapon systems; will mature weapon system, fire control, and ammunition technologies to increase the current performance of the lightweight medium machine gun."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to component technologies being matured for a demonstration of a next generation squad weapon."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Effects"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the maturation and demonstration of emerging small arms technologies from PE 0602623A efforts into current and next generation weapon systems to address precision fire (Precision fire is support fire in the offense during the assault and engagement of targets to the maximum effective range of the weapon), and fire control capability gaps for improved accuracy at extended ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.521"
                                            },
                                            "Text": {
                                                "val": "Integrate and demonstrate weapon systems, fire control and ammunition technologies to support the next generation weapon systems; address precision fire requirements for the squad (up to 600m range) and the Platoon (up to 2400m range) with increased lethality, reduced weight, and decreased weapon signature."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.428"
                                            },
                                            "Text": {
                                                "val": "Optimize and demonstrate precision ammunition technologies to support precision ammunition requirements for extended range, accuracy and terminal effects required to perforate toughest targets and implement highly efficient aerodynamics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.013"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.013"
                                            },
                                            "Text": {
                                                "val": "Will optimize and demonstrate anti-material, improved performance and subsonic precision ammunition in three different calibers to support requirements for extended range and increased accuracy and terminal effects required to meet those needs across multiple fielded or emerging weapon platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to technologies for small arms precision being matured for a demonstration in three different calibers."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Systems Integration and Demo"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the maturation and demonstration of small arms component technologies resulting from PE 0602623A efforts and applied into advanced small arms technologies as to inform the user requirement process, address operational capability gaps and transition mature components and technology concepts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.38"
                                            },
                                            "Text": {
                                                "val": "Increase understanding of current lethality capabilities, gaps, and impacts on the Warfighter; assess small unit effectiveness on next generation leap ahead weapon systems supporting the Squad."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.495"
                                            },
                                            "Text": {
                                                "val": "Continue to increase lethality capabilities and assess small arms effectiveness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate next Generation Small Arms Squad Technologies at the Army Expeditionary Warrior Experiment (AEWE) in support of increasing small unit effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase is due to the leadtime for and during the demonstration of the next generation squad weapons a live fire warfighter exercise."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Service Small Arms Science and Technology Collaboration"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the continued operations of the Joint Service Small Arms Program (JSSAP) office to coordinate and harmonize new Services' materiel requirements with potential joint applications, and to maintain awareness of the Services' efforts to improve Small Arms capabilities thus reducing duplication of ongoing and planned technology, acquisition and sustainment activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.442"
                                            },
                                            "Text": {
                                                "val": "Provide intensive management of the Department of Defense (DoD) small arms tech base; harmonize emerging material requirements; focus technology development efforts on material solutions that will transition to the Project Managers for further development and eventual fielding; conduct long range plans and optimize strategies for joint applications; influence international small arms activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Continue to manage Joint Services Small Arms Programs; continue technology developmental efforts on material solutions for transitioning to small arms programs of record; continue to influence small arms technology maturation activities in collaboration with North Atlantic Treaty Organization (NATO) partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.427"
                                            },
                                            "Text": {
                                                "val": "Will continue to manage Joint Services Small Arms Programs; will continue technology developmental efforts on material solutions for transitioning to small arms programs of record; will continue to influence small arms technology maturation activities in collaboration with North Atlantic Treaty Organization (NATO) partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to reduced level of effort in support of technology maturation activities with NATO partners."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}