{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-1-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-31",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605104D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technical Studies Support and Analysis"
        },
        "R1LineNumber": {
            "val": "143"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "133.008"
            },
            "PriorYear": {
                "val": "20.300"
            },
            "CurrentYear": {
                "val": "22.386"
            },
            "BudgetYearOne": {
                "val": "22.576"
            },
            "BudgetYearOneBase": {
                "val": "22.576"
            },
            "BudgetYearTwo": {
                "val": "23.158"
            },
            "BudgetYearThree": {
                "val": "23.417"
            },
            "BudgetYearFour": {
                "val": "23.995"
            },
            "BudgetYearFive": {
                "val": "24.434"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program is a key source of funding for the Office of the Secretary of Defense and the Joint Staff to manage studies, analyses, strategic planning, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analyses will examine current and alternative policies, plans, operations, strategies and budgets, providing essential means for managing and responding to the shifting and complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  Independent analyses from subject matter experts are instrumental for senior defense planners in making informed choices regarding requirements for force planning and strategic deployment of assets taking into account technological challenges and resource constraints, and there is a strong need to incorporate the findings of operational analysis in force planning requirements and projections. With the complexities of emerging advanced security threats in the current geopolitical environment, the need for objective analysis and forward looking planning to inform senior leadership for the mid and long-term is vital to remaining strategically competitive."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.069"
                },
                "CurrentYear": {
                    "val": "22.386"
                },
                "BudgetYearOne": {
                    "val": "22.760"
                },
                "BudgetYearOneBase": {
                    "val": "22.760"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "20.300"
                },
                "CurrentYear": {
                    "val": "22.386"
                },
                "BudgetYearOne": {
                    "val": "22.576"
                },
                "BudgetYearOneBase": {
                    "val": "22.576"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.769"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.184"
                },
                "BudgetYearOneBase": {
                    "val": "-0.184"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-1.600"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.350"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.792"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "General budget and economic adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.184"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.184"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.024"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Cancelled account withhold"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reductions are reflected for mandated statutory reductions and general  budget changes.  The FY 17 reprogramming event was an internal one-time realignment of funding to PE 0604016D8Z to facilitate execution of a USD(AT&L) technical requirement.\n\nAs part of the Department of Defense reform agenda, the budget estimate reflects a stable trend in the number and cost of reports and studies in the near-term."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "421"
                    },
                    "ProjectTitle": {
                        "val": "Technical Studies"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "133.008"
                        },
                        "PriorYear": {
                            "val": "20.300"
                        },
                        "CurrentYear": {
                            "val": "22.386"
                        },
                        "BudgetYearOne": {
                            "val": "22.576"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.576"
                        },
                        "BudgetYearTwo": {
                            "val": "23.158"
                        },
                        "BudgetYearThree": {
                            "val": "23.417"
                        },
                        "BudgetYearFour": {
                            "val": "23.995"
                        },
                        "BudgetYearFive": {
                            "val": "24.434"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program is a key source of funding for the Office of the Secretary of Defense and the Joint Staff to manage studies, analyses, strategic planning, and technical support efforts to improve and support policy development, decision making, management and administration of DoD programs and activities. Studies and analyses will examine current and alternative policies, plans, operations, strategies and budgets, providing essential means for managing and responding to the shifting and complex international, political, technological, economic, military, and acquisition environments in which national security planning decisions are made.  Independent analyses from subject matter experts are instrumental for senior defense planners in making informed choices regarding requirements for force planning and strategic deployment of assets taking into account technological challenges and resource constraints, and there is a strong need to incorporate the findings of operational analysis in force planning requirements and projections. With the complexities of advanced emerging security threats in the current geopolitical environment, the need for objective analysis and forward looking planning to inform senior leadership for the mid and long-term is vital to remaining strategically competitive."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Studies and Analyses Support for the Office of the Secretary of Defense"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.300"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition, Technology & Logistics):\nStudies and analyses of:\n\nElectronic warfare capabilities, joint warfighting command and control in contested environments, combat aircraft service life optimization, WMD defense capabilities, weapons systems architecture, laser systems, ordinance modernization strategies, cyber resilience in industrial control systems, weapons systems software assurance, foreign investment in domestic suppliers, munitions industrial requirements, leveraging additive manufacturing capabilities to strengthen supply chain resilience, technology transfer capabilities, strategic basing requirements, defense acquisition workforce planning, weapons system sustainment in contingency operations, identifying acquisition program risk, support to Defense Science Board task forces on various evolving technological and warfare issues, and leveraging small business technology innovations.\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nRequirements regarding investment and resource planning such as future force structure requirements and weapons system requirements, recapitalization planning of strategic forces, product support cost analysis considerations during the acquisition process, commercial aircraft pricing and market factors, contingency force structure capabilities planning, technical studies and analyses to support independent cost estimates and economic research, weapons systems capabilities projection, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program\n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional and strategic defense strategy, countering extremist movements, international defense policy planning, strategic force planning, homeland defense and humanitarian response capabilities, deterrence and counterproliferation requirements, international defense trade and industrial relationships, alliance sustainment, technological and other external effects on strategic requirements, space and cyber strategic guidance planning, contingency and stability operations, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRequirements regarding sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, health care requirements for current and retired personnel, survivor benefits, compensation analyses, identifying critical personnel requirements, reserve component readiness and sustainability, military family and educational issues, gender and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon operations research, cyber capabilities and strategy, command and control, mobility capabilities, supply chain requirements, training requirements, force programming planning, and basing requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.386"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition, Technology & Logistics) and USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nTechnical areas regarding joint warfighting capability and technology planning, strategic and conventional system requirements, semiconductor supply chain assurance, operational mission integration management capabilities, critical munitions requirements, networked sensor architecture planning, counter WMD defense capabilities, strategic defense architectures, industrial base capabilities assessments, cyber capabilities, defense manufacturing technology, effects of defense industry consolidation, methods to facilitate innovative emerging commercial technological solutions, acquisition policy effectiveness, technologies for evolving mission requirements, allied defense capabilities, strategic basing requirements, DoD installations planning, logistics supply chain and energy requirements, NATO policy planning, identifying acquisition program risk, support to Defense Science Board task forces on various evolving technological and warfare issues, and advanced electronic warfare countermeasures. \n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nRequirements regarding investment and resource planning such as emerging strategic and tactical systems requirements, strategic mobility, maintaining force readiness, personnel force models, assessments in support of scenario analyses, special operations and force support requirements, technical studies and analyses to support independent cost estimates and economic research, comparative analyses of alternative strategic and conventional weapons systems configurations and force levels, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional and strategic defense strategy, international defense policy planning, strategic force requirements, homeland defense and humanitarian response capabilities, deterrence and counterproliferation requirements, international defense trade and industrial relationships, NATO requirements planning, technological and other external effects on strategic requirements, space and cyber strategic guidance planning, contingency and stability operations, countering emerging terrorist and transnational criminal threats, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRequirements regarding sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, medical force infrastructure, compensation analyses, identifying critical personnel requirements, reserve component readiness and sustainability, military family and educational issues, gender and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon contingency planning, cyber force planning, command and control, mobility and supply chain requirements, joint training requirements, force programming planning, and basing requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.576"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.576"
                                            },
                                            "Text": {
                                                "val": "Technical Support for the USD(Acquisition and Sustainment):\nStudies and analyses of:\n\nCybersecurity for weapons systems, technological capabilities requirements planning, munitions portfolio requirements, strategic systems and communications capabilities, space systems requirements, industrial base and defense manufacturing requirements, cyber assurance, acquisition policy effectiveness, foreign defense industry developments, strategic basing requirements, DoD installations planning, logistics supply chain and energy requirements, acquisition program performance, support to various Defense Science Board task forces on various evolving technological and warfare issues, and small business technology investment and acquisition strategy.\n\nTechnical Support for the Director, Cost Assessment and Program Evaluation:\nStudies and analyses regarding the following areas:\n\nVarious analytic requirements for maintaining a balanced portfolio of defense capabilities through investment and resource planning such as emerging strategic and tactical systems requirements, mobility and logistical support capabilities, maintaining force readiness and personnel planning requirements, capability planning resulting from scenario analyses, contingency and conventional force requirements, technical studies and analyses to support independent cost estimates and economic research, and continuation of development of critical management instruments for measuring the long-term trends, strength and affordability of the defense program and supporting development of the Future Years Defense Program. \n\nTechnical Support for the USD(Policy):\nStudies, analyses, and activities in the following areas:\n\nRequirements regarding national security geopolitical posture and policies such as regional and strategic defense strategy, countering weapons of mass destruction, global strategic affairs, defense capabilities continuity, space and cyber policy, homeland defense support of civil authorities, planning, technological and other external effects on strategic requirements, space and cyber strategic guidance planning, protection of defense critical infrastructure, contingency and stability operations, nuclear planning, and strategic-level simulations of areas of interest for legislative and executive branch decision-makers.\n\nTechnical Support for the USD(Personnel & Readiness):\nStudies and analyses in the following areas:\n\nRequirements regarding sustainment and planning for the force of the future such as active and reserve recruiting and retention issues, training requirements, maintaining strategic readiness, compensation and quality of life matters and retention, identifying critical personnel requirements, reserve component readiness and sustainability, health and medical issues, crisis and contingency readiness, diversity management and equal opportunity, and strategies for managing the Total Force portfolio.\n\nTechnical Support for the Joint Staff conducting joint research with OSD:\n\nJoint Studies and analyses with OSD based upon operations research, cyber capabilities, command and control requirements, mobility capabilities, supply chain and support requirements, joint testing and training requirements, homeland defense, force programming planning, and basing requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase reflects general program price changes accounting for inflation.   FY 2019 plans reflect the transition of certain functions from the USD(Acquisition, Technology & Logistics) to the USD(Acquisition and Sustainment)"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "FY 2019 BA: $22.576 FY 2019 BA Assoc w\/Metrics: $22.576 Percent FY 2019 BA Assoc w\/Metrics: 100%\n\nThis program conducts approximately seventy-five actions per fiscal year to support a wide variety of national security goals of the Department and is designed to encourage a collaborative research approach among the components of OSD and the Joint Staff.  The research and study projects supported by this program are closely integrated with the strategic goals of the Department of Defense.  The focus of studies varies across a wide spectrum including weapons systems cost analysis, strengthening and leveraging alliances, human resource and military personnel management, examination of innovative technologies, application of technology to operational doctrine, and many other issues of emerging importance.  Most of the actions are long to intermediate-range in outlook, and the program allows organizational leaders to plan and guide their research toward meeting their highest-priority goals and other high-level guidance such as executive branch performance management objectives, the Quadrennial Defense Review, the President's National Security Strategy, and the National Military Strategy of the United States of America.\n\nIn following the program efficiencies guidance of the Secretary of Defense, the scope of studies and analyses has been limited as necessary in order to focus upon issues of the highest strategic importance and needs to the Department of Defense while continuing to make every effort to support requirements for the Office of the Secretary of Defense developing from legislative direction."
                        }
                    }
                }
            ]
        }
    }
}