{
    "id": "2019-Army-PB-2040-JBOOK-50fbd0261a3655ea9f06b01dc4349c755f85c19c33affe9e3ab3b9417df4558d-18",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604100A"
        },
        "ProgramElementTitle": {
            "val": "Analysis Of Alternatives"
        },
        "R1LineNumber": {
            "val": "72"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.354"
            },
            "CurrentYear": {
                "val": "9.921"
            },
            "BudgetYearOne": {
                "val": "9.765"
            },
            "BudgetYearOneBase": {
                "val": "9.765"
            },
            "BudgetYearTwo": {
                "val": "10.023"
            },
            "BudgetYearThree": {
                "val": "10.092"
            },
            "BudgetYearFour": {
                "val": "10.225"
            },
            "BudgetYearFive": {
                "val": "10.427"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "66.807"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This PE provides funding for analytical support of Analysis of Alternatives (AoA). Based on Department of Defense Instruction (DoDI) 5000.02, AoAs are required to be completed for a new start program prior to its first Milestone (MS) Decision. AoAs are a statutory requirement for ACAT I programs and regulatory for ACAT II and ACAT III programs.  The AoAs support the preparation of the Capability Development Document (CDD), Key Performance Parameters (KPP) and Thresholds within the CDDs and tradeoff analysis.  The Army must complete an AoA prior to the MS A Decision in order to successfully achieve a MS A decision for new start programs.  For new start programs which do not yet have a Program Manager assigned this PE provides central funding prior to a materiel development decision.  The cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and Plan.  Work in this PE is performed by analytical agencies such as U.S. Army TRADOC Analysis Center and U.S. Army Materiel Systems Analysis Activity. The Army is projecting to start work on mutiple AoAs beginning in FY 2019, and will assess and fund the highest Army priorities during the year of execution."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "6.608"
                },
                "CurrentYear": {
                    "val": "9.921"
                },
                "BudgetYearOne": {
                    "val": "9.87"
                },
                "BudgetYearOneBase": {
                    "val": "9.87"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.354"
                },
                "CurrentYear": {
                    "val": "9.921"
                },
                "BudgetYearOne": {
                    "val": "9.765"
                },
                "BudgetYearOneBase": {
                    "val": "9.765"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.254"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.105"
                },
                "BudgetYearOneBase": {
                    "val": "-0.105"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.003"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.251"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.105"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.105"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 adjustments include $-0.003 million for FFRDC, $-0.220 million for SBIR and $-0.031 million for STTR."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EC7"
                    },
                    "ProjectTitle": {
                        "val": "Analysis Of Alternatives"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.354"
                        },
                        "CurrentYear": {
                            "val": "9.921"
                        },
                        "BudgetYearOne": {
                            "val": "9.765"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.765"
                        },
                        "BudgetYearTwo": {
                            "val": "10.023"
                        },
                        "BudgetYearThree": {
                            "val": "10.092"
                        },
                        "BudgetYearFour": {
                            "val": "10.225"
                        },
                        "BudgetYearFive": {
                            "val": "10.427"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "66.807"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This PE provides funding for analytical support of Analysis of Alternatives (AoA). Based on Department of Defense Instruction (DoDI) 5000.02, AoAs are required to be completed for a new start program prior to its first Milestone (MS) Decision. AoAs are a statutory requirement for ACAT I and ACAT II programs and regulatory for ACAT III programs.  The AoAs support the preparation of the Capability Development Document (CDD), Key Performance Parameters (KPP) and Thresholds within the CDDs and tradeoff analysis.  The Army must complete an AoA prior to the MS A Decision in order to successfully achieve a MS A decision for new start programs.  For new start programs which do not yet have a Program Manager assigned this PE provides central funding prior to a materiel development decision.  The cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and Plan.  Work in this PE is performed by analytical agencies such as U.S. Army TRADOC Analysis Center and U.S. Army Materiel Systems Analysis Activity. The Army is projecting to start work on multiple AoAs beginning in FY 2019, and will assess and fund the highest Army priorities during the year of execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis of Alternatives"
                                    },
                                    "Description": {
                                        "val": "This PE provides funding for analytical support of Analysis of Alternatives (AoA). Based on Department of Defense Instruction (DoDI) 5000.02, AoAs are required to be completed for a new start program prior to its first Milestone (MS) Decision. AoAs are a statutory requirement for ACAT I programs and regulatory for  ACAT II and ACAT III programs.  The AoAs support the preparation of the Capability Development Document (CDD), Key Performance Parameters (KPP) and Thresholds within the CDDs and tradeoff analysis.  The Army must complete an AoA prior to the MS A Decision in order to successfully achieve a MS A decision for new start programs.   For new start programs which do not yet have a Program Manager assigned this PE provides central funding prior to a materiel development decision.  The cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and Plan.  Work in this PE is performed by analytical agencies such as U.S. Army TRADOC Analysis Center and U.S. Army Materiel Systems Analysis Activity. The Army is projecting to start work on Multiple AoAs beginning in FY 2019, and will assess and fund the highest Army priorities during the year of execution."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.354"
                                            },
                                            "Text": {
                                                "val": "Centrally fund AoAs for new program starts that require a materiel development decision. These new programs do not yet have a Program Manager assigned."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.921"
                                            },
                                            "Text": {
                                                "val": "FY 2018 PE funds are planned to support AoAs for new program starts that require a materiel development decision.  Funding will support new programs including Maneuver SHORAD, Enhanced Heavy Equipment Transport System, Terrestrial Layer Intelligence Support for Multi-Domain Battle\/Joint Combined Arms Maneuver, Future Vertical Lift Capability Set 3, Family of Unmanned Aircraft Systems, Vehicle Protection Suite, and Advanced Threat Detection System.  Funding will also support finalizing FY 2017 analysis efforts on programs including Next Generation Biometric Collection Capability, Mobile Protected Firepower, and Degraded Visual Environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.765"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.765"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funding in the amount of $9.765 million supports Analysis of Alternatives (AoA) for new start programs that do not yet have a Program Manager assigned and to augment PM funds where requirement decisions drive changes in scope or increased fidelity to achieve Congressional intent and interest.  AoA initiation, scope, and fidelity are determined through the AROC process prior to the materiel development decision. Current projections indicate multiple new start programs will need to start their AoA in FY 2019, including Unified Network Operations, Common Operating Environment, Cyberspace Situational Understanding, Offensive Cyberspace Operations, Mobile Armored Combat Earthmover, and Synthetic Training Environment.  In addition, several AoA started in FY 2018 will continue to require analysis funding into FY 2019, to include Vehicle Protection Suite, Terrestrial Layer Intelligence Support for Multi-Domain Battle\/Joint Combined Army Maneuver, Future Tactical Unmanned Aircraft System, and Advanced Threat Detection System.  In the Spring of 2018 (on or about 1 May) we will provide the Committee an updated listing of projected FY 2019 new start program AoAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in funding is attributed to economic adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TRADOC Analysis Center (TRAC)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TRADOC Analysis Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Leavenworth, KS"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.899"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.765"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.765"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.664"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Army Materiel Systems Analysis Activity (AMSAA)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "LH"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Materiel Systems Analysis Activity"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Ground, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.022"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.022"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Analytical Support for Analyses of Alternatives"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.218"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.354"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.572"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260712_EC7.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Identify Candidates for FY19 AoA funding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Issue FY19 AoA Funding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify Candidates for FY18 AoA funding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Issue FY18 AoA Funding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Conduct Analysis of Alternatives"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Identify Candidates for FY20 AoA funding"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}