{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-23",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602786A"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Technology"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "59.327"
            },
            "CurrentYear": {
                "val": "39.559"
            },
            "BudgetYearOne": {
                "val": "40.566"
            },
            "BudgetYearOneBase": {
                "val": "40.566"
            },
            "BudgetYearTwo": {
                "val": "44.085"
            },
            "BudgetYearThree": {
                "val": "43.663"
            },
            "BudgetYearFour": {
                "val": "44.692"
            },
            "BudgetYearFive": {
                "val": "45.583"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "317.475"
            }
        },
        "ProgramElementNote": {
            "val": "In FY19, work is realigned from Projects 283 (Airdrop Adv Tech) and VT4 (Expeditionary Mobile Base Camp Technology) to XW5 (Small Unit Expeditionary Maneuver Technology)."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates and develops integrated technologies which improve Soldier and Small Combat Unit survivability, sustainability, mobility, combat effectiveness, and field quality of life and assess the impact of each on Soldier performance. This PE supports the design, development, and improvement of components used for aerial delivery of personnel and cargo (Project 283), combat clothing and personal equipment including protective equipment such as personal armor, helmets, and eyewear (Project H98), combat rations and combat feeding equipment (Project H99), expeditionary base camps (Project VT4), small unit expeditionary maneuver technologies (Project XW5). This PE supports the investigation and advancement of critical knowledge and understanding of Soldier physical and cognitive performance. Project E01 funds Congressional special interest items. The Projects in this PE adhere to Tri-Service Agreements on clothing, textiles, and food with coordination provided through the Cross Service Warfighter Equipment Board, the Soldier and Squad Integrated Concepts Development Team, and the Department of Defense (DoD) Combat Feeding Research and Engineering Board.\n\nEfforts in this PE support the Army Science and Technology Soldier Portfolio.\n\nWork in this PE is related to, and fully coordinated with, PE 0603001A (Warfighter Advanced Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602787A (Medical Technology Initiatives), PE 0602716A (Human Factors Engineering Technology), 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0602784A (Military Engineering Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n \nWork is led, performed, and\/or managed by the Research, Development, and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.403"
                },
                "CurrentYear": {
                    "val": "39.559"
                },
                "BudgetYearOne": {
                    "val": "45.691"
                },
                "BudgetYearOneBase": {
                    "val": "45.691"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.327"
                },
                "CurrentYear": {
                    "val": "39.559"
                },
                "BudgetYearOne": {
                    "val": "40.566"
                },
                "BudgetYearOneBase": {
                    "val": "40.566"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "21.924"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-5.125"
                },
                "BudgetYearOneBase": {
                    "val": "-5.125"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "22.7"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.865"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.1"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.125"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.125"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.011"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2017 Congressional increase in E01 Warfighter Technology Initiatives.\n\nFY19 funding reduction accommodates funding shifts that support higher priority efforts that align to senior leader priorities for Soldier Lethality."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "283"
                    },
                    "ProjectTitle": {
                        "val": "Airdrop Adv Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.396"
                        },
                        "CurrentYear": {
                            "val": "3.818"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.214"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY19, work is realigned from Project 283 (Airdrop Adv Tech) to Project XW5 (Small Unit Expeditionary Maneuver Tech)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project funds the research and investigation of component technologies to enhance cargo and personnel airdrop capabilities for global precision delivery, rapid deployment, and insertion for force projection into hostile regions. Areas of emphasis include parachute technologies, parachutist injury reduction, precision offset aerial delivery, soft landing technologies, and airdrop simulation.\n\nEfforts in this Project support the Army Science and Technology Soldier Portfolio.\n \nThe cited work is consistent with Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.   \n\nWork in this Project is fully coordinated with Program Element (PE) 0603001A (Warfighter Advanced Technology).\n\nIn FY19, work in this project realigns into XW5, titled Small Unit Expeditionary Maneuver Tech, along with VT4 Expeditionary Mobile Base Camp Technology."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airdrop\/Aerial Delivery Research and Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that enhance payload extraction, increase parachute gliding capabilities, and mature delivery accuracy of cargo aerial delivery systems that support varying payload weights. Research in the area of novel parachute materials will provide increased capabilities for cargo and personnel aerial delivery systems. This effort will support an investigation of new Modeling and Simulation (M&S) tools in order to develop validation methods for airdrop concepts. This effort also investigates technologies that advance airborne personnel insertion safety and security. This work is coordinated with PE 0603001A\/Project 242\/XW6. In Fiscal Year (FY) 2019, work in this Project is realigned into XW5, titled Small Unit Expeditionary Maneuver Tech, along with H99, Joint Service Combat Feeding Technology and VT4, Expeditionary Mobile Base Camp Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.396"
                                            },
                                            "Text": {
                                                "val": "Study, design, and conduct experiments with precision aerial delivery software and hardware components to enhance high altitude precision aerial delivery capabilities in Global Positioning System (GPS)-denied areas, urban terrains, and jungle environments; investigate novel textiles for parachute applications that enable material properties to be customized which can enhance parachute performance; investigate non-destructive inspection methodologies for helicopter sling load cordage components; refine and validate software algorithms for static line reserve parachute automatic activation technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.818"
                                            },
                                            "Text": {
                                                "val": "Conduct modeling & simulation (M&S) supporting aerial delivery system analyses to establish a baseline for personnel and cargo airdrop systems utilizing several high- and low-fidelity M&S tools; investigate and analyze results of full-scale wind tunnel experiments and methods for determining parachute shelf\/service life; mature software algorithms that support the static line reserve parachute automatic activation sensor technologies in order to better detect parachute malfunctions and record and analyze jump data; investigate precision airdrop enhancements that will expand GPS-denied capabilities to include nighttime operations and design control systems to enhance low-cost airdrop system accuracy."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding in this Project will be moved to Project XW5, accomplishment title Aerial Delivery, in order to meet senior leader priorities for Soldier Lethality."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "E01"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Technology Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.7"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.700"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Warfighter Technology Applied Research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "H98 clothing and equipment"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced active environmental control technology for expeditionary mobile base"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "6"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier protection"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "1.7"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H98"
                    },
                    "ProjectTitle": {
                        "val": "Clothing & Equipm Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.979"
                        },
                        "CurrentYear": {
                            "val": "27.45"
                        },
                        "BudgetYearOne": {
                            "val": "30.393"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.393"
                        },
                        "BudgetYearTwo": {
                            "val": "33.821"
                        },
                        "BudgetYearThree": {
                            "val": "33.483"
                        },
                        "BudgetYearFour": {
                            "val": "34.548"
                        },
                        "BudgetYearFive": {
                            "val": "35.236"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "220.910"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates fibers, textiles, components, and materials focused on enhancing Soldier survivability from combat threats (flame and thermal, blast and ballistic, multispectral sensor, and laser threats) and environmental threats (e.g., cold, heat, wet, vector, antimicrobial, etc.) to increase operational effectiveness while decreasing the Soldier's physical and cognitive burden. Included are investigations of technologies, novel materials, and test methods related to personnel armor, helmets, hearing protection, eyewear, uniforms, handwear, footwear, and other clothing and individual equipment items. This Project also supports the investigation and development of novel combat identification technologies, electro-textiles for power generation and distribution, the study and exploration of algorithms for autonomous micro and nano robotics and sensors, and human-machine teaming technologies to enhance the dismounted Soldier's Situational Awareness (SA) and Manned-Unmanned Teaming (MUMT) with autonomous systems. In addition, this Project supports the development and refinement of essential analytic tools needed to predict and\/or assess the combat effectiveness of next generation Soldier systems to identify and develop methods to assess human responses to sensory, physical, cognitive, and affective stimuli and stressors.\n\nEfforts in this Project support the Army Science and Technology Soldier Portfolio.\n\nWork in this Project is coordinated with Program Element (PE) 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0603001A (Warfighter Advanced Technology), PE 0602787A (Medical Technology Initiatives), and PE 0602716A (Human Factors Engineering Technology).\n  \nThe cited work is consistent with the S&T priorities of the U.S. Chief of Staff, Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Soldier Blast, Ballistic, and Sensory Protection"
                                    },
                                    "Description": {
                                        "val": "This effort supports the investigation of novel materials, component design, and material modeling to design and develop technologies that protect Soldiers against ballistic, blast, and directed energy threats. This effort utilizes a cross-disciplinary, human-focused approach to develop technologies which optimize tradeoffs in ballistic and blast protective component design. This effort is fully coordinated with PE 0602787A\/Project FH2, PE 0602787A\/Project VB3, PE 0602787A\/Project 874, PE 0602618A\/H80, PE0602105A\/Project H84, PE0602716A\/Project H70, PE 0603001A\/Project J50, and PE 0603001A\/Project FF6. This effort supports the Force Protection Soldier & Small Unit capability research and addresses the Army top challenge of easing overburdened Soldiers in small units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.779"
                                            },
                                            "Text": {
                                                "val": "Continue the development of the biofidelic neck model which will provide a more accurate simulation of the dynamic behavior of the human neck when encountering blast impacts; develop and validate novel fibers, textiles, and components that enhance ballistic protection performance in equipment while reducing Soldier thermal and weight burden; develop enhanced materials, components, and models that mitigate Soldier injuries from blunt impact to head and extremities; continue the development of materials, processes, experiments, and validation tools that reduce threat of injury to the head from ballistic penetration or behind-the-helmet blunt trauma."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.452"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments to determine the efficacy of a combat helmet ballistic test methodology tied to modeling capabilities that correlate results with behind helmet blunt trauma injury; investigate new energy absorbing materials and subsystem components for helmet blunt impact protection systems; mature casualty reduction assessment tools and modeling capability; conduct experiments on next generation fiber technologies and material processing techniques with potential for enhancing fiber strength and advancing ballistic protection at reduced weight; validate pixelated lens technology applied on a ballistic fragmentation eyewear lens platform with ability to respond and protect against point and broadband light sources; determine the ability to detect and locate exposure to non-visible laser sources and other threats; investigate high transmission laser eye protection technology and evaluation procedures; conduct experiments on hard armor torso protection ceramic and composite backing materials to explore significant weight reduction opportunities; fund research to investigate alternative or new test methods and corresponding modeling and simulation for torso protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.33"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.33"
                                            },
                                            "Text": {
                                                "val": "Will research new technologies for an integrated, single lens that incorporates multiple capabilities into the Soldier vision protection system, including variable transmission lenses with flash protection, laser dazzle and frequency agile pulsed\/continuous wave laser protection, and an environmentally- hardened, ballistic fragmentation platform lens with high visual transmission; design and develop cost effective and repeatable laboratory test method that is capable of evaluating the performance of head-borne equipment in a simulated free-field blast overpressure environment; develop research tools to assist the development of a transfer function enabling the scaling of head injury criteria from animal testing to humans to inform future helmet performance requirements based on injury biomechanics; investigate pre-stress and temperature conditioning methods to preserve and\/or increase ballistic material mechanical properties during composite laminate processing to enhance ballistic performance; research fundamental understanding of the role of processing-structure-property relationships in ballistic composites, in particular, the role of microstructure on ballistic performance; investigate the penetration mechanics and effectiveness of sphere projectiles against woven armor packages via deconstruction and analysis of individual fabric plies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction in funding as the effort supporting casualty reduction assessment tools and modeling is ending."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Vision Protection and Enhancement"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the investigation of technologies that provide eye protection against battlefield threats. This effort supports the Force Protection Soldier and Small Unit capability research and addresses the Army top challenge of easing overburdened Soldiers in small units. This effort is fully coordinated with PE 0602787A\/Project FH2, PE 0602787A\/Project VB3, PE 0602787A\/Project 874, PE 0602618A\/H80, PE0602105A\/Project H84, PE0602716A\/Project H70, PE 0603001A\/Project J50, and PE 0603001A\/Project FF6. In Fiscal Year (FY) 18, this effort will be incorporated into this PE's Soldier Blast, Ballistic, and Sensory Protection Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.9"
                                            },
                                            "Text": {
                                                "val": "Investigate the application of the pixelated lens technology on a ballistic fragmentation eyewear lens platform; design proof of concept for enhanced Soldier vision and auditory system technology; conduct experiments to refine the ability to respond and protect against point and broadband light sources using a pixilated lens approach; investigate the ability to detect and locate exposure to non-visible laser sources and other threats; investigate how specific novel visual protective technologies impact visual acuity and Soldier perceptual capabilities and determine the impact on a wide range of Soldier tasks such as movement from indoor to outdoor environments, marksmanship, and move-shoot."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Measurement, Prediction, and Improvement of Soldier Performance"
                                    },
                                    "Description": {
                                        "val": "This effort provides a comprehensive investigation of human science methods (psychological, anthropometric, and psychophysical) and biomechanical models to assess human responses to sensory, physical, cognitive, and affective stimuli and stressors. This investigation supports the development of human systems design concepts for Soldier equipment and enhances Soldier and small unit physical and cognitive performance. This work is collaborative with the Army Research Laboratory PE 0602716A\/H70 and the Medical Research and Materiel Command PE 0602787A\/Project FH2, PE 0602787A\/Project VB3, and PE 0602787A\/Project 874. This effort supports the Force Protection Soldier & Small Unit capability research and addresses the Army top challenge of easing overburdened Soldiers in small units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.2"
                                            },
                                            "Text": {
                                                "val": "Study the effects of incorporating physical, cognitive, and social performance metrics into the SSEA human performance tools to identify their impacts on equipment and mission tasks; investigate emerging human science measures and metrics such as load mitigation, encumbered movement impact to mission performance, and assessment of physical and cognitive augmentation to increase understanding of human performance in a military environment; conduct experiments to increase understanding of factors that optimize human performance in biomechanics, anthropometry, and cognition measures; validate predictive data with Soldier performance tools and simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.863"
                                            },
                                            "Text": {
                                                "val": "Investigate the utility of non-invasive physical human performance metrics data collection with respect to specific Warfighter tasks; continue to conduct experiments that monitor, predict, and optimize cognitive, physical, and social measures of the Soldier; validate common criteria for measures of Soldier performance while conducting military relevant tasks; investigate the validity, reliability, and sensitivity of obstacles utilized within the Load Effects Assessment Program (LEAP); validate interactions and physical interfaces between the Soldier, equipment, and physical tasks; mature benchtop representation of the Warfighter?s gut microbiome model to investigate and characterize the effects of dietary inputs on the performance of a Soldier?s internal anatomy; research and conduct experiments to understand the physiological mechanisms necessary to advance a Soldier?s natural physical and cognitive abilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.828"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.828"
                                            },
                                            "Text": {
                                                "val": "Will design tools to predict Soldier comprehension of information in a dense urban and technology laden terrain by conducting experiments of cognitive function in immersed\/simulated environments and then will develop predictive algorithms for decision making at platoon-level operations; investigate and validate human performance metrics for system design in support of emerging situational awareness efficacy of cuing techniques in augmented and mixed reality as well as the intervention of neuro-stimulation to optimize cognitive performance; investigate and validate human performance metrics for system design in support of emerging mobility enhancement to determine the most efficient control scheme and joint augmentation needs of the lower extremity; investigate and validate human performance metrics in support of emerging expeditionary maneuver support by maturing an in vitro gut microbiome model that could deter gastrointestinal distress; design digital humans to inform space claims and human factors engineering considerations for all platforms inhabited or utilized by a Soldier."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to support work in the area of exoskeleton control schemes and joint augmentation needs of the lower extremity."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advancements in Fibers, Textiles, and Materials for Soldier Protection"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on the investigation of technologies and test methods that aid in the design and development of multifunctional protective materials for Soldier clothing and individual equipment. This effort includes the development and maturation of flame, thermal, environmental, and multispectral concealment capabilities, as well as novel desalinization and purification technologies for individual Soldier hydration, combat identification technologies, and electro-textiles for power generation and distribution. This effort supports the Force Protection Soldier and Small Unit capability research. This effort is fully coordinated with PE0602105A\/Project H84, PE0602716A\/Project H70, and PE 0603001A\/Project J50."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.1"
                                            },
                                            "Text": {
                                                "val": "Develop second generation materials and combat uniform components that significantly reduce Soldier thermal signature; investigate novel textile technologies to provide protection against microbes, insect-borne diseases, climate extremes, flame\/thermal threat, and microwave directed energy threats; continue maturation of improved Soldier combat identification technologies and electrotexiles for power generation\/distribution and personal thermal management; investigate use of improved models and simulated skin samples for improved burn injury prediction of human skin; identify, design, and develop lightweight personal hydration and thermal management concepts to enhance dismounted Soldier performance in jungle\/tropical environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.135"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop desalination capabilities for individual Soldier hydration systems; design and develop novel textile architectures and weaves to provide protection against microwave frequency hazards through reflection and scattering of directed energy threats; investigate quantum dots and novel film applications as possible mechanisms to improve combat identification; investigate and develop microrectenna arrays for Soldier worn combat identification and energy conversion; investigate thermally adaptive fibers and technologies which provide improved thermal protection in cold and extreme cold weather environments; investigate carbon based conductive fibers and flexible materials for incorporation into textiles for optimized Soldier worn energy distribution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.76"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.76"
                                            },
                                            "Text": {
                                                "val": "Will investigate and develop optical film (VOF) technology for standoff-based signature concealment in a variety of spectral ranges to achieve concealment performance for Soldier uniforms; investigate multifunctional materials suitable for signature management\/decoy and high mobility mission command applications to enable on-demand resupply capabilities; develop novel textile architectures and weaves to provide protection against microwave frequency hazards through reflection and scattering of directed energy threats; investigate the principles of motion versus conspicuity effects on observer perception and apply these principles to simulated real-world operational scenes to evaluate Soldier camouflage; investigate and develop novel sensor systems for measuring heat flux during system and sub-system flame resistance testing to capture the most susceptible burn injury body regions; mature infrared microrectenna arrays to demonstrate wireless power transfer and data communications embedded in the Soldier clothing and individual equipment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to support the development of optical film (VOF) technology for standoff-based signature concealment for Soldier uniforms."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Situational Awareness Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates novel technologies that enhance the dismounted Soldier and Small Unit?s Situational Awareness (SA) during missions.  Research in the area of advanced algorithms for Soldier deployed sensors and robotics will provide advanced autonomy to enable Manned-Unmanned Teaming (MUM-T) capabilities for the dismounted Small Unit. This effort also investigates advanced human-machine teaming technologies to minimize warfighter dedicated control of robotic assets. Work in this Project is coordinated with Program Element (PE) 0603001A (Warfighter Advanced Technology)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.475"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.475"
                                            },
                                            "Text": {
                                                "val": "Will investigate and mature advanced algorithms and sensors for micro and nano robotic systems to enhance autonomy and provide collision avoidance, environmental sensing, and global positioning system (GPS) denied navigation capabilities; will investigate novel Soldier-robotic interfaces and interaction modalities to enhance human-machine teaming; will investigate micro and nano sensors and robotic platforms, payloads, and architectures to enable Manned-Unmanned Teaming of autonomous systems with dismounted Soldiers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports S&T strategy of increased Soldier Situational Awareness in a variety of hostile environments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H99"
                    },
                    "ProjectTitle": {
                        "val": "Joint Service Combat Feeding Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.867"
                        },
                        "CurrentYear": {
                            "val": "5.051"
                        },
                        "BudgetYearOne": {
                            "val": "4.896"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.896"
                        },
                        "BudgetYearTwo": {
                            "val": "5.007"
                        },
                        "BudgetYearThree": {
                            "val": "5.157"
                        },
                        "BudgetYearFour": {
                            "val": "5.41"
                        },
                        "BudgetYearFive": {
                            "val": "5.518"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "35.906"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops novel ration packaging, combat feeding equipment\/systems, and advanced food processing technologies to prolong shelf-life. This Project also investigates technologies that detect food safety hazards on the battlefield and enhance quality, nutritional content, and the variety of food items in military rations. Efforts funded in this project support all Military Services, the Special Operations Command, and the Defense Logistics Agency. The Army serves as Executive Agent for this Department of Defense (DoD) program, with oversight and coordination provided by the DoD Combat Feeding Research and Engineering Board. Technologies developed within this effort transition to Program Element (PE) 0603001A\/Project C07 for maturation.\n\nEfforts in this Project support the Army Science and Technology Soldier Portfolio.\n\nWork in this Project is fully coordinated with PE 0602787A (Medical Technology) and PE 0603001A (Warfighter Advanced Technology).\n \nThe cited work is consistent with the S&T priorities of the U.S. Chief of Staff, Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Combat Feeding Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops stabilization techniques and nutrient compositions to maximize the Warfighter's cognitive and physical performance while minimizing nutritional degradation to optimize the Warfighter's health on the battlefield. This effort investigates technologies in support of the Defense Health Agency Veterinary Services (DHA VS) to enhance field detection and identification capabilities of chemical and biological threats in foods. This effort supports the design and development of new threat detection tools and sensors for food inspectors. This effort additionally investigates equipment and energy technologies to expand the capability and reduce the logistics footprint of Joint Service field feeding operations in a wide range of environmental and operational contexts. This work is coordinated with PE 0602787A\/Project 869 and PE 0603001A\/Project C07."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.867"
                                            },
                                            "Text": {
                                                "val": "Explore ration nutritional strategies for components targeted at optimizing the gut microbiome to reduce gastrointestinal distress; investigate refrigeration technologies for reduced energy consumption and modularity; investigate ration compounds to promote recovery and optimize performance; research the detection, prevention, and reduction of pathogenic bacteria and toxins in foods; investigate novel self-repairing\/heating packaging materials to enhance food protection and quality; explore technologies for three-dimensional printing of ration components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.051"
                                            },
                                            "Text": {
                                                "val": "Develop ration formulations containing proven nutritional strategies to optimize the gut microbiome and improve warfighter cognitive performance under stressful conditions; investigate heat transfer methods to enable high efficiency operation of field feeding appliances while reducing power requirements; identify nutritional interventions that promote recovery from strenuous exercise or mitigate oxidative stress; investigate portable biosensor detection platforms to improve food safety; design alternative packaging configurations that decrease ration weight; validate improved nutrient content of foods processed using non-thermal or low-thermal methods to improve warfighter nutritional status; develop model food formulations that retain desired sensory characteristics after creation via three-dimensional (3D) printing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.896"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.896"
                                            },
                                            "Text": {
                                                "val": "Will study, design, and conduct experiments investigating technologies capable of rapidly detecting adulterated food items prior to consumption, particularly in limited re-supply and austere environments; conduct clinical studies to determine the effect of targeted nutritional strategies on gut and immune health; investigate food processing technologies that increase nutrient retention while meeting shelf life requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction in funding as heat transfer methods effort is ending."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VT4"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Mobile Base Camp Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.385"
                        },
                        "CurrentYear": {
                            "val": "3.24"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5.625"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY19, work is realigned from Project VT4 (Expeditionary Mobile Base Camp Technology) to Project XW5 (Small Unit Expeditionary Maneuver Tech)"
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and validates fully integrated holistic expeditionary base camp (EBC) capabilities with mission-specific plug and play components, subsystems, and modules designed to optimize manpower requirements, enhance situational awareness, increase Soldier readiness and survivability, optimize habitation, reduce logistics footprint, enhance supportability, and reduce cost. EBC systems provide an operational capability for small combat units (battalion and below) and Soldiers in varying environments, which are rapidly deployable and re-locatable, require no Military Construction, and need limited materiel handing support. This Project matures technologies that can be combined to create mission specific lab demonstrators and develops metrics and methodologies to measure performance characteristics.  \n\nEfforts in this Project support the Army Science and Technology Soldier Portfolio.\n\nWork in this Project is fully coordinated with Program Element (PE) 0602784A and 0603734A (Military Engineering Technology), PE 0603001A (Warfighter Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603125A (Combating Terrorism Technology Development), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nIn Fiscal Year 2019, work in this Project realigns into XW5, titled Small Unit Expeditionary Maneuver Tech, along with 283 Airdrop Adv Tech."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Base Camp Component Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates base camp component interoperability and matures and scales component technologies for an integrated holistic base camp concept. This effort supports the basing sustainment and logistics capability investigation. This work is coordinated with PE 0603001A\/Project VT5\/XW5, PE 0602786A\/Project H99 and is coordinated with PE 0602784A\/Project T40, PE 0603734A\/Project T08, PE 0603004A\/Project L97, PE 0603005A\/Project 497, PE 0603125A\/Project DF5, and PE 0603772A\/Project 101. In FY19, work in this Project realigns into XW5, titled Small Unit Expeditionary Maneuver Tech, along with 283, titled Airdrop Adv Tech and H99, titled Joint Service Combat Feeding Technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.385"
                                            },
                                            "Text": {
                                                "val": "Investigate tradeoffs between base camp efficiency, scalability, and Soldier quality of life for optimal readiness and minimal degradation to missions; conduct experiments on microscale alternative field service energy technologies to enable self-sufficient base camps that decrease the logistical burden and cost; investigate novel thermal insulation material and coating technologies for rigid wall tactical shelters to enhance shelter energy efficiency; investigate and design novel solutions to characterize and mitigate emerging ballistic threats to integrated shelter basing systems including potential reactive technologies to increase overmatch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.24"
                                            },
                                            "Text": {
                                                "val": "Identify operational effectiveness measures and explore correlation between expeditionary maneuver, base camp sustainment, and operational quality of life optimized for Soldier readiness in order to incorporate mission effectiveness into the development of self-sufficient base camp technology; investigate alternative energy technologies to improve efficiency, durability, and adaptability to a base camp environment; mature thermal insulation material to enhance energy efficiency for expeditionary shelter; investigate technical approaches for expeditionary structures to mitigate visual, thermal, and electromagnetic infrared signatures; validate ballistic protective shelter material and design technologies with simulated emerging threats; investigate concepts of additive manufacturing technologies for in-theatre shelter component fabrication to reduce overall logistics tail."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding in this Project will be moved to Project XW5, accomplishment title Expeditionary Maneuver, in order to meet senior leader priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XW5"
                    },
                    "ProjectTitle": {
                        "val": "Small Unit Expeditionary Maneuver Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.277"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.277"
                        },
                        "BudgetYearTwo": {
                            "val": "5.257"
                        },
                        "BudgetYearThree": {
                            "val": "5.023"
                        },
                        "BudgetYearFour": {
                            "val": "4.734"
                        },
                        "BudgetYearFive": {
                            "val": "4.829"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.120"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY19, work is realigned from Projects 283 (Airdrop Adv Tech) and VT4 (Expeditionary Mobile Base Camp Technology) to XW5 (Small Unit Expeditionary Maneuver Technology)."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Small Unit Expeditionary Maneuver Technology Project funds the research and investigation of innovative and emerging technologies which provide maneuver capabilities such as precision aerial delivery of cargo and personnel and force projection platforms enabling mission command in all operating environments. This Projects provides trusted tactical sustainment for dispersed units in highly mobile dismounted Manned-UnManned Teaming (MUM-T) operations and other complex operating environments. Efforts funded in this Project support all Military Services, the Special Operations Command, and the Defense Logistics Agency. Technologies developed within this effort transition to Program Element (PE) 0603001A\/Project XW6 for maturation.\n\nEfforts in this Project support the Army Science and Technology (S&T) Soldier Portfolio.\n\nThe cited work is consistent with the S&T priorities of the U.S. Army Chief of Staff, Assistant Secretary of Defense for Research and Engineering priority focus areas, and the Army Modernization Strategy.\n\nProject XW5 combines the efforts of Project 283 and VT4 in FY19 to create an integrated expeditionary maneuver research focus area."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerial Delivery"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops technologies that enable Soldier and Small Unit mission readiness, survivability, and effectiveness during highly mobile, dispersed operations that may occur in the absence of conventional logistics support. This effort investigates technologies that enhance equipment, materiel, and personnel aerial delivery in an Anti-Access, Area Denial (A2\/AD) environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.777"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.777"
                                            },
                                            "Text": {
                                                "val": "Will study, design, and conduct experiments with precision aerial delivery software and hardware components to enhance precision aerial delivery capabilities and assure re-supply via manned and unmanned systems in A2\/AD environments; conduct research in the area of maneuver assistance in personnel airdrop systems to accelerate the certification of airborne jumpers from novice to master jumper."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding was moved from Project 283, accomplishment title Airdrop\/Aerial Delivery Research and Technology, in order to meeting senior leader priorities for Soldier Lethality."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Expeditionary Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops technologies that enable Soldier and Small Unit mission readiness, survivability, and effectiveness during highly mobile, dispersed operations that may occur in the absence of conventional logistics support. This effort investigates system designs and technologies to enable mission command through highly mobile expeditionary maneuver platforms, signature management, and production of energy\/supplies at the point of consumption to provide small units with the capability to move rapidly, while providing improved protection and extended range."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will study, design, and conduct experiments that investigate autonomous deployment methodologies, additive manufacturing of components used in expeditionary maneuver platforms that support expeditionary operations in all environments, and concepts for rapidly-deployable platforms that allows for integration of technologies that will improve protection and minimize resource consumption."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding was moved from Project VT4, accomplishment title Expeditionary Base Camp Component Technologies, in order to meeting senior leader priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}