{
    "id": "2019-DoDHumanResourcesActivity-PB-0400-MJBOOK-0-2-32521504027ebdb13752e3b88d1670fe1a293063bafd6431aca8a5e28b29fb53-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "DoD Human Resources Activity",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605021SE"
        },
        "ProgramElementTitle": {
            "val": "Homeland Personnel Security Initiative"
        },
        "R1LineNumber": {
            "val": "124"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "DoD Human Resources Activity"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.286"
            },
            "PriorYear": {
                "val": "1.658"
            },
            "CurrentYear": {
                "val": "4.893"
            },
            "BudgetYearOne": {
                "val": "0.296"
            },
            "BudgetYearOneBase": {
                "val": "0.296"
            },
            "BudgetYearTwo": {
                "val": "0.295"
            },
            "BudgetYearThree": {
                "val": "0.295"
            },
            "BudgetYearFour": {
                "val": "0.301"
            },
            "BudgetYearFive": {
                "val": "0.307"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)). RDTE funding in FY18 was applied to the start-up costs for expanding the recruiting database provided to all Military Services for use with officer and enlisted recruiting and to explore the merits of expanding use to civilian recruiting as proposed in a Force of the Future initiative. Specifically, the funds would provide contractor support for the development of a pilot expanded database, procurement of additional directory lists, and the purchase of IT hardware and software for the development of a user- friendly interface for accessing the data.  FY19 RDTE funds in HSPD-12 will be applied to research and investigation of multifactor authentication alternatives that may allow DoD to supplement current public key infrastructure and DoD Self-Service Logon authentication solutions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "1.658"
                },
                "CurrentYear": {
                    "val": "4.893"
                },
                "BudgetYearOne": {
                    "val": "0.296"
                },
                "BudgetYearOneBase": {
                    "val": "0.296"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "1.658"
                },
                "CurrentYear": {
                    "val": "4.893"
                },
                "BudgetYearOne": {
                    "val": "0.296"
                },
                "BudgetYearOneBase": {
                    "val": "0.296"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "SummaryExplanation": {
                "val": "Recruiting Databases:  OPA JAMRS will continue to operate and maintain the expanded JAMRSdb in FY19 and beyond using O&M,DW funding."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "01"
                    },
                    "ProjectTitle": {
                        "val": "Homeland Security Presidential Directive (HSPD-12) Initiative\/Recruiting Databases"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.286"
                        },
                        "PriorYear": {
                            "val": "1.658"
                        },
                        "CurrentYear": {
                            "val": "4.893"
                        },
                        "BudgetYearOne": {
                            "val": "0.296"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.296"
                        },
                        "BudgetYearTwo": {
                            "val": "0.295"
                        },
                        "BudgetYearThree": {
                            "val": "0.295"
                        },
                        "BudgetYearFour": {
                            "val": "0.301"
                        },
                        "BudgetYearFive": {
                            "val": "0.307"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Homeland Security Presidential Directive (HSPD-12) Initiative:  The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)). HSPD-12 requires rapid electronic authentication for all Government employees, uniformed individuals and contractors. Real Time Automated Personnel Identification System (RAPIDS) is the infrastructure that supports the Uniformed Services identification card, provides on-line updates to DEERS and issues the CAC to Service members, civilian employees, and eligible contractors, thus providing an enterprise-wide credential for both physical and logical access to DoD facilities and networks. CAC uses the DEERS database for authentication and personnel information.\n\nRecruiting Databases Project: FY 2018 funds were directed to completing the expansion of recruiting database from the pilot started in FY 2017.  It will be provided to all Military Services for use with officer and enlisted recruiting and to explore the merits of expanding use to civilian recruiting.  Specifically, the funds will provide contractor support to research efforts on expanding the JAMRS Recruiting database for more precise direct messaging and run micro-targeting pilots with third party data buys."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Enrollment Eligibility Reporting System\/HSPD-12\/Recruiting Databases"
                                    },
                                    "Description": {
                                        "val": "The Department of Defense Human Resources Activity (DHRA) is a DoD-wide Field Activity chartered to support the Under Secretary of Defense for Personnel and Readiness (USD (P&R)).  HSPD-12 requires rapid electronic authentication for all Government employees, uniformed individuals and contractors.\n\nThe Office of People analytics (OPA) JAMRS Recruiting Database (JAMRSdb) - Recruiting database provided to all Military Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.658"
                                            },
                                            "Text": {
                                                "val": "To support HSDP-12, FY17 RDTE funds will be expended to implement probabilistic search to prevent the duplication of identities and reduce help desk  calls and manual record corrections. Performing a probabilistic search before adding a person to the PDR promotes better data quality and improves identity assurance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.893"
                                            },
                                            "Text": {
                                                "val": "HSPD-12:  Funds in HSPD-12 were applied to the DoD NextGen USID to allow the Department to replace the existing Teslin ID cards that are highly susceptible to counterfeiting due to an outdated design and lack newer anti-counterfeiting technology.  This project was deferred from FY 2017 to accommodate higher priority identity management task for probabilistic search.  Completing the USID redesign utilizing the latest technical and printing techniques on a plastic substrate will significantly improve card quality and reduce fraud.\n\nRecruiting Databases:  FY18 funds were directed to completing the expansion of recruiting database from the pilot started in FY17. It will be provided to all Military Services for use with officer and enlisted recruiting and to explore the merits of expanding use to civilian recruiting. Specifically, the funds will provide contractor support to research efforts on expanding the JAMRS Recruiting database for more precise direct messaging and run micro-targeting pilots with third party data buys.\n\nRecruiting Databases ($4.500 million):  \n- Research efforts on expanding the JAMRS Recruiting Database for more precise direct messaging.\n- Run micro-targeting pilots with third party data buys."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.296"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.296"
                                            },
                                            "Text": {
                                                "val": "HSPD-12:  FY 2019 RDTE funds in HSPD-12 will be applied to research and investigation of multifactor authentication alternatives that may allow DoD to supplement current public key infrastructure and DoD Self-Service Logon authentication solutions.\n\nRecruiting Databases:  OPA JAMRS will continue to operate and maintain the expanded JAMRSdb in FY 2019 and beyond using O&M, DW funding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "HSPD-12:  Decrease is due to completion of DoD NextGen USID redesign.\n\nRecruiting databases:  Decrease of $4.5M because enhanced Recruiting database will be maintained with a different appropriation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "HSPD-12:  Existing contract vehicles in place\/General Services Administration for Commercial Off The Shelf (COTS)."
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "HSPD-12:  RDTE funds in HSPD-12 will extend through the FYDP and be applied to research and investigation of multifactor authentication alternatives that may allow DoD to supplement current public key infrastructure and DoD Self-Service Logon authentication solutions."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Homeland Personnel Security Directive (HSPD-12) Initiative\/Recruiting Databases"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "IDIQ"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Gulf Coast Enterprise"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pensacola, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.286"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.658"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.296"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Homeland Security Presidential Directive (HSPD-12)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Recruiting Databases"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "HSPD-12:  FY19 RDTE funds in HSPD-12 will be applied to research and investigation of multifactor authentication alternatives that may allow DoD to supplement current public key infrastructure and DoD Self-Service Logon authentication solutions.\n\nRecruiting Databases:  OPA JAMRS will continue to operate and maintain the expanded JAMRSdb in FY 2019 and beyond using O&M, DW funding."
                        }
                    }
                }
            ]
        }
    }
}