{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2493f0919bca3c9887c2149e77e4bc805cb5ac3396a194d2f3cb8b6ccd5038c5-9",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604294D8Z"
        },
        "ProgramElementTitle": {
            "val": "Trusted and Assured Microelectronics"
        },
        "R1LineNumber": {
            "val": "97"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "83.626"
            },
            "BudgetYearOne": {
                "val": "233.142"
            },
            "BudgetYearOneBase": {
                "val": "233.142"
            },
            "BudgetYearTwo": {
                "val": "237.209"
            },
            "BudgetYearThree": {
                "val": "228.272"
            },
            "BudgetYearFour": {
                "val": "239.994"
            },
            "BudgetYearFive": {
                "val": "241.626"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) implements, maintains, and updates the DoD’s long-term microelectronics strategy and places emphasis on incentivizing and proving new microelectronics technology solutions.  FY 2019 funds in the amount of $2.000 million are being transferred from PE 0603826D8Z for the continuation of Joint Federated Assurance Center (JFAC) hardware and software assurance and integrity analysis activities planned across the Future Years Defense Program (FYDP).\n\nRecognizing that a trusted and assured supply of microelectronics is a U.S. Government (USG)-wide concern, this activity will interface with interagency partners to take into account interagency requirements, opportunities for collaboration, and strategic decisions that can be made to limit the overall cost of these requirements to the USG.  Its goal is to eliminate the Department of Defense (DoD)’s reliance on sole source foundries for trusted state-of-the-art (SOTA) microelectronics.  It supports activities to ensure critical and sensitive integrated circuits are available to meet the DoD’s needs.  It refines strategies and management planning activities implementing three integrated, complementary solutions that:  (1) protect the Intellectual Property (IP) of microelectronics components; (2) improve capabilities to evaluate and validate the trust and assurance of microelectronic parts and advance standards to incentive the commercial marketplace to recognize hardware assurance as a competitive design standard; and (3) develop and demonstrate alternative approaches to the DoD Trusted Foundry program to assure the microelectronics supply chain in order to enable broader DoD access to commercial SOTA microelectronics technology.\n\nThis activity is being led by the Under Secretary of Defense for Research and Engineering.  This activity is conducted, in coordination with the JFAC Steering Committee and the Science and Technology (S&T) Advisory Board, by performers, such as the JFAC service providers, Defense Microelectronics Activity (DMEA), the Defense Advanced Research Programs Agency (DARPA), and other DoD and Intelligence Community S&T organizations and laboratories in the area of hardware assurance (HwA) and software assurance (SwA).  It is integrating with, and supporting, the functions of the DoD Trusted Foundry Program, the Trusted Supplier accreditation program, JFAC, and related HwA and SwA S&T actions.  This activity is also expected to maintain and update the DoD long-term microelectronics strategy based on feedback from the execution of this PE and enable and leverage commercial and academic relationships as necessary to fulfill this mission."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "83.626"
                },
                "BudgetYearOne": {
                    "val": "81.712"
                },
                "BudgetYearOneBase": {
                    "val": "81.712"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "83.626"
                },
                "BudgetYearOne": {
                    "val": "233.142"
                },
                "BudgetYearOneBase": {
                    "val": "233.142"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "151.430"
                },
                "BudgetYearOneBase": {
                    "val": "151.430"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment of funds"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.025"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.025"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Increase for Priority Requirements"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "151.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "151.020"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.565"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.565"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 funds in the amount of $2.000 million are being transferred from PE 0603826D8Z for the continuation of JFAC hardware and software assurance and integrity analysis activities planned across the FYDP.  An additional $151.020 million was added to support the following: secure design environments; electronic data automation (EDA) tools; third-party IP and USG IP development; persistent expertise; prototype development; advanced foundry research and development (R&D) access; state-of-the-practice (SOTP) foundry access; process IP procurement and transition; tool development; enabling integrated circuit manufacturing; and assessment of supply security and protection."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "645"
                    },
                    "ProjectTitle": {
                        "val": "Verification & Validation (V&V) Capabilities and Standards for Trust"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "41.524"
                        },
                        "BudgetYearOne": {
                            "val": "41.773"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.773"
                        },
                        "BudgetYearTwo": {
                            "val": "41.007"
                        },
                        "BudgetYearThree": {
                            "val": "35.607"
                        },
                        "BudgetYearFour": {
                            "val": "36.382"
                        },
                        "BudgetYearFive": {
                            "val": "36.831"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project improves microelectronics test and verification methodologies in support of verifying the trust and assurance of parts and develops standards and practices to foster commercial development of secure, trusted and assured parts.  Verification and test technologies are required to provide direct program support for microelectronics assurance verification when DoD Trusted Foundry Program options are not available.  Core technical laboratories and other HwA and SwA capabilities are chartered as a JFAC to provide this support.  Out-year demands will require an increase in capacity, which will take the form of additional personnel and\/or equipment to permit scaling of microelectronics assessment capabilities.  Challenges have been identified, to include the ability to analyze leading-edge technology nodes (<45 nanometers (nm)), throughput\/time required for analysis, ability to analyze third-party IP contained in microelectronic components, and analysis of non-application specific integrated circuit (ASIC) components that are increasingly being used for agility, e.g., Field-Programmable Gate Arrays (FPGAs).  This project addresses these gaps in current technical capabilities, in coordination with the JFAC, which prioritizes this investment as required to meet the realized and projected out-year demand for JFAC services.  Three capability areas core to microelectronics analysis and verification will be improved:\n•\tPhysical verification, i.e., destructive analysis of integrated circuits and printed circuit boards \n•\tFunctional analysis, i.e., non-destructive screening\/verification of select, critical parts\n•\tDesign verification, i.e., verification\/assurance of designs, IP, netlists, bitstreams, firmware, etc.\n\nThese improvements address two primary attributes: (1) technical capability including laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) the capacity to perform microelectronics assessments.\n\nThis project develops and matures assurance mitigations, evaluates the effectiveness of protections of IP in support of integrity, and develops and validates obfuscation and disaggregation technologies.  The project will address physical validation tool and capability development, design software validation tool development, counterfeit detection and imaging techniques, and system vulnerability assessments and testbeds.\n\nThis project also develops standards and practices in support of assured designs and supply chains and formal relationships with industry to foster commercial development of secure, trusted, and assured parts and for acquisition of USG access to proprietary designs, software, development, and quality assurance processes and test procedures to develop practices that minimize security flaws in designs and facilitate verification.  Two capability areas that are core to improved commercial designs will be improved, i.e., assured designs and supply chains.\n\nThis project enables JFAC to provide hardware and software assurance and integrity analysis tools, services, best-practices, contract language, and other help to programs that detect, assess, prioritize, and mitigate mission critical vulnerabilities to malicious hardware and software attacks and supply chain exploitation vulnerabilities.  Additionally, the JFAC will provide capabilities for programs to keep assessment findings throughout the life cycle of their systems for data mining (e.g., documentation on rationale for previous mitigation decisions regarding software, hardware, and firmware.)  The collaboration between the JFAC and program offices will help mitigate existing and emerging critical threats and vulnerabilities in both software and hardware and yield secure architecture and design patterns available to all DoD programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Verification & Validation (V&V) Capabilities and Standards for Trust"
                                    },
                                    "Description": {
                                        "val": "The JFAC will:  (1) improve its microelectronics test and verification methodologies in support of verifying trust and assurance of parts and (2) develop standards\/practices to foster commercial development of secure, trusted and assured parts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.524"
                                            },
                                            "Text": {
                                                "val": "Verification and test technologies activities will include:\n\n• Improvements to the core JFAC’s (1) technical capability, through the procurement of laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) capacity to perform microelectronics assessments.  FY 2018 and\nout-year demands will require an increase in capacity supporting weapon system program engagement, which will take the form of additional personnel and\/or equipment to permit scaling of assessment capabilities.\n• Enhancement of automation and standard processes needed to increase the throughput of information produced by individual JFAC laboratory tools as well as to facilitate information sharing across the families of tools used for analysis and testing.\n• Development of common subject matter expert (SME) training and protocols based on the existing tool base, to include both commercial and USG-developed tools.\n• Funding for additional SME support in each core laboratory in support of the microelectronics trust verification and other JFAC-related work.\n• Increased direct program support focused on addressing technical gaps and trust-related findings.\n\nStandards and practices activities will include:\n• Development of standards and best practices, and relationships with industry, to foster commercial development of secure, trusted and assured parts.\n• Establishment of formal relationships with FPGA vendors and other key commercial suppliers to improve device and IP security.\n• Acquisition of government access to proprietary designs, software, development, and quality assurance processes and test procedures to develop design practices that minimize security flaws and facilitate verification.\n• Establishment of government and industry working groups to develop test procedures to validate the trust of designs.\n• Documentation and promulgation of security-enhancing design practices across government, industry, and academia.\n• Development of industry-wide standards and practices to establish a common understanding of what constitutes verified and trusted hardware\/software\/firmware at both the component and systems level.\n• Maintain infrastructure services and staff for the JFAC Coordination Center (CC), enabling the centralized assurance repository, assurance contract language, metrics, the JFAC Ticketing System for SwA tool license distribution, help-desk, and hard problem analysis. \n• Incorporate S&T, DARPA\/ Intelligence Advanced Research Projects Activity (IARPA), Test & Evaluation (T&E), and Defense Acquisition University (DAU) products into the JFAC website."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "41.773"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "41.773"
                                            },
                                            "Text": {
                                                "val": "Continuation of FY 2018 verification and test technologies activities including:\n• Improvements to the core JFAC’s (1) technical capability, through the procurement of laboratory equipment, IP, analysis tools, such as imaging software, and highly skilled tradecraft, and (2) capacity to perform microelectronics assessments.  FY 2019 and out-year demands will require an increase in capacity supporting weapon system program engagement, which will take the form of additional personnel and\/or equipment to permit scaling of assessment capabilities.\n• Enhancement of automation and standard processes needed to increase the throughput of information produced by individual JFAC laboratory tools as well as to facilitate information sharing across the families of tools used for analysis and testing.\n• Development of common SME training and protocols based on the existing tool base, to include both commercial and USG-developed tools.\n• Funding for additional SME support in each core laboratory in support of the microelectronics trust verification and other JFAC-related work.\n• Increased direct program support focused on addressing technical gaps and assurance-related findings.\n• Continue to maintain infrastructure services and staff for the JFAC CC, enabling the centralized assurance repository, assurance contract language, metrics, the JFAC Ticketing System for SwA tool license distribution, help-desk, and hard problem analysis.\n• Incorporate S&T, DARPA\/IARPA, T&E, and DAU products into the JFAC website.\n\nContinuation of FY 2018 standards and practices activities including:\n• Development of standards and best practices, and relationships with industry, to foster commercial development of secure, trusted and assured parts.\n• Establishment of formal relationships with FPGA vendors and other key commercial suppliers to improve device and IP security.\n• Acquisition of USG access to proprietary designs, software, development, and quality assurance processes and test procedures to develop design practices that minimize security flaws and facilitate verification. \n• Establishment of USG and industry working groups to develop test procedures to validate the assurance of designs.\n• Documentation and promulgation of security-enhancing design practices across the USG, industry, and academia.\n• Development of industry-wide standards and practices to establish a common understanding of what constitutes assured hardware, software, and firmware at both the component and system level.\n• Development of a common lexicon for secure hardware, software, and firmware in collaboration with the Committee for National Security Systems, National Institute of Standards and Technology, and the broader USG, industry, and academia.\n• Definition of supply chain controls for assured chain of custody for critical and other microelectronics devices and IP.\n• Development of security training and education of USG and industry system security engineers and material managers on supply chain and life-cycle management best practices using agreed-upon language, standards, and practices.\n• Alignment of DoD Instruction 5200.44 (Protection of Mission Critical Functions to Achieve Trusted Systems and Networks (TSN)), and other related policies and guidance, with other USG, e.g., NIST 800-161 (Supply Chain Risk Management Practices for Federal Information Systems and Organizations), and industry standards identifying and addressing gaps in definition and criteria and establishing accepted levels of supplier and part assurance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funds transferred from PE 0603826D8Z in FY 2019 to correctly align funding in support of the mission."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "NA"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n• Increases in throughput in current JFAC laboratories, and stand-up of additional capability and capacity as required, so that at least two laboratories will have capability in physical verification, functional analysis, and design verification to increase the DoD’s overall microelectronics trust verification and test capacity for analysis of parts.\n• Increased Probability of Detection of malicious insertion and\/or counterfeit parts.\n• Decreased cost to evaluate components.\n• Decreased time to evaluate components."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "V&V Capabilities and Standards for Trust"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (Air Force, Army, Navy, NSA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "41.524"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "41.773"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "41.773"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "V&V Capabilities and Standards for Trust"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Joint Federated Assurance Center (JFAC) Hardware Assurance (HwA) Technical Working Group Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC HwA capability gap analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC Subject Matter Expert (SME) training"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC technical capability improvements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC assessments"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC direct program support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain standards and best practices development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "U.S. Government and industry engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Intellectual Property (IP) access\/acquisition"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain training for U.S. Government and industry"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "646"
                    },
                    "ProjectTitle": {
                        "val": "New Trust Approach Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "42.102"
                        },
                        "BudgetYearOne": {
                            "val": "191.369"
                        },
                        "BudgetYearOneBase": {
                            "val": "191.369"
                        },
                        "BudgetYearTwo": {
                            "val": "196.202"
                        },
                        "BudgetYearThree": {
                            "val": "192.665"
                        },
                        "BudgetYearFour": {
                            "val": "203.612"
                        },
                        "BudgetYearFive": {
                            "val": "204.795"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds a program of research to develop the next generation, technology-driven approach to microelectronics trust and assurance, to include state-of-the-art (SOTA) microelectronics, to ensure continued access to SOTA microelectronic technologies while maintaining the required level of assurance in all environments.  DoD’s ability to access commercial technology for its custom, secure, trusted and assured needs is diminishing as SOTA suppliers become fewer and more focused on serving the global commercial market.  DoD’s technology needs are broad, and relying on a single source supplier is not feasible.  Alternative, advanced manufacturing methods, technologies, and design tools are needed to produce secure, trusted and assured SOTA parts from commercial sources and to preserve access to these advanced nodes while protecting DoD and Defense Industrial Base IP from exploitation.  It is also intended to dramatically improve the capabilities of the JFAC with regard to verification and validation of SOTA microelectronics assurance.\n\nThis program of research will develop innovative design, manufacturing, imaging, tagging, and control and assessment approaches for protecting DoD’s microelectronics supply chain and IP, including alternatives for trusted and assured strategic radiation-hardened electronics in advanced technology nodes for next-generation strategic systems, obfuscation and disaggregation technology development, and other assurance mitigations.  It will develop advanced imaging technologies and forensics, Design for Assurance techniques, active hardware assurance controls, electronic component markers, and a data and analysis capability to enable auditing and independent verification and validation of commercial designs.  It also develops, demonstrates, and implements concepts for the cost-effective production of custom microelectronics in low volumes and protection of sensitive IP from exploitation.\n\nAssurance technologies that can be applied in a broad range of trusted and commercial environments can mitigate the risk associated with sole-source suppliers and increase the Government’s ability to leverage commercial capabilities.  The suite of developed technologies, e.g., alternative manufacturing methods and design tools, will enable DoD to obfuscate the purpose of sensitive devices, verify their origin and function, and protect sensitive IP from exploitation even while using the global supply chain for most hardware.  In cases where the risk involved precludes that level of commercial collaboration, low-volume manufacturing technologies developed under this project would permit DoD to more cheaply produce low volumes of sensitive microelectronics in trusted environments.  The project would also support using a repository of vetted third-party IP and EDA tools to expedite circuit design and transition promising technologies to use.\n\nThis project has received additional funding starting in FY 2019 to support microelectronics innovation efforts in the following focus areas:  capture and secure microelectronics R&D; new microelectronics development, demonstration, and capability insertion; radiation hardening by process (RHBP) and radiation hardening by design (RHBD); and radio frequency (RF) and opto-electronics."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Development"
                                    },
                                    "Description": {
                                        "val": "This project’s activities will mature and evaluate assurance technologies and techniques through efforts that may include the conduct of studies and Broad Agency Announcements (BAAs) and other efforts to coordinate research programs across USG R&D organizations, academia, and industry.\n\nIn addition, the JFAC will initiate the conduct of identified acquisition program pilots and technology demonstrations in coordination with research programs across government R&D organizations, academia and industry."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.102"
                                            },
                                            "Text": {
                                                "val": "This project will initiate and support at least one R&D activity in each of the following technical focus areas:\n• Design-For-Trust techniques\n• IP protection\n• Low-volume SOTA manufacturing\n• Electronic component markers\n• Imaging technologies and forensics\n• Computing infrastructure and processing methods.\n\nPrimary efforts will include reducing-to-practice technologies enabling trusted (1) design, (2) access, (3) component integrity and (4) IP protection. FY 2018 primary activities include development of these technologies, followed by transition of these capabilities to new programs in the following fiscal years under PE 0605294D8Z.\n\nThis project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles, and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "191.369"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "191.369"
                                            },
                                            "Text": {
                                                "val": "This project will use the augmented funding in FY19 to initiate and support R&D activities in each of the following technical focus areas:\n\n• Capture and secure microelectronics R&D, including support and enhanced manufacturing at SOTP foundries.   \n• New microelectronics development, demonstration, and capability insertion including supporting public\/private co-development of new COTS programmable devices that address USG needs during their development by industry when it is the most cost-effective to do so.\n• RHBP and RHBD including supporting secure design of RHBD IP in all major domestic foundries and fabrication of SOTA test articles for evaluation and qualification. \n• RF and opto-electronics including supporting secure design of IP and access to SOTP government and commercial facilities for RF and optical devices.                                    \n\nPrimary efforts will include reducing-to-practice technologies enabling assured (1) design, (2) access, (3) component integrity and (4) IP protection.\n\nThis project will engage early on with potential stakeholders to identify potential transition issues and aid in transition through joint collaboration between research teams and stakeholders with a focus on evaluations of prototypes, test articles and beta versions of tools, IP, techniques, methods, etc. and their use in operationally-realistic scenarios.\n \nPrimary activities in FY 2019 will continue the development of these technologies, followed by transition of these capabilities to new programs in the fiscal years that follow under PE 0605294D8Z."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increase supports additional efforts in this USG priority area."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Performance for this project is monitored in the following ways:\n• Enhanced capability in physical verification, functional analysis, and design verification.\n• Increased Probability of Detection of malicious insertion and\/or counterfeit parts.\n• Expanded access to leading SOTA technology and enhanced availability of essential SOTP design and fabrication capabilities.\n• Successful transition demonstrations from commercial technology to modernized military applications, e.g., such as strategic radiation-hardened and RF-optical microelectronics.\n• Effectiveness of developed technologies, as measured by:  \n    - The speed and reliability of new validation and verification techniques in identifying known microelectronics issues (e.g., tampering) in laboratory and non-laboratory situations. \n    - Successful demonstration of advanced, alternative manufacturing techniques, such as disaggregated manufacturing.\n    - Resilience of microelectronics protected by new trust approach technologies in red teaming exercises.\n• Adoption of next-generation commercial technologies, as measured by:  \n     - The number of DoD and other USG programs employing assured access to SOTP and SOTA technologies, design approaches, and best practices developed in cooperation with commercial partners.\n     - The volume and criticality of components employing these technologies, design approaches, or best practices.\n     - Promulgation in DoD guidance and program protection plans.\n• Commercial partnerships established for, or enhanced by, the development and manufacture of DoD microelectronics using next-generation assurance technologies."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "New Trust Approach Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various (DARPA, Air Force, Army, Navy, NSA)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "42.102"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "191.369"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "191.369"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "New Trust Approach Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Third Party Intellectual Property (IP) and EDA tool repository development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "JFAC technical capability improvement development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain technology maturation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Government and industry engagement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Microelectronics assurance and supply chain policy and guidance development\/update"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Management\/Technical Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}