{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-12",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603225D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint DOD\/DOE Munitions Technology Development"
        },
        "R1LineNumber": {
            "val": "32"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "91.979"
            },
            "PriorYear": {
                "val": "16.618"
            },
            "CurrentYear": {
                "val": "18.662"
            },
            "BudgetYearOne": {
                "val": "18.644"
            },
            "BudgetYearOneBase": {
                "val": "18.644"
            },
            "BudgetYearTwo": {
                "val": "18.827"
            },
            "BudgetYearThree": {
                "val": "19.106"
            },
            "BudgetYearFour": {
                "val": "19.441"
            },
            "BudgetYearFive": {
                "val": "19.810"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the Department of Defense (DoD)\/Department of Energy (DOE) Joint Munitions Technology Development Program (JMP) is to develop new and innovative warhead, advanced and disruptive explosive, fuzing, weapons effects, and lifecycle technologies and tools to enable significant improvements in conventional munitions.  The JMP supports the development and exploration of advanced munitions concepts and enabling technologies that precede Service-specific system engineering.  A Memorandum of Understanding signed in 1985 by DoD and DOE provides the basis for the cooperative effort and for cost-sharing the long-term commitment.  The DoD JMP funds budgeted in this justification are matched, at a minimum, dollar for dollar by DOE funds.  Through this interdepartmental cooperation, DoD’s relatively small investment leverages DOE’s substantial investments in intellectual capital and highly specialized skills, advanced scientific equipment and facilities, and computational tools not available within DoD.  Under the auspices of the JMP, the integration of DOE technologies with Joint and Individual Services’ needs has provided major advances in warfighting capabilities over many years and continues to play a crucial role in the exploration, development, and transition of new technologies needed by the Services.\n\nThe JMP has established a successful collaborative community of DoD and DOE scientists and engineers that develop technologies of interest to both Departments within a structured framework of technical reviews and scheduled milestones.  The JMP is administered and monitored by the Office of the Secretary of Defense (OSD) and reviewed annually by the Munitions Technical Advisory Committee (TAC), which is comprised of munitions laboratory technical directors and senior executives from the Army, Navy, Air Force, Special Operations Command, the Defense Threat Reduction Agency, OSD, and DOE.  Projects are organized in eight Technology Coordinating Groups (TCG) that bring together the disciplines necessary to properly evaluate technical content, relevance, and progress.  The TCGs conduct semi-annual technical peer reviews of JMP projects and plans.  DoD Service laboratory technical experts lead each of the TCGs to ensure that the technologies under development address high-priority DoD gaps, needs, and challenges.  The JMP also promotes more in-depth technical exchange via short-term visiting scientist and engineer assignments at both the DOE and the DoD laboratories.\n\nThe JMP also works with the Defense Ordnance Technology Consortium (DOTC) and the National Armaments Consortium (NAC) of industrial suppliers to equitably and efficiently transition JMP technologies to defense industrial contractors.  \n\nThe integrated DoD and DOE efforts within the JMP are transitioning new munitions’ technologies to the Department and the defense industrial base through the advanced development process.  The JMP is a focal point for collaborative work by nearly 300 DoD and DOE scientists and engineers.  Technical leaders from both Departments consider the JMP a model of cooperation, both within their respective departments and between departments.  The highly challenging technical objectives of the 32 current projects require multi-year efforts and sustained, long-term investments to achieve success."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.256"
                },
                "CurrentYear": {
                    "val": "18.662"
                },
                "BudgetYearOne": {
                    "val": "18.775"
                },
                "BudgetYearOneBase": {
                    "val": "18.775"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.618"
                },
                "CurrentYear": {
                    "val": "18.662"
                },
                "BudgetYearOne": {
                    "val": "18.644"
                },
                "BudgetYearOneBase": {
                    "val": "18.644"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.638"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.131"
                },
                "BudgetYearOneBase": {
                    "val": "-0.131"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.617"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.006"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.006"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.018"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.125"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.125"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of other program adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "225"
                    },
                    "ProjectTitle": {
                        "val": "Joint DOD\/DOE Munitions"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "91.979"
                        },
                        "PriorYear": {
                            "val": "16.618"
                        },
                        "CurrentYear": {
                            "val": "18.662"
                        },
                        "BudgetYearOne": {
                            "val": "18.644"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.644"
                        },
                        "BudgetYearTwo": {
                            "val": "18.827"
                        },
                        "BudgetYearThree": {
                            "val": "19.106"
                        },
                        "BudgetYearFour": {
                            "val": "19.441"
                        },
                        "BudgetYearFive": {
                            "val": "19.810"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JMP seeks to develop technological advances in several munitions subject areas.  These include:  1) improved modeling and simulation tools for munitions and system design and evaluation, including evaluation of lethality, vulnerability and the design of energetic materials (EM) and insensitive munitions (IM), 2) novel experimental techniques and material property databases to support modeling and simulation, 3) higher power and safer explosives and propellants, 4) miniaturized, lower-cost, and higher reliability fuzes, initiators, power systems, and sensors, 5) design tools to enable development of higher performance warheads and weapons, such as penetrators, that are hardened against high impact loads, and 6) tools to assess the health and reliability of the munitions stockpile and predict lifetimes based on these assessments.  The supporting experimental research requires the development of new technologies related to the synthesis, processing, formulation, and characterization of advanced munition materials, components, and systems.  This involves energetic material research, new fuzing concepts, dynamic testing of munition materials, and advanced characterization including high-rate in-situ diagnostics.\n\nThe JMP projects are divided into five technical focus areas:  1) Computational Mechanics and Material Modeling, 2) Energetic Materials, 3) Initiators, Fuzes, and Sensors, 4) Warhead and Penetration Technology, and 5) Munitions Lifecycle Technologies.\n\nEach of the 32 projects has a detailed five year plan with objectives, tasks, deliverables and milestones that is approved annually by a group of 20-plus SES from the DoD munitions laboratories."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Computational Mechanics and Material Modeling"
                                    },
                                    "Description": {
                                        "val": "Projects in this technical focus area develop physics-based computational tools, material models, and calibration and validation databases that support the design and development of weapon systems.  These capabilities are intended to predict the complex phenomena across significant length (meso to continuum) and time (nano-seconds to minutes) scales.  The tools will provide coupled, multi-physics and chemistry modeling capabilities that are scalable to massively parallel architectures for solving diverse problems across the weapons systems’ research and development and acquisition communities.  Numeric tools are the foundation that makes possible the integration of mechanics, materials science, physics, and chemistry.  This focus area also includes an extensive experimental component consisting of:  1) phenomenological or “discovery” experiments that provide the physics basis for model development, 2) experiments directly coupled to model development and application, such as characterization, calibration, and validation experiments, or 3) the development of advanced test methods or device development.\n\nThe specific projects in computational mechanics and material modeling are:\n-  CTH (Sandia code) shock physics and Sierra\/Solid Mechanics (SM) codes & model development and supporting experiments.\n-  Arbitrary Lagrangian-Eulerian Three-Dimensional (ALE3D) code and model development.\n-  Composite case technology and modeling.\n-  Dynamic properties of materials, modeling and validation.\n-  Energetic materials and polymers under dynamic and thermal loading.\n-  Fragment impact and response experiments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.577"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate concave projectile fragment capability by firing into heated and ambient PBX 9502.\n-  Decision gate whether to continue to pursue a Generalized Initiation Criterion.\n-  Perform over-driven EOS and sound speed experiments on relevant energetic materials using two-stage or three stage gun.\n-  Demonstrate three-dimensional solid extended finite element (XFEM) fracture capabilities\n-  Release CTH Version 11.3 with next-generation platform improvements.\n-  Provide equation of state data on glass fiber reinforced polymer material.\n-  Simulate a projectile penetration event that can exhibit multiple modes of failure, such as plugging and shear bands.\n-  Develop three-dimensional formulation of the two-component localization model for use in 3D fragmentation problems where adiabatic shear banding is dominant.\n-  Complete experimental suite to quantify nucleation and growth behavior of adiabatic shear bands in 316L SS, transition to targeted light source experiments.\n-  Complete grain boundary model for use in both meso-scale theory as well as to motivate macro-scale porosity based damage model.\n-  Continue development of CartaBlanca code for failure and fragmentation problems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.345"
                                            },
                                            "Text": {
                                                "val": "-  Develop and advance new material models in CTH for anisotropic shock wave propagation.\n-  Determine equation of state (EOS) and constitutive property data on advanced\/additive manufactured (AM) polymers.\n-  Complete first experiment on stainless steel alloy examining adiabatic shear banding with both digital image correlation (DIC) and surface thermometry.\n-  Complete implementation of new porosity based ductile damage model within ABAQUS with micro-inertia.\n-  Perform experiments using High Energy Density Material (HEDM) and tomography to characterize incipient void nucleation and growth in titanium.\n-  Complete PBX 9502 fragment impact test series.\n-  ALE3D:  Improve the multiphysics auto-contact, integrate improved strength models, and improve the failure and fragmentation models.\n-  Complete the Insensitive Munitions Project Arrangement (IM PA) with the U.K. to develop a model to predict the effects of fragment impact on minimum smoke propellant motors on relevant tactical systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.149"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.149"
                                            },
                                            "Text": {
                                                "val": "-  Release CTH Version 13.0.\n-  Release Sierra Mechanics Version 4.52.\n-  Determine the effects of thermodynamic non-equilibrium under high strain rate considered using the multi-scale methods in Carta Blanca. \n-  Complete Ignition\/violence characterization tests on pedigreed PBXN-9, Comp B, and Plastic Bonded eXplosive (PBX) 9501.\n-  Release ALE3D Version 4.30.\n-  Transfer key portions of Lawrence Livermore National Laboratory’s Siboka workflow tools to one or more DoD platforms (Army Armament Research, Development & Engineering Center and Air Force Research Laboratory) for the development of warhead design optimization tools.\n-  Continue to improve and release the MIDAS material database to the DoD and the DOE."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Energetic Materials (EM)"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new Energetic Materials (EMs) and supporting technologies to satisfy the competing requirements for smaller, more lethal, and safer munitions.  Work is primarily focused on explosives, gun and rocket propellants, and, to a lesser extent, pyrotechnics.  The projects include development of: 1) new EMs, including new molecules in a range of particle sizes and morphologies, 2) new EM formulations, 3) a fundamental understanding of energetic properties and performance, and 4) computational tools for analysis of performance and sensitivity.  New materials and formulations are developed with the recognition that costs must be reasonable, chemical feed stocks reliable, and manufacturing processes suitable for scale-up to production levels.\n\nBoth Federal statute and Department policy direct the development of safer, less sensitive munitions.  Making munitions less sensitive while maintaining explosive or propellant performance is a difficult challenge.  This goal is best attained through a combination of new EM development, EM characterization, and more sophisticated modeling and simulation tools.  It is cost prohibitive to qualify weapons for compliance with insensitive munitions requirements through testing alone.  A better, and in many cases the only means, to qualify these weapons is with the combination of analysis based on validated computational tools and a few well-designed tests.\n\nThe Department also needs munitions that provide selectable effects and improved lethality.  To achieve these effects, weapons designers need to thoroughly understand the performance of EMs used in both the main weapon fill and the initiation systems.  Distributed fuzing systems can provide selectable effects as well as safer munitions, but such complex, small-scale systems require more complete knowledge of EM detonation physics and in some cases, new EMs designed for this application.\n\nThe desire for smaller and lighter munitions is driven in part by recommendations of the Long Range Research and Development Program Plan (LRRDPP) and the increasing dependence on unmanned weapons platforms and to some extent by the need to reduce logistical burden, especially energy consumption.  New EMs are needed to meet the munitions weight and size requirements while maintaining and improving lethality, effects, and safety.  \n\nIn order to clearly establish overmatch, the Department is working to increase the range and speed of weapons and to develop weapons against hardened targets.  This thrust includes the development of hypersonic and hyper-velocity weapons.  These applications subject EMs to high accelerations and shock loads.  To support the development of these new systems, we need to improve our ability to model EM under higher impact loads and to characterize relevant properties to determine their ability to survive in these aggressive environments.  DoD may also need to develop new, more robust EMs that survive impact loads while maintaining lethality and the ability to initiate weapons under extreme conditions.\n\nTCG-III is also a forum for the exchange of information on new energetic materials, their performance and sensitivity characteristics, and physical models that can be used to predict the behavior of energetics under adverse and unplanned conditions.  It is a venue in which collaboration opportunities can be identified to facilitate the transition of technology developed in the DOE to the DoD.\n\nThe specific projects in the energetic materials technical focus area for FY 2018 are:\n-  Synthesis, properties, and scale-up of new energetic compounds.\n-  Insensitive munitions and surety.\n-  Cheetah thermochemical code development and experiments.\n-  Micro- and nano-energetics synthesis and initiation.\n-  Hazards analysis of energetic materials.\n-  Reactive processes in energetic materials.\n-  Development of tools for energetic material performance characterization.\n-  Explosives chemistry and properties, and new energetic materials formulation.\n-  Thermal response of energetic materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.478"
                                            },
                                            "Text": {
                                                "val": "-  Synthesis of new cyclic, planar structures consisting of imidazole or pyazole arrays.\n-  Publish results of characterization of damage evolution of gun propellants.\n-  Benchmark Spiral 1 MSP1 HERMES\/XDT with cylindrical ABVR experiments.  Perform pre-test predictions for analog rocket motor fragment impact tests.\n-  Perform X-ray measurements of burn-rates and DDT.\n-  Deliver second kinetics tool for non-ideal EM’s, possibly initiation behavior.\n-  Integrate CHEETAH code capabilities to facilitate exploratory calculations (e.g., constant volume explosions at user specified conditions, EOS tables for hydro simulations, and multiple constraints on formulation performance).\n-  Perform experiments on milling technique for nanomaterial production.\n-  Report on aging of PBXN-103 underwater explosive formulation.\n-  Report on first use of Lattice Boltzmann and\/or Kinetic Monte Carlo Methods to model multiscale reaction processes.\n-  Perform sensitivity testing of energetic binder candidates.\n-  Mechanistic determination of the insensitivity of TATB-based formulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.464"
                                            },
                                            "Text": {
                                                "val": "-  Execute experiments on LX20 graded\/ungraded mixtures to assess the predictive capacity of modeling capabilities of additively manufactured energetic material.\n-  Develop detonation and post-detonation kinetics models for conventional and insensitive high explosives. Test and validate against small scale experiments (e.g., cylinder, plate push) for explosives based on TNT, RDX, NTO, DNAN, HMX, TATB (triaminotrinitrobenzene), FOX-7, Landau Level Mixing (LLM)-105, NQ, HNS, LLM-200, TNBA, 3,4 Dinitrophenol (DNP), LX20, halogenated (e.g., LX04, LX10, PBX 9407, ammonium perchlorate (AP)-based, etc.).\n-  Synthesize functionalized acrylate monomers and optimize catalyst for nitro-group bearing monomers.\n-  Demonstrate small scale x-ray determination of detonation product EOS in situ.\n-  Report on aging of PBXN-103 underwater explosive formulation (Naval Surface Warfare Center-Indian Head).\n-  Release foam filling computational models for use in predicting large material deformation from thermal boundary conditions via publication or computational subroutine."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.632"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.632"
                                            },
                                            "Text": {
                                                "val": "-  Complete graded additive manufactured (AM) booster design experiments on selected designs including non-destructive evaluation of as-printed energetic material.\n-  Integrate code capabilities to facilitate exploratory calculations (e.g., constant volume explosions at user specified conditions, EOS tables for hydro simulations (e.g., LEOS, SESAME), multiple constraints on formulation performance, etc.).  Upgrade graphical user interface to maintain and enhance functionality (e.g., heat of formation and density estimates) and compatibility with current versions of major operating systems.\n-  Complete performance testing on energetic binders and then formulate main charge with energetic polymers.\n-  Integrate pre and post-ignition modeling of thermal response in PBX 9501.\n-  Report on ammonium perchlorate (AP) propellant thermal decomposition.\n-  Develop high-speed, high-definition imaging capability and data-extraction method for material behavior and combustion front observation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 funding enables more effort focused on advanced and disruptive energetics ‎to increase range, speed, lethality, and effects of munitions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Initiators, Fuzes, and Sensors"
                                    },
                                    "Description": {
                                        "val": "The goals of this technical focus area are to develop new materials, components, diagnostic techniques, and modeling and simulation tools for fuzing systems.  Initiators, fuzes, and sensors must work reliably together to prevent unintended detonation, to correctly detect intended targets, and to initiate detonation when required.  Projects in this focus area support the Department’s needs to miniaturize fuzing systems.  Smaller systems are required for several reasons including: 1) compatibility with smaller and lighter weapons systems, 2) trading volume in munitions for other components such as additional explosives, higher energy and power density power sources, or enhanced guidance systems, 3) increasing reliability through redundancy, for example, using of two or more smaller initiating systems, and 4) upgrading existing sub-munitions with smarter and more reliable fuzing systems. \n\nThe miniaturization of fuzing systems requires new material and components, new power systems, new diagnostic techniques, and improved modeling tools for microdetonics.  The Department also needs weapons systems with selectable effects, and these effects may be achieved with multi-point initiation systems.  Such systems are inherently more complex and require improved characterization of initiator materials and components, as well as more sophisticated modeling and simulation tools.  To attain greater precision and to avoid unintended collateral effects when weapons are used in the complex environment of counter-insurgency or counter-terrorist operations, target sensors must be reliable and provide high-fidelity discrimination.  Projects in this focus area are developing technologies to achieve this level of performance in compact packages.\n\nThe specific projects in the initiators, fuzes, and sensors technical focus area are:\n-  Firing Systems Technology, comprising FireMod firing set code model development and validation, 1.6 hazard classification detonator development, and initiation and detonation physics on the millimeter scale.\n-  Safe, Arm, Fuze and Fire Technology, comprising Initiation and Detonation, and Advanced Firing System Components.\n-  Advanced Initiation Systems, comprising diagnostics development, microdetonics, miniature initiation systems, and detonators for enhanced safety.\n-  Thermal Battery Performance Modeling to develop a multi-physics modeling capability for thermal batteries.\n-  Thin Film Thermal Batteries to develop, mature, and transition a method to produce a thin, conformal, low-cost thermal battery.\n-  Vertical-Cavity Surface-Emitting Laser (VCSEL) sensors for proximity fuzing of munitions with very low size, weight, and power requirements.\n-  Enabling Robust, Mode-Agile GPS-Denied Weapon Guidance through High-Efficiency Data Processing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.681"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate 1.2V operation of thin-film thermal battery at 500mA\/cm2 in coated configuration.\n-  Complete implementation of insulation mechanical model and parameter fitting based on experimental data.\n-  Expand Thermally Activated Battery Simulator (TABS) thermal material database with properties for thin film thermal battery materials, add active insulation capability to the TABS interface, and publish instructions to build and run a 3D thermal model.\n-  Demonstrate validated fully-coupled thermo-poro-mechano-electrochemical single cell battery model.\n-  Demonstrate model of full magneto hydrodynamic (MHD) slapper-initiating explosive train with predicted reliability, incorporating ALE3D.\n-  Perform output characterization, large array (>80 samples).\n-  Demonstrate an integrated modeling tool for detonator explosive performance. \n-  Determine breakdown mechanisms in multilayer glass capacitors (MLGCs) and eliminate defect formers identified during prototype capacitor construction.\n-  Demonstrate MLGC integration into micro fireset.\n-  Micro-optic development, including new designs for detector collector lenses in addition to new VCSEL emitters.\n-  Deliver initial GPS-denied sensor hardware prototype and associated radar guidance software to DoD customer for evaluation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.067"
                                            },
                                            "Text": {
                                                "val": "-  Deliver initial GPS-denied sensor hardware prototype and associated radar guidance software to DoD customer for evaluation.\n-  Deliver documentation and training for Thermally Activated Battery Simulator (TABS) Version 5.0 to include improved single-cell modeling capabilities.\n-  Demonstrate 3-cell stack configuration with < 50 millisecond (ms) rise to midvoltage and no shorting.\n-  Integrate Photon Doppler Velocimetry microscope and complete report on Photon Doppler Velocimetry (PDV) microscope.  Support flyer characterization by using PDV microscope in boombox.\n-  Demonstrate synthetic aperture radar (SAR) image formation, SAR-on-SAR and radar-to-optical-feature extraction and correlation (ROFEC) on a workstation platform.\n-  Fabricate flip-chip laser in 10x10 array format for vertical-cavity surface-emitting laser (VCSEL).\n-  Status results and validation of simultaneous shock wave image framing technique (SWIFT), and explosive particle image velocimetry (PIV) diagnostic benchmark testing to advocates at the Army Research Laboratory for consideration and application to polymethyl methacrylate (PMMA) gap-test model validation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.187"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.187"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to model thin-film batteries and couple thermal and electrical performance.\n-  Optimization of process to cut metallized glass\/epoxy composites without damaging electrodes.\n-  Demonstrate 10 Volt (V), 10-cell stack at 1 amphere\/square centimeter (A\/cm2) with < 50 ms rise to midvoltage and no shorting.\n-  Delivery of SAR-on-SAR and ROFEC prototype hardware\/software processor solution to DoD customer for evaluation.\n-  Refine fabrication and complete optical characterization of VCSEL and complete g-testing.\n-  Report status of photoactive high explosives (HE) project capabilities in preparation for specification of down-selected engineering applications, e.g., prompt versus deflagration to detonation transition (DDT) photo-active detonators."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of FY 2019 would accelerate the transition of technology to the DoD for advanced modeling to optimize new weapons firing and detonation system design."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warhead and Penetration Technology"
                                    },
                                    "Description": {
                                        "val": "This focus area supports the development of new warheads and penetrator weapons through advances in materials processing and characterization, instrumentation, and computational codes.  Significant increases in warhead performance are directly attributed to our ability to understand and accurately model the physics and fine details of new warhead designs, and to advances in increasingly sophisticated material processing.  The Department’s requirement to achieve more precise weapon effects with minimum collateral damage is supported by work on controlled fragmentation, non-fragmenting warhead cases, and multiphase blast explosives (MBX).  More recently, increases in performance and reductions in vulnerability are being achieved through improved warhead integration into munitions using a systems-oriented approach. \n\nThe goals for penetrator weapons are to investigate, develop, and transition advanced technologies for the design, development, and performance assessment of the next generation of high performance, precision strike weapons.  This effort directly supports national initiatives to defeat hard and deeply buried targets, which are proliferating worldwide, and to deny\/defeat weapons of mass destruction.  The work addresses high-velocity penetration into granular materials (sand and soil), penetration into advanced high-strength, high performance, and ultra-high-performance concretes, new penetrator materials and designs, and non-inertial onboard instrumentation.\n\nThe specific projects in the warhead and penetration technology focus area for FY 2018 are:\n-  Multiphase blast munitions (MBX) technology.\n-  Dynamic behavior of concrete.\n-  Integrated munitions modeling & experimentation for penetration and MBX target coupling.\n-  Modeling of strategic structures subject to ballistic impact or blast.\n-  Concrete perforation and penetration modeling and experiments.\n-  Explosive\/metal interactions.\n-  Structure, mechanical & shock-loading response, and modeling of materials.\n-  Controlled effects warhead materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.063"
                                            },
                                            "Text": {
                                                "val": "-  ALE3D version of MBX model with validated key particulate plume transport physics, drag model and surface instabilities, through use of experiments.\n-  Exercise ALE3D MBX capability to interact with complex (failing) targets.\n-  Quasi-static and dynamic characterization of lattice structures.\n-  Direct numerical simulations of architected structures under dynamic loading.\n-  Development of constitutive models for Additive Manufactured (AM) microstructures and homogenization for lattice structures.\n-  Design, print, and infill suitable architectures for dynamic compression.\n-  Complete oblique HE driven shock hardening and damage microstructural characterization on Zirconium\/Titanium and Copper\/Lead alloys.\n-  Transition updated materials databases and materials models.\n-  Utilize Dynamic Tensile-Extrusion experimental facility, diagnostics, and modeling to support warhead material validation and complete shear localization studies of relevant warhead materials.\n-  Calculate the flat-plate oblique shock experiment performed on Tantalum and compare results with experimental data and recovered sample metallography.  Make observations about improvement needed to the material model and computational code.\n-  Calculate the curved-plate oblique shock experiment performed on Tantalum and account for improvements made vice the flat-plate configuration.  \n-  Issue report on impact energy transfer across threaded interfaces.\n-  Implement material failure models into CTH-Multipoint Method-Multi-field code.\n-  Implement improved user interface into the Peridynamics-Multiscale (PDMS) code."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.968"
                                            },
                                            "Text": {
                                                "val": "-  Implement improved user interface into the Peridynamics-Multiscale (PDMS) code.\n-  Establish an exemplar AFX-1282 input deck with a composite case for modeling MBX flow in Arbitrary Lagrangian-Eulerian Three-Dimensional (ALE3D).\n-  Complete report on continuum model validation for penetration through concrete.\n-  Complete calculations of the flat-plate and curved-plate oblique shock experiments performed on titanium (Ta) with CartaBlanca and compare results with experimental data and recovered sample metallography.  \n-  Integrate new physical observations for improvement to the damage model and code over the progress made in FY 2017.\n-  Complete constitutive modeling of AF9628 Eglin Steel and validate models using Taylor Cylinder testing.\n-  Identify the cause of the ductility characteristics of pure Zirconium (Zr)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.878"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.878"
                                            },
                                            "Text": {
                                                "val": "-  Add a granular temperature model to ALE3D for improved modeling of MBX.\n-  Element conversion of finite element modeling and discrete element modeling (FEM-DEM) with improved stability in ALE3D v4.32.\n-  Complete mechanistic mesoscale simulations for concrete penetration.\n-  Develop thermomechanical solution framework for hard-target penetration.\n-  Concrete perforation and penetration modeling and experiments on high performance and ultra-high performance material.\n-  Simulate 3D compact shear sample experiment on two materials of interest – possibly stainless steel or tantalum – using the 3D embedded element formulation.\n-  Exercise new model within CartaBlanca for the sweeping detonation wave damage problem on tantalum."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Munitions Lifecycle Technologies"
                                    },
                                    "Description": {
                                        "val": "This focus area supports improving the Department’s ability to understand measure, predict, and mitigate safety and reliability problems caused by materials aging and degradation in weapons systems.  Current stockpile assessment methods typically focus on addressing materials aging and reliability problems after they occur, rather than anticipating, predicting, and avoiding future problems or failure mechanisms.  The overall objective of this work is to develop a toolset of computational models that are able to quantitatively predict materials aging processes and ultimately improve the long-term reliability of weapons systems, subassemblies, and\/or components.  These objectives are achieved by identifying aging mechanisms, quantifying the rates at which those aging mechanisms occur, developing predictive models, and using these models to predict the munitions stockpile reliability.  An additional objective of this work is to develop technologies and methodologies to enable munitions health management and condition-based maintenance.\n\nThe specific projects in the munitions lifecycle technologies focus area are:\n-  Predictive Materials Aging, including solder interconnect reliability, corrosion of electronics, and adhesive degradation.\n-  Microelectromechanical systems (MEMS) reliability.\n-  Military use of commercial off-the-shelf (COTS) electronics.\n-  Complex system health assessment.\n-  Physical\/chemical reactive transport modeling of material\/system aging and reliability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.819"
                                            },
                                            "Text": {
                                                "val": "-  Transition tin whisker mitigation to commercial plating houses.\n-  Transition first principles (Dynamic recrystallinzation) tin whisker mitigation methods to industry.\n-  Demonstrate roll-up of bondpad & connector corrosion models to predict system performance \/ reliability.\n-  Validate predictions of adhesive degradation in humid environments in a unique geometry: smooth stainless steel surfaces.\n-  Develop Accelerated Aging MEMS protocol\/statistically-based model.\n-  Experimentally characterize and model the physical-chemical aging response of one to three DoD material(s), dependent on complexity of mechanism.\n-  Intermediate delivery of compact lifetime predictive models to the DoD customer. \n-  Validate the most promising tin whisker mitigation methods in actual operating environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Text": {
                                                "val": "-  Validate predictions of adhesive degradation in humid environments in a unique geometry: smooth stainless steel surfaces.\n-  Characterize chemical reaction kinetics of material for validation (e.g., RTV-734) for lifecycle out-gassing effects.\n- Characterize sorption\/diffusion (S\/D) parameters of chosen material and vapors and validate against single and multi-material experiments.\n-  Validate shock isolation system modeling and compare to experimental results.\n-  Experimentally characterize Foam plug(s) from AMRDEC\nMLRS M26 igniter.\n-  Characterize chemical reaction kinetics of material for validation (e.g., RTV-734).\n-   Release of preliminary, early prototype of physics-based lifetime predictive model to the DoD.\n-  Transition first-principles (DRX) tin whisker mitigation methods to industry."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.798"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.798"
                                            },
                                            "Text": {
                                                "val": "-   Experimentally characterize and model DOE & DoD material(s) of interest based on suspected impact on aging and outgassing.\n-  Simulate multi-material experiments (MME) on DoD system (MLRS M26 ignitor).\n-  Complete 3D, MME experiments for validation on identified systems of interest.\n-  Simulate 3D compact shear sample experiment on two materials of interest – possibly stainless steel or tantalum – using the 3D embedded element formulation.\n-  Use 3D experiments to determine outgassing effects of critical materials. \n-  Transition tin whisker mitigation to commercial plating houses.\n-  Develop datasets for electrochemical kinetics and damage distributions on aluminum under varying humidity and chloride-loading conditions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Small fluctuations reflect minor budget adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1.  Transition of technologies developed by the Joint DoD\/DOE Munitions Technology Program are tracked and documented.  In FY 2017, there were over 70 transitions to DoD weapons programs and personnel.\n2.  Attendance and technical interactions at the semiannual meetings of the eight Technology Coordinating Groups (TCGs) are tracked and documented.\n3.  Laboratory Five-Year Plans are prepared, evaluated, analyzed and approved by DOE and DoD management and technical staff.\n4.  TCG Chairmen's Annual Assessments for each TCG are critically reviewed by the Technical Advisory Committee (TAC) to determine progress, validate transition plans, and verify relevance of each project.  \n5.  The five-year plans and all news start projects are approved each year by the TAC.  Adjustments are made to the five-year plan based on recommendation of the TAC to meet the most compelling gaps, needs, or challenges of the DoD and the DOE.   \n6.  Project progress toward goals and milestones is assessed at each biannual TCG meeting and critically reviewed annually by the TAC.\n7.  Annual technical reports, papers, and presentations are tracked and documented."
                        }
                    }
                }
            ]
        }
    }
}