{
    "id": "2019-ChemicalandBiologicalDefenseProgram-PB-0400-JBOOK-9e38ae0091140c0534657cc0867e23431690c03369a2d2d94356a61b91e6fff3-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-CBDP-U_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Chemical_and_Biological_Defense_Program_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Chemical and Biological Defense Program",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602384BP"
        },
        "ProgramElementTitle": {
            "val": "CHEMICAL\/BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
        },
        "R1LineNumber": {
            "val": "15"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Chemical and Biological Defense Program"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "185.864"
            },
            "CurrentYear": {
                "val": "201.053"
            },
            "BudgetYearOne": {
                "val": "192.674"
            },
            "BudgetYearOneBase": {
                "val": "192.674"
            },
            "BudgetYearTwo": {
                "val": "194.061"
            },
            "BudgetYearThree": {
                "val": "197.468"
            },
            "BudgetYearFour": {
                "val": "202.120"
            },
            "BudgetYearFive": {
                "val": "200.025"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Applied research in the areas of physical technologies (CB protective materials, textiles, and filtration, sensors and sensing algorithms, effects modeling, chemical formulations, processes, and methods for hazard mitigation), medical technologies (drug discovery and platform technology development, biomarkers and assay development useful in drug development and diagnostics, human mimicking devices and regulatory science), and non-traditional agent medical and physical defense technologies, including characterization of emerging threats.  Major efforts support development of vaccines, therapeutics, next generation diagnostics systems, next generation chemical detectors, nerve agent pretreatments, and individual protection advances.\n\nIn the physical sciences area, Project CB2, focuses on continuing improvements in CB defense materiel, including contamination avoidance, decontamination, and protection technologies, as well as biological weapon\/agent surveillance.  \n\nFor Non-Traditional Agents (NTAs), Project NT2 consolidates all NTA efforts (both medical and non-medical) including pretreatments, therapeutics, detection, threat agent science, modeling, and protection and hazard mitigation.  \n\nThe medical program, Project TM2, focuses on the development of antidotes, drug treatments, disease surveillance and point-of-need diagnostic devices, patient decontamination and medical technologies management.\n\nOne function of the CBDP S&T Applied Research budget is to preserve critical core competencies in the DoD Service laboratories which includes: United States Army Edgewood Chemical Biological Center (ECBC), United States Army Medical Research Institute of Infectious Diseases (USAMRIID), United States Army Medical Research Institute of Chemical Defense (USAMRICD), United States Army Natick Soldier Systems Center, Naval Research Lab (NRL), Air Force Research Lab (AFRL), among others.  The intent is to maintain strategic partnerships with the DoD Service communities for mission success across the enterprise through collaborative planning and programming maintaining budget assurance.\n\nEfforts under this PE will transition to or will provide risk reduction for Advanced Technology Development (PE: 0603384BP), Advanced Component Development and Prototypes (PE: 0603884BP), and System Development and Demonstration (PE: 0604384BP)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "188.715"
                },
                "CurrentYear": {
                    "val": "201.053"
                },
                "BudgetYearOne": {
                    "val": "194.578"
                },
                "BudgetYearOneBase": {
                    "val": "194.578"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "185.864"
                },
                "CurrentYear": {
                    "val": "201.053"
                },
                "BudgetYearOne": {
                    "val": "192.674"
                },
                "BudgetYearOneBase": {
                    "val": "192.674"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.851"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.904"
                },
                "BudgetYearOneBase": {
                    "val": "-1.904"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "5.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.478"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.373"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.904"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.904"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding: FY17 (+$5.000M): Congressional add to Medical Chemical Counter Measures (TM2). \nFY17 (-$3.478M): Program reprogrammings to support high priority efforts and CBDP Defense Finance and Accounting System transactions. \nFY17 (-$4.373M): Transfer of funding to support Small Business Innovative Research\/Small Business Technology Transfer efforts.\nFY19 (-$1.804M): Application of revised inflation guidance.\nFY19 (-$0.100M): Program adjustments to balance overall portfolio efforts.\n\nSchedule: N\/A\n\nTechnical: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CB2"
                    },
                    "ProjectTitle": {
                        "val": "CHEMICAL BIOLOGICAL DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "53.726"
                        },
                        "CurrentYear": {
                            "val": "71.654"
                        },
                        "BudgetYearOne": {
                            "val": "67.994"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.994"
                        },
                        "BudgetYearTwo": {
                            "val": "68.078"
                        },
                        "BudgetYearThree": {
                            "val": "68.279"
                        },
                        "BudgetYearFour": {
                            "val": "68.311"
                        },
                        "BudgetYearFive": {
                            "val": "68.307"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project CB2 provides physical science applied research to develop future, multi-disciplinary, and multi-functional capabilities in life sciences, physical sciences, environmental sciences, mathematics, cognitive sciences, and engineering.  Efforts in this project support the seamless integration of state-of-the-art-technologies into a collection of systems across the spectrum of capabilities required to support chemical and biological defense missions.  Capability areas in this project include: protection\/hazard mitigation; detection; information systems technology; and threat agent science.  Protection and hazard mitigation focuses on providing technologies that protect from and reduce the impact of chemical\/biological threat or hazard to the Warfighter, weapons platforms, and structures.  Detection focuses on developing technologies for standoff and point detection and identification of chemical and biological agents.  Information systems technology focuses on advanced hazard prediction, operational effects and risk assessment, and systems performance modeling.  Threat agent science is devoted to characterizing threat agents and the hazards they present in terms of agent fate in the environment, toxicology, and pathogenicity, and focuses on the horizontal integration of CB defensive technologies in support of the Joint Services."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.333"
                                            },
                                            "Text": {
                                                "val": "Continued transition of sorbent decontaminant formulation effort to advanced development for immediate decontamination to leverage emerging technologies and data that demonstrates significantly greater efficacy if decontamination process is initiated within the first hour.  Continued application of data gathered from surface science investigations to inform design to initiate development of the next generation of hazard mitigation technologies that include integration of multiple systems to achieve efficacy goals.  Continued enhanced CB survivability and responsive coatings projects to enhance decontaminability as part of the systems approach to achieving efficacy goals.  Continued demonstration of the wide-area decontamination hazard mitigation effort, which focuses on biological spore decontamination in a representative outdoor environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.171"
                                            },
                                            "Text": {
                                                "val": "Complete agent resistant coatings effort and transition to the Air Force Item manager.  Continue chemical hot air decontamination effort to address sensitive equipment, platform interior, and aircraft chemical warfare agent decontaminant needs.  Continue responsive coatings efforts to enhance decontaminability as part of the systems approach to achieving efficacy goals.  Continue Wide Area Decontamination of Bacillus anthracis projects, focusing on agrochemical approaches.  Continue surface science investigations with expanded set of materials, parameters and agents to inform design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals.  Continue elimination\/bulk chemical warfare agent destruction effort, focusing on neutralization and polymerization of bulk chemical warfare agents.  Continue effort to examine how decontamination technologies perform on field assets when contaminated with other than Chemical Agent Standard Analytical Reference Material (CASARM) (laboratory quality\/pure) chemical agents.  Continue efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.180"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.180"
                                            },
                                            "Text": {
                                                "val": "Complete sorbent decontaminant formulation effort to advanced development for tactical decontamination, complete vapor and complex surface efficacy performance evaluations.  Continue surface science investigations with expanded set of materials, parameters and agents focusing on informing design for the development of the next generation of hazard mitigation technologies to achieve toxicology-based efficacy goals.  Continue coatings development utilizing new chemical agent resistance method to reduce chemical absorption.  Continue Wide Area Decontamination of Bacillus anthracis projects, focusing on subscale formulation testing.  Continue chemical hot air decontamination effort including the insertion of aerosolized decontaminants to reduce the time and logistical requirements associated with addressing sensitive equipment, platform interior, and aircraft CWA decontaminant needs in a laboratory environment.  Continue effort to examine how decontamination technologies perform on field assets coated with battlefield grime when contaminated with impure weapons-grade representative chemical agents. Continue efforts to develop\/enhance agent mapping (disclosure\/assurance) technologies, including generating electronic records of contamination locations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and integration of novel filtration media into a lightweight, low-profile, and low-burden individual protective filter, which has enhanced performance against a broader range of challenges that includes TICs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.437"
                                            },
                                            "Text": {
                                                "val": "Continued to develop components of a hybrid respirator that can scale between different challenge environments.  Components include nanotechnologies, anti-fogging materials, dynamic response breathing, oxygen storage and CO2 scrubbing.\nContinued novel filtration efforts and developed respirator-helmet integration technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.113"
                                            },
                                            "Text": {
                                                "val": "Continue novel filtration efforts and develop respirator-helmet integration technologies.  Continue closed circuit Self Contained Breathing Apparatus (SCBA) development, and portable integrated air management systems.  Initiate multifunctional systems in relevant configurations at scale for respiratory and ocular protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.464"
                                            },
                                            "Text": {
                                                "val": "Continue to evaluate improved oxygen and carbon dioxide removal technologies.  Continue to evaluate and assemble improved sensor technologies and control systems into SCBA platform.  Continue coordination with percutaneous protection to make whole ensemble and extend the available operational time and improve interface with tactical equipment.  Continue respirator and helmet integration with emerging filtration technologies and compatible components.  Develop and qualify flexible and stretchable materials for all hazard use."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Develop advanced ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.713"
                                            },
                                            "Text": {
                                                "val": "Continued from FY16 Percutaneous Protection engineering of mixed matrix membranes with increased moisture permeability and selectivity against CB threats.  Continued from FY16 Percutaneous Protection incorporation of metal-organic frameworks\/metal oxide (MOF\/MO) constructs into these membranes to destroy chemical agents.  Continued from FY16 Percutaneous Protection test reactive (MOF\/MO) materials with chemical agents and develop deposition strategies to form composite materials.  Continued from FY16 Percutaneous Protection development and demonstration of fully integrated ensembles that meet National Fire Protection Association (NFPA) standards for full-spectrum hazards that support tactical operations for all services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.333"
                                            },
                                            "Text": {
                                                "val": "Continue to develop advanced National Fire Protection Association (NFPA) certified fully encapsulated ensemble prototypes with state-of-the art materials that address the full spectrum of threats and provide a range of solutions optimized for protection, thermal comfort, and mission performance.  Continue to develop composite and novel multi-functional materials and low thermal burden garment materials which provide site-specific CB protection On Demand."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.120"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.120"
                                            },
                                            "Text": {
                                                "val": "Continue the process to mount compounded materials onto fabrics for protection.  Continue to conduct fiber and yarn analysis.  Continue to develop knit and woven samples for evaluation.  Develop respirator and helmet integration, develop and qualify flexible and stretchable materials for all hazard use.  Fabricate and test hood\/mask interface concepts, perform whole system agent tests.  Develop mechanisms at scale, and finalize proof of principle responsive materials.  Determine usefulness of metal organic frameworks and other materials for use in fabrics for protective ensembles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their CWA filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.093"
                                            },
                                            "Text": {
                                                "val": "Continued systems integration and surveillance of Guard Bed filters and RLIs.  Continued fabrication of the photo luminescent RLI satellite cartridge prototypes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.343"
                                            },
                                            "Text": {
                                                "val": "Continue systems integration and surveillance of Guard Bed filters and RLIs.  Continue fabrication of the photo luminescent RLI satellite cartridge prototypes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.370"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Text": {
                                                "val": "Continue field testing and sampling of guard bed and Residual Life Indicator (RLI) filters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.160"
                                            },
                                            "Text": {
                                                "val": "Continued Personnel Decontamination hazard mitigation projects to develop an alternative to Reactive Skin Decontamination Lotion (RSDL).  Continued mass casualty personnel decontamination projects to develop technology to manage the specific issues (throughput and efficacy) associated with mass casualty decontamination to support warfighter operations, including homeland defense mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.450"
                                            },
                                            "Text": {
                                                "val": "Transition technology data efforts to develop an alternative to Reactive Skin Decontamination Lotion (RSDL).  Initiate personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.370"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.370"
                                            },
                                            "Text": {
                                                "val": "Continue personnel decontamination efforts to enhance current processes (kinetics, dwell time, mechanics, etc.) and support mass casualty personnel decontamination warfighter operations to increase throughput and decrease logistics and burden on warfighters, including efficacy studies associated with the homeland defense mission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact, and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools.  This effort will be realigned in FY19 to CB2 (Chemical Biological Defense) Threat Surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.193"
                                            },
                                            "Text": {
                                                "val": "Developed technologies (e.g., event-based surveillance and historical baselines; predictive models of plant and\/or animal disease; uncertainty quantification) to intelligently fuse ubiquitous sensing capabilities (wearables, field deployed diagnostics and autonomous environmental sensing vehicles).  Data fusion and calibration technologies, developed in FY16 under BA2 TM2\/Diagnostics, have been completed and validated.  Completed device-to-cloud capabilities effort to reliably transmit sensed data to a secure repository and appropriately feed into disease modeling, medical resource estimation, and decision support tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.708"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies aimed at predicting, forecasting and mitigating biosurveillance events (e.g., data gathering and sharing mechanisms for event-based surveillance; compilation of historical baselines; models of plant and\/or animal disease spread; social media data analytics, uncertainty quantification).  Develop capabilities to intelligently fuse ubiquitous sensing capabilities (wearables, field deployed diagnostics and autonomous environmental sensing vehicles) for earlier warning.  Initiate enhanced data visualization capabilities for both sensor data fusion and predictive disease propagation models.  Initiate Integrated Early Warning Ecosystem to provide improved Chemical and Biological Defense (CBD) situational awareness, a common analytical work bench for users, integration and fusion of a wide array of relevant data sources, and decision support tools for the tactical to strategic level command authorities.  The intent is to leverage advances gained in the Biosurveillance Ecosystem development for application in the wider Integrated Early Warning domain.  This effort will be funded out of both CB2 (Chemical Biological Defense)\/Biosurveillance and TM2 (Techbase Med Defense)\/Biosurveillance .  Efforts in this budget will focus on modeling and simulation and innovative data fusion techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Detection"
                                    },
                                    "Description": {
                                        "val": "Emphasis on the detection and identification of chemical and biological threats.  Objectives include the development of miniaturized detector for sensing of chemical and biological agents, and design for prototype whole pathogen genome sequencing system.  This effort will be realigned in FY18 to CB2 (Chemical Biological Defense) Detection Sensor Technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.249"
                                            },
                                            "Text": {
                                                "val": "Continued concept and technology development for the biological threat early warning detection.  Initiated development of sample preparation techniques to enhance environmental detection platforms.  Continued the development of proteomic detection capabilities."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Detection Sensor Technologies"
                                    },
                                    "Description": {
                                        "val": "Focus of this effort is to develop capabilities to detect and identify chemical and biological threats.  This activity can include development of point, remote, or standoff sensors as appropriate, to address both conventional and non-traditional chemical and biological threats.  These efforts are being developed to further the detection capability for early warning of contamination exposure to the warfighter.  This effort will be realigned in FY18 from CB2 (Chemical Biological Defense) Detection and NT2 (Techbase Non-Traditional Agents Defense) Detection."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.051"
                                            },
                                            "Text": {
                                                "val": "This program realigns FY17 efforts from CB2 (Chemical Biological Defense)\/Detection and NT2 (Techbase Non-Traditional Agents Defense)\/Detection.  Continue concept and technology development for biological and chemical threat early warning detection.  Continue development of sample preparation techniques to enhance environmental detection platforms.  Initiate the development of detection capabilities for identifying genomic editing events.  Continue development of a man worn environmental sensor for detecting exposure to chemical hazards.  Continue the development of proteomic detection capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.270"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.270"
                                            },
                                            "Text": {
                                                "val": "Continue concept and technology development for biological and chemical threat early warning detection to include distributed biological reconnaissance capabilities along with the ability to reduce false alarms in a highly complex and chemical saturated environment.  Continue development of detection capabilities for identifying genomic editing events.  Initiate the development of exploring sensing approaches to provide unattended monitoring of perimeters for rapid defensive positioning to enable early indication of airborne chemical threats.  Continue the development of sensors for mobile applications, including development for unmanned systems.  Initiate a program to investigate an automated man-out-of-loop remote biological collection and detection system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Hazard Prediction"
                                    },
                                    "Description": {
                                        "val": "Improve battlespace awareness by accurately predicting hazardous material releases, atmospheric transport and dispersion, and resulting human effects.  Develop capability for predicting the source term of releases of chemical, biological, and industrial materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.876"
                                            },
                                            "Text": {
                                                "val": "Continued development of waterborne transport and dispersion models, including advancements to the Incident Command Tool for Drinking Water Protection (ICWater) and System for Hazard Assessment of Released Chemicals (SHARC).  Incorporated new data sources for higher resolution land-use, bathymetric and oceanographic data.  Continued related field studies to validate waterborne transport and dispersion model outputs.  Expanded capability of SHARC to model biological threat agents.  Continued interior building transport and dispersion modeling effort to improve modeling of outdoor dispersion from indoor release and modeling of indoor dispersion in multiple buildings from an outdoor release, simulating wide-area effects of a release in an urban environment.  Continued work to optimize the urban subsystem modeling capability and developed capability to perform linked Bayesian probability analysis and increase the fidelity of source term estimation for urban environments.  Continued development of MicroSWIFT\/SPRAY (MSS) to improve hazard prediction for urban environments in HPAC.  Continued research and development to enhance the fidelity of the missile intercept modeling capability within the HPAC.  Continued development of a virtual test and evaluation simulation environment for evaluating\/stressing source characterization and hazard refinement techniques."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.648"
                                            },
                                            "Text": {
                                                "val": "Continue development to improve urban subsystem, specifically coupling between indoor and outdoor dispersion models for urban releases and initiate field studies for validation of these capabilities.  Begin development and enhancement of source-term estimation\/source characterization algorithms.  Complete research and development of enhancements to the fidelity of the missile intercept modeling capability within the Hazard Prediction and Assessment Capability (HPAC).  Initiate research and development of advanced weather modeling techniques.  Initiate development of enhancements to human response models for CBRN agent and toxic industrial chemical exposures.  Continue development of MSS to improve hazard prediction for urban environments in HPAC, including continuing to upgrade the code to meet CCMI compliance and implementing terrain-following dense gas motions.  Complete development of a secondary evaporation model.  Initiate development of next generation littoral waterborne modeling system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.253"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.253"
                                            },
                                            "Text": {
                                                "val": "Continue development of coupled indoor and outdoor dispersion models for enhanced hazard prediction in urban environments.  Execute a field trial to collect validation data for coupled indoor and outdoor dispersion models and conduct sample analysis for all field trial samples.  Continue development of MicroSWIFT\/SPRAY (MSS) for improved hazard prediction in urban environments.  Continue enhancements to source term estimation and source characterization algorithms.  Complete development of a secondary evaporation model.  Begin integration of secondary evaporation model with MSS.  Begin research and development of mobile applications for CBRN hazard prediction consequence assessment tools.  Continue researching new methods for the development of next generation dispersion models such as hybrid Large Eddy Simulation\/Gaussian approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Data Analysis"
                                    },
                                    "Description": {
                                        "val": "Develop CBRN data sharing capabilities and simulation tools.  Develop chapters of the Chemical and Biological Agent Effects Manual Number 1 (CB-1), an authoritative source capturing analytical methods for evaluating the effects of Chemical Biological (CB) agents on equipment, personnel, and operations.  These chapters are developed by a mix of contractors and labs, employing experts in each subject area."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.489"
                                            },
                                            "Text": {
                                                "val": "Improved modeling of subsurface chemical concentrations of contaminants.  Continued the review of CB-1 chapters and the revision of completed CB-1 chapters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.216"
                                            },
                                            "Text": {
                                                "val": "Continue working on all 20 Chapters of CB-1.  Make CB-1 available online.  Continue providing access of field trial data sources to transport and dispersion community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.364"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.364"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, revise and integrate CB-1.  Continue to host and maintain online accessibility of CB-1 to the Chemical Biological Defense Program (CBDP) community, as well as enhance online capabilities based on user feedback."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Supports defensive countermeasure development against CB threats by delivering the scientific data, understanding, and relevant human estimates of the hazards posed to humans by exposure to CB agents.  Toxicological and\/or infectious-dose information and environmental response supports development and\/or enhancement of both operational risk and exposure guidelines; identifies gaps in detection and protection; informs decontamination procedures; and supports the development of medical countermeasures.  Knowledge generated from this program is used to inform understanding of hazards, hazard prediction models, and materiel and countermeasure development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.369"
                                            },
                                            "Text": {
                                                "val": "Continued to develop methods for biological agent characterization including genomic fingerprinting and tracing initiated with Ebola virus efforts.  Initiated effort to deliver environmental metagenomics information.  Provided environmental persistence and decontamination estimates on high priority biological threat agents.  Continued to define particle properties to predict aerosolization behavior to inform hazard assessment.  Continued efforts to characterize the environmental fate of biological aerosols for hazards assessment.  Continued developing methods for understanding and predicting agent-substrate interactions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.575"
                                            },
                                            "Text": {
                                                "val": "Continue developing advanced methods for biological agent characterization.  Continue to deliver environmental metagenomic information.  Continue providing data on fate, persistence, and response of priority biological agents in various environments to reveal latent details on their behavior.  Continue developing methods to understand biological agent fate on surfaces and begin developing methods for understanding energetic materials for vulnerability assessments and signature identification and development.  Continue defining particle properties and agent-substrate interaction to predict agent behavior and aerosolization to inform hazard assessment.  Continue with relevant biological toxicity and infectious dose studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection; and goals for decontamination and medical countermeasures.  Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.425"
                                            },
                                            "Text": {
                                                "val": "Continue developing advanced methods for threat agent characterization.  Continue providing data on fate, persistence, and response of priority agents in various environments.  Continue developing methods to understand agent fate on surfaces.  Continue defining particle properties and agent-substrate interaction to predict agent behavior and aerosolization to inform hazard assessment.  Continue studies to provide data to inform operational risk and exposure guidelines, response, detection, and protection; and define goals for the development of decontamination procedures and medical countermeasures.  Continue assessing the impact of environmental factors on threat agent activity (persistence, transport, degradation, resuspension, decontamination, and disinfection)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Operational Effects and Planning"
                                    },
                                    "Description": {
                                        "val": "Provide tools to enable the assessment and mitigation of impacts at the personnel, system, tactical, operational and strategic levels.  Develop and institutionalize consensus-based, scientifically sound data and analytical methods to link CBRN exposures to relevant operational effects and to enhance test and evaluation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.814"
                                            },
                                            "Text": {
                                                "val": "Continued to develop health and human effects modeling capability.  Increased operational effects research and analysis efforts, to provide objective, quantitative analysis in support of science and technology initiatives, material developments, operational guidance, and requirements setting.  Continued the development of an augmented reality sand table with CBRN modeling capabilities.  Continued the development of the Navy Operational Risk Model (NORM).  Completed the planning phase and began the experimental phase of Navy specific operational performance studies in order to assess and model the effects mission oriented protective posture (MOPP) equipment has on the ability for the Littoral Combat Ship (LCS) surface-platform to carry out mission critical tasks.  Completed the research and planning phase of Air Force specific operational performance studies.  Initiated studies to assess and obtain data to model the effects exposures to low level nerve agents have on tasks associated with fixed-wing piloting and small arms marksmanship.  Continued to conduct TIC toxicity level studies and provide subject matter expertise support as needed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.046"
                                            },
                                            "Text": {
                                                "val": "Complete development of health and human effects modeling capability.  Conduct service-specific human performance experiments aimed at better understanding operational risk.  Provide objective, quantitative analysis in support of science and technology initiative, material developments, operational guidance, and requirements setting.  Develop simulation-based training to enhance senior leader decision making during weapons of mass destruction (WMD) crises.  Enhance CBRN operational risk assessment tools for the Navy.  This includes the development of models of various ship classes and tools to assess the impact of CBRN use on individual and team tasks.  Begin to study the relationships among low level chemical nerve agent exposures, adverse individual health and physiological effects, and degradation on individual military task performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.675"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.675"
                                            },
                                            "Text": {
                                                "val": "Continue Air Force and Navy service specific human performance studies.  Plan and initiate Army and Marine Corps specific operational performance studies.  Continue to enhance CBRN operational risk assessment tools for the Navy.  Continue efforts to determine the effects of chemical warfare agents (CWA) on individual tasks.  Continue studies to determine the toxicity levels of Toxic Industrial Chemicals (TICs).  Conduct direct subsurface transport measurement studies and continue modeling contact transfer exposures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "13) Threat Surveillance"
                                    },
                                    "Description": {
                                        "val": "Integrate disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into chemical and biological threat advanced warning systems, tactical decision aids, and leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  This effort will be realigned in FY19 from CB2 (Chemical Biological Defense) Biosurveillance and TM2 (Techbase Medical Defense) Biosurveillance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.503"
                                            },
                                            "Text": {
                                                "val": "Expand the number of pathogens, hosts and vectors incorporated into a robust prediction and forecasting capability.  Develop tactical decision aids on mobile applications to identify risks and provide mitigation strategies for chemical and biological threats.  Identify new data streams, such as physiological markers, which can be leveraged to support early warning and forecasting.  Develop a global area of concern forecasting risk map capability.  Conduct studies to determine the validity of using wearable biomonitoring data as indicative and predictive of health status in controlled environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "CB3"
                                    },
                                    "Title": {
                                        "val": "CHEMICAL BIOLOGICAL DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.584"
                                        },
                                        "CurrentYear": {
                                            "val": "18.093"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.698"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "21.675"
                                        },
                                        "BudgetYearThree": {
                                            "val": "21.735"
                                        },
                                        "BudgetYearFour": {
                                            "val": "21.740"
                                        },
                                        "BudgetYearFive": {
                                            "val": "21.737"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "NT2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.042"
                        },
                        "CurrentYear": {
                            "val": "56.187"
                        },
                        "BudgetYearOne": {
                            "val": "53.720"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.720"
                        },
                        "BudgetYearTwo": {
                            "val": "52.986"
                        },
                        "BudgetYearThree": {
                            "val": "50.200"
                        },
                        "BudgetYearFour": {
                            "val": "52.503"
                        },
                        "BudgetYearFive": {
                            "val": "52.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project NT2 provides early applied research to enhance and develop defensive capabilities against Non-Traditional Agents (NTAs).  This project focuses on expanding scientific knowledge required to develop defensive capabilities and to demonstrate fast and agile scientific responses to enhance or develop capabilities that address emerging threats.  Efforts in this project support an integrated approach to counter emerging threats through innovative science and technology (S&T) solutions for detection, protection, decontamination, information systems and modeling and simulation, and medical countermeasures.  This project is a comprehensive and focused effort for developing NTA defense capabilities, coordinated with specific interagency partners for doctrine, equipment, and training for the Warfighter and civilian population for defense against NTAs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Expeditionary Collective Protection"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies for soldiers to determine the remaining chemical vapor service life of their CWA filters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.454"
                                            },
                                            "Text": {
                                                "val": "Began to analyze and characterize the performance of Residual Life Indicator (RLI) satellite filter cartridge.  Started to optimize the RLI performance to ensure correlation to that of the carbon bed in a CBRN collective protection filter.  Initiated the collection of data to establish how the filter bed performance of the RLI is effectively correlated with Guard Bed (a low profile pre-filter) and the RLI creates an extended filter bed life with Guard Bed."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "Assess baseline novel filtration materials against NTAs and other emerging threats under laboratory conditions.  Continue to analyze and characterize the performance of RLI satellite filter cartridges against NTAs and other emerging threats.  Continue to collect data to establish correlation or filter bed performance and pre-filter system against NTAs and other emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Material Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop highly effective non-traditional or novel decontamination technologies that integrate with current procedures and support non-material improvements of the overall decontamination effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.991"
                                            },
                                            "Text": {
                                                "val": "Continued integrating of NTAs, including newly identified emerging threats into the continuing Government owned decontaminant formulation, sensitive equipment decontamination (enzyme and catalytic) projects, responsive coatings, multiple system integration, and the full hazard mitigation technology development portfolio.  Initiated focus on hazard mitigation of other emerging threats and classes of NTAs, including data sharing with international partners.  Continued incorporation of data gathered from surface science effort to inform design of new approach on Government owned formulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.939"
                                            },
                                            "Text": {
                                                "val": "Continue integrating the full range of NTAs into the material contamination mitigation portfolio.  Continue responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals.  Continue effort to examine how decontamination technologies perform on field assets when contaminated with other than CASARM (laboratory quality\/pure) NTAs.  Continue efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.605"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.605"
                                            },
                                            "Text": {
                                                "val": "Continue integrating the full range of NTAs and other emerging threats into the material contamination mitigation portfolio.  Continue responsive coatings efforts to enhance NTA decontaminability as part of the systems approach to achieving efficacy goals.  Continue effort to examine how decontamination technologies perform on field assets that include battlefield grime when contaminated with impure weapons-grade representative NTAs.  Continue efforts to develop\/enhance NTA mapping (disclosure\/assurance) technologies, including generating electronic records of contamination locations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Personnel Contamination Mitigation"
                                    },
                                    "Description": {
                                        "val": "Develop new technologies to mitigate the risk associated with contaminated human remains and personal effects (materials) exposed to and contaminated by chemical agents by neutralizing and\/or physically removing the residual chemical agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.908"
                                            },
                                            "Text": {
                                                "val": "Continued mass casualty personnel decontamination projects to develop technology to manage the specific issues (throughput and efficacy) associated with mass casualty decontamination that include efficacy against NTAs and emerging threats decontamination to support warfighter operations, including homeland defense mission."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.761"
                                            },
                                            "Text": {
                                                "val": "Transition technology data developed by efforts to develop an alternative to RSDL, including efficacy data against representative NTAs to Next Generation Personnel Decontamination.  Initiate personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.359"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.359"
                                            },
                                            "Text": {
                                                "val": "Continue technology data developed by efforts to develop an alternative to RSDL, including efficacy data against representative NTAs in close coordination with concurrent medical testing required to achieve FDA approval.  Continue personnel decontamination efforts to enhance current processes and support mass casualty personnel decontamination warfighter operations, including homeland defense mission, including efficacy data against representative NTAs required to achieve FDA approval."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Respiratory and Ocular Protection"
                                    },
                                    "Description": {
                                        "val": "Development and analysis of design alternatives for chemical and biological air-purifying respirators that provide enhanced protection with lower physiological burden and improved interface with mission equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.419"
                                            },
                                            "Text": {
                                                "val": "Continued to investigate performance limitations current and developmental of respiratory protection technologies against NTA challenges and investigate counter-measures to these specific limitations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.733"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate upgrades to existing air purification (including respiratory protection) technologies to enable broad spectrum protection and extended filter life.  Assess novel filtration materials against new NTAs and compounds of interest."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.250"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.250"
                                            },
                                            "Text": {
                                                "val": "Continue development and integration of component and system upgrades to existing air purification (including respiratory protection) technologies to provide protection and extended filter life against emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project schedule."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Chemical Pretreatments - Medical"
                                    },
                                    "Description": {
                                        "val": "Develops pretreatments and prophylactics that provide protection against non-traditional agents (NTAs) and emerging chemical threats.  Prophylactic medical countermeasures (MCMs) include catalytic and stoichiometric bioscavengers that rapidly bind and detoxify a broad spectrum of NTAs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.467"
                                            },
                                            "Text": {
                                                "val": "Explored bioscavengers administered as post-exposure, pre-symptomatic prophylaxis against NTAs in validated animal models.  Evaluated Food and Drug Administration (FDA) licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.837"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to identify and develop catalytic enzymes for use against selected, priority NTAs.  Continue to explore alternative technologies for bioscavenging enzymes to address capability gaps such as immunogenicity, circulatory stability, dosing, shelf-life, and delivery.  Initiate development of new platform technologies such as modulation of endogenous protein expression or other innate protective response.  Complete investigation of nanotechnology to support prophylactic countermeasures.  Continue research projects at the ADMET CoE to improve MCM understanding and facilitate development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.717"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to develop catalytic enzymes for use against selected, priority NTAs.  Continue to explore alternative technologies for prophylaxis to address capability gaps such as immunogenicity, circulatory stability, dosing, shelf-life, and delivery.  Complete investigation of nanotechnology to support prophylactic countermeasures.  Complete evaluation of Food and Drug Administration (FDA) licensed MCMs for potential pretreatment\/prophylaxis against NTAs and emerging chemical threats.  Continue research projects at the ADMET CoE to improve MCM understanding and facilitate development.  Continue new approaches to identify pretreatment and prophylaxis against multiple classes of NTAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Chemical Therapeutics - Medical"
                                    },
                                    "Description": {
                                        "val": "Investigates common mechanisms of agent injury.  Physiological parameters and pathological assessments will be used to establish the general mode and mechanism(s) of toxicity to inform countermeasure development.  Develops, assesses, evaluates, and validates therapeutics for treatment resulting from exposure to NTAs and emerging chemical threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.411"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize novel therapeutic compounds that cross the blood brain barrier (BBB) for use as treatments for NTA exposures.  Continued to evaluate licensed FDA therapeutics against NTAs for potential emergency use authorization (EUA).  Continued to utilize the ADMET CoE to support evaluation and development of new NTA therapeutics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.670"
                                            },
                                            "Text": {
                                                "val": "Continue pursuit of analogs of therapeutic compounds to treat NTA exposures.  Continue to test compounds using high-throughput, in vitro screens.  Continue to evaluate licensed FDA therapeutics against selected, priority NTAs.  Continue to evaluate compounds at the ADMET CoE to identify leads.  Continue to evaluate FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of chemical agent exposure.  Initiate additional animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.272"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.272"
                                            },
                                            "Text": {
                                                "val": "Continue pursuit of analogs of therapeutic compounds to treat NTA exposures.  Continue to test compounds using high-throughput, in vitro screens.  Continue to evaluate licensed FDA therapeutics against selected, priority NTAs.  Continue to evaluate compounds at the ADMET CoE to identify leads.  Deliver information on the evaluation of FDA licensed\/approved products for therapeutic applications for countering the deleterious effects of an NTA exposure to the advanced developer.  Continue animal studies to support regulatory submission of candidate therapeutics for treatment of the toxic effects of selected, priority NTAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Detection"
                                    },
                                    "Description": {
                                        "val": "Primary focus is to assess the potential of multiple technologies to meet the needs to detect the presence of NTAs.  This effort will be realigned in FY18 to CB2 (Chemical Biological Defense) Detection Sensor Technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.090"
                                            },
                                            "Text": {
                                                "val": "Continued development from technology concepts and models to meet the needs to detect contamination on surfaces in pre and post decontamination applications.  Continued concept and technology development for chemical threat early warning detection.  Initiated development of a man worn environmental sensor for detecting exposure to chemical hazards."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Modeling & Simulation"
                                    },
                                    "Description": {
                                        "val": "Provide modeling of NTA materials for hazard prediction.  Develop NTA source term algorithms for predicting chemical hazards from intentionally functioning weapons, counter-proliferation scenarios (bomb on target), and missile intercept.  Investigate NTA agent fate for secondary effects, environmental\/atmospheric chemistry, atmospheric and waterborne transport and dispersion, human effects, model Validation and Verification (V&V), scaled testing, casualty estimation, and supporting data management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.606"
                                            },
                                            "Text": {
                                                "val": "Completed sensitivity and validation studies on NTA source term models and update and expand NTA databases.  Continued development of agent fate modeling for NTAs.  Began expansion of System for Hazard Assessment of Released Chemicals (SHARC) to model waterborne dispersion of NTAs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.722"
                                            },
                                            "Text": {
                                                "val": "Initiate additional small-scale testing of NTA simulants and provide test data for source term model development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.707"
                                            },
                                            "Text": {
                                                "val": "Complete development of agent fate modeling for NTAs.  Complete expansion of SHARC to model NTAs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Percutaneous Protection"
                                    },
                                    "Description": {
                                        "val": "Study and assessment of percutaneous protective technologies.  Membrane and composite material (\"novel materials\"\/\"multifunctional materials\") efforts will continue on in Percutaneous Protection NT3 (Non-Traditional Agents) during FY18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.397"
                                            },
                                            "Text": {
                                                "val": "Initiated engineering of mixed matrix membranes with increased moisture permeability and selectivity against NTA threats.  Began incorporation of metal-organic frameworks\/metal oxide (MOF\/MO) constructs into these membranes to destroy NTA agents.  Began to test reactive (MOF\/MO) materials with NTAs and develop deposition strategies to form composite materials.  Began development and demonstration of fully integrated ensembles that meet NFPA standards for NTA\/Emerging Threats that support tactical operations for all services."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "Continue development of novel materials and ensembles that provide protection against NTAs and emerging threats.  Initiating additional NTA and other emerging threats tests."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Threat Agent Sciences"
                                    },
                                    "Description": {
                                        "val": "Provide critical agent characterization (chemical, physical and physiological\/toxicological) data on current and emerging threat agents to prepare for surprise, enabling and informing development and testing of NTA defense technology (e.g., detection, decontamination, protection, and hazard assessment).  This characterization of new threats informs decision makers and development of Concept of Operations (CONOPs) and Tactics, Techniques and Procedures (TTP); it also provides the basis for countermeasure development and assessment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.299"
                                            },
                                            "Text": {
                                                "val": "Continued to characterize priority emerging threats to provide critical agent parameters to decision makers and technology developers to support countermeasure development and testing, and to inform CONOPs, policies, doctrines and procedures.  Built linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps.  Continued the evaluation of synthesis pathways, physico-chemical properties and environmental fate properties for priority threats.  Continued assessing the impact of environmental factors and substrate properties on threat agent activity (e.g. persistence, transport, degradation, resuspension).  Continued preparing laboratory and operationally-relevant toxicity estimates for next priority NTAs.  Refined and delivered human toxicity estimates for a priority NTA.  Continued developing in-silico platforms for predicting human ADMET of threat agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.525"
                                            },
                                            "Text": {
                                                "val": "Continue characterizing priority emerging threats to provide critical supportable data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures.  Continue to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats.  Continue evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats.  Continue assessing the impact of environmental factors and substrate properties on threat agent activity (persistence, transport, degradation, resuspension, etc.). Continue preparing laboratory and operational toxicity estimates for next priority NTAs.  Continue to refine and deliver human toxicity estimates for next priority NTAs.  Initiate development of medium- to high-throughput laboratory approaches to predict acute systemic toxicity in support of CRISTAL capability.  Expand computational and in vitro research efforts concerning ADMET, physical characterization and behavior to support development of the CRISTAL capability.  Initiate efforts to integrate the computational and in vitro predictive tools developed for CRISTAL to provide a computational user interface that can accommodate multiple streams of data and provide outputs based on best available information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.851"
                                            },
                                            "Text": {
                                                "val": "Continue characterizing priority emerging threats to provide critical support data to enable countermeasure development and testing as well as inform CONOPs, policies, doctrines and procedures.  Continue to build linkages between emerging threat characterization and advanced development capability assessments to better define current capability gaps for emerging threats.  Continue evaluating synthesis pathways, physicochemical properties and environmental fate properties for priority threats.  Continue assessing the impact of environmental factors and substrate properties on threat agent activity (e.g. persistence, transport, degradation, resuspension).  Continue preparing laboratory and operationally-relevant toxicity estimates for next priority NTAs.  Continue to refine and deliver human toxicity estimates for next priority NTAs.  Continue development of medium- to high-throughput laboratory approaches to predict acute systemic toxicity.  Expand computational and in vitro research efforts concerning ADMET, physical and chemical characterization and behavior."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NT3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE NON-TRADITIONAL AGENTS DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.055"
                                        },
                                        "CurrentYear": {
                                            "val": "23.655"
                                        },
                                        "BudgetYearOne": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "22.749"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "24.219"
                                        },
                                        "BudgetYearThree": {
                                            "val": "30.349"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.155"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.150"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TM2"
                    },
                    "ProjectTitle": {
                        "val": "TECHBASE MED DEFENSE (APPLIED RESEARCH)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "73.096"
                        },
                        "CurrentYear": {
                            "val": "73.212"
                        },
                        "BudgetYearOne": {
                            "val": "70.960"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.960"
                        },
                        "BudgetYearTwo": {
                            "val": "72.997"
                        },
                        "BudgetYearThree": {
                            "val": "78.989"
                        },
                        "BudgetYearFour": {
                            "val": "81.306"
                        },
                        "BudgetYearFive": {
                            "val": "79.218"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project TM2 provides for applied research for innovative technology approaches to advance medical systems designed to rapidly identify, diagnose, prevent, and treat disease due to exposure to chemical and biological threat agents.  Categories for this project include core science efforts in Medical Chemical, Medical Biological, Diagnostics, and Medical Countermeasures.  This project supports applied research for the investigation of new medical countermeasures to include prophylaxes, pretreatments, antidotes, skin decontaminants, and therapeutic drugs against identified and emerging biological and chemical warfare agents.  Medical Science and Technology (S&T) efforts in this Budget Activity refine promising medical initiatives identified in Budget Activity 1, resulting in the development of countermeasures to protect against and treat the effects of exposure to chemical and biological (CB) agents.  Diagnostic research focuses on providing high quality data closer to the point-of-need comprising device innovation, panels of biomarkers driven by bioinformatics, and epidemiological modeling tools."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "1) Biosurveillance"
                                    },
                                    "Description": {
                                        "val": "Biosurveillance\/Disease Surveillance: Integrate existing disparate military and civilian datasets, investigate methodologies to appropriately integrate open source data into advanced warning systems.  Leverage and enhance advanced epidemiological models and algorithms for disease prediction, forecasting, impact and biological threat assessment.  Contribute to the development of global, near real-time, disease monitoring and surveillance systems that address secondary infection, fuse medical syndromic, environmental, and clinical data, and feed into disease modeling, medical resource estimation and decision support tools.  The CBDP partners with civil agencies and Department of Defense (DoD) agencies to provide near real-time information and provide situational awareness, yielding analytical and predictive capabilities for DoD decision makers including CCDRs.  This effort will be realigned in FY19 to CB2 (Chemical Biological Defense) Threat Surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.182"
                                            },
                                            "Text": {
                                                "val": "Development of Biosurveillance Ecosystem was shifted to Biosurveillance.  Completed the next iteration of analytic capabilities, specifically an agricultural animal population database for zoonotic disease analysis, an online crowdsourcing game for bacterial genome assembly to enhance rapid pathogen discovery and identification, a capability to assess the risk of disease spread to the United States, a data-driven framework for zoonotic disease prediction, and tools for diagnosing infectious disease bioevents.  Continued development of biosurveillance analytic capabilities, including real-time disease forecasting capabilities, novel visualization capabilities, mobile applications, an ecological analytics capability to monitor and map global, near-real-time areas at risk of emerging infectious diseases, an ability to link sequencing at remote locations with the Biosurveillance Ecosystem.  Developed next generation of technologies with focus on synthesizing large volumes of data to enable analysts and decision makers to make informed decisions in real-time.  Initiated new efforts to explore utilizing ensemble approaches to disease forecasting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.171"
                                            },
                                            "Text": {
                                                "val": "Continue development of biosurveillance analytic capabilities, including real-time disease forecasting capabilities, novel visualization capabilities, mobile applications, an ecological analytics capability to monitor and map global, near-real-time areas at risk of emerging infectious diseases.  Continue new efforts to explore utilizing ensemble approaches to disease forecasting.  Initiate Integrated Early Warning Ecosystem to provide improved CBD situational awareness, a common analytical work bench for users, integration and fusion of a wide array of relevant data sources, and decision support tools for the tactical to strategic level command authorities.  The intent is to leverage advances gained in the Biosurveillance Ecosystem development for application in the wider Integrated Early Warning domain.  This effort will be funded out of both CB2 (Chemical Biological Defense)\/Biosurveillance and TM2 (Techbase Med Defense)\/Biosurveillance .  Efforts in this budget will focus on medical and diagnostic data and analytics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "2) Chemical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Focuses on developing state-of-the-art laboratory\/fieldable methods that detect exposure to CWA\/NTA in clinical samples.  Identifies biomolecular targets that can be leveraged as analytical methodologies, as well as, laboratory and animal studies characterizing time-course and longevity of a particular analyte\/biomarker.  This effort will be realigned in FY19 to TM2 (Techbase Med Defense) Medical Diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.163"
                                            },
                                            "Text": {
                                                "val": "Completed development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds.  Completed the development of confirmatory assays for discovered markers and assay verification studies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.482"
                                            },
                                            "Text": {
                                                "val": "Complete development of assays for enhancing the ability to identify sublethal exposure to emerging chemical agent threats using newly-identified biomolecular targets for third series of compounds for organophosphate (OP) nerve agents generating butyrylcholinesterase (BChE).  Complete the development of confirmatory assays for discovered markers.  Initiate assay verification studies and investigations to mature chemical diagnostic assays for use in forward field settings or at point-of-need."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3) Diagnostic Assays"
                                    },
                                    "Description": {
                                        "val": "Development and verification of rapid, sensitive, and specific tests for the identification of Biological Warfare Agents (BWA) and their expressed pathogens and toxins in clinical specimens from Warfighters for the diagnosis of exposure\/infection.  Discovery of host biomarkers generated in response to exposure to biological threat agents, whether known or emerging.  This effort will be realigned in FY19 to TM2 (Techbase Med Defense) Medical Diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.268"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease.  Continued discovery and identification of host response biomarkers.  Continued efforts and feasibility studies on integrating identification of antimicrobial resistance into future diagnostic systems.  Continued designs and studies on the development of vertical flow immunoassays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.551"
                                            },
                                            "Text": {
                                                "val": "Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease.  Continue discovery and identification of host response and\/or agent biomarkers.  Complete efforts and initiate verification studies on integrating identification of antimicrobial resistance into future diagnostic systems.  Initiate the investigation for designing biomarker validation methods and activities.  Complete designs and studies on the development of vertical flow immunoassays.  Initiate assay development for extremely difficult to detect\/diagnosis intracellular pathogens of severe acute systemic febrile illnesses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "4) Next Generation Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Diagnostic device development to include systems able to harness next generation technologies to revolutionize clinical diagnostics in care facilities and in hospital laboratories.  This investment will incorporate capabilities such as next generation sequencing and advanced biomolecular methods to harness both host and pathogen biomarkers in a threat agnostic approach that will serve all echelons of military medical care.  This effort will be realigned in FY19 to TM2 (Techbase Med Defense) Medical Diagnostics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "Completed development of multiplexed point of need diagnostic platform technologies into syndromic-based panels.  Initiated development of sample preparation techniques to enhance clinical diagnostic platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.392"
                                            },
                                            "Text": {
                                                "val": "Continue development of sample preparation techniques to enhance clinical diagnostic platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred to another funding line."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "5) Viral\/Bacterial\/Toxins Vaccines"
                                    },
                                    "Description": {
                                        "val": "Generate novel or improved vaccines against viral, bacterial and toxin biothreat agents, and demonstrate preliminary efficacy in small animal models.  Develop assays that identify correlates of protective immunity in animal models."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.096"
                                            },
                                            "Text": {
                                                "val": "Executed down-selection of FDA Animal Rule compliant non-human primate (NHP) model for aerosolized Burkholderia pseudomallei (melioidosis), which adequately mimics progression of human disease.  Continued characterization of specific antibody and T cell responses during human Burkholderia pseudomallei (melioidosis) and Coxiella (Q-fever) infections.  Completed data analysis for initial studies involving novel subunit, polysaccharide, and outer membrane vesicle (OMV) -based candidate Burkholderia (glanders and melioidosis) vaccines in small and large animal models.  Continued to evaluate and define in composition type A Francisella tularensis (Tularemia) vaccine prototypes in established small animal and NHP models for safety and efficacy.  Developed candidate non-reactogenic Coxiella (Q-fever) vaccine and a humanized mouse model for aerosolized Q-fever.  Evaluated prototypic three-component vaccines against Western Equine Encephalitis Venezuelan Equine Encephalitis (WEVEE) viruses in small animal models with down-selected adjuvants.  Initiated immune correlate studies with a three-component vaccine against WEVEE viruses in small animal models.  Evaluated immunogenicity and efficacy of nanoparticle adjuvants with the Venezuelan Equine Encephalitis Virus (VEEV) DNA vaccine and the trivalent (WEVEE) vaccine in mice.  Continued to assess the ability of novel adjuvants to enhance the protective efficacy of viral vaccines.  Continued research to assess vaccination capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.629"
                                            },
                                            "Text": {
                                                "val": "Complete qualification\/validation of well-defined animal models of Burkholderia and Q Fever.  Continue analysis of T and B cell antigen-based Q Fever vaccine candidates.  Initiate manufacturing and investigative new drug (IND) enabling studies of OMV or other lead Burkholderia candidates based on results in animal models refined toward Animal Rule Licensure use.  Down select tularemia vaccine based on efficacy in animals for advancement to clinical studies.  Evaluate efficacy of multivalent monoclonal antibody cocktail for protection against multiple serotypes of botulinum neurotoxin in relevant animal models.  Evaluate potential animal models for medical countermeasure development against broad spectrum of biological toxins.  Continue nonclinical efficacy and clinical safety development of multivalent filovirus vaccine against Zaire ebolavirus, Sudan ebolavirus and Marburgvirus.  Continue comparison of homologous and heterologous prime-boost regimens with filovirus candidates.  Continue detailed dissection of the immune response following alphavirus and filovirus vaccination by epitope mapping and B-cell antigen receptor (BCR) antibody repertoire analysis.  Continue evaluation of immunogenicity and efficacy of nanoparticle adjuvanted VEEV DNA vaccine and the trivalent WEVEE vaccine in NHP.  Initiate development of multiplexed VEEV infection biomarker assay.  Continue to assess MCM capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.663"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.663"
                                            },
                                            "Text": {
                                                "val": "Continue selection of T and B cell antigens for Q Fever vaccine candidates.  Continue analysis of candidate Q fever vaccines.  Continue down-selection of subunit tularemia vaccine candidates in animal models.  Continue development of animal models for medical countermeasure development against aerosolized biological toxins including marine toxins.  Continue nonclinical efficacy and clinical safety development of candidate vaccines against Marburgvirus.  Evaluate potential for boosting of recombinant vesicular stomatitis virus (rVSV)- based ebolavirus vaccine.  Continue detailed immune correlate studies of filovirus vaccines for animal rule licensure including antibody response maturation and passive transfer studies.  Continue improvements to delivery mechanism, immunogenicity, efficacy and manufacturing of VEEV DNA vaccine and the trivalent WEVEE vaccine including animal modeling.  Initiate development of multiplexed VEEV infection biomarker assay.  Continue to assess MCM capabilities and strategies to defend against emerging and genetically engineered bioweapon (BW) threat agents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "6) Vaccine Platforms and Research Tools"
                                    },
                                    "Description": {
                                        "val": "Use novel technology and methods to support development of vaccine candidates.  Conduct studies to determine potential immune interference between lead vaccine candidates, the effect of alternative vaccine delivery methods, and thermo-stabilization technologies on the efficacy of lead vaccine candidates.  Identify correlates of protection in humans, and predict the success of lead vaccine candidates in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.048"
                                            },
                                            "Text": {
                                                "val": "Continued evaluation of hybrid antigenic proteins for use in broad spectrum vaccines for Staphylococcus Enterotoxins in relevant small animal models.  Down selected to the most promising Toll-Like Receptors (TLR) adjuvants for testing in vivo with relevant vaccines.  Explored novel formulation and targeting systems for enhanced vaccine potency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.191"
                                            },
                                            "Text": {
                                                "val": "Initiate construction and evaluation of hybrid alphavirus E1\/E2 antigenic vaccines.  Maintain capability and assess biodefense Burkholderia vaccine candidates in the in vitro biomimetic Modular Immune In-vitro Construct (MIMIC) system.  Evaluate production and scale-up of trivalent inactivated alphavirus vaccines and use these particles to generate new WEVEE monoclonal antibodies (mAbs).  Analyze mAbs for neutralizing activity and map epitopes of strongly neutralizing mAbs.  Establish, organize, and sustain the Human Specimen Archive at USAMRIID.  Continue in vivo down selection of next generation TLR agonist adjuvants.  Initiate evaluation of hybrid antigenic proteins for use in broad spectrum vaccines for alphaviruses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.087"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.087"
                                            },
                                            "Text": {
                                                "val": "Continue evaluation of multivalent hybrid vaccines: structural analysis and performance in the biomimetic Modular Immune In-vitro Construct (MIMIC) system.  Maintain capability and continue assessment of Burkholderia and Q fever vaccine candidates in the MIMIC system.  Continue MIMIC development for use in evaluation of pulmonary responses to biodefense vaccines.  Complete evaluation of production and scale-up of trivalent inactivated alphavirus vaccines and use of these vaccines to generate new WEVEE monoclonal antibodies (mAbs).  Analyze mAbs for neutralizing activity and map epitopes of strongly neutralizing mAbs.  Sustain the Human Specimen Archive at USAMRIID.  Continue in vivo down selection of next generation Toll Like Receptor agonist adjuvants for use in Q fever and other biodefense vaccines."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "7) Viral Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead candidate therapeutics for efficacy against viral pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.284"
                                            },
                                            "Text": {
                                                "val": "Screened and evaluated novel small molecule inhibitors of alphaviral infections in vitro and in vivo.  Evaluated novel formulations to deliver antivirals to target sites and\/or to enable new dosing methods.  Evaluated modified nucleoside analogues as inhibitors of alphaviral infections in animal models for their access to the central nervous system and ability to inhibit encephalitic complications.  Identified novel nuclear import and export inhibitors for modulation of capsid localization against alphaviruses.  Initial studies targeted Venezuelan Equine Encephalitis (VEE), but there is potential for broad spectrum activity against Western Equine Encephalitis (WEE) and Eastern Equine Encephalitis (EEE), as well."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.983"
                                            },
                                            "Text": {
                                                "val": "Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo.  Continue development of small molecule ribonucleoside inhibitors directed against alphaviruses.  Develop alphavirus animal models for evaluation of therapeutic countermeasures.  Continue optimization of broad-spectrum inhibitors of filovirus infection that antagonize the NPC1-GP interaction.  Continue studies to enhance Anti-viral Therapy Against Ebola (Zaire) and Marburg Viruses.  Development of an inhalation model of VEEV in the common marmoset.  Continue funding small molecule\/repurposing efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.910"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.910"
                                            },
                                            "Text": {
                                                "val": "Continue screening, evaluation and development of novel small molecule inhibitors and monoclonal antibodies effective against filo- and alpha-virus infections in vitro and in vivo.  Continue development of small molecule ribonucleoside viral replication inhibitors directed against alphaviruses.  Develop alphavirus animal models for evaluation of therapeutic countermeasures for use with Animal Rule Guidance by the FDA.  Continue optimization of broad-spectrum inhibitors of filovirus infection that antagonize NPC1-GP interactions.  Continue studies to enhance anti-viral therapies against Ebola (Zaire) and Marburg Viruses.  Continue funding small molecule\/repurposing efforts.  Begin feasibility studies on reducing neuro-inflammation by repurposing existing therapeutics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "8) Bacterial Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate lead therapeutic candidates effective against designated bacterial threat agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.389"
                                            },
                                            "Text": {
                                                "val": "Evaluated FDA approved or late stage therapeutics for activity against Burkholderia, Francisella tularensis, Bacillus anthracis, and Yersinia pestis.  Continued to evaluate reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates.  Continued the discovery and advancement of non-traditional strategies to diversify approaches identifying lead therapeutic candidates against bacterial infection.  Continued generation of multi-drug resistant (MDR) surrogate panels to bridge the gap between antimicrobial resistant biowarfare agents and multi-drug resistant clinical pathogens."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.775"
                                            },
                                            "Text": {
                                                "val": "Continue the discovery and advancement of non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.  Continue evaluation of FDA approved and mid to late stage therapeutics for activity against wildtype and multi-drug resistant (MDR) Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species.  Continue to evaluate reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.933"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.933"
                                            },
                                            "Text": {
                                                "val": "Continue the discovery and advancement of novel, non-traditional, as well as traditional, strategies to diversify approaches to identify lead therapeutic candidates against bacterial infection.  Continue evaluation of FDA approved and mid to late stage therapeutics for activity against wild-type and multi-drug resistant (MDR) Francisella tularensis, Bacillus anthracis, Yersinia pestis, and Burkholderia species.  Complete evaluation of reformulation and\/or targeted delivery approaches to enhance efficacy of poorly performing or failed drug candidates."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "9) Toxin Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Identify, optimize and evaluate therapeutic candidates that are effective against biological toxin agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.894"
                                            },
                                            "Text": {
                                                "val": "Further evaluated the most potent small molecule botulinum toxin type A (BoNT\/A) inhibitors in neuronal assays and ex vivo model systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Perform safety (Good Laboratory Practice-GLP) studies with one SMI; select candidates for IND submission of one SMI and IGF-1 for treatment post BoNT A intoxication."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.156"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.156"
                                            },
                                            "Text": {
                                                "val": "Develop single domain monoclonal antibody in small animal studies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to change in program\/project technical parameters."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "10) Pretreatments, Nerve Agents"
                                    },
                                    "Description": {
                                        "val": "Develop pretreatments and prophylactics that provide protection against chemical warfare agents, including organophosphorus nerve agents (OPNA), such as stoichiometric and catalytic scavengers and other entities that rapidly bind and detoxify a broad spectrum of agents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.958"
                                            },
                                            "Text": {
                                                "val": "Continued to optimize catalytic scavengers for acceptable in vivo toxicity profile, pharmacokinetic (PK) and efficacy activity against G-type and V-type OP nerve agents in appropriate animal models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.593"
                                            },
                                            "Text": {
                                                "val": "Continue efforts developing prophylactic medical countermeasures including bioscavengers.  Continue efforts developing prophylactic and pretreatment medical countermeasures, including bioscavengers.  Initiate development of animal models for operationally relevant exposures to better support development of pretreatment and prophylactic MCMs and MCM concepts of use including post-exposure pre-symptomatic applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.549"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.549"
                                            },
                                            "Text": {
                                                "val": "Continue efforts developing prophylactic and pretreatment medical countermeasures.  Continue development of animal models for operationally relevant exposures to better support development of pretreatment and prophylactic MCMs and MCM concepts of use including post-exposure pre-symptomatic applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "11) Chemical Therapeutics"
                                    },
                                    "Description": {
                                        "val": "Focuses on therapeutic strategies to effectively minimize injuries resulting from exposure to CWAs.  This effort involves the development of neuroprotectants, anticonvulsants, improved therapies for enzyme reactivation, and investigation of alternate pathways leading to treatment.  This effort also includes discovery and development of therapeutic strategies to treat dermal, ocular and respiratory injuries of CWAs.  Efforts in this area are designed to develop potential candidates that will ultimately be submitted for FDA licensure or to identify previously licensed products for new uses in the treatment of chemical warfare casualties."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.664"
                                            },
                                            "Text": {
                                                "val": "Supported in vitro and in vivo testing and characterization of therapeutics for: 1) an improved broad spectrum oxime; 2) compounds effective in the brain for enhanced neuroprotection and 3) compounds effective in the brain for enhanced survival.  Continued exploring technologies for delivery of therapeutics to the brain (crossing the BBB).  Continued supporting development and screening for broad spectrum cholinesterase reactivators that work in the brain.  Continued development of animal models for realistic operational threat agent exposure and MCM development.  Investigated dermal treatments and therapeutics for nerve agent and sulfur mustard exposure.  Identified candidate small molecules that are broad spectrum and demonstrate potential effectiveness in the brain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.445"
                                            },
                                            "Text": {
                                                "val": "Continue synthesizing and screening broad spectrum reactivators.  Continue testing of BBB penetration.  Continue developing computational capabilities using molecular dynamics to predict compound ability to penetrate the BBB.  Continue exploring alternate modes of drug encapsulation for delivery across the BBB.  Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.512"
                                            },
                                            "Text": {
                                                "val": "Continue supporting validation and characterization of therapeutics for: 1) an improved broad spectrum oxime; 2) compounds effective in the brain for enhanced neuroprotection and 3) compounds effective in the brain for enhanced survival.  Continue exploring technologies for delivery of therapeutics to the brain (crossing the BBB).  Continue supporting development and screening for broad spectrum cholinesterase reactivators that work in the brain.  Continue development of animal models for operationally relevant threat agent exposure and medical countermeasure efficacy.  Initiate efforts to develop therapeutic medical countermeasures to decrease or ameliorate the effects of mustard ocular injury."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to fact of life change in the program\/project."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "12) Medical Diagnostics"
                                    },
                                    "Description": {
                                        "val": "Make medical diagnostics ubiquitous and comprehensive against chemical and biological threats (including NTAs, pharmaceutical-based agents, and toxins) by advancing diagnostic innovations; investigating emerging technologies; ensuring medical diagnostics rapid adaptation to emerging threats; harvesting and synergizing the immense volume of diagnostic data; and aligning medical diagnostics capabilities with the FDA pipeline and larger commercial supply chain.  This effort will be realigned in FY19 from TM2 (Techbase Med Defense) Chemical Diagnostics, TM2 (Techbase Med Defense) Diagnostic Assays, and TM2 (Techbase Med Defense) Next Generation Diagnostics."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.150"
                                            },
                                            "Text": {
                                                "val": "Continue the development of a diagnostic platform to diagnose chemical exposure at the point-of-care.  Continue to optimize processes and platform technologies employed in laboratory characterization of host and pathogen biomarker signatures of exposure and disease.  Continue discovery and identification of host response and\/or agent biomarkers.  Continue assay development for extremely difficult to detect\/diagnose intracellular pathogens of severe acute systemic febrile illnesses.  Initiate efforts to exploit gene-editing systems for development of robust diagnostic platforms with reduced cold-chain needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program\/project funding transferred from another funding line."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "TM3"
                                    },
                                    "Title": {
                                        "val": "TECHBASE MED DEFENSE (ATD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "88.629"
                                        },
                                        "CurrentYear": {
                                            "val": "92.846"
                                        },
                                        "BudgetYearOne": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "88.188"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "93.271"
                                        },
                                        "BudgetYearThree": {
                                            "val": "104.285"
                                        },
                                        "BudgetYearFour": {
                                            "val": "103.753"
                                        },
                                        "BudgetYearFive": {
                                            "val": "97.215"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "58.800"
                                        },
                                        "CurrentYear": {
                                            "val": "83.999"
                                        },
                                        "BudgetYearOne": {
                                            "val": "73.090"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "73.090"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "35.432"
                                        },
                                        "BudgetYearThree": {
                                            "val": "26.460"
                                        },
                                        "BudgetYearFour": {
                                            "val": "13.317"
                                        },
                                        "BudgetYearFive": {
                                            "val": "6.506"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC4"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (ACD&P)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "4.816"
                                        },
                                        "CurrentYear": {
                                            "val": "5.165"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.790"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.790"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.675"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.975"
                                        },
                                        "BudgetYearFour": {
                                            "val": "7.098"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.098"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "92.313"
                                        },
                                        "CurrentYear": {
                                            "val": "136.553"
                                        },
                                        "BudgetYearOne": {
                                            "val": "107.815"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "107.815"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "141.385"
                                        },
                                        "BudgetYearThree": {
                                            "val": "170.160"
                                        },
                                        "BudgetYearFour": {
                                            "val": "154.262"
                                        },
                                        "BudgetYearFive": {
                                            "val": "153.288"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MC5"
                                    },
                                    "Title": {
                                        "val": "MEDICAL CHEMICAL DEFENSE (EMD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "51.903"
                                        },
                                        "CurrentYear": {
                                            "val": "47.388"
                                        },
                                        "BudgetYearOne": {
                                            "val": "62.092"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "62.092"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "38.576"
                                        },
                                        "BudgetYearThree": {
                                            "val": "40.607"
                                        },
                                        "BudgetYearFour": {
                                            "val": "31.746"
                                        },
                                        "BudgetYearFive": {
                                            "val": "25.740"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "MB7"
                                    },
                                    "Title": {
                                        "val": "MEDICAL BIOLOGICAL DEFENSE (OP SYS DEV)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.999"
                                        },
                                        "CurrentYear": {
                                            "val": "11.950"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.850"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.850"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.728"
                                        },
                                        "BudgetYearThree": {
                                            "val": "6.060"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.532"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2.969"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}