{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-1-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-28",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604940D8Z"
        },
        "ProgramElementTitle": {
            "val": "Central Test and Evaluation Investment Program (CTEIP)"
        },
        "R1LineNumber": {
            "val": "139"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "952.702"
            },
            "PriorYear": {
                "val": "212.389"
            },
            "CurrentYear": {
                "val": "211.325"
            },
            "BudgetYearOne": {
                "val": "258.796"
            },
            "BudgetYearOneBase": {
                "val": "258.796"
            },
            "BudgetYearTwo": {
                "val": "261.529"
            },
            "BudgetYearThree": {
                "val": "291.831"
            },
            "BudgetYearFour": {
                "val": "296.176"
            },
            "BudgetYearFive": {
                "val": "295.630"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "219.199"
                },
                "CurrentYear": {
                    "val": "211.325"
                },
                "BudgetYearOne": {
                    "val": "248.116"
                },
                "BudgetYearOneBase": {
                    "val": "248.116"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "212.389"
                },
                "CurrentYear": {
                    "val": "211.325"
                },
                "BudgetYearOne": {
                    "val": "258.796"
                },
                "BudgetYearOneBase": {
                    "val": "258.796"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.810"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "10.680"
                },
                "BudgetYearOneBase": {
                    "val": "10.680"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.537"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "12.381"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.381"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.241"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.701"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.701"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.032"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY2019 – Increased investments for high-priority hypersonic ground and open air range test capability developments and increased investments for critically needed upgrades to DoD Threat Models and Simulations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "940"
                    },
                    "ProjectTitle": {
                        "val": "Central Test and Evaluation Investment Program (CTEIP)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "952.702"
                        },
                        "PriorYear": {
                            "val": "212.389"
                        },
                        "CurrentYear": {
                            "val": "211.325"
                        },
                        "BudgetYearOne": {
                            "val": "258.796"
                        },
                        "BudgetYearOneBase": {
                            "val": "258.796"
                        },
                        "BudgetYearTwo": {
                            "val": "261.529"
                        },
                        "BudgetYearThree": {
                            "val": "291.831"
                        },
                        "BudgetYearFour": {
                            "val": "296.176"
                        },
                        "BudgetYearFive": {
                            "val": "295.630"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Since its inception in FY 1990, this program element (PE) has been used to fund the development of critically needed, high-priority Test and Evaluation (T&E) capabilities for joint\/multi-Service requirements.  The Central Test and Evaluation Investment Program (CTEIP) uses a corporate investment approach to combine Service, Defense, and other Government agencies T&E needs, maximize opportunities for joint efforts, and avoid unwarranted duplication of test capabilities.  CTEIP focuses investments on projects that will have high productivity returns on investment.  Projects under the CTEIP PE support two basic tasks: investments to improve the test capabilities base (Joint Improvement and Modernization (JIM) projects) and development of near-term solutions to test capability shortfalls in support of ongoing operational test programs (Resource Enhancement Project (REP)).\n\n    The JIM funds critically needed T&E investments in the major functional areas of air combat; armament and munitions; Command, Control, Communications, Computers, and Intelligence (C4I) networks; common range instrumentation; electronic combat; cyber warfare; land combat; sea combat; space combat; target systems; and test environments. Examples of project subject matter include highly accurate time-space-position information, electronic warfare test capability developments to address critical testing shortfalls against advanced threats, infrastructure developments needed for testing hypersonic weapon systems, network enhanced telemetry, information assurance and cyber testing and analysis capabilities, end-to-end testing of infrared countermeasures systems, net-centric weapons, and unmanned systems.  CTEIP continues to serve as the focal point for fostering common architectures throughout the test and training communities to enhance the sharing of resources and linkages between test and training ranges. \n\n   CTEIP has provided special focus to institutionalize the use of modeling and simulation (M&S) as a practical test tool, to link ranges to enhance inter-range and inter-Service cooperation and resource sharing, and to ensure development and acquisition of common instrumentation necessary for a more efficient test infrastructure.\n\n   Analyses of alternative solutions are conducted for each investment project to validate T&E requirements, to define integrated support systems, and to determine overall cost effectiveness of the proposed test investments.  The use of Department of Defense (DoD)-wide criteria for requirement validation, prioritization, and risk assessment ensures an effective test resource investment program.\n\nThe REP funds development of near-term solutions for critical ongoing operational tests supporting decisions on major, high-priority defense acquisition programs.  These unanticipated operational test (OT) capability requirements arise from several sources such as a new threat system identified during OT planning, acquisition of foreign military assets that are critical in determining weapon system operational effectiveness, short timelines between system design maturity and scheduled OT, and emerging technologies and test requirements resulting from operational concept changes mandated by Congress or Director, Operational Test & Evaluation (DOT&E), or system-of-systems testing.  Funding these activities under the CTEIP provides the opportunity to coordinate and integrate these near-term test requirements with the total DoD test and evaluation investment planning, and ensures their availability and legacy for other programs that may have similar testing requirements.\n\n   This Budget Activity 6 PE includes special studies, analyses, and strategic planning related to test capabilities and infrastructure, and supports the development and application of proven technologies to provide major test and evaluation capabilities required to meet DoD component weapon system test requirements.\n\nThe FY2019 CTEIP budget is described in detail below. As part of the DoD reform agenda, the CTEIP budget was reduced for consolidation and reduction of service contracts. The FY2019 includes increased investments in high-priority hypersonic ground and open air range test capability developments and increased investments for critically needed upgrades to DoD Threat Models and Simulations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Central Test and Evaluation Investment Program"
                                    },
                                    "Description": {
                                        "val": "Jim Projects:\n- Awarded the contract for system development and completed preliminary design for the Advanced Range Tracking and Imaging System project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical throughput.\n- Continued procurement and initiated sustainment for the Common Range Integrated Instrumentation System project to develop a common range instrumentation system to address next generation range data requirements.\n- Completed the B-2 Defense Management System project to upgrade test capabilities at the Benefield Anechoic Facility (BAF) to support B-2 testing in a modern radio frequency (RF) signal threat environment.\n- Completed Block 1 Initial Operational Capability for the Multi-Level Secure Joint\/Coalition Network Environment (MLS-JCNE) project to develop a standardized, DoD multi-level secure and cross-domain data management T&E network environment. Continued system development for Block 2 to develop a standardized, multi-level secure voice, text chat, file transfer, and multi-level work station for cross-domain data management in a T&E network environment.\n- Completed Block 1 (Initial Operational Capability) and Block 2 (Full Operational Capability) for the Synthetic Battlefield Emitter Systems and project to provide a controlled, high-density open air environment for testing C4ISR systems. \n- Completed development and fielded the Vertical Electromagnetic Pulse (EMP) System at both NAS Patuxent River, MD, and White Sand Missile Range, NM; and a High Power Microwave (HPM) Test Sources project to provide vertical high-altitude EMP and HPM external electromagnetic environments for testing in accordance with Military Standards.\n- Completed system design for Increment 1 and Initial Operational Capability for the Network Centric Weapon (NCW) T&E Environment project to provide an enhanced capability to test and evaluate an NCW in a distributed end-to-end simulation environment. Continued system design and development for Increment 2. \n- Completed system design and an Early Operational Capability Demonstration of the Cyber Test Analysis and Simulation Environment project and continued development to enhance current Information Assurance \/ Cyber testing and analysis capabilities and modeling and simulations tools for testing against increasingly robust Cyber threats.\n- Completed system development and initiated production for the Radar Signal Emulators to provide open-loop, transmit-only systems that will accurately emit waveforms of threat radar systems operating in the C and S radio frequency (RF) bands. Delivered 8 of 16 Radar Signal Emulators at the Nellis AFB Test and Training Range, NV and initiated site acceptance testing. Continued production of the remaining 9 Radar Signal Emulators. \n- Completed integration of three threat command posts at the Electronic Combat Range, China Lake, CA and continued system development for remaining deliverables for the Integrated Air Defense System (IADS) Enhancements project that will add comprehensive threat-representative IADS capabilities based on the development and integration of several high-priority, threat-representative Command Post (CP) models to open-air test ranges, test laboratories and modeling and simulation (M&S) facilities. \n- Completed source selection and contract award and initiated preliminary design for the Commercial Derivative Aircraft Based Instrumentation Telemetry System project to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n- Completed requirements development and initiated concept development and preliminary design for 7 projects improving hypersonic ground test capabilities to address critical shortfalls in developmental and operational testing of cruise missile and boost glide vehicles.\n     * The Hypersonic Test Capability Improvement Clean Air\/Variable Mach Capability to provide clean air, variable Mach test capability for hypersonic system prototypes from Mach 4 to Mach 7.5.\n     * The Tunnel 9 High Mach Number project that develops a Mach 18 test capability at the AEDC White Oak, MD.\n     * The High Altitude LIDAR Atmospheric Sensing System that provides DOD launch and flight test ranges with improved ability to measure atmospheric conditions to reduce flight test evaluation uncertainty and improve launch and recovery operations.\n     * Holloman AFB High Speed Test Track Weather Effects System that provides a full scale rain erosion capability in order to validate vehicle structural design and qualify hypersonic weapon systems for flight in an open air facility.\n     * AEDC G-Range Weather Effects that provides a small scale dust, rain, and snow erosion capability in order to validate vehicle structural design and qualify hypersonic weapon systems for flight.\n     * M&S for Weather Effects on Hypersonic Systems that provides a database of realistic and relevant weather conditions as a basis for ground test requirements, and that develops advanced material response models validated with improved ground test data to predict weather erosion in flight.\n     * Transient Thermal Analysis Software Transition tool set provides dramatically improved capabilities for predicting aerothermal and ablation response to high speed, high temperature flow in ground and flight test environments.  \n- Completed requirements development and planning, and contract award and initiated preliminary design for the Advanced Weapons Effects Test Capability project to develop a capability to more accurately measure fragment characteristics of explosive weapons and more accurately estimate collateral damage distances.\n- Completed concept development and preliminary design, and initiated system development for the Mid-Pressure Arc Heater project to expand the H2 Hypersonic Test Facility at Arnold Engineering Development Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems.\n- Completed requirements development for the Pulsed Neutron Environment project to provide a Low Enriched Uranium (LEU) facility and transitioned this project to the Fast Burst Reactor Upgrade project that will begin during FY2018.\n- Completed critical design and continued system development for the Advanced Dynamic Transmitter Array (ADTRA) project to develop a complex, dynamic radio frequency (RF) threat environment that will accurately represent signal characteristics, increase signal densities while reducing test system set up and calibration times at the Benefield Anechoic Facility (BAF).\n- Completed critical design and continued system development of the Closed Loop PESA Simulator project to develop a closed-loop radar system that will closely replicate the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system.\n- Completed preliminary design and initiated system development for the Radar Cross Section Range Relevance Project to upgrade radar cross section measurement capabilities to measure and evaluate advanced low observable technologies at the Atlantic Test Range, Patuxent River NAS, MD and the National RCS Test Facility, Holloman AFB, NM.\n- Completed preliminary design and initiated system development for the Swarm Autonomy and Scoring project to upgrade existing High Speed Maneuverable Surface Targets (HSMST) with semi-autonomous control and UAS overhead scoring capabilities for testing against representative surface swarming threats. Deferred concept development and preliminary design of the Real Time Casualty Assessment capability pending completion of a feasibility assessment.\n- Continued system development of the Integrated Network Enhanced Telemetry (iNET)Project Block I capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n- Continued system development for the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n- Continued Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) activities to provide detailed analysis and validation of threat system designs and operational techniques.\n- Continued system development for Full Operational Capability for the Joint Distributed Infrared Countermeasures (IRCM) Ground Test System project to provide end-to-end ground testing of IRCM systems.\n- Continued the Joint Strike Fighter Knowledge Management (KM) project to establish a next-generation KM capability that utilizes the latest in virtualization technologies, methodologies, and best practices for efficient and effective use of T&E data. Initiated development of small form factor instrumentation prototypes for data collection and data analytics systems to support F-35 Initial Operational Test and Evaluation.  \n- Initiated risk reduction activities under the Enhanced Solutions Process for potential FY18 multi-Service T&E developments, as recommended by Service Test and Evaluation Executives.\n- Monitored early maturation under the Test and Evaluation\/Science and Technology Program for a prototype capability to develop a Dense Plasma Focus (DPF) system to meet short pulse fusion neutron test requirements necessary for both weapons certification and testing new circuit designs for nuclear weapons effects testing that will transition to CTEIP development in FY2018.\n- Continued threat system simulator, modeling and simulation development efforts to improve integration; reduce potential duplication and ensure that accurate, cost-effective representations of threat systems are available to support testing.\n\n Resource Enhancement Project:\n- Completed the Advanced Mine Simulation System (AMISS) Upgrade, which provides the existing AMISS asset with five new mine-triggering emulations, as well as sensor and improved compartmentalization enhancements.\n- Completed the C2 and Urban Background Environment Simulator (CUBES) to incorporate modern urban communication background signals and selected closed-loop communications for Installed System Test Facility communications jamming purposes.\n- Completed the Digital Integrated Air Defense System (DIADS) Sensor Reactivity Upgrade (SRU) to upgrade DIADS radars with enhanced ECM response features in support of F-35 and F-22 operational testing.\n- Completed development of Torpedo Operational Testing Using Modeling and Simulation (TOTUMS) to enhance torpedo OT&E by upgrading an HITL simulator and environment simulator for high-fidelity, OT-ready realism.\n- Completed Tactical Datalink (TDL) and Full Motion Video (FMV) Accuracy Assessment Tool (T-FAAT) to interface commercial off-the-shelf tool suites to create a net-enabled weapon situational awareness during live testing.\n- Continued development of Airborne Early Warning Interoperability Simulator (AEIS) to develop the hardware and software necessary to generate a properly spaced, dense target and ECM environment for injection-mode Installed Systems Test Facility testing of the E-2D Hawkeye mission system.\n- Continued development of Boosted Zombie Target (BZT) to develop multi-stage, economical targets for PAC-3 by integrating a GFE booster onto a blue \"Zombie\" maneuvering target.\n- Continued development of Joint Standard Instrumentation Suite (JSIS) Phase 1 to measure and collect signature, TSPI, and related data from key flight trajectory segments of threat missile and hostile fire munitions (e.g., small arms and RPG) firings to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Continued development of the Medium Range Target Engagement Radar (MR-TER) Radar System Emulator (RSE) to develop and integrate TER waveform replication capability into C-Band RSEs. \n- Continued development of Cognitive Electronic Warfare (Cognitive EW) Flight Test to evaluate an advanced EW system against emerging threat representations.\n- Continued development of Submarine Launched Modular 3-inch Device (SLAM-3D), which provides a Cluster Duncan countermeasure emulator that will help resolve the Anti-Submarine Warfare COI for the Mk 54 Mod 1 Torpedo.\n- Continued development of General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n- Initiated development of Advanced Communication Threat Testing Suites (ACTTS) Uplink Capability to develop an electronic warfare (EW) threat representative uplink jamming system to support test and evaluation of end to end satellite system responsiveness to threat systems operating in applicable bands. \n- Initiated development of additional enhancements to Air Warfare Battle Shaping (AWBS) investments to improve air-to-air range infrastructure for NAWC-WD.\n- Initiated development of Common Operational Test Vehicle and Engagement Real-Time Test Instrumentation (COVERT-I) to reduce the data collection footprint in Abrams tanks and Bradley fighting vehicles by reducing from three unique data collectors to one modular, scalable data collector with increased storage capacity. \n- Initiated development of Integrated Digital Acquisition Radar Environment.\n- Upgraded (IDARE-U) to upgrade two NAWCWD Electronic Combat Range OEM Radars’ analog output with digital upgrade for downstream digital messaging.\n- Initiated development of Joint Standard Instrumentation Suite (JSIS) Phase 2 to measure and collect missile attitude (6DOF) as well as signature, TSPI, and related data for a larger portion of the threat MANPADS trajectory at the required accuracies within a single firing to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n-Initiated development of the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) to develop kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets. \n- Initiated development of Space Fence Evaluation of Radar Effectiveness (SFERES) to fabricate a 3-axis stabilized CubeSat which will launch two spheres to support accurate evaluation of the Space Fence radar."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "212.389"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n- Complete system development and field the Synthetic Battlefield Emitter Systems project to provide a controlled density open air environment for testing of C4ISR systems.\n- Complete system development for the Joint Distributed Infrared Countermeasures (IRCM) Ground Test System project to provide an end-to-end ground test system enabling complete testing of IRCM systems.\n- Complete system development for Block 1 and continue Block 2 concept development and preliminary design for the Multi-Level Secure (MLS) Joint\/Coalition Network Environment project to develop a standardized, DoD multi-level secure and cross-domain data management T&E network architecture.\n- Compete initial operational capability (IOC) and continue system development for the Network Centric Weapon (NCW) T&E Environment project to provide an enhanced capability to test and evaluate NCW in a distributed end-to-end simulation environment.\n- Complete early operational capability (EOC) and continue development for the Cyber Test Analysis and Simulation Environment project to enhance current Information Assurance \/ Cyber testing and analysis capabilities and modeling and simulations tools for testing against increasingly robust Cyber threats.\n- Complete system development and transition to production and sustainment of the Radar Signal Emulator project to provide open-loop, transmit-only systems that will accurately emit waveforms of threat radar systems operating in the C and S radio frequency (RF) bands.\n- Continue system development for the Advanced Range Tracking and Imaging System project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical throughput.\n- Continue the Commercial Derivative Aircraft Based Instrumentation Telemetry System project with contract award for design and system development to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n- Continue production and sustainment for the Common Range Integrated Instrumentation System project to develop a common range instrumentation system to address next generation range data requirements.\n- Continue system development for the Next Generation Electronic Warfare Environment Generator Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n- Continue system development for the Advanced Dynamic Transmitter Array project to develop a dense, complex, dynamic radio frequency (RF) signal threat environment that will accurately represent signal characteristics, increase signal densities, while reducing test system set up and calibration times at the Benefield Anechoic Facility (BAF).\n- Continue system development of the Closed Loop PESA Simulator project to develop a closed-loop radar system that will closely replicate the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system.\n- Continue system development of Integrated Air Defense System (IADS) Enhancements that will add comprehensive threat-representative IADS capabilities based on the development and integration of several high-priority, threat-representative Command Post (CP) models to open-air test ranges, test laboratories and modeling and simulation (M&S) facilities.\n- Continue Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) activities to provide detailed analysis and validation of threat system designs and operational techniques.\n- Complete concept development and preliminary design and initiate system development for the Advanced Weapons Effects Test Capability project to develop a capability to more accurately measure fragment characteristics of explosive weapons and more accurately estimate collateral damage distances.\n- Complete concept development and preliminary design and initiate system development for the Mid-Pressure Arc Heater project to expand the H2 Hypersonic Test Facility at the Arnold Engineering Development Center, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems. \n- Complete requirements development and planning and enter concept development and preliminary design for the Pulsed Neutron Environment project to provide a Low Enriched Uranium (LEU) facility to replace the current HEU reactor, providing higher fluence over a larger test area. It will also develop a Dense Plasma Focus (DPF) system to meet short pulse requirements necessary for both weapons certification and testing new circuit designs.\n- Complete concept development and preliminary design and initiate system development for the Radar Cross Section Range Relevance Project to upgrade radar cross section measurement capabilities to measure and evaluate advanced low observable technologies at the Atlantic Test Range, Patuxent River NAS and the National RCS Test Facility, Holloman AFB, NM.\n- Complete concept development and preliminary design and initiate system development for the Swarm Autonomy and Scoring project to upgrade existing High Speed Maneuverable Surface Target (HSMST) with semi-autonomous control, develop a Real Time Casualty Assessment capability, and improved scoring capabilities for testing against representative surface swarming threats.\n- Continue system development of the Integrated Network Enhanced Telemetry project capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n- Continue risk reduction activities under the Enhanced Solutions Process for potential multi-service T&E developments, as recommended by Service Test and Evaluation Executives.\n- Continue threat system simulator development efforts to improve integration, reduce potential duplication, and ensure that accurate, cost-effective representations of threat systems are available to support testing.\n- Complete concept development and initiate design for Hypersonic Test Capability Improvement project that will test models of hypersonic systems in a realistic clean air environment up to Mach 7.5 at Arnold Engineering and Development Center, TN.\n- Continue requirements development and planning for improved hypersonics ground test capabilities to address critical shortfalls in developmental and operational testing of cruise missile and boost glide vehicles. \n- Initiate requirements development and planning for the upgrade of the Arnold Engineering Center Hypervelocity Wind Tunnel 9, Maryland to a Mach 18 capability to conduct testing in support of hypersonic system development and hypersonic vehicle technologies. \n- Initiate requirements development and planning for the upgrade of the Arnold Engineering Center, TN G-Range Weather Erosion Facility to conduct erosion testing of hypersonic materials and vehicle technologies in weather and particulate environments (rain, ice and dust).  \n- Initiate requirements development and planning for the upgrade of the Holloman AFB, NM Sled Track to conduct erosion testing of hypersonic materials and vehicle technologies. \n- Initiate requirements development and planning to develop a Light Detecting and Ranging (LiDAR) atmospheric measurement system for enhanced ground-based atmospheric measurements to support open-air range flight testing of hypersonic vehicles.\n-Initiate a study of open-air ranges for hypersonic testing.\n\nResource Enhancement Project:\n- Complete development of Advanced Mine Simulation System (AMISS) Upgrade, which provides the existing AMISS asset with five new mine triggering emulations, as well as sensor and improved compartmentalization enhancements.\n- Complete development of C2 and Urban Background Environment Simulator (CUBES) to incorporate modern urban communication background signals and selected closed-loop communications for Installed System Test Facility communications jamming purposes.\n- Complete the Digital Integrated Air Defense System (DIADS) Sensor Reactivity Upgrade (SRU) to upgrade DIADS radars with enhanced ECM response features in support of F-35 and F-22 operational testing.\n- Complete development of Joint Standard Instrumentation Suite (JSIS) to measure and collect signature, TSPI, and related data of threat missile and hostile fire munitions (e.g., small arms and RPG) firings to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Complete development of Submarine Launched Modular 3-inch Device (SLAM-3D), which provides a Cluster Donut countermeasure emulator that will help resolve the Anti-Submarine Warfare COI for the Mk 54 Mod 1 Torpedo.\n- Complete development of Tactical Datalink (TDL) and Full Motion Video (FMV) Accuracy Assessment Tool (T-FAAT) to interface COTS tool suites to create a net-enabled weapon situational awareness during live testing.\n- Complete development of Torpedo Operational Testing Using Modeling and Simulation (TOTUMS) to enhance torpedo OT&E by upgrading an HITL simulator and environment simulator for high-fidelity, OT-ready realism.\n- Continue development of Airborne Early Warning Interoperability Simulator (AEIS) to develop the hardware and software necessary to generate a properly spaced, dense target and ECM environment for injection-mode Installed Systems Test Facility testing of the E-2D Hawkeye mission system.\n- Continue development of Boosted Zombie Target (BZT) to develop multi-stage, economical targets for PAC-3 by integrating a GFE booster onto a blue \"Zombie\" maneuvering target.\n- Continue development of the Medium Range Target Engagement Radar (MR-TER) Radar System Emulator (RSE) to develop and integrate TER waveform replication capability into C-Band RSEs.\n- Initiate development of additional enhancements to Air Warfare Battle Shaping (AWBS) investments to improve air-to-air range infrastructure for NAWC-WD.\n- Initiate development of Cognitive Electronic Warfare (Cognitive EW) Flight Test to evaluate an advanced EW system against emerging threat representations. \n- Initiate development of General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n-Initiate development of the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) to develop kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets. \n- Initiate development of Space Fence Evaluation of Radar Effectiveness (SFERES) to fabricate a 3-axis stabilized CubeSat which will launch two spheres to support accurate evaluation of the Space Fence radar."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "211.325"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n- Complete system development for the Joint Distributed Infrared Countermeasures (IRCM) Ground Test System (JDIGS) project to provide an end-to-end ground test system enabling complete testing of IRCM systems.\n- Complete preliminary design and continue system development for Block 2 of the Multi-Level Secure Joint\/Coalition Network Environment (MLS-JCNE) project to develop standardized, DoD test and evaluation multi-level secure voice, text chat, file transfer and a multi-level work station for cross-domain data management in a T&E network environment.\n- Continue system development for the Network Centric Weapon (NCW) T&E Environment project to provide an enhanced capability to test and evaluate NCW in a distributed end-to-end simulation environment.\n- Complete Initial Operational Capability (IOC) and continue system development for the Cyber Test Analysis and Simulation Environment (Cyber TASE) project to enhance current Information Assurance \/ Cyber testing and analysis capabilities and modeling and simulations tools for testing against increasingly robust Cyber threats.\n- Complete production, delivery and site acceptance testing for a 16 Radar Signal Emulator project to provide open-loop, transmit-only systems that will accurately emit waveforms of threat radar systems operating in the C and S radio frequency (RF) bands. Transition to Air Force and Navy for sustainment.\n- Complete prototype testing, critical design and continue system development for the Advanced Range Tracking and Imaging System (ARTIS) project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical test data.\n- Complete requirements development and planning and initiate preliminary design for the Fast Burst Reactor project that upgrades the capability of Highly Enriched Uranium, Fast Burst Reactor at White Sands Missile Range test capability to conduct component testing in a nuclear weapons environment.  \n- Complete engineering design unit #1 and continue preliminary design for the Commercial Derivative Aircraft Based Instrumentation Telemetry System (CBITS) project to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n- Continue initial contractor support for the delivery of the Common Range Integrated Instrumentation System (CRIIS) project that provides a common range instrumentation system for next generation high dynamic aeronautical range data requirements.\n- Continue the Joint Strike Fighter Knowledge Management (JSF-KM) project to establish a next-generation KM capability that utilizes the latest in virtualization technologies, methodologies, and best practices for efficient and effective use of T&E data. Complete development of small form factor data analytics system to support F-35 Initial Operational Test and Evaluation.\n- Complete Initial Operational Capability at Patuxent River NAS, MD, for the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.  Continue system development and integration of simulator systems and integration for Full Operational Capability.  \n- Complete system development for unit #1 and integration testing with the Next Generation Electronic Warfare Environment Generator (NEWEG) system for the Advanced Dynamic Transmitter Array (ADTRA) project to develop a dense, complex, dynamic radio frequency (RF) signal threat environment that will accurately represent signal characteristics, increase signal densities, while reducing test system set up and calibration times at the Benefield Anechoic Facility (BAF).  Continue system development and integration for remaining ADTRA units. \n- Continue system development of the Closed Loop PESA Simulator project to develop a closed-loop radar system that will closely replicate the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system.\n- Continue system development of Integrated Air Defense System (IADS) Enhancements that will add comprehensive threat-representative IADS capabilities based on the development and integration of several high-priority, threat-representative Command Post (CP) models to open-air test ranges, test laboratories and modeling and simulation (M&S) facilities.\n- Continue Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) activities to provide detailed analysis and validation of threat system designs and operational techniques.\n- Complete critical design and continue system development for the Advanced Weapons Effects Test Capability project to develop a capability to more accurately measure fragment characteristics of explosive weapons and more accurately estimate collateral damage distances.\n- Complete integration of the Ka-band radar upgrade and continue risk reduction for the Atlantic Test Range ADAMS-3 at Patuxent River NAS, MD, and complete HF antenna integration, distributed signal processing upgrade and pylon refurbishment and continue system development at the National Radar Cross Section Test Facility, Holloman AFB, NM for the Radar Cross Section Range Relevance Project to upgrade radar cross section measurement capabilities to measure and evaluate advanced low observable technologies.\n- Complete critical design, conduct UAS Scoring flight demonstrations, seaborne target control demonstrations and continue system development for the Swarm Autonomy and Scoring project to upgrade existing High Speed Maneuverable Surface Targets (HSMST) with semi-autonomous control and improved UAS overhead scoring capabilities for testing against representative surface swarming threats. Complete the feasibility assessment for the Real Time Casualty Assessment capability.\n- Continue system development of the Integrated Network Enhanced Telemetry (iNET) project capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities.\n- Continue system development for the Mid-Pressure Arc Heater project to expand the H2 Hypersonic Test Facility at the Arnold Engineering Development Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems. \n- Complete concept development and initiate design for Hypersonic Test Capability Improvement project that will test prototypes of hypersonic systems in a realistic clean air environment up to Mach 7.5 at Arnold Engineering Development Complex, TN.\n- Continue upgrading the Arnold Engineering Development Complex (AEDC) Hypervelocity Wind Tunnel 9 in Maryland to a Mach 18 capability to conduct testing in support of hypersonic system development and hypersonic vehicle technologies. \n- Continue development of G-Range Weather Erosion Facility to conduct erosion testing of hypersonic materials and vehicle technologies in weather and particulate environments (rain, ice and dust).  \n- Continue upgrading of the Holloman AFB, NM Sled Track to conduct erosion testing of hypersonic materials and vehicle technologies. \n- Continue requirements development and planning to develop a Light Detecting and Ranging (LiDAR) atmospheric measurement system for enhanced ground-based atmospheric measurements to support open-air range flight testing of hypersonic vehicles.\n- Continue development under the M&S for Weather Effects on Hypersonic Systems project that provides a database of realistic and relevant weather conditions as a basis for ground test requirements and develops advanced material response models validated with improved ground test data to predict weather erosion in flight.\n- Continue development of the Transient Thermal Analysis Software Transition tool set that improves capabilities for predicting aerothermal and ablation response to high speed, high temperature flow in ground and flight test environments.\n- Initiate a study of open-air ranges for hypersonic testing.\n- Initiate six CTEIP FY2018 New Start test environment and test instrumentation capability development projects. Complete requirements development and planning and initiate concept development and preliminary design based on progress:\n   * The Autonomous Systems Test Capability (ASTC) project that develops test capability for Service autonomous systems.\n   * The Advanced Durability Testing (AVDT) that develops a multi-axle vehicle chassis simulator and a drive train simulator at Aberdeen, MD.\n   * The Mission System Test Capability (MSTC) project that develops the capability to support integration and interoperability testing for advanced 4th and 5th generation aircraft data links (MADL and TTNT) in a ground test, simulation environment.\n   * The Radar Air-to-Ground Environment (RAGE) project that develops an installed test facility, ground test capability for testing advanced aircraft radars in high density air-to-air and air-to-ground environments. \n   * The Next Generation Turbine Engine Sea-level RAM Test Capability (NGTE) project that upgrades the turbine engine test capability to test advanced aircraft engines at Arnold Engineering Development Center, TN. \n   * The Unmanned Systems T&E Improvements (UAS-TEI) project that develops improved test capability of the Services LVC unmanned autonomous systems test environments. \n- Initiate risk reduction activities under the Enhanced Solutions Process for candidate FY2020 multi-Service T&E developments, as recommended by Service Test and Evaluation Executives.\n- Continue ongoing threat system simulator, modeling and simulation development efforts, and initiate new threat simulator, modeling and simulation efforts in coordination with the Director, Operational Test and Evaluation (DOTE) Test and Evaluation Threat Resource Activity (TETRA).\n- Transition the Dense Plasma Focus (DPF) system to meet short pulse requirements necessary for both weapons certification and testing new circuit designs for nuclear weapons effects testing from T&E\/S&T technical maturation into a CTEIP development project. Initiate requirements development and project planning. \n\nResource Enhancement Project:\n- Complete development of additional enhancements to Air Warfare Battle Shaping (AWBS) investments to improve air-to-air range infrastructure for NAWC-WD.\n- Complete development of Boosted Zombie Target (BZT) to develop multi-stage, economical targets for PAC-3 by integrating a GFE booster onto a blue \"Zombie\" maneuvering target.\n- Complete development of Cognitive Electronic Warfare (Cognitive EW) Flight Test to evaluate an advanced EW system against emerging threat representations. \n- Complete development of Joint Standard Instrumentation Suite (JSIS) Phase 1.5 to improve and enhance plume signature video models of threat missile and hostile fire munitions (e.g., small arms and RPG) firings to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Complete development of Submarine Launched Modular 3-inch Device (SLAM-3D), which provides a Cluster Donut countermeasure emulator that will help resolve the Anti-Submarine Warfare COI for the Mk 54 Mod 1 Torpedo.\n- Complete development of Space Fence Evaluation of Radar Effectiveness (SFERES) to fabricate a 3-axis stabilized CubeSat which will launch two spheres to support accurate evaluation of the Space Fence radar.\n- Continue development of Advanced Communication Threat Testing Suites (ACTTS) Uplink Capability to develop an electronic warfare (EW) threat representative uplink jamming system to support test and evaluation of end to end satellite system responsiveness to threat systems operating in applicable bands. \n- Continue development of Airborne Early Warning Interoperability Simulator (AEIS) to develop the hardware and software necessary to generate a properly spaced, dense target and ECM environment for injection-mode Installed Systems Test Facility testing of the E-2D Hawkeye mission system.\n- Continue development of Common Operational Test Vehicle and Engagement Real-Time Test Instrumentation (COVERT-I) to reduce the data collection footprint in Abrams tanks and Bradley fighting vehicles by reducing from three unique data collectors to one modular, scalable data collector with increased storage capacity.\n- Continue development of General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n- Continue development of Integrated Digital Acquisition Radar Environment - Upgrade (IDARE-U) to upgrade two NAWCWD Electronic Combat Range OEM Radars’ analog output with digital upgrade for downstream digital messaging.\n- Continue development of Joint Standard Instrumentation Suite (JSIS) Phase 2 to measure and collect missile attitude (6DOF) as well as signature, TSPI, and related data for a larger portion of the threat man-portable air defense systems (MANPADS) trajectory at the required accuracies within a single firing to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Continue development of the Medium Range Target Engagement Radar (MR-TER) Radar System Emulator (RSE) to develop and integrate TER waveform replication capability into C-Band RSEs.\n- Continue development of the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) to develop kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets. \n- Initiate development of Ultra Low-band Time Difference Of Arrival (UT) to develop the capability for a time difference of arrival (TDOA) multi-aircraft test configuration to support three aircraft under test in both the Air Combat Environment Test and Evaluation Facility (ACETEF) and the Electronic Combat Simulation and Evaluation Lab (ECSEL)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "258.796"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "258.796"
                                            },
                                            "Text": {
                                                "val": "JIM Projects:\n- Complete requirements and development and initiate concept development and preliminary design for the Autonomous Systems Test Capability (ASTC) project that develops test capability for Service autonomous systems.\n- Complete requirements and development and initiate concept development and preliminary design for the Advanced Durability Testing (AVDT) that develops a multi-axle vehicle chassis simulator and a drive train simulator at Aberdeen, MD.\n- Complete requirements and development and initiate concept development and preliminary design for the Mission System Test Capability (MSTC) project that develops the capability to support integration and interoperability testing for advanced 4th and 5th generation aircraft data links (MADL and TTNT) in a ground test, simulation environment.\n- Complete requirements and development and initiate concept development and preliminary design for the Next Generation Turbine Engine Sea-level RAM Test Capability (NGTE) project that upgrades the turbine engine test capability to test advanced aircraft engines at Arnold Engineering Development Center, TN\n- Complete requirements and development and initiate concept development and preliminary design for the Radar Air-to-Ground Environment (RAGE) project that develops an installed test facility, ground test capability for testing advanced aircraft radars in high density air-to-air and air-to-ground environments.\n- Complete requirements and development and initiate concept development and preliminary design for the Unmanned Systems T&E Improvements (UAS-TEI) project that develops improved test capability of the Services LVC unmanned autonomous systems test environments. \n- Complete Enhanced Solutions Process risk reduction activities for candidate FY2020 CTEIP New Start test environment and test instrumentation test capability development projects to support CTEIP FY2020 New Start nominations by the Service T&E Executives. \n- Complete preliminary design and initiate system development for the Fast Burst Reactor Upgrade project that upgrades the capability of the Highly Enriched Uranium, Fast Burst Reactor at White Sands Missile Range to conduct component testing in a nuclear weapons environment. \n- Complete requirements development and planning and initiate preliminary design for the Dense Plasma Focus (DPF) project that will meet the short pulse requirements necessary for both weapons certification and testing new circuit designs for nuclear weapons effects testing.\n- Complete preliminary and critical design and continue system development for the Commercial Derivative Aircraft Based Instrumentation Telemetry System project to provide expanded capability and capacity telemetry support for aircraft and missile defense testing in inter-range and broad ocean area test scenarios.\n- Complete development of units 2-3 and continue system development for the Advanced Dynamic Transmitter Array (ADTRA) project to develop a dense, complex, dynamic radio frequency (RF) signal threat environment that will accurately represent signal characteristics, increase signal densities, while reducing test system set up and calibration times at the Benefield Anechoic Facility (BAF).\n- Complete development of the upgraded Command and Control system and initiate security and Calibration Pit developments at the National RCS Test Facility, Holloman AFB, NM. Complete the continue system development for the ADAMS-3 radar facility for the Atlantic Test Range, Patuxent River NAS, MD Radar Cross Section Range Relevance Project that upgrades radar cross section measurement capabilities to measure and evaluate advanced low observable technologies. \n- Complete Initial Operational Capability and continue system development for the Swarm Autonomy and UAV Scoring project to upgrade existing High Speed Maneuverable Surface Targets (HSMST) with semi-autonomous control for testing against representative surface swarming threats. Initiate preliminary design for the Real Time Casualty Assessment capability.\n - Complete Initial Operational Capability (IOC) and continue system development of the Closed Loop PESA Simulator project to develop a closed-loop radar system that will closely replicate the performance of a widely fielded Western Pacific (WESTPAC) long-range surface-to-air missile (SAM) system.\n- Complete Full Operational Capability (FOC) for the Integrated Air Defense System (IADS) Enhancements that will add comprehensive threat-representative IADS capabilities based on the development and integration of several high-priority, threat-representative Command Post (CP) models to open-air test ranges, test laboratories and modeling and simulation (M&S) facilities.\n- Complete critical design and deliver the cross domain VOIP at the JMETC SYSCON and the Multi-level Desktop at the Man Flight Simulator Facility, NAS Patuxent River, MD as Initial Operational Capabilities. Complete critical design for the cross domain text chat and file transfer capabilities and continue system development for Block 2 of the Multi-Level Secure Joint\/Coalition Network Environment (MLS-JCNE) project to develop standardized, DoD test and evaluation multi-level secure voice, text chat, file transfer and a multi-level work station for cross-domain data management in a T&E network environment.\n- Complete Full Operational Capability at NAS Patuxent River, MD and continue system development at the ECSEL, NAS Point Mugu, CA and BAF, Edwards AFB, CA for the Next Generation Electronic Warfare Environment Generator (NEWEG) Build B project to provide electronic warfare simulation capabilities for testing future Electronic Attack and Electronic Support Measures systems.\n- Complete the upgrade of the Arnold Engineering Development Complex (AEDC) Hypervelocity Wind Tunnel 9 in Maryland to a Mach 18 capability to conduct testing in support of hypersonic system development and hypersonic vehicle technologies.\n- Initiate sustainment for the Radar Signal Emulator project to provide open-loop, transmit-only systems that will accurately emit waveforms of threat radar systems operating in the C and S radio frequency (RF) bands.\n- Continue system development for the Advanced Range Tracking and Imaging System project to provide an integrated next generation suite of optical tracking mounts needed to increase performance, reduce costs, and effectively deliver secure reliable optical throughput.\n- Continue system development for the Advanced Weapons Effects Test Capability project to develop a capability to more accurately measure fragment characteristics of explosive weapons and more accurately estimate collateral damage distances.\n- Continue production and interim contractor logistics support for the Common Range Integrated Instrumentation System project to develop a common range instrumentation system to address next generation range data requirements.\n- Continue system development for the Cyber Test Analysis and Simulation Environment project to enhance current Information Assurance \/ Cyber testing and analysis capabilities and modeling and simulations tools for testing against increasingly robust Cyber threats.\n- Continue system development of the Integrated Network Enhanced Telemetry (iNET) project capability to develop a network-enhanced aeronautical telemetry capability for T&E ranges and facilities. \n- Continue system development for the Network Centric Weapon (NCW) T&E Environment project to provide an enhanced capability to test and evaluate NCW in a distributed end-to-end simulation environment.\n- Continue Integrated Technical Evaluation and Analysis of Multiple Sources (ITEAMS) activities to provide detailed analysis and validation of threat system designs and operational techniques.\n- Continue system development for the Mid-Pressure Arc Heater project to expand the H2 Hypersonic Test Facility at the Arnold Engineering Development Complex, TN to provide higher enthalpy at the mid-pressure altitudes to enable ground materials testing of components of hypersonic systems. \n- Continue system development for the Hypersonic Test Capability Improvement project that will test models of hypersonic systems in a realistic clean air environment up to Mach 7.5 at Arnold Engineering Development Complex, TN.\n-  Continue upgrading the G-Range Weather Erosion Facility at Arnold Engineering Development Complex, TN to conduct erosion testing of hypersonic materials and vehicle technologies in weather and particulate environments (rain, ice and dust).  \n- Continue upgrading the Holloman AFB, NM Sled Track to conduct erosion testing of hypersonic materials and vehicle technologies. \n- Complete development of a Light Detecting and Ranging (LiDAR) atmospheric measurement system for enhanced ground-based atmospheric measurements to support open-air range flight testing of hypersonic vehicles.\n- Continue the study of open-air ranges for hypersonic testing.\n- Continue development of tools under the M&S for Weather Effects on Hypersonic Systems project to develop advanced material response models validated with improved ground test data to predict weather erosion in flight.\n- Complete development of the Transient Thermal Analysis Software to predict aerothermal responses to high speed, high temperature air flow.\n- Continue activities to improve capabilities of the hypersonics workforce with industry and academia.\n- Initiate requirements development and planning for projects that support hypersonic ground and open air range test capabilities identified in the Execution Plan for Hypersonic T&E Investments.  \n- Continue ongoing threat system simulator, modeling and simulation development efforts, and initiate new threat simulator, modeling and simulation efforts in coordination with the Director, Operational Test and Evaluation (DOTE) Test and Evaluation Threat Resource Activity (TETRA).\n\nResource Enhancement Project:\n- Complete development of Airborne Early Warning Interoperability Simulator (AEIS) to develop the hardware and software necessary to generate a properly spaced, dense target and ECM environment for injection-mode Installed Systems Test Facility testing of the E-2D Hawkeye mission system.\n- Complete development of Common Operational Test Vehicle and Engagement Real-Time Test Instrumentation (COVERT-I) to reduce the data collection footprint in Abrams tanks and Bradley fighting vehicles by reducing from three unique data collectors to one modular, scalable data collector with increased storage capacity. \n- Complete development of Integrated Digital Acquisition Radar Environment - Upgrade (IDARE-U) to upgrade two NAWCWD Electronic Combat Range OEM Radars’ analog output with digital upgrade for downstream digital messaging.\n- Complete development of the Medium Range Target Engagement Radar (MR-TER) Radar System Emulator (RSE) to develop and integrate TER waveform replication capability into C-Band RSEs.\n- Complete development of the Pulsed Doppler Emitter Capability Payload for Aerial Targets (PDEC-163) to develop kinematic threat representations and threat representative emissions to provide the DDG-1000 OT SUT with the ability to collect data necessary for COTF to accredit the DDG-1000’s fire control loop weapons system response to threat targets. \n- Continue development of Advanced Communication Threat Testing Suites (ACTTS) Uplink Capability to develop an electronic warfare (EW) threat representative uplink jamming system to support test and evaluation of end to end satellite system responsiveness to threat systems operating in applicable bands. \n- Continue development of General Threat Torpedo (GTT) to develop a threat torpedo surrogate with upgradable interchangeable segments as an upgrade replacement for the current threat surrogate torpedo.\n- Continue development of Joint Standard Instrumentation Suite (JSIS) Phase 2 to measure and collect missile attitude (6DOF) as well as signature, TSPI, and related data for a larger portion of the threat man-portable air defense systems (MANPADS) trajectory at the required accuracies within a single firing to support evaluation of the missile\/hostile fire warning systems such as the Advance Threat Warning (ATW) system.\n- Continue development of Ultra Low-band Time Difference Of Arrival (UT) to develop the capability for a time difference of arrival (TDOA) multi-aircraft test configuration to support three aircraft under test in both the Air Combat Environment Test and the Evaluation Facility (ACETEF) and Electronic Combat Simulation and Evaluation Lab (ECSEL). \n- Initiate development of instrumented facilities to evaluate our next generation of sensors, weapons, platforms, and C4ISR systems in a realistic urban environment in response to near-term documented OT shortfalls.\n-  Initiate development of hardware simulators to test missile warning systems of new generation electronic warfare (EW) suites in a dynamic environment in response to near-term documented OT shortfalls.\n-  Initiate the development of non-intrusive instrumentation to address near-term OT capability shortfalls to evaluate advanced sensor system performance in harsh environments in response to near-term documented OT shortfalls."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Department Program Adjustments. Increased investments for high-priority hypersonic ground and open air range test capability developments and increased investments for critically needed upgrades to DoD Threat Models and Simulations."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "A portion of CTEIP projects that were developed and delivered to the DoD test community over the past five years."
                        }
                    }
                }
            ]
        }
    }
}