{
    "id": "2019-DefenseLogisticsAgency-PB-0400-MJBOOK-0-4-32521504027ebdb13752e3b88d1670fe1a293063bafd6431aca8a5e28b29fb53-4",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605070S"
        },
        "ProgramElementTitle": {
            "val": "DoD Enterprise Systems Development and Demonstration"
        },
        "R1LineNumber": {
            "val": "127"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "117.472"
            },
            "PriorYear": {
                "val": "3.661"
            },
            "CurrentYear": {
                "val": "6.266"
            },
            "BudgetYearOne": {
                "val": "3.173"
            },
            "BudgetYearOneBase": {
                "val": "3.173"
            },
            "BudgetYearTwo": {
                "val": "2.378"
            },
            "BudgetYearThree": {
                "val": "1.486"
            },
            "BudgetYearFour": {
                "val": "0.743"
            },
            "BudgetYearFive": {
                "val": "0.757"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The mission of the DoD Enterprise Business Systems (DEBS) is to coordinate and enable business transformation efforts across the Department of Defense (DoD). The DLA recognizes that DoD’s business enterprise must be closer to its warfighting customers than ever before. Joint military requirements drive the need for greater commonality and integration of business and financial operations."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "5.660"
                },
                "CurrentYear": {
                    "val": "6.266"
                },
                "BudgetYearOne": {
                    "val": "3.200"
                },
                "BudgetYearOneBase": {
                    "val": "3.200"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "3.661"
                },
                "CurrentYear": {
                    "val": "6.266"
                },
                "BudgetYearOne": {
                    "val": "3.173"
                },
                "BudgetYearOneBase": {
                    "val": "3.173"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.999"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.027"
                },
                "BudgetYearOneBase": {
                    "val": "-0.027"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.139"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FY 2017 Request for Additional Appropriations Not Addressed"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.860"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.027"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.027"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY2017, the Small Business Innovation Research and Small Technology Transfer Research tax amounted to $0.139M. In FY2017, EFD request for additional appropriations was not addressed. \n\n\nInflation adjustments for Non-Pay\/Non-Fuel Pay purchases and Civilian Pay decreased the program baseline in FY2019."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0"
                    },
                    "ProjectTitle": {
                        "val": "Prior Years"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "100.112"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Prior Year includes:\n-Business Enterprise Information Services (BEIS): $13.360M. The BEIS utilized the mature, existing infrastructure of Defense Corporate Database\/Defense Corporate Warehouse (DCD\/DCW), Defense Departmental Reporting System (DDRS), and Defense Cash Accountability System (DCAS) to provide timely, accurate, and reliable business information from across the DoD to support auditable financial statements as well as provide detailed information visibility for management in support of the Warfighter.  The goals of BEIS were to ensure data compliance with Standard Financial Information Structure (SFIS) standards; provide security-defined, enterprise-level access to information for ad hoc management queries; and produce external financial management reports\/statements based on standardized data.  \n\n-Defense Information System for Security (DISS): $70.319M. The DISS program was a family of systems solution that specifically addresses the security clearance and suitability determinations requirements of Section 3001 of Public Law 108-458, the Intelligence Reform and Terrorism Prevention Act of 2004 (IRTPA) which requires 90% of all clearances – whether Top Secret, Secret, or Confidential – to be completed within 60 days, as well as supports Homeland Security Presidential Directive 12 (HSPD-12) compliance across the DoD.  The DISS electronically collects, reviews, and shares relevant data, government-wide, as mandated by the IRPTA and, guided by relevant Executive Orders, Congress, and GAO recommendations, deliver and maintain an appropriately vetted world-class workforce.  \n\n-Defense Travel System (DTS): $1.423M. The DTS program was a fully integrated, electronic, end-to-end financial management system that automates temporary duty travel for the Department of Defense (DoD). DTS meets unique DoD mission, security and financial system requirements within the guidelines of Federal and DoD travel policies and regulations. DTS automates travel authorizations, reservations and arrangements, voucher processing, payment, reconciliation, accountability and archiving. DTS employs Digital Signature and Login\/Authentication which requires users to provide a signed response using a valid DoD Public Key Infrastructure (PKI) certificate to gain access to the DTS application. Travel documents created in DTS are digitally signed with the user’s PKI certificate to provide a means of identifying the signer, verifying the document’s integrity, and enforcing non-repudiation of the signature by the signer.\n\n-Defense Retired and Annuitant Pay System (DRAS): $15.010M. The DRAS program established and maintained a modernized retired military pay accounts.  DRAS 2 will replace the current Defense Retiree and Annuitant Systems (DRAS) and selected manual processes with proven state of the market technology using Clinger-Cohen guidance for selection of the solution.  Rapid fielding techniques will be used to close business process gaps by delivering incremental capability that provides clear financial benefits."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "09"
                    },
                    "ProjectTitle": {
                        "val": "Enterprise Funds Distribution"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.360"
                        },
                        "PriorYear": {
                            "val": "3.661"
                        },
                        "CurrentYear": {
                            "val": "6.266"
                        },
                        "BudgetYearOne": {
                            "val": "3.173"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.173"
                        },
                        "BudgetYearTwo": {
                            "val": "2.378"
                        },
                        "BudgetYearThree": {
                            "val": "1.486"
                        },
                        "BudgetYearFour": {
                            "val": "0.743"
                        },
                        "BudgetYearFive": {
                            "val": "0.757"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Enterprise Funds Distribution (EFD) is a multi-service\/multi-agency solution established as a key initiative to provide full visibility of funds distributed through echelon I and II for the Military Departments and at all levels for the Defense Agencies to improve and modernize the OUSD(C) funds distribution process. Funds distribution by its nature is a key enabler of financial visibility within DoD enterprise systems. The concept of a fully visible enterprise funds distribution process serves as a reference where planned and coordinated funds development and execution takes place. \n\nWithin the current DoD environment, progress has been made streamlining a diverse set of stove-piped budget execution and funds distribution processes and systems. Efforts continue to improve the visibility of funding information, eliminate manual efforts and undue complexities to the management of budget authority, and to eliminate impediments in the flow of funding documents. The current environment relies heavily on manual processing and on disconnected standalone systems for the processing of Funding Authorization Documents (FADs) and reprogramming actions. This environment made the implementation of internal controls difficult, negatively impacted the accuracy and timeliness of information while making the processes of integrating and obtaining management information arduous. \n\nThe envisioned operational environment solves these problems by enabling lifecycle program value management in a web-based application utilizing an authoritative database with single-source data entry and automated workflow. Capabilities within this integrated environment will enable the automation of all funds distribution and funds control processes within OUSD(C) using authoritative and highly visible data. Specifically, capabilities include managing apportionments, distributing budget authority to the Military Departments and Defense Agencies, managing rescissions and continuing resolutions, creating and tracking reprogramming actions, and establishing program baselines and budget authority needed to support changes in funding priorities throughout the year.\n\nThe operational environment includes organizational elements down to the echelon II level responsible for managing DoD and Component appropriations operating in an unclassified environment. The web-based application provides pre-planning, apportionment, reprogramming, rescission, continuing resolution, reporting of enterprise-level funds control and distribution of appropriated funding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Enterprise Funds Distribution (EFD)"
                                    },
                                    "Description": {
                                        "val": "EFD will distribute funds to the Military Departments and the Defense Agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.661"
                                            },
                                            "Text": {
                                                "val": "• Complete implementation of EFD Phase 2. and begin transition activities preparing for hand off to DFAS.\n• Complete research and employ new hosting solution for EFD IAW DFAS Systems hosting directives"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.266"
                                            },
                                            "Text": {
                                                "val": "Continue development and deployment of EFD Phase 2 requirements based on user group migration strategy. Deploy user migration wave 1"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.173"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.173"
                                            },
                                            "Text": {
                                                "val": "Continue development and deployment of EFD Phase 2 requirements based on user group migration strategy. Deploy user migration wave 2"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 is lower due to the majority of EFD's development to be completed in FY2018 and the primary focused to be on Wave II user migration and their required changes."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The EFD strategy is to use a “single acquisition to full capability,” commercial-off-the-shelf (COTS) solution (Momentum software). The effort needed to ensure EFD is fully implemented for all appropriation data for the Military Services and Defense Organizations has led to a full deployment date of September 2016."
                        },
                        "PerformanceMetrics": {
                            "val": "For performance, the objective is that 100% of the SFIS elements are SFIS compliant at FD."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Savantage Solutions"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Savantage Solutions"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rockville, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "14.158"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "14.158"
                                                    },
                                                    "TargetValue": {
                                                        "val": "14.158"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TeraThink Corporation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TeraThink Corporation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.710"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.661"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.266"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.173"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.173"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.492"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.492"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.492"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "50605070S_R4.PNG"
                                }
                            }
                        ]
                    }
                }
            ]
        }
    }
}