{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2493f0919bca3c9887c2149e77e4bc805cb5ac3396a194d2f3cb8b6ccd5038c5-33",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605142D8Z"
        },
        "ProgramElementTitle": {
            "val": "Systems Engineering"
        },
        "R1LineNumber": {
            "val": "146"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "187.433"
            },
            "PriorYear": {
                "val": "31.276"
            },
            "CurrentYear": {
                "val": "37.622"
            },
            "BudgetYearOne": {
                "val": "38.872"
            },
            "BudgetYearOneBase": {
                "val": "38.872"
            },
            "BudgetYearTwo": {
                "val": "39.252"
            },
            "BudgetYearThree": {
                "val": "39.726"
            },
            "BudgetYearFour": {
                "val": "39.971"
            },
            "BudgetYearFive": {
                "val": "40.840"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) establishes the dedicated funding line to carry out the duties as described in Title 10 US Code, Section 139, the Weapons Systems Acquisition Reform Act of 2009.  The Deputy Assistant Secretary of Defense for Systems Engineering (DASD(SE)) is the principal advisor to the Secretary of Defense and the Under Secretary of Defense for Research and Engineering (USD(R&E)) on systems engineering, development planning, program protection, and related technical fields in the Department of Defense (DoD).  The DASD(SE) develops policies and guidance for: (1) the use of systems engineering principles and best practices; (2) the use of systems, system security, and software engineering planning and contracting approaches to enhance manufacturing, reliability, availability, maintainability, and software and hardware assurance, on major defense acquisition programs (MDAPs) and major automated information systems (MAISs); (3) the systems engineering plans (SEPs) and program protection plans (PPPs) for MDAPs and MAISs including software, and systems engineering considerations in support of lifecycle management and sustainability; and (4) the inclusion of provisions relating to systems engineering, assurance and reliability in requests for proposals.  The DASD(SE) develops new methods, processes, and tools (MPTs) incorporating state of the practice into system engineering for the DoD in both weapon system design, and design tools.  The DASD(SE) reviews and approves the SEP and PPP for each MDAP and MAIS, and monitors and reviews the systems engineering, program protection, and development planning activities of MDAPs and other defense acquisition programs, as directed by the Secretary of Defense.  Based on the DASD(SE)’s continuous program engagement, the DASD(SE) advises and makes recommendations to the Secretary of Defense regarding systems engineering, development planning, program protection and the execution of these activities.  As a member of the Defense Acquisition Board (DAB), the DASD(SE) provides independent assessments of defense acquisition program’s systems engineering, development planning, program protection planning, technical execution, and risk.  The DASD(SE) also provides input on the inclusion of systems engineering requirements as part of the Joint Requirements Oversight Council's process for joint military requirements, to include developing specific inputs relating to each capabilities development document.\n\nThe DASD(SE) issues guidance to, and consults with, the Services and Agencies with respect to systems engineering across the Department.  The DASD(SE) improves DoD’s SE capabilities through advocacy, oversight, policy, and guidance for the acquisition workforce responsible for Engineering, and Production, Quality & Manufacturing (PQM); in Engineering Tools and Environments; and in Specialty Engineering.  \n\nThe DASD(SE) periodically reviews the organizations and capabilities of the military departments with respect to systems engineering, development planning, and lifecycle management and sustainability, and identifies needed changes or improvements to such organizations and capabilities.  The DASD(SE) prepares and submits a bi-annual report to Congress on systems engineering activities and effectiveness.\n\nThis PE includes efforts by the office of the DASD(SE) in implementing the Department’s Trusted Defense System Strategy.  Specifically, the PE will develop and mature the critical sub discipline of systems engineering - system security engineering (SSE), Hardware and Software Assurance, and the Comprehensive Program Protection Planning process that implements a risk-based approach to protection of critical program information, critical components and mission functions, and information in acquisition programs.  These efforts include study and maturation of policy, guidance, system security discipline fundamentals, such as engineering methods, tools, and best practices, and establishing a coalition of assurance activities across the DoD to provide analytical and technical support to acquisition programs.  These activities will be promulgated in defense acquisition as a fundamental element of the DASD(SE) systems engineering and technical reviews.\n\nBeginning in FY 2019, this PE will support activities to carry out responsibilities described in Fiscal Year 2017 National Defense Authorization Act (NDAA) Section 855 titled Mission Integration Management (MIM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.429"
                },
                "CurrentYear": {
                    "val": "37.622"
                },
                "BudgetYearOne": {
                    "val": "37.146"
                },
                "BudgetYearOneBase": {
                    "val": "37.146"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "31.276"
                },
                "CurrentYear": {
                    "val": "37.622"
                },
                "BudgetYearOne": {
                    "val": "38.872"
                },
                "BudgetYearOneBase": {
                    "val": "38.872"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.153"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "1.726"
                },
                "BudgetYearOneBase": {
                    "val": "1.726"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.112"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Realignment for Higher Priorities"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.013"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.013"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.036"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.261"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.261"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Realignment for higher priorities reflect a new project line for Mission Engineering."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "142"
                    },
                    "ProjectTitle": {
                        "val": "Systems Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "165.587"
                        },
                        "PriorYear": {
                            "val": "27.722"
                        },
                        "CurrentYear": {
                            "val": "33.392"
                        },
                        "BudgetYearOne": {
                            "val": "33.002"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.002"
                        },
                        "BudgetYearTwo": {
                            "val": "33.398"
                        },
                        "BudgetYearThree": {
                            "val": "33.872"
                        },
                        "BudgetYearFour": {
                            "val": "34.127"
                        },
                        "BudgetYearFive": {
                            "val": "35.103"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project P142 supports the execution of the missions of the Deputy Assistant Secretary of Defense for Systems Engineering (DASD(SE)) to: (1) provide flexible engineering policy, guidance, and workforce development requirements for the DoD acquisition workforce; (2) foster an acquisition environment of collaboration, teamwork, and joint ownership of program success through a proactive program oversight process, ensuring appropriate levels of systems engineering discipline are applied through all phases of the acquisition life cycle; and (3) engage all stakeholders across government, industry, and academia to collectively advance systems engineering practice and achieve acquisition excellence.  The outcome of this effort is to ensure systems engineering principles and disciplines are fully accepted and assimilated into the DoD acquisition workforce positioning the DoD for acquisition excellence and leading to a stronger national defense.\n\nActivities include the following functions:\n\n• Work with acquisition program managers to prepare systems engineering plans (SEPs) to document the technical management approach.\n• Conduct periodic program engagements in support of technical reviews to confirm programs are executed in accordance with the SEP.\n• Review all aspects of the systems engineering process for major defense acquisition programs (MDAPs) to ensure they are adequate to support fielding and the achievement of cost and performance goals including producibility, reliability, sustainment, and other considerations.\n• Participate in Systems Engineering Integrated Project Teams (IPTs), Systems Engineering Working Integrated Project Teams (WIPTs), and Systems Engineering technical reviews, especially Preliminary Design Reviews and Critical Design Reviews.\n• Work with DoD Service program managers, their staffs, and other organizations, technical authorities, and oversight organizations to develop and implement technical management programs for MDAPs.\n• Conceive plans and lead program support reviews and assessments of MDAP weapons systems and other programs (e.g., Major Automated Information Systems (MAIS)) to shape technical planning and management to ensure program success.\n• Conduct other technical reviews as requested (e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, focused technical assessments, and software readiness reviews to identify and mitigate program risk).\n• Establish engineering policy, guidance, and workforce development to drive the development of fully capable and supportable weapons systems.\n• Oversee Component implementation of engineering initiatives and conduct independent assessments.\n• Incorporate new MPTs into the engineering practice for development of weapon systems.\n• Advance the principles of modularity and open systems and incorporate them when practicable in the design, and acquisition of weapon systems.\n• Develop education and training materials for instructing, maintaining, and enhancing the defense acquisition workforce.  Activities include: (1) developing guidance to enhance Engineering (ENG) and Production Quality and Manufacturing (PQM) acquisition career planning and progression; and (2) monitoring, and facilitating Defense Acquisition University (DAU) updates to the systems engineering, quality and specialty engineering courses, to ensure the curriculum represents the education and training requirements necessary to be a viable team member in the acquisition process.\n• Improve the DoD’s capabilities in Specialty Engineering (e.g., reliability & maintainability, human-systems integration, weapons safety, value engineering and manufacturing) through policy, program oversight, fostering practice and technology improvements, initiating long-term strategic improvements, and collaborating with industry.\n• Advance DoD engineering practices through the use of digital engineering and model-based systems engineering.\n• Increase trust in computer hardware and software in warfighting systems by establishing a cadre of activities across the DoD capable of detecting and reducing or eliminating software and hardware vulnerabilities for systems in development and sustainment.\n• Serve as the Defense Standardization Executive and oversee the Defense Standardization Program.\n• Guide Service and other component organizations in the development planning process to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Resolve long-term major systems engineering challenges such as systems of systems (SoS) systems engineering, systems engineering of complex systems, and pre-program formulation systems engineering trade off analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Systems Engineering Initiatives"
                                    },
                                    "Description": {
                                        "val": "The DASD(SE) provides objective assessments of program risk to support knowledge-based decision making by DoD leaders regarding DoD MDAPs and MAISs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.722"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \nContinue to:\n• Monitor programs, providing SE oversight and support to all MDAPs, Major Automated Information Systems (MAIS), and special interest programs.\n• Expand root cause analysis conducted during and after Program Support Assessments (PSAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing(PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to, program protection\/system security engineering; software; manufacturing, reliability, availability, and maintainability; modeling and simulation; configuration management; data management; and risk management. \n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria in SEPs and Test and Evaluation Master Plans (TEMPs) for MDAPs; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.392"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \n• Monitor programs, providing SE oversight and support to all MDAPs, Major Automated Information Systems (MAIS), and special interest programs.\n• Expand root cause analysis conducted during and after Program Support Assessments (PSAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing(PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to, program protection\/system security engineering; software; manufacturing, reliability, availability, and maintainability; modeling and simulation; configuration management; data management; and risk management. \n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria in SEPs and Test and Evaluation Master Plans (TEMPs) for MDAPs; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.002"
                                            },
                                            "Text": {
                                                "val": "Strategic Thrust:  Program Support \nContinue to:\n• Monitor programs, providing SE oversight and support to all MDAPs, Major Automated Information Systems (MAIS), and special interest programs.\n• Expand root cause analysis conducted during and after Program Support Assessments (PSAs).\n• Expand use of detailed performance measurement and analysis.\n• Provide decision-quality information and recommendations to DABs, In Progress Reviews, Peer Reviews, and PDR\/CDR assessments.\n\nStrategic Thrust:  Work Force Development\n• Carry out duties as Functional Lead for Engineering (ENG), Production, Quality, and Manufacturing(PQM), all Department non-construction engineering and assist software engineering.\n• Build an enduring high performance engineering culture across the Department in Systems Engineering.\n• Update and deploy courses with increased technical rigor and complex, case-based exercises.\n• Investigate workforce development initiatives including leadership development, specialized training, and improved instructional methods.\n• Assess engineering workforce capability and capacity, and, working with Components, develop strategies to address identified gaps.\n• Perform outreach to services and OSD to focus the Department’s attention and behavior on promoting an engineering culture.\n\nStrategic Thrust:  Engineering Policy and Guidance\n• Develop and update core SE policy, guidance and standards; review all acquisition policy for SE implications.\n• Develop engineering guidance and policies for the integration of specialty engineering functions as part of the SE responsibility in the acquisition process including, but not limited to, program protection\/system security engineering; software; manufacturing, reliability, availability, and maintainability; modeling and simulation; configuration management; data management; and risk management. \n• Assess challenges and impact; develop new guidance, best practices, methods, processes and tools to more effectively implement SE for Systems of Systems.\n• Provide guidance to Defense acquisition programs for developing and documenting each program’s technical strategy and management approach in the SEP throughout the program’s lifecycle. \n\nStrategic Thrust: Systems Engineering Capabilities Assessment \n• Work jointly with DT&E to develop and track measurable performance criteria.\n• Develop and strengthen component SE organization and capabilities.\n• Periodically review the organizations and capabilities of the Military Departments and Defense Agencies with respect to systems engineering, development planning, and lifecycle management and sustainability, and identify needed changes or improvements to such organizations and capabilities. \n• Issue guidance to and consult with the Heads of the DoD Components with respect to systems engineering and development planning in the DoD. \n• Store and analyze performance criteria in SEPs and Test and Evaluation Master Plans (TEMPs) for MDAPs; develop program metrics to aid SE assessments and program execution.\n\nStrategic Thrust:  Early Systems Engineering and Development Planning\n• Perform early acquisition risk assessment including pre-MS A engagement with Joint Requirements Oversight Council processes.\n• Support: (1) Services and COCOMs in pre-MS A formulation; (2) requirements analyses and analysis of alternatives; and (3) initial capabilities document definition and development.\n\nStrategic Thrust:  Engineering Tools and Environments\n• Establish guidance and education to support digital engineering use in Systems Engineering.\n• Continue collaboration in digital engineering methods, processes, tools development and gap identification.\n• Oversee development of, and incorporation of modularity and open system technical enablers by Services in their acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Improved the Systems Engineering effectiveness of the Department’s acquisition enterprise and provided Department leadership with technical insights into acquisition program performance through:\n• Systems engineering plans (SEPs) reviewed and approved to document each program’s technical management approach.\n• Program support assessments (PSAs) and periodic program engagements conducted and program technical reviews supported to confirm programs are executed in accordance with the SEP.\n• Technical reviews conducted as requested (e.g., Nunn-McCurdy certification reviews, Non-Advocate Reviews, and focused technical assessments to identify and mitigate program risk).\n• DABs, Overarching Integrated Product Teams (OIPTs), and other program review participation to provide technical insights to OSD stakeholders.\n• Effective systems engineering policy and guidance established and promulgated throughout the Military Services and the Defense Acquisition System.\n• A systems engineering workforce staffed, trained and certified with capable and experienced personnel.\n• Improved reliability engineering, reliability growth management, and reliability monitoring in program development contracting, execution and sustainment.\n• Service and other component organizations engaged and supported in the development planning process through effective policy, guidance, document reviews and program engagement to ensure proposed MDAP programs are executable within acceptable levels of risk.\n• Increased use of digital artifacts in acquisition decision making and expansion of design options.\n• Increased use of modular designs and design techniques in weapon systems, coupled with appropriate contracting language and follow through."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "143"
                    },
                    "ProjectTitle": {
                        "val": "Program Protection"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "21.846"
                        },
                        "PriorYear": {
                            "val": "3.554"
                        },
                        "CurrentYear": {
                            "val": "4.230"
                        },
                        "BudgetYearOne": {
                            "val": "3.870"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.870"
                        },
                        "BudgetYearTwo": {
                            "val": "3.854"
                        },
                        "BudgetYearThree": {
                            "val": "3.854"
                        },
                        "BudgetYearFour": {
                            "val": "3.844"
                        },
                        "BudgetYearFive": {
                            "val": "3.737"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) must address cybersecurity and supply chain risks to DoD networks, weapons systems, and information stored and processed on both DoD and Defense Industrial Base (DIB) unclassified networks that support DoD programs.  Increased reliance on the internet as a vehicle for sharing information, globalization of the supply chain, and advanced persistent threats (APTs) that can evade commercially available security tools and defeat generic security best practices, drives the need for diligent program protection planning and execution.  Program Protection Planning includes protection of critical program information, critical components and mission functions, and integrates high level security policies and practical expertise to specific acquisition practices, systems engineering activities, and risk reduction activities.  Through this initiative the Department is maturing system security engineering methodologies to protect controlled unclassified information, to include controlled technical information on contractor networks; improve mitigation of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, improve software assurance practices, mature processes to identify Critical Program Information and improve program protection planning.  Activities carried out, support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of Safeguarding Controlled Unclassified Information on contractor owned networks."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Protection"
                                    },
                                    "Description": {
                                        "val": "The DASD(SE) provides system security engineering policy, guidance and objective assessments to reduce risks in sharing and storing Controlled Technical Information, improve mitigation of supply chain risk management risks, improve integration of cybersecurity into the engineering processes, improve software and hardware assurance practices and anti-tamper practices, mature processes to identify Critical Program Information and improve program protection planning.  Activities carried out support implementation of DoD Instruction 5200.44 Trusted Systems and Networks with the use of proven mitigation techniques and tools, the ongoing refinement of risk management processes, and creation of needed technology; implementation of DoD Instruction 5200.39  Critical Program Information (CPI) Identification and Protection Within Research, Development, Test, and Evaluation (RDT&E) to identify and protect Critical Program Information; and implementation of Safeguarding Controlled Unclassified Information on contractor owned networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.554"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n\n• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.\n   - Conduct criticality analyses to determine system vulnerabilities.\n   - Develop Program Protection Plans, and track progress to verify protection of critical program capabilities.\n   - Review ACAT I Program Protection Plans and provide recommendations for their approval to USD(AT&L). \n \n• Advance the state of the practice of systems security engineering.\n   - Continue development of methodology to identify and mitigate system security, to include cybersecurity risk.\n   - Continue to develop courseware, refine guidance, mentor Service teams, provide training, and outreach with government and industry.\n\n• Hardware and Software Assurance (HwA and SwA)\n   - Conduct hardware and software technical working groups, assurance oversight steering council and support group.\n   - Approve HwA and SwA concept of operations for collaboration activities and program support.\n   - Approve strategic plan: establish requirements and schedule for Initial Operating Capabilities (IOC) of HwA and SwA efforts.\n   - Conduct comprehensive survey across HwA and SwA activities to: document capability and capacity, identify gaps, propose gap mediation investments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.230"
                                            },
                                            "Text": {
                                                "val": "• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.\n   - Conduct criticality analyses to determine system vulnerabilities.\n   - Develop Program Protection Plans, and track progress to verify protection of critical program capabilities.\n   - Review ACAT I Program Protection Plans and provide recommendations for their approval to USD(AT&L). \n \n• Advance the state of the practice of systems security engineering.\n   - Continue development of methodology to identify and mitigate system security, to include cybersecurity risk.\n   - Continue to develop courseware, refine guidance, mentor Service teams, provide training, and outreach with government and industry.\n\n• Hardware and Software Assurance (HwA and SwA)\n   - Conduct hardware and software technical working groups, assurance oversight steering council and support group.\n   - Approve HwA and SwA concept of operations for collaboration activities and program support.\n   - Approve strategic plan: establish requirements and schedule for Initial Operating Capabilities (IOC) of HwA and SwA efforts.\n   - Conduct comprehensive survey across HwA and SwA activities to: document capability and capacity, identify gaps, propose gap mediation investments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.870"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.870"
                                            },
                                            "Text": {
                                                "val": "Continue to:\n\n• Provide support to Acquisition Category (ACAT) I programs to conduct broad program protection planning.\n   - Conduct criticality analyses to determine system vulnerabilities.\n   - Develop Program Protection Plans, and track progress to verify protection of critical program capabilities.\n   - Review ACAT I Program Protection Plans and provide recommendations for their approval to USD(AT&L). \n \n• Advance the state of the practice of systems security engineering.\n   - Continue development of methodology to identify and mitigate system security, to include cybersecurity risk.\n   - Continue to develop courseware, refine guidance, mentor Service teams, provide training, and outreach with government and industry.\n\n• Hardware and Software Assurance (HwA and SwA)\n   - Conduct hardware and software technical working groups, assurance oversight steering council and support group.\n   - Approve HwA and SwA concept of operations for collaboration activities and program support.\n   - Approve strategic plan: establish requirements and schedule for Initial Operating Capabilities (IOC) of HwA and SwA efforts.\n   - Conduct comprehensive survey across HwA and SwA activities to: document capability and capacity, identify gaps, propose gap mediation investments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The program protection project supports activities focused on:  (1) improve system security engineering to reduce risks in sharing and storing controlled unclassified information, to include controlled technical information, (2) improve mitigation to supply chain risks, (3) Program Protection Plans reviewed and recommended for USD(AT&L) approval, (4) effective system security engineering policy and guidance, (5) improve software and hardware assurance and anti-tamper practices and implementation, and (6) mature processes to identify and protect critical program information, critical components and mission functions.  \n\nImpact of the program protection initiative is assessed based upon number of major acquisition programs supported with formal assessments, program protection plans reviewed and approved, and through engagement supporting acquisition policy initiatives related to program protection."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "842"
                    },
                    "ProjectTitle": {
                        "val": "Mission Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "2.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.000"
                        },
                        "BudgetYearTwo": {
                            "val": "2.000"
                        },
                        "BudgetYearThree": {
                            "val": "2.000"
                        },
                        "BudgetYearFour": {
                            "val": "2.000"
                        },
                        "BudgetYearFive": {
                            "val": "2.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program Element (PE) establishes a dedicated funding line to support activities to carry out responsibilities described in FY 2017 National Defense Authorization Act (NDAA) Section 855 titled Mission Integration Management (MIM)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mission Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "• Coordinate with Joint Service and commanders of the combatant commands to identify major threats, mission scope, Concept of Operations (CONOPS) development, and Operation Plans (OPLAN). \n• Initiate translation of multi-Service and Coalition mission-based needs for the requirements process, resulting in Capability Requirements.  \n• Develop strategy to use relevant Cross-Service mission threads in coordination with Joint Staff to identify capability gaps. \n• Determine where multi-Service and Coalition mission areas would benefit from mission engineering and a coordinated implementation approach to set an operational context."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort beginning in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}