{
    "id": "2019-Army-PB-2040-JBOOK-d3d3f82921b489871a1a4e67a87dc7ea6efd7f320a6682df27ed06f0007d5b08-38",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0303150A"
        },
        "ProgramElementTitle": {
            "val": "Army Global Command & Control System"
        },
        "R1LineNumber": {
            "val": "220"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.536"
            },
            "CurrentYear": {
                "val": "10.475"
            },
            "BudgetYearOne": {
                "val": "2.034"
            },
            "BudgetYearOneBase": {
                "val": "2.034"
            },
            "BudgetYearTwo": {
                "val": "2.073"
            },
            "BudgetYearThree": {
                "val": "2.11"
            },
            "BudgetYearFour": {
                "val": "2.157"
            },
            "BudgetYearFive": {
                "val": "2.198"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Global Command and Control System-Army (GCCS-A): This project is the Army component system that directly supports the implementation of the Global Command and Control System Family of Systems. GCCS-A provides automated command and control tools for Army Strategic and Operational Theater Commanders to enhance warfighter capabilities throughout the spectrum of conflict during joint and combined operations in support of National Security. The GCCS-A developed software systems dramatically improves the Army's ability to analyze courses of action; develop and manage Army Forces; and ensure feasibility of war plans. In accordance with Army Command Post Computing Environment and Joint Command and Control objectives, GCCS-A was re-architected away from a scalable process architecture based server - thick client architecture to a virtualized server - web client architecture hosted on Battle Command Common Services (BCCS)\/Tactical Server Infrastructure (TSI) and Mission Command Workstation. GCCS-A strategic tools for readiness reporting have been modernized and replaced with the Defense Readiness Reporting System - Army (DRRS-A), a suite of web based applications for Army Readiness, Force Registration and Force Projection.\n \nArmy Joint and Strategic Command and Control (AJaSC2) is a modernization development effort for the Army's joint and strategic C2 capabilities. AJaSC2 provides the materiel solution in response to the Army Mission Command for Unified Action Capability Definition Package (AMCUA CDP). AJaSC2 enables Army operational headquarters to integrate with the Joint Force Commands and Unified Action Partners (UAP). AJaSC2 provides Army leaders: Joint Common Operating Picture (COP); Adaptive planning and execution capabilities for distributed, synchronous and asynchronous collaboration services to develop, revise, and execute their warfighting plans supported by theaterwide analytics; strategic Situational Awareness (SA) to coalition operations and other mission partners and Coordination and synchronization of Joint Execution Mission Management.\n\nGCCS-A will transition into sustainment in FY19.\n\nFiscal Year 2019 base funding will support the Defense Readiness Reporting System - Army  (DRRS-A), the Army's capability for unit readiness reporting, unit registration and force planning and projection activities that enables Title 10 reporting to Congress.  Specifically the funding will provide program oversight and technical development, testing and training support to enable the readiness and force projection capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.718"
                },
                "CurrentYear": {
                    "val": "10.475"
                },
                "BudgetYearOne": {
                    "val": "4.554"
                },
                "BudgetYearOneBase": {
                    "val": "4.554"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.536"
                },
                "CurrentYear": {
                    "val": "10.475"
                },
                "BudgetYearOne": {
                    "val": "2.034"
                },
                "BudgetYearOneBase": {
                    "val": "2.034"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.182"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-2.52"
                },
                "BudgetYearOneBase": {
                    "val": "-2.52"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.002"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.18"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.52"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.52"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year 2019 base funding will support DRRS-A. The Army's capability for unit readiness reporting, unit registration and force planning and projection activities that enable Title 10 reporting to Congress.  Specifically the funding will provide program oversight, technical development, testing and training support to enable the readiness and force projection capabilities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C86"
                    },
                    "ProjectTitle": {
                        "val": "Army Global C2 System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.449"
                        },
                        "CurrentYear": {
                            "val": "6.028"
                        },
                        "BudgetYearOne": {
                            "val": "2.034"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.034"
                        },
                        "BudgetYearTwo": {
                            "val": "2.073"
                        },
                        "BudgetYearThree": {
                            "val": "2.11"
                        },
                        "BudgetYearFour": {
                            "val": "2.157"
                        },
                        "BudgetYearFive": {
                            "val": "2.198"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Global Command and Control System-Army (GCCS-A): This project is the Army component of the Global Command and Control System (GCCS) Family of Systems (FoS). GCCS-A provides automated command and control tools, including Force readiness, planning and movement, and situational awareness, for Army Strategic and Operational Theater commanders to enhance warfighter capabilities throughout the spectrum of conflict during Joint and combined operations in support of National Security. GCCS-A dramatically improves the Army's ability to analyze courses of action, develop and manage Army forces and execute war plans. GCCS-A links the GCCS-Joint Common Operating Picture with the Army Mission Command systems. In accordance with Army Command Post Computing Environment and Joint Command and Control objectives, GCCS-A is being re-architected away from a scalable process architecture based server - thick client architecture to a virtualized server - Battle Command Common Services (BCCS)\/Tactical Server Infrastructure (TSI) and Mission Command Workstation.  \n\nGCCS-A will transition into sustainment in FY19.\n\nThe Defense Readiness Reporting System- Army (DRRS-A) is the Army's Authoritative Readiness Reporting System.  This information technology system provides unit readiness reporting, unit registration and force planning and projection activities to enable Title 10 reporting to Congress. All Fiscal Year 2019 base funding will support DRRS-A.  Specifically this funding will provide additional system enhancements and testing to support emerging developmental requirements to satisfy the Army's and Joint readiness reporting capabilities along with ensuring interoperability of Army and Joint Systems.  DRRS-A is the Army's critical enabler which directly enables the Quarterly Readiness report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software and System Engineering (GCCS-A)"
                                    },
                                    "Description": {
                                        "val": "Software and System Engineering for GCCS-A and DRRS-A Modernization"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.162"
                                            },
                                            "Text": {
                                                "val": "Software and System Engineering modifications to existing GCCS-A version 4.3 baseline"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synchronize with Joint C2 objective Architecture (GCCS-A)"
                                    },
                                    "Description": {
                                        "val": "Software ehancement efforts required to synchronize with Joint C2 objective Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.047"
                                            },
                                            "Text": {
                                                "val": "Synchronize existing baseline with any COE standard modifications"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation (GCCS-A)"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation for GCCS-A"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.11"
                                            },
                                            "Text": {
                                                "val": "Test and Evaluation for GCCS-A. CTSF and SEC testing\/support."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support and Management (GCCS-A)"
                                    },
                                    "Description": {
                                        "val": "Program management includes overall management of program execution, major events, reporting, funds execution, contract management, and logistical support. Includes participation in program planning meetings and IPTs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.13"
                                            },
                                            "Text": {
                                                "val": "Program Support and Management for GCCS-A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.15"
                                            },
                                            "Text": {
                                                "val": "Program Support and Management for GCCS-A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "GCCS-A C86 line will be transitioning into sustainment in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support and Management for Readiness Capabilities (GCCS-A)"
                                    },
                                    "Description": {
                                        "val": "Provides program management and acquisition oversight functions to enable the Army's readiness capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.166"
                                            },
                                            "Text": {
                                                "val": "Provide program management and acquisition oversight functions to enable the Army's readiness capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "GCCS-A C86 line will be transitioning into sustainment in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Readiness Reporting System (DRRS-A) - Software Enhancements (Design\/Develop)"
                                    },
                                    "Description": {
                                        "val": "Support to design, develop, and deploy emerging requirements into the Army's authoritative readiness reporting system to include:  Software enhancements to support evolving DoD and Army readiness policies, processes, technical standards and new interace and interoperability requirements needed to share Army authoritative readiness data with Joint and Army data sharing partners."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.845"
                                            },
                                            "Text": {
                                                "val": "Software enhancements for the Army's authoritative readiness reporting system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.726"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.726"
                                            },
                                            "Text": {
                                                "val": "Software enhancements for the Army's authoritative readiness reporting system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Initial year incorporated start up costs"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense Readiness Reporting Sytem (DRRS-A) - Test and Integration"
                                    },
                                    "Description": {
                                        "val": "Support for developmental and interoperability testing required for the Army's authoritative readiness reporting system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.867"
                                            },
                                            "Text": {
                                                "val": "Support for developmental and interoperability testing required for the Army's authoritative readiness reporting system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.308"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.308"
                                            },
                                            "Text": {
                                                "val": "Developmental and interoperability testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Initial year incorporated start up costs"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA8250"
                                    },
                                    "Title": {
                                        "val": "BA8250  Army Global Cmd & Control Sys (AGCCS) - OPA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.53"
                                        },
                                        "CurrentYear": {
                                            "val": "2.658"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "5.188"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The GCCS-A Modernization Strategy consists of two separate program efforts. (1) A Bridge effort, Acquisition Category (ACAT) III level and (2) a Modernization development effort for the Army's Joint and Strategic command and Control capabilities infrastructure software products. The GCCS-A modernization development effort will be in compliance with Joint Command and Control Capability Development Document (JC2 CDD) and Army Mission Command for Unified Action Capability Definition Package (AMCUA CDP). DRRS-A will continue to satisfy readiness reporting requirements from Army Readiness Division (DAMO-ODR). The Bridge Effort's acquisition approach consists of a support agreement with CECOM LCMC SEC as the prime software developer utilizing a mix of government and contractor support.\n\nThe DRRS-A development effort in FY19 is accomplished through an existing Cost Plus Fixed Fee contract with Sotera Defense Solutions Inc. and testing is managed at the Army Software Engineering Center at Aberdeen Proving Grounds, Maryland."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Office Management (GCCS-A)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "15.808"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.13"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.15"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.088"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Defense Readiness Reporting System-Army Software Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Software Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.217"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.845"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.726"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.726"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.788"
                                                    },
                                                    "TargetValue": {
                                                        "val": "10.217"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "GCCS-A\/DRRS-A Bridge Effort Software Development (GCCS-A)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Software Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.636"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.209"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.845"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.893"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Support Contractors (GCSS-A)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.333"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.166"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "17.499"
                                                    },
                                                    "TargetValue": {
                                                        "val": "17.333"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "ATEC\/JTIC\/CTSF\/SEC(GCCS-A)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.938"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.048"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.878"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Defense Readiness Reporting System - Army (DRRS-A)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "IA"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Army Software Engineering Center"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen Proving Grounds, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.867"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-09"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.308"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.308"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.175"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260716_C86.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Software Materiel Release GCCS-A v4.3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Software Fielding and IA GCCS-A v4.3 (Procurement Funded)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Deployment GCCS-A v4.3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization of Defense Readiness Reporting System - Army"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRRS-A Event 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRRS-A Event 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRRS-A Event 3"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "DRRS-A Event 4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EA5"
                    },
                    "ProjectTitle": {
                        "val": "Strategic and Joint Mission Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.087"
                        },
                        "CurrentYear": {
                            "val": "4.447"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.534"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Army Joint and Strategic Command and Control (AJaSC2) is a modernization development effort for the Army's joint and strategic C2 capabilities. AJaSC2 provides the materiel solution in response to the Army Mission Command for Unified Action Capability Definition Package (AMCUA CDP). AJaSC2 enables Army operational headquarters to integrate with the Joint Force Commands and Unified Action Partners (UAP). AJaSC2 is a software only implementation of strategic applications and interoperability services that leverage the unified software architecture design (core infrastructure and selected common applications being implemented in the CPCE) that provides Army leaders:  Joint Common Operating Picture (COP); Adaptive planning and execution capabilities for distributed, synchronous and asynchronous collaboration services to develop, revise, and execute their warfighting plans supported by theaterwide analytics; strategic Situational Awareness (SA) to coalition operations and other mission partners and coordination and synchronization of Joint Execution Mission Management. Capability Packages enabled by AJaSC2 are providing Force Employment, Joint Force Synchronization, and Total Force Analysis.  The operational payoff providing the Joint Force Commander a linkage between Army Mission Command and Unified Action Partners, enabling Unified Action through integration with existing and future applications (including CPCE and MCE) and contributes to achieving Shared Understanding during Unified Land Operations (ULO) facilitating effective Mission Command."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Design and Systems Engineering (Pre Milestone B)"
                                    },
                                    "Description": {
                                        "val": "Software Development and Systems Engineering of Capability Packages (Common Operating Environment (COE) System Engineering)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.177"
                                            },
                                            "Text": {
                                                "val": "Supports initial software development and engineering support of Capability Packages."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.853"
                                            },
                                            "Text": {
                                                "val": "Finalize Capability Package designs and required specifications\/standards. Conduct research and analysis and systems engineering in coordination with other Joint Programs with an interdependency and with the Army Command Post and Mounted Computing Environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Requirement to be completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synchronization with COE and Command Post Computing Environment (CP CE) and Joint C2 objective Architecture"
                                    },
                                    "Description": {
                                        "val": "Software ehancement efforts required to sync with COE\/CPCE and Joint C2 objective architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.51"
                                            },
                                            "Text": {
                                                "val": "Software enhancement efforts required to synchronize with COE\/CPCE and Joint C2 objective Architecture"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Support and Management"
                                    },
                                    "Description": {
                                        "val": "Program management includes overall management of program execution, major events, reporting, funds execution, contract management, and logistical support. Includes participation in program planning meetings and IPTs"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.4"
                                            },
                                            "Text": {
                                                "val": "Program Support and Management for AJaSC2"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.315"
                                            },
                                            "Text": {
                                                "val": "Develop technical requirements for the three Capability Packages and synchronize those requirements with CPCE and the Joint community to ensure requirements supporting the Joint C2 objective Architecture are fully accounted for."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Requirement to be completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Joint Requirements Validation Process"
                                    },
                                    "Description": {
                                        "val": "Synchronization and Systems Engineering efforts with COE and Command Post Computing Environment (CPCE) and Joint C2 objective Architecture for CP 3, 4 and 5."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.279"
                                            },
                                            "Text": {
                                                "val": "Develop technical requirements for the three Capability Packages and synchronize those requirements with CPCE and the Joint community to ensure requirements supporting the Joint C2 objective Architecture are fully accounted for."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Requirement to be completed in FY18."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA8250"
                                    },
                                    "Title": {
                                        "val": "BA8250  Army Global Cmd & Control Sys (AGCCS) - OPA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.53"
                                        },
                                        "CurrentYear": {
                                            "val": "2.658"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.643"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.643"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.688"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.848"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "14.367"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In accordance with the Army Mission Command for Unified Action (AMCUA) CDP approved December of 2014. The AMCUA CDP provides an overarching structure for future Army Mission Command systems. The AMCUA initiative will meet the requirements to enable planning and share situational awareness within an interdependent enterprise services network comprised of Unified Action Partners (UAP) and sister service components to achieve integrated mission operations. The AMCUA CDP defines the Land Component-unique Mission Command (MC) capabilities that the Army will develop to enable unified action through integration with existing and future Joint and Service command and control applications. MC capability contributions will enable Joint Forces Land Component Command (JFLCC) Commanders to gain and maintain Situational Awareness (SA), make decisions, and exercise authority and direction via a flexible, distributive and seamless system.\n\nThe acquisition strategy for AJaSC2 consists of the development, testing and fielding of Capability Packages implemented over time and synchronized with Command Post Computing Environment infrastructure. AJaSC2 will utilize the \"Information Technology (IT) Box\" construct. As such, evolutionary development of the software will continue as defined Capability Packages to meet emerging requirements that fall within the bounds of the approved IT Box. AJaSC2 strategy will consist of agile application development which will utilize and leverage existing and emerging technologies from Programs of Record and Common Operating Environment (COE) infrastructure. The product development under this R-Form will be accomplished in part under a Project Manager, Mission Command engineering services contract approach which will consist of multiple prime contractors competitively bidding on development efforts."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Office Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "APG, MD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.4"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.315"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.715"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development and Systems Engineering"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.177"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.853"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.030"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Synchronization with COE, CP CE, and Joint C2"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.51"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.279"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.789"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260716_EA5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Validate C-BA"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Package (CP)4"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MDD Program Documentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MDD Delegation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MDD"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "S&T Concept Piloting"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CP5"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS B Program Documentation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MS B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Prototype (CP4&5)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CP6"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "CDR"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}