{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-f6ce2d6fdd72f55e6bde81509aa64b9e4fd9e88c2a3ca324177acd603679c7b4-5",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602702E"
        },
        "ProgramElementTitle": {
            "val": "TACTICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "285.348"
            },
            "CurrentYear": {
                "val": "343.776"
            },
            "BudgetYearOne": {
                "val": "335.466"
            },
            "BudgetYearOneBase": {
                "val": "335.466"
            },
            "BudgetYearTwo": {
                "val": "344.387"
            },
            "BudgetYearThree": {
                "val": "316.016"
            },
            "BudgetYearFour": {
                "val": "300.376"
            },
            "BudgetYearFive": {
                "val": "326.376"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Tactical Technology Program Element is budgeted in the Applied Research Budget Activity because it supports the advancement of concepts and technologies to enhance the next generation of tactical systems.  The Tactical Technology program element funds a number of projects in the areas of Naval Warfare, Advanced Land Systems, Advanced Tactical Technology, Aeronautics Technology and Network Centric Enabling Technology.\n\nThe Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications.\n\nThe Advanced Land Systems Technology project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies.\n\nThe Advanced Tactical Technology project focused on broad technology areas including compact, efficient, frequency-agile, diode-pumped, solid-state lasers for a variety of applications including infrared countermeasures, laser radar, holographic laser sensors, chemical sensing, communications, and high-power laser applications.\n\nThe Aeronautics Technology project will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion and vehicle concepts, sophisticated fabrication methods, and examination of novel materials for aeronautic system applications.\n\nThe Information Analytics Technology project develops applications for analyzing data and information arising from: 1) intelligence networks; 2) open and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems. Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data in tactically-relevant timeframes. Efforts address problems related to conditioning of unstructured data, content analysis, behavioral modeling, pattern-of-life characterization, economic activity analysis, social network analysis, anomaly detection, and visualization. Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon. Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "313.843"
                },
                "CurrentYear": {
                    "val": "343.776"
                },
                "BudgetYearOne": {
                    "val": "363.482"
                },
                "BudgetYearOneBase": {
                    "val": "363.482"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "285.348"
                },
                "CurrentYear": {
                    "val": "343.776"
                },
                "BudgetYearOne": {
                    "val": "335.466"
                },
                "BudgetYearOneBase": {
                    "val": "335.466"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-28.495"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-28.016"
                },
                "BudgetYearOneBase": {
                    "val": "-28.016"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-14.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.230"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-14.265"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-28.016"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-28.016"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects Congressional reduction, reprogrammings and the SBIR\/STTR transfer.  \nFY 2018:  N\/A\nFY 2019:  Decrease reflects rephasing of several Aeronautics Technology and Information Analytics programs."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "TT-03"
                    },
                    "ProjectTitle": {
                        "val": "NAVAL WARFARE TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.132"
                        },
                        "CurrentYear": {
                            "val": "33.544"
                        },
                        "BudgetYearOne": {
                            "val": "47.561"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.561"
                        },
                        "BudgetYearTwo": {
                            "val": "54.501"
                        },
                        "BudgetYearThree": {
                            "val": "46.451"
                        },
                        "BudgetYearFour": {
                            "val": "46.451"
                        },
                        "BudgetYearFive": {
                            "val": "41.451"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Naval Warfare Technology project develops advanced technologies for application to a broad range of naval requirements.  Enabling and novel technologies include concepts for expanding the envelope of operational naval capabilities such as improved situational awareness over large maritime environments, ship self-defense techniques, novel underwater propulsion modalities, vessels for estuary and riverine operations, high speed underwater vessels, improved techniques for underwater object detection and discrimination, long endurance unmanned surface vehicles, and high bandwidth communications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Azimuth Defense Fast Intercept Round Engagement System (MAD-FIRES)"
                                    },
                                    "Description": {
                                        "val": "The Multi-Azimuth Defense Fast Intercept Round Engagement (MAD-FIRES) program seeks to develop a point defense system against today's most stressing threats by developing a highly maneuverable, medium caliber, guided projectile, fire sequencing and control system capable of neutralizing large threat raids of high speed, highly maneuverable targets.  Leveraging recent advancements in gun hardening, miniaturization of guided munition components, and long range sensors, MAD-FIRES will advance fire control technologies, medium caliber gun technologies, and guided projectile technologies enabling the multiple, simultaneous target kinetic engagement mission at greatly reduced costs.  MAD-FIRES seeks to achieve lethality overmatch through accuracy rather than size, thus expanding the role of smaller combat platforms into missions where they have been traditionally outgunned.  MAD-FIRES, sized as a medium caliber system, enhances flexibility for installment as a new system and as an upgrade to existing gun systems with applications to various domain platforms across a multitude of missions to include: ship self-defense, precision air to ground combat, precision ground to ground combat, counter unmanned air vehicles (C-UAV), and counter rocket and artillery and mortar (C-RAM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.132"
                                            },
                                            "Text": {
                                                "val": "-  Updated models and simulations of select designs.\n-  Completed preliminary prototype design.\n-  Matured electronics packaging through design and subsystem validation.\n-  Conducted gun launch and fired solid rocket motors to validate projectile kinematic performance.\n-  Performed initial controlled projectile flight tests to assess projectile maneuver performance.\n-  Demonstrated gun survivability for all up projectile.\n-  Conducted ballistic test vehicle flights."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.544"
                                            },
                                            "Text": {
                                                "val": "-  Finalize designs for major subcomponents.\n-  Conduct controlled test vehicle flights.\n-  Apply lessons learned from flight tests to maturing design.\n-  Validate sensor modeling and simulation through lab testing.\n-  Develop advanced algorithms and software for projectile control and threat intercept."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "35.561"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "35.561"
                                            },
                                            "Text": {
                                                "val": "-  Begin detailed design of system prototype that includes projectile, gun system, and fire control system.\n-  Update projectile design based on previous year flight test results.\n-  Validate sensor modeling and simulation through realistic environment testing.\n-  Verify projectile compatibility with high speed gun feed system.\n-  Verify fire control system ability to acquire and track surrogate threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lobster"
                                    },
                                    "Description": {
                                        "val": "The undersea domain has significant importance to national security and military operations.  Fiber optic cables, military seabed infrastructure, mines, submarines, unmanned vehicles and oil and gas infrastructure are all within this potentially contested environment.  Yet it is a challenging domain in which to operate due to extreme water pressures, restricted communications, ever changing bottom environments, marine fouling and corrosion.  The Lobster program seeks to improve U.S. operations in this domain by enabling underwater robotic systems significantly ahead of the state of the art.  These robotic systems would be able to execute inspection, characterization, repair, manipulation, recharging, data exfiltration, re-tasking and other high value services without the need for continuous human control and high risk surface ship launch and recovery.  Key Lobster technical challenges include scene recognition through visual and acoustic modalities, autonomous behaviors, environmental robustness, vehicle endurance, universality for all unmanned underwater systems, energy storage and interaction with the maritime domain.  The anticipated transition is to the Navy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct exploratory trade studies to establish feasibility of technical approaches. \n-  Initiate studies on integration within unmanned underwater vehicle system architecture.\n-  Conduct a logistics study to determine vehicle support approaches."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Submarine Warfare (ASW) Continuous Trail Unmanned Vessel (ACTUV)"
                                    },
                                    "Description": {
                                        "val": "The Anti-Submarine Warfare  (ASW) Continuous Trail Unmanned Vessel (ACTUV) program had three primary goals: (1) to build and demonstrate an experimental unmanned vessel with beyond state-of-the-art platform performance based on clean sheet design for unmanned operation; (2) demonstrate the technical viability of operating autonomous unmanned craft at theater or global ranges, from forward operating bases, under a sparse remote supervisory control model; and (3) leverage unique ACTUV characteristics to transition a game changing ASW capability to the Navy.  When coupled with innovative sensor technologies, the ACTUV system provided a low cost unmanned system with a fundamentally different operational risk calculus that enables game changing capability to detect and track even the quietest diesel electric submarine threats.  Key technical areas included unmanned naval vessel design methodologies, ship system reliability, high fidelity sensor fusion to provide an accurate world model for autonomous operation, novel application of sensors for ASW tracking, and holistic system integration due to unique optimization opportunities of the ACTUV system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability to successfully integrate new mission payloads, including a Mine Counter Measures (MCM).\n-  Completed vessel at-sea testing, including tactical exercises with fleet units.\n-  Completed testing of new payloads for MCM, ASW, and other missions.\n-  Transitioned custody of prototype vessel to the Office of Naval Research."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Upward Falling Payloads (UFP)"
                                    },
                                    "Description": {
                                        "val": "The Upward Falling Payloads (UFP) program developed forward-deployed unmanned distributed systems to provide non-lethal effects or situational awareness over large maritime environments.  The UFP approach centered on pre-deploying deep-ocean nodes years in advance in forward operating areas which could be commanded from standoff to launch to the surface."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed analysis of long range underwater acoustic communications test data for triggering riser."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "ACTUV"
                                    },
                                    "Title": {
                                        "val": "Office of Naval Research MOA"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.807"
                                        },
                                        "CurrentYear": {
                                            "val": "3.917"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-04"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED LAND SYSTEMS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "61.166"
                        },
                        "CurrentYear": {
                            "val": "92.675"
                        },
                        "BudgetYearOne": {
                            "val": "112.503"
                        },
                        "BudgetYearOneBase": {
                            "val": "112.503"
                        },
                        "BudgetYearTwo": {
                            "val": "121.283"
                        },
                        "BudgetYearThree": {
                            "val": "90.283"
                        },
                        "BudgetYearFour": {
                            "val": "64.283"
                        },
                        "BudgetYearFive": {
                            "val": "72.283"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Land Systems Technology project is developing technologies for enhancing U.S. military effectiveness and survivability in operations ranging from traditional threats to military operations against irregular forces that can employ disruptive or catastrophic capabilities, or disrupt stabilization operations.  The emphasis is on developing affordable technologies that will enhance the military's effectiveness while decreasing the exposure of U.S. or allied forces to enemy fire.  This project will also explore novel design technologies for the manufacture of ground vehicles and new tools for systems assessments of emerging DARPA technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Squad X"
                                    },
                                    "Description": {
                                        "val": "The U.S. military achieves overmatch against its adversaries in certain regimes; however, this level of overmatch is not enjoyed at the squad to individual dismounted warfighter level.  The goal of the Squad X program is to leverage advances in real-time situational awareness and mission command; organic three-dimensional dismount mobility; extended range tracking, targeting, and response; and unmanned mobility and perception in order to create a squad with substantial combat overmatch.  The concept of overmatch at the squad level includes increased human stand-off, a smaller force density, and adaptive sensing to allow for responses at multiple scales.  Squad X will explore advanced wearable force protection, advanced organic squad level direct and indirect trajectory precision weaponry, and non-kinetic precision capabilities.  The end result of the Squad X program is an individual dismount unit outfitted with sensors, weaponry, and supporting technology to achieve unit level overmatch as well as the overall integration of unmanned assets alongside the dismounts to create an advanced, dismounted small unit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.410"
                                            },
                                            "Text": {
                                                "val": "-  Leveraged Squad X testbed and simulation environments to iteratively assess developed technology and architecture schemes.\n-  Leveraged virtual testbed to provide predictions of system performance in multiple operational conditions; complete virtual testbed development.\n-  Initiated planning for system-level experimentation and evaluation in relevant conditions with operational units.\n-  Demonstrated through live experimentation individual technology capabilities for squad precision effects, non-kinetic engagement, enhanced sensor fusion and exploitation, and squad collaborative autonomy in simulated operational environments.\n-  Initiated technology development efforts focusing on human machine interfaces, the squad common operating picture, and the synchronization of kinetic and non-kinetic engagement capabilities.\n-  Initiated squad-system development efforts focusing on automatic systems to increase"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.675"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate and complete development of individual technology capabilities for squad precision effects, non-kinetic engagement, enhanced sensor fusion and exploitation, and squad collaborative autonomy in simulated operational environments.\n-  Continue technology development efforts focusing on human machine interfaces, the squad common operating picture in two dimensions, and the synchronization of kinetic and non-kinetic engagement capabilities.\n-  Continue squad-system development efforts focusing on an automatic, augmenting system to increase squad performance and the integration of previously developed technology to enhance dismounted operations.\n-  Conduct system-level experimentation and evaluation in relevant conditions with operational units."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.503"
                                            },
                                            "Text": {
                                                "val": "-  Complete initial technology development efforts focusing on human machine interfaces, the squad common operating picture in three dimensions, and the synchronization of kinetic and non-kinetic engagement capabilities.\n-  Complete initial squad-system development efforts focusing on an automatic, augmenting system to increase squad performance and the integration of previously developed technology to enhance dismounted operations.\n-  Conduct system-level experimentation and evaluation in relevant conditions with operational units with increased number of humans and unmanned systems in the squad.\n-  Initiate expanded squad-system development efforts with focus on multiple squads and threat capabilities analogous to near-peer\/peer states."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of initial technology efforts and focus on system-level experimentation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Force Protection (MFP)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Mobile Force Protection (MFP) program is to develop and demonstrate an integrated system capable of defeating a raid of self-guided small unmanned aircraft (sUAS) attacking a high value convoy on the move.  By focusing on protecting mobile assets, the program will emphasize low footprint solutions, in terms of size, weight, power (SWaP), and manning, which will benefit other counter UAS missions and result in more affordable systems.  Defending in a variety of operating environments against these sUAS threats and associated concept of operations requires several breakthroughs in affordable technology to sense, decide and act on a compressed timeline while mitigating collateral damage.  The program seeks to develop solutions applicable to the defense of mobile ground and naval forces that can also potentially defeat more conventional threats.  The solution will be scalable and modular such that it can be deployed in multiple defense applications and does not become obsolete with evolving threat capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.156"
                                            },
                                            "Text": {
                                                "val": "-  Defined system level requirements, and conducted trade studies.\n-  Developed interfaces with the program mandated government owned open architecture (GOOA).\n-  Reviewed the government owned open architecture capabilities and discovered technical and programmatic limitations that require a change in architecture.\n-  Developed rapid reaction kinetic kill counter group 1 solution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct affordability and cost analysis.\n-  Complete system conceptual designs.\n-  Integrate early system implementation able to protect a fixed site from a small raid of multiple Radio Controlled UASs via non-kinetic and kinetic neutralization techniques.\n-  Conduct an open air demonstration that will include realistic threats, performance models, signatures, networks, and environmental factors.\n-  Perform modeling, simulation, and lab demonstrations to evaluate advanced algorithms and sub-systems for integration.\n-  Modify the end-to-end system to integrate into representative tactical vehicles for relocation by reducing size, weight and power.\n-  Continue to develop sub-systems that will be able to operate while on the move.\n-  Develop new interfaces and integrate novel algorithms in an open architecture system to reduce manning, false alarm rate, and reaction time.\n-  Update affordability and cost analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct two open air demonstrations that will include advanced airborne threats and complex environmental factors.\n-  Perform advanced modeling and simulation to validate system performance in operational environment.\n-  Modify the end-to-end system to enable operations while on the move by reducing size, weight and power.\n-  Finalize development of sub-systems that will be able to operate while on the move.\n-  Validate graphic user interface that reduces manning false alarm rate, and reaction time.\n-  Final update to affordability and cost analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects completion of detailed design and initiation of end-to-end system development and testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Precision Kinetic Light Strike*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Precision Light Strike Munition (PLSM)\n\nThe Precision Kinetic Light Strike program will seek to develop a small, lightweight, guided kinetic weapon for lightweight maneuver forces.  Current short-range weapons are used against a variety of target sets using different munitions without the benefit of active guidance.  Current long-range weapons are highly effective against a specific target set at range, but are too large or heavy to employ in needed numbers, have a high cost per shot\/procurement cost, and often require burdensome logistics or dedicated specialized systems to use.  The program goal is to improve on the existing, lightweight unguided munition systems by increasing range, accuracy, and lethality, while reducing cost.  These improvements will leverage advances in miniaturization, precision guidance and warheads.  Precision Kinetic Light Strike seeks also to take advantage of commercial technologies whenever possible to provide a low-cost, multi-use, and multi-function precision engagement capability.  The Precision Kinetic Light Strike program could significantly increase the combat power of small units with reduced burden, while significantly reducing cost relative to near-peer and peer adversaries."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Model system performance against multiple target sets.\n-  Complete trade studies, evaluate concepts and performance metrics, and complete simulations for the most promising concept(s).\n-  Initiate development efforts for high-risk and high-impact component technologies.\n-  Initiate system-level design and development efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue development efforts for high-risk and high-impact component technologies.\n-  Update models and simulations of selected designs.\n-  Continue system-level design and complete preliminary prototype design(s).\n-  Continue system-level development efforts with focus on the subsystems with the highest risk."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects transition from initial modeling and studies to specific technology development and prototype design."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PDUE: Autonomous Building Search Persistent Deterrence in Urban Environments*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Urban Operations\n\nThe goal of the PDUE: Autonomous Building Search Persistent Deterrence in Urban Environments program is to generate capabilities which would allow distributed forces to operate effectively in dense urban areas (e.g. megacities).  Military operations in dense urban environments require massive investments in materiel and manpower to clear and hold terrain.  Past urban operations indicate the pressing need to maintain security of cleared areas to prevent the enemy from reoccupying or moving freely through these areas.  This program seeks to allow the ability to gain, hold, and control areas of the dense urban combat zone over extended periods without the physical presence of warfighters.  Just as police units perform presence patrols in neighborhoods to create a pervasive presence that ultimately deters crime within an area, this program seeks to create a system of autonomous ground and air platforms that monitor an area overtly to deter enemy operations in a designated area.  Extending this analogy, police and military follow strict rules of engagement that prescribe an escalation of force appropriate with the level of hostilities and confidence that an individual is engaged in nefarious behavior; this program will demonstrate the capability to escalate in force to allow future operations in the presence of civilians as well as the enemy.  This mission will require the integration and maturation of novel sensors, urban air vehicles with lethal and non-lethal capabilities, and potentially ground platforms capable of navigating and maneuvering through urban environments.  Enabling capabilities would focus on enhanced tactical situational awareness, precise control of destructive and non-destructive effects, cyber- and electronic warfare robustness, and predictive capabilities to analyze avenues of approach and freedom of movement."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify critical operational needs, tactical and environmental issues and key measures of effectiveness.\n-  Conduct trade space analysis regarding sensing range, battery life, and optimal placement as well as aerial vehicle mobility and develop overall system architecture.\n-  Develop adversarial path planning and asset allocation models that select routes to fly and locations to observe based on likely enemy actions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct initial development of sensing and tracking capabilities integrated into an aerial platform.\n-  Conduct initial development of lethal and non-lethal capabilities integrated into an aerial platform.\n-  Perform initial evaluation of aerial vehicle flights coupled with sensor emplacement.\n-  Demonstrate path planning and sensing focused on deterring enemy actions.\n-  Continue development of lethal and non-lethal capabilities integrated into an aerial platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects transition from initial studies and modeling to iterative testing and algorithm enhancement."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subterranean (SubT) Challenge*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Urban Operations\n\nThe DARPA Subterranean (SubT) Challenge will develop novel integrated solutions capable of mapping and navigating complex and dynamic terrains (tunnel systems, urban underground and cave networks); sensors and computation for perception in austere conditions; distributed information sharing in degraded communications environments; and collaborative autonomy enabling extended operations with minimal human interventions. The core objective of the SubT Challenge is to find the solution(s) which best outperforms current approaches for manually and laboriously mapping and searching subterranean environments. Newly developed capabilities will span across four technology focus areas in autonomy, perception, networking, and mobility technologies.  The program will increase the diversity, versatility, and robustness of relevant system technologies, capable of addressing the multi-faceted needs of a wide range of environments.  Innovations will be explored in the context of a public-facing, broadly inclusive DARPA Challenge."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate system and virtual development approaches.\n-  Release rules and structure of the challenge.\n-  Initiate virtual test bed infrastructure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct baseline design, development, integration, of proposed solutions in the sub-domain of tunnel systems.\n-  Conduct circuit competition in the sub-domain of tunnel systems.\n-  Assess technology maturity and predicted technology trends to identify research and development needs and gaps.\n-  Continue development and refinement of the virtual test bed."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects transition from initial development to circuit competitions and virtual test bed refinement."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Operational Fires"
                                    },
                                    "Description": {
                                        "val": "The goal of the Operational Fires (OpFires) program is to develop and demonstrate a novel ground-launched system enabling hypersonic boost glide weapons to penetrate modern enemy air defenses and rapidly and precisely engage critical time sensitive targets.  This program seeks to develop an advanced booster capable of delivering a variety of payloads at a variety of ranges.  Additional considerations include the need for compatible mobile ground launch platforms enabling integration with existing ground forces and infrastructure, and specific system attributes required for rapid deployment and redeployment.  The OpFires program will conduct a series of subsystem tests designed to evaluate component design and system compatibility, and culminate in integrated end-to-end flight tests.  OpFires will leverage and integrate ongoing investments in hypersonic tactical boost glide vehicles (e.g., DARPA's Tactical Boost Glide (TBG) program) to achieve these objectives."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-\tConduct independent assessment of configurations using Government Reference Vehicle (GRV) baseline.\n-\tDevelop conceptual launcher designs compatible with existing ground forces and infrastructure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects transfer to PE 0603286E, Project AIR-01."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Infantry (MI)"
                                    },
                                    "Description": {
                                        "val": "The Mobile Infantry (MI) program will explore the development of a system-based, mixed team of mounted\/dismounted warfighters, and semi-autonomous variants of platforms.  The MI system concept will allow for a combined set of mounted and dismounted operations and for a larger area of operations over more aggressive timelines than standard infantry units.  To improve operational effectiveness of the warfighter teams when dismounted, the semi-autonomous platforms, when unmanned, act as multipliers to the squad, such as extended and mobile fire support platforms and allow the MI mixed teams to perform higher risk exposure and access missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiated technology development efforts for critical perception and autonomous algorithms to enable semi-autonomous systems to act as force multipliers for warfighter team.\n-  Initiated technology development efforts for critical collaborative behavior algorithms to enable semi-autonomous systems to cooperatively execute missions without human interaction.\n-  Initiated technology development efforts for critical technologies to enable effective command and control of manned and unmanned warfighter team."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete technology development efforts.\n-  Evaluate integrated technologies in relevant environments with single vehicle and section-level experiments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Experimental Vehicle (GXV)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Ground Experimental Vehicle (GXV) program was to investigate ground vehicle technologies that enable crew\/vehicle survivability through means other than traditional heavy passive armor solutions.  The focus of the GXV program was technology development across multiple areas to simultaneously improve military ground vehicle survivability and mobility.  Coupled with the development of technologies, the GXV program defined concept vehicles to showcase these developmental technologies.  Technology development areas included increasing vehicle tactical mobility, survivability through agility, and crew augmentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.600"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of parametric models for evaluating military utility of technologies.\n-  Completed studies focusing on the impact of crew augmentation capabilities on the size and cognitive workload of combat vehicle crews.\n-  Completed additional survivability analyses of individual concepts.\n-  Completed GXV technology development efforts focused on increasing mobility and survivability through agility and crew augmentation."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-06"
                    },
                    "ProjectTitle": {
                        "val": "ADVANCED TACTICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.269"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Tactical Technology project focused on broad technology areas including compact, efficient, frequency-agile, diode-pumped, solid-state lasers for a variety of applications including infrared countermeasures, laser radar, holographic laser sensors, chemical sensing, communications, and high-power laser applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser Ultraviolet Sources for Tactical Efficient Raman (LUSTER)"
                                    },
                                    "Description": {
                                        "val": "The Laser Ultraviolet Sources for Tactical Efficient Raman (LUSTER) program developed a compact laser suitable for a wide array of DoD applications, such as sensing the presence of chemical agents.  The program developed a semiconductor laser that emits deep ultraviolet (UV) radiation with high efficiency, high laser purity, and an output power over one watt.  This represents a significant advance over the state of the art, since existing deep UV lasers are bulky, highly inefficient, and expensive.  Semiconductor lasers, on the other hand, benefit from low-costs, established manufacturing processes, compact size, and unique electro-optical performance capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.269"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated bench top deep UV laser system that delivers record performance metrics of > 100 mW output power  and line width <0.1 nm at 2% efficiency. \n-  Demonstrated path to meeting the ultimate goal of > 1 W output power, 10% total system efficiency, line width less than 0.01 nm and size < 2 in^3 within program budget."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-07"
                    },
                    "ProjectTitle": {
                        "val": "AERONAUTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "70.367"
                        },
                        "CurrentYear": {
                            "val": "67.378"
                        },
                        "BudgetYearOne": {
                            "val": "59.119"
                        },
                        "BudgetYearOneBase": {
                            "val": "59.119"
                        },
                        "BudgetYearTwo": {
                            "val": "57.678"
                        },
                        "BudgetYearThree": {
                            "val": "60.328"
                        },
                        "BudgetYearFour": {
                            "val": "62.528"
                        },
                        "BudgetYearFive": {
                            "val": "52.528"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Aeronautics Technology efforts will address high payoff opportunities that dramatically reduce costs associated with advanced aeronautical and aerospace systems and\/or provide revolutionary new system capabilities for satisfying current and projected military mission requirements.  This includes advanced technology studies of revolutionary propulsion, vehicle, and launch concepts, sophisticated fabrication methods, and examination of novel materials and enabling technologies for aeronautic and aerospace system applications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aircrew Labor In-cockpit Automation System (ALIAS)"
                                    },
                                    "Description": {
                                        "val": "The Aircrew Labor In-cockpit Automation System (ALIAS) program will design, develop, and demonstrate a kit enabling affordable, rapid automation of selected aircrew functions across a broad range of aircraft.  ALIAS intends to enable reduction of aircrew workload and\/or the number of on-board aircrew to improve performance.  The program will develop hardware and software to automate select aircrew functions and will employ novel, low impact approaches to interface with existing aircraft monitoring and control systems.  The program will also develop tractable approaches to rapidly capture crew-station specific skills and aircraft unique behaviors.  To accomplish this, ALIAS will leverage recent advances in perception, manipulation, machine learning, reusable software architectures, autonomous systems architecture, and verification and validation.  ALIAS will culminate in a demonstration of the ability to rapidly adapt a single system to multiple aircraft and execute simple missions.  This reliability enhancement capability will enable new operational concepts for reuse of existing air assets and allow a reduction in the number of aircrew required."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.867"
                                            },
                                            "Text": {
                                                "val": "-  Conducted flight demonstration of integrated capabilities.\n-  Performed ground demonstration of portability timeline into other aircraft.\n-  Initiated airworthiness evaluation for integrated flight demonstration on operational aircraft.\n-  Initiated commercial certification process of ALIAS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.378"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate knowledge acquisition timeline and kit installation\/removal on other aircraft.\n-  Refine system human interface.\n-  Conduct integrated system flight demonstration on an operational aircraft to include contingency management.\n-  Continue system refinement and demonstration on multiple aircraft.\n-  Initiate the transition of select knowledge acquisition, perception, and interface technologies to operational aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct integrated system flight demonstration on operationally representative aircraft with reduced crew operations.\n-  Proceed with system installation and integration on a commercial aircraft with enhanced capabilities.\n-  Continue civil certification process of a commercial aircraft to support flight demonstrations that provide input for reduced crew operations.\n-  Refine human machine interface to support multiple operational mission scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects transition to final flight demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gremlins"
                                    },
                                    "Description": {
                                        "val": "The goal of the Gremlins program is to develop platform technologies that enable a new class of distributed warfare.  The Gremlins concept envisions small air-launched unmanned systems that can be responsively dispatched in volley quantity from commodity platforms, fly into contested airspace, conduct a moderate duration mission, and ultimately be recovered.  Key enabling technologies for the concept include smaller developmental payloads that benefit from multiple collaborating host platforms.  The Gremlins program will conduct risk reduction and development of the host platform launch and recovery capability and develop and demonstrate a recoverable Unmanned Air Vehicle (UAV) platform concept.  Enabling platform technologies will include precision relative navigation, advanced computational modeling, variable geometry stores, compact propulsion systems, and high speed digital flight control.  The program will leverage these technologies, perform analytic trade studies, conduct incremental development, and ultimately demonstrate the potential for an integrated air-launched Gremlins unmanned platform."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.500"
                                            },
                                            "Text": {
                                                "val": "-  Conducted conceptual design and system requirements review of demonstration system.\n-  Initiated engineering design of integrated demonstration concepts.\n-  Conducted system and subsystem risk reduction test planning.\n-  Developed objective system concepts and mission capability projections."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct demonstration system Preliminary Design Review.\n-  Initiate detailed design of integrated demonstration system.\n-  Fabricate and ground test demonstration system or subsystem mock-ups.\n-  Perform wind tunnel or preliminary flight test of demonstration system components.\n-  Conduct demonstration system Critical Design Review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.119"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "31.119"
                                            },
                                            "Text": {
                                                "val": "-  Conduct flight validation for launch and recovery capability.\n-  Fabricate and ground test flight-worthy assets.\n-  Conduct flight test demonstrating Gremlins mission objectives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects transition of program from design, fabrication, and ground testing of subsystems and components to flight testing of the integrated system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Aeronautics Technologies"
                                    },
                                    "Description": {
                                        "val": "The Advanced Aeronautics Technologies program will examine and evaluate aeronautical technologies and concepts through applied research.  These may include the feasibility studies of novel or emergent materials, devices and tactics for both fixed and rotary wing air vehicle applications, as well as manufacturing and implementation approaches.  The areas of interest range from propulsion to control techniques to solutions for aeronautic mission requirements.  The result of these studies may lead to the design, development, and improvement of prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed testing of enabling technology components.\n-  Investigated tactically relevant concepts for swarm versus swarm unmanned aerial system (UAS) technologies.\n-  Initiate conceptual system designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Research enabling technology and sub-system feasibility experiments to support novel aeronautic concepts.\n-  Conduct trade studies of candidate technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform studies to support development of innovative prototypes.\n-  Initiate new studies of novel technologies to improve speed and range.\n-  Conduct trade studies of candidate technologies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "OFFensive Swarm-Enabled Tactics (OFFSET)"
                                    },
                                    "Description": {
                                        "val": "The OFFSET program will design, develop, and demonstrate a swarm system architecture to advance the innovation, interaction, and integration of novel swarm tactics.  The program will examine enabling technologies for collaborative autonomy for large teams of unmanned systems, including unmanned ground and air capabilities through the use of both virtual, game-based and physical, live-fly testbeds.  Key research thrusts include the development of advanced swarm tactics-centered autonomy and development of human-swarm teaming interface technologies.  These combined enhancements will facilitate insights and enable employment of these collective systems to address current needs and defeat future threats.  The program will consider technologies supporting U.S. ground and air operations, extensible to other operating environments, requiring organic and\/or tactical swarm capabilities, leveraging low-cost, rapidly deploy-able, autonomous system technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Assess technology maturity and anticipate technology trends to identify research and development needs and gaps.\n-  Identify key technology advances required for swarm tactics concepts of deployment and employment.\n-  Initiate research and development for integration of advanced sensors, mobility, communication, and command & control technologies.\n-  Conduct capability-based field experimentation events that demonstrate swarm tactics for scaled missions of relevance to urban combat operations.\n-  Initiate Swarm Sprints for specific technology thrust areas relevant to swarm tactics and swarm autonomy."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct additional capability-based field experimentation events that demonstrate swarm tactics for scaled missions of relevance to urban combat operations.\n-  Assess technology maturity and anticipate technology trends to identify research and development needs and gaps.\n-  Initiate Swarm Sprints for specific technology thrust areas relevant to human-swarm teaming."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects progress to increasingly difficult and complex scenarios."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "TT-13"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION ANALYTICS TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "114.414"
                        },
                        "CurrentYear": {
                            "val": "150.179"
                        },
                        "BudgetYearOne": {
                            "val": "116.283"
                        },
                        "BudgetYearOneBase": {
                            "val": "116.283"
                        },
                        "BudgetYearTwo": {
                            "val": "110.925"
                        },
                        "BudgetYearThree": {
                            "val": "118.954"
                        },
                        "BudgetYearFour": {
                            "val": "127.114"
                        },
                        "BudgetYearFive": {
                            "val": "160.114"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Information Analytics Technology project develops technology for analyzing data and information arising from: 1) intelligence networks; 2) open and other external sources; 3) sensors and signal\/image processors; and 4) collection platforms and weapon systems.  Technical challenges include the need to process huge volumes of diverse, incomplete, and uncertain data in tactically-relevant timeframes.  Efforts address problems related to causal modeling, automated model construction, media integrity, graph matching, biometrics-based health assessment, domain-specific search, enterprise network defense, social media analysis, and visualization. Operational benefits include deeper understanding of the evolving operational environment tailored to the needs of commanders at every echelon.  Promising technologies are evaluated in the laboratory and demonstrated in the field to facilitate transition."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Causal Exploration of Complex Operational Environments"
                                    },
                                    "Description": {
                                        "val": "The Causal Exploration of Complex Operational Environments program is developing advanced modeling, analysis, simulation, and visualization tools to enable command staffs to rapidly and effectively design, plan and manage missions in complex, hybrid operational environments.  The U.S. military increasingly operates in remote and unstable parts of the world where mission success depends heavily on cooperation with a wide variety of stakeholder groups on civil, economic, and military matters.  These groups typically include host nation government organizations, local civilian groups, and non-governmental organizations, each of which has priorities, sensitivities and concerns that may differ significantly.  Current mission design and planning technologies do not adequately model the range of options or the inherent uncertainties.  This program will develop tools to create causal, computational models that represent the most significant relationships, dynamics, interactions, and uncertainties of the operational environment including political, military, economic, and social factors.  These tools will enable command staffs to design and quantitatively assess potential courses of action in complex operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed initial design for information integration and scenario modeling frameworks to support mission design and planning for complex hybrid environments.\n-  Developed appropriate schemata for knowledge bases of entities typically encountered in an operational environment and their relationships.\n-  Conceptualized initial dynamical systems models for projecting and predicting the interactions between diverse stakeholder groups that may have differing priorities, sensitivities and concerns.\n-  Developed metrics for quantitative assessment of modeling systems, including correctness and completeness of causal structure, ability to predict and explain behaviors, and quality and precision of model outputs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.600"
                                            },
                                            "Text": {
                                                "val": "-  Develop technologies for populating knowledge bases with extracted entities, events and relationships in selected operational environments.\n-  Develop information integration and scenario modeling frameworks and interfaces to support operational design and planning for complex hybrid warfare environments.\n-  Develop interfaces for rapidly visualizing and evaluating models and likely outcomes of alternative courses of action.\n-  Implement, execute, and assess models that support the design of representative hybrid missions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.300"
                                            },
                                            "Text": {
                                                "val": "-  Produce an initial prototype system and collaborate with operational and transition partners to assess models for selected complex operational environments.\n-  Develop and demonstrate techniques to quantify uncertainty in inputs and models.\n-  Expand visualizations and user interfaces to support exploration and refinement of models.\n-  Refine methodologies and measurements to address dynamically changing models and enable component comparisons."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data-Driven Discovery of Models (D3M)"
                                    },
                                    "Description": {
                                        "val": "The Data-Driven Discovery of Models (D3M) program is developing automated model discovery techniques and tools that enable non-expert users to create empirical models of real, complex processes and phenomena.  The ability to understand the battlespace is driven increasingly by analysis of sensor and open source data.  The DoD and the Intelligence Community (IC) are fundamentally limited by a shortage of expert data scientists to construct empirical models that predict behaviors and anticipate contingencies during tactical and strategic planning.  D3M will address this need by creating technologies that automate the construction of complex empirical models.  D3M technologies will include a library of data modeling primitives that are automatically selectable; automated approaches for composition of complex models from modeling primitives; and intuitive mechanisms for human-model interaction that enable curation of models by non-experts.  D3M technical development will focus on the types of empirical modeling problems commonly encountered by the DoD and IC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.816"
                                            },
                                            "Text": {
                                                "val": "-  Created automated approaches for hypothesizing models and components for a given outcome of interest and set of input data and for determining when apparent correlations are spurious.\n-  Evaluated approaches for assessing alternative models by identifying which model(s) are most likely to generalize well in the presence of new data.\n-  Designed and evaluated initial visualization tools to help users understand the data underlying learned models and to make informed selections between alternative models.\n-  Created and evaluated initial implementations of mechanisms for users to interact with models by mixing and matching model components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "26.840"
                                            },
                                            "Text": {
                                                "val": "-  Develop a library of modeling primitives that transform, structure, reduce, infer, and augment data, and a capability to compose modeling primitives into complex models.\n-  Expand the collection of data science and empirical science problems to enable automated learning of analytic approaches.\n-  Initiate development of an end-to-end, integrated system to automatically generate and propose models that are relevant to a given problem.\n-  Address problems of overfitting, spurious correlation, and biased training data by creating curation aids that explain model limitations and data dependencies to non-expert users."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.500"
                                            },
                                            "Text": {
                                                "val": "-  Enhance modeling primitives and incorporate into the integrated toolkits.\n-  Develop and synthesize multi-modal predictive models for unsolved problems, including automated data collection for data augmentation.\n-  Develop question formalization frameworks and specifications for question decomposition to support user-model interaction.\n-  Demonstrate automated composition of complex models in coordination with operators from multiple domains."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is the result of development work ramping down and the focus shifting to demonstrations in coordination with operators from multiple domains."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Battle Management (DBM)"
                                    },
                                    "Description": {
                                        "val": "The Distributed Battle Management (DBM) program will develop mission-driven architectures, protocols, and algorithms for battle management (BM) in contested environments.  The military is turning to networked weapons and sensors on-board a heterogeneous mix of multi-purpose manned and unmanned systems.  In contested environments, it is a challenge for BM networks to communicate with subordinate platforms due to extensive adversarial cyber and electronic warfare operations, anti-satellite attacks, and the need for emissions control in the face of a formidable integrated air defense system.  The Distributed Battle Management program will seek to develop a distributed command architecture with decentralized control of mission-focused asset teams.  The architecture will enable rapid reaction to ephemeral engagement opportunities and maintain a reliable BM structure, despite limited communications and platform attrition in continuously evolving threat environments.  The program will incorporate highly automated decision making capability while maintaining vital human-on-the-loop operator approval."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.726"
                                            },
                                            "Text": {
                                                "val": "-  Updated DBM algorithms and architecture based on experimentation to support complex contested environments.\n-  Continued development of the DBM human-machine interface for battle management platforms and tactical platforms.\n-  Demonstrated integrated DBM capabilities in live, virtual, and constructive simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.250"
                                            },
                                            "Text": {
                                                "val": "-  Conduct software flexibility tests to demonstrate the ability to insert software upgrades without disrupting the BM structure.\n-  Conduct a virtual, constructive-based simulation of the air portion of an Air-to-Ground battle using DBM software components.\n-  Use DBM components in a simulation event for the System of Systems Integration Technology and Experimentation (SoSite) program (budgeted in PE 0603766E, Project NET-01).\n-  Conduct a live-fly experiment with a virtual, constructive-based simulation of the air portion of an Air-to-Ground battle using DBM software components.\n-  Use DBM components in a live-fly event for the SoSite program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Use DBM components in a live-fly experiment in support of transition to the services (Navy or Air Force).\n-  Expand the number of flight systems modeled in DBM system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects a reduction in algorithm development, implementation, and integration emphasis, with focus shifting to experiments and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Media Forensics (MediFor)"
                                    },
                                    "Description": {
                                        "val": "The Media Forensics (MediFor) program is creating technologies for analyzing media content to determine trustworthiness for military and intelligence purposes.  Current approaches to media forensics are labor intensive, requiring analysts and investigators to undertake painstaking analyses to establish context and provenance.  The program will develop, integrate, and extend image and video analytics to provide forensic information that can be used by analysts and automated systems to quickly determine the integrity of open source and captured images and video.  Technologies will transition to operational commands and the intelligence community."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.079"
                                            },
                                            "Text": {
                                                "val": "-  Developed techniques for media fingerprinting and for searching large repositories for content produced by the same device.\n-  Developed cross-media representations of semantic content in image and video sources and techniques to indicate where the sources reinforce or contradict each other.\n-  Developed approaches for detecting and localizing commonly occurring media manipulations.\n-  Created new evaluation metrics and tools for journaling, visualizing and distributing large-scale research data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.879"
                                            },
                                            "Text": {
                                                "val": "-  Extend approaches to counter evolving media-editing technologies to detect indicators obscured by noise and compression, and to address synthetic media created using generative adversarial techniques.\n-  Develop methods to fuse knowledge from multiple forensic engines to determine whether a manipulation renders media unsuitable for an intended application.\n-  Develop a large-scale, integrated integrity-assessment platform with graphical user interfaces for operator interaction.\n-  Evaluate the integrity-assessment platform on realistic research data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop quantitative measures of integrity relevant to diverse needs of government users and specific missions.\n-  Enhance the effectiveness of algorithms that must operate against media manipulated at large scales.\n-  Develop association methods to track and assess related media assets that are subject to coordinated manipulation by adversaries.\n-  Evaluate the effectiveness of the integrated integrity-assessment platform on relevant operational data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is the result of development work ramping down and the focus shifting to testing media integrity-assessment techniques to establish utility for transition partners."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling Adversarial Activity (MAA)"
                                    },
                                    "Description": {
                                        "val": "The Modeling Adversarial Activity (MAA) program is developing technologies for generating high-confidence indications and warnings for weapons of mass terror (WMT) activities.  WMT pathways consist of networks or links among individuals, groups, organizations, and other entities that act to promote or enable the development, procurement, possession, transportation, or proliferation of WMTs and related capabilities.  Monitoring and controlling WMT pathways is essential to denying access to WMT technology, knowledge, materials, expertise, and weapons.  MAA will create graph models reflecting prototypical WMT pathways, develop methods for creating merged activity graphs by aligning entities across multiple intelligence modalities, develop algorithms to match empirical activity graphs with pathway models, and create synthetic data sets at scale to support development and testing of WMT activity detection techniques.  MAA research will be coordinated with the Defense Threat Reduction Agency (DTRA) and the Department of Homeland Security (DHS)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.000"
                                            },
                                            "Text": {
                                                "val": "-  Conceptualized a graph-theoretic framework for WMT activity detection.\n-  Identified approaches for generating synthetic data with realism adequate for testing WMT activity detection techniques.\n-  Established contacts and working relationships with stakeholders at DTRA and DHS."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.400"
                                            },
                                            "Text": {
                                                "val": "-  Formulate graph models for pathway activity sequences designed by WMT subject matter experts.\n-  Design computationally feasible approaches for aligning entities across multiple intelligence modalities and for approximate graph matching.\n-  Initiate implementation of graph models and graph matching algorithms.\n-  Collaborate with DTRA and DHS on methods for generating synthetic activity data with realism adequate for testing WMT pathway recognition techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.500"
                                            },
                                            "Text": {
                                                "val": "-  Implement graph alignment techniques, and assess strengths and weaknesses of alternative approaches on synthetic data.\n-  Implement techniques for approximate matching of activity graphs, and demonstrate pathway detection on synthetic data.\n-  Create an initial prototype pathway recognizer, and demonstrate the capability to detect modeled WMT activity sequences in synthetic data.\n-  Collaborate with DTRA and DHS to implement techniques in their environments and to optimize techniques for efficient and timely execution on their computational infrastructure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects continued development of techniques and software for WMT pathway discovery and additional work to integrate these into a prototype pathway recognition system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Warfighter Analytics using Smartphones for Health (WASH)"
                                    },
                                    "Description": {
                                        "val": "The Warfighter Analytics using Smartphones for Health (WASH) program is developing analytic techniques for continuous and real-time assessment of warfighter physiological health and cognitive state based on the multiple sensor data streams generated by modern smartphones.  Recent research in the area of smartphone biometrics has shown the feasibility of measuring user physiological and behavioral parameters for purposes of user authentication.  WASH will extend these smartphone biometrics to reliably measure additional user physiological and behavioral parameters relevant to health assessment and the diagnosis of disease.  If successful, WASH will produce a mobile application that continuously and reliably assesses warfighter health and combat\/mission readiness.  WASH is coordinated with the Naval Health Research Center."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop a privacy framework and privacy processes appropriate for smartphone-based physiological health and cognitive state assessment.\n-  Develop data analytics for extracting context from smartphone sensor data. \n-  Identify promising digital biomarkers for physiological conditions and cognitive state."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.983"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.983"
                                            },
                                            "Text": {
                                                "val": "-  Develop secure, privacy-preserving, cloud-based data ingest and storage technologies for collecting, organizing, and associating user smartphone, physiological health, and behavioral data.\n-  Develop a mobile application to capture user smartphone data passively and securely, and to compute digital biomarkers.\n-  Perform assessments of sensitivity and specificity of smartphone-based digital biomarkers for detection and diagnosis of physiological disease and assessment of cognitive state."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects continued work to develop techniques to capture user smartphone data and to assess user physiological health and cognitive state and additional work to assess performance of techniques."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Memex"
                                    },
                                    "Description": {
                                        "val": "The Memex program is developing search technologies to revolutionize the discovery, organization, and presentation of domain-specific content.  Current search technologies have limitations in search query format, retrieved content organization, and infrastructure support.  These current technologies impose an iterative search process that is time-consuming and inefficient, typically producing only a fraction of the available information.  Memex is creating a new domain-specific search paradigm to discover relevant content and organize it in ways that are more immediately useful to specific missions and tasks.  In addition, Memex domain-specific search engines will extend the reach of current search capabilities to the deep web and non-traditional content.  Memex technologies will enable the military, government, and commercial enterprises to find and organize mission-critical information on the Internet and in large intelligence repositories.  Anticipated mission areas include counter-terrorism, counter-drug, anti-money-laundering, and anti-human-trafficking, with transition partners from DoD and other U.S. Government activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.608"
                                            },
                                            "Text": {
                                                "val": "-  Developed and evaluated advanced domain discovery techniques and methods across the data pipeline (domain specification, crawlers, extractors, indexing, search, analytics, and visualization) that are domain agnostic, highly adaptable, and rapidly deployed.\n-  Developed integrated applications demonstrating reduced time and increased flexibility of standing up new domain specific search capabilities with highly effective user experience.\n-  Developed and demonstrated domain-specific software capabilities for countering human trafficking and other missions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.460"
                                            },
                                            "Text": {
                                                "val": "-  Develop optimized components and integrated applications that address new domain specific search requirements arising from the national security and intelligence communities.\n-  Transition software components and integrated systems for multiple national security and intelligence missions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Defense"
                                    },
                                    "Description": {
                                        "val": "The Network Defense program is developing technologies to detect network attacks. U.S. computer networks are continually under attack, and these attacks are typically handled by individual organizations as they occur.  Analyzing network summary data across a wide array of networks will make it possible to identify trends and patterns visible only when the data is viewed as a whole.  Network Defense is developing novel algorithms and analysis tools that enable a big picture approach for identifying illicit behavior in networks.  This analysis and subsequent feedback to system administrators, security engineers, and decision makers will enhance information security in both the government and commercial sectors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.625"
                                            },
                                            "Text": {
                                                "val": "-  Optimized algorithms that detect anomalous behaviors and coordinated adversary activities, and tested these through exercises, summary data, and on-site evaluations.\n-  Performed comprehensive test and evaluation of the multiple detection algorithms developed to produce quantitative understanding of probabilities of detection and false alarm and receiver operating characteristic curves for important classes of attacks.\n-  Transitioned technologies for detecting attacks on enterprise networks to U.S. government agencies, defense industrial base organizations, and other U.S. commercial companies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.750"
                                            },
                                            "Text": {
                                                "val": "-  Develop distributed versions of the most effective algorithms to permit deployment on a decentralized global infrastructure.\n-  Extend comprehensive test and evaluation of the most promising techniques to adversarial use cases.\n-  Transition resulting capabilities to U.S. government agencies, defense industrial base organizations, and other U.S. commercial companies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantitative Crisis Response (QCR)"
                                    },
                                    "Description": {
                                        "val": "The Quantitative Crisis Response (QCR) program developed digital tools that help operational partners better understand how information is being used by adversaries, and predict and assess the effects of adversary information campaigns and of countermeasures quantitatively, in real time, and at scale.  The tools enable operators to assess population-scale radicalization and other potential effects of the information being traded through social media and other communications channels.  QCR is coordinated with multiple national security agencies, Combatant Commands, and the Department of State."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Created and evaluated semi-automated methods for web content analysis and visualization.\n-  Integrated new algorithms, analytic models, processes and methods into a prototype system.\n-  Supported system evaluations by operational partners and established a transition plan with Combatant Commands."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "XDATA"
                                    },
                                    "Description": {
                                        "val": "The XDATA program developed computational techniques and software tools for analyzing large volumes of data, both semi-structured (e.g., tabular, relational, categorical, metadata, spreadsheets) and unstructured (e.g., text documents, message traffic).  Central challenges addressed included; a) development of scalable algorithms for processing imperfect data in distributed data stores; and b) creation of effective human-computer interaction tools for facilitating rapidly customizable visual reasoning for diverse missions.  The program developed open source software toolkits that enable flexible software development to support users processing large volumes of data in timelines commensurate with mission workflows of targeted defense applications.  An XDATA framework supports minimization of design-to-deployment time of new analytic and visualization technologies on diverse distributed computing platforms, and accommodates changing problem spaces and collaborative environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.560"
                                            },
                                            "Text": {
                                                "val": "-  Transitioned end-to-end systems, components, platforms and operating environments to transition partners."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}