{
    "id": "2019-TheJointStaff-PB-0400-MJBOOK-0-0-ffce3191c7eefb8562d2a34cc99fec96721f2a4642336d58234fb945beaef3c0-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604826J"
        },
        "ProgramElementTitle": {
            "val": "Joint C5 Capability Development, Integration, and Interoperability Assessments"
        },
        "R1LineNumber": {
            "val": "103"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "21.700"
            },
            "PriorYear": {
                "val": "23.630"
            },
            "CurrentYear": {
                "val": "23.638"
            },
            "BudgetYearOne": {
                "val": "22.435"
            },
            "BudgetYearOneBase": {
                "val": "22.435"
            },
            "BudgetYearTwo": {
                "val": "20.095"
            },
            "BudgetYearThree": {
                "val": "20.108"
            },
            "BudgetYearFour": {
                "val": "20.094"
            },
            "BudgetYearFive": {
                "val": "20.094"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Lead command, control, communications, computers, and cyber (C5) assessments, analyses, capability development, and joint fires command and control (C2) interoperability efforts required to achieve an effective, integrated, and interoperable joint force.  Efforts include C5 requirements determination, C5 architectures development and integration, C5 data standardization, joint fires C2 interoperability, and C5 integration and interoperability assessments."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.642"
                },
                "CurrentYear": {
                    "val": "23.638"
                },
                "BudgetYearOne": {
                    "val": "23.148"
                },
                "BudgetYearOneBase": {
                    "val": "23.148"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.630"
                },
                "CurrentYear": {
                    "val": "23.638"
                },
                "BudgetYearOne": {
                    "val": "22.435"
                },
                "BudgetYearOneBase": {
                    "val": "22.435"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.012"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.713"
                },
                "BudgetYearOneBase": {
                    "val": "-0.713"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.012"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Adjustment (inflation rate change)"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.713"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.713"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in funding for FY 2017 due to undistributed Congressional mark to FFRDC.\n\nDecrease in funding for FY 2019 thru FY 2023 is a result of (1) mandated 25% Major Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA and (2) changes in economic assumptions for non-fuel and non-pay inflation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "C5 Assessments and Analyses"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "10.196"
                        },
                        "PriorYear": {
                            "val": "12.886"
                        },
                        "CurrentYear": {
                            "val": "12.898"
                        },
                        "BudgetYearOne": {
                            "val": "11.648"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.648"
                        },
                        "BudgetYearTwo": {
                            "val": "9.308"
                        },
                        "BudgetYearThree": {
                            "val": "9.321"
                        },
                        "BudgetYearFour": {
                            "val": "9.307"
                        },
                        "BudgetYearFive": {
                            "val": "9.307"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Conduct analysis and assessment activities to inform and enhance joint warfighter capabilities in support of national security requirements. Provide timely, facts-based findings and recommendations to DoD decision-making processes that validate operational requirements and apply funding to field effective, interoperable capabilities. Conduct interoperability assessments and analyses that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), and systems in response to operational issues and shortfalls.  Conduct integration assessment efforts focused on emerging capabilities in wireless devices and security, tactical command and control and networking, satellite communications, advanced secure digital datalinks, and coalition data exchanges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C5 Assessments and Analyses"
                                    },
                                    "Description": {
                                        "val": "Support the Chairman’s statutory requirement to advise the Secretary of Defense “on development of joint command, control, communications and cyber capability, including integration and interoperability of such capability through requirements, integrated architectures, data standards and assessments.”  Also supports the Chairman's focus area of improving joint warfighting capability and the SECDEF's line of effort to strengthen alliances and attract new partners.  Interoperability is assessed and integrated solutions are developed to improve C5 system performance by providing recommendations based on operational architectures and evolving standards and data products.  Combatant Commands, Services, agencies and coalition partners at the joint force headquarters level are provided a laboratory, exercise and assessment venue for the warfighter and capability developer to identify and solve interoperability, integration, and cyber issues with current and near-term joint and coalition capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.886"
                                            },
                                            "Text": {
                                                "val": "Conduct interoperability assessments and analysis in both field and persistent environments that evaluate capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), systems in response to operational issues and shortfalls.  FY 2017 focus areas include: Command and Control, Counter UAS, Joint Fires, Mission Partner Environment, and operations in Cyberspace Capability Development. This includes the impact of technology advances in wireless devices, modem technology, RF communications, and small secure digital capabilities on warfighter command and control capabilities to match emerging requirements with near-term technology solutions. \n\nProjects include:  \n(1)\tBold Quest 2017 Technical Demonstration – Design, build, accreditation, assessment, and management of the exercise networks for US and coalition partners. \n(2)\tCounter-UAS (C-UAS) – Data collection and analysis during BLACK DART or similar events. \n(3)\tSmall Unit Joint C2 Capabilities – Quantitative\/qualitative data collection and analysis of DARPA’s Squad-X project. \n(4)\tJoint Expeditionary Integration C5ISR Integration Kit Assessments – Integrate and assess emerging technologies, respond to issues reported from operating forces, and support the transition of SOF “best practices” to conventional forces and acquisition programs.  \n(5)\t4G LTE Security as a Commercial Solutions for Classified (CSfC) Security Layer 4G LTE CSfC Pilot – In partnership with the NSA, integrate and demonstrate the viability of using the native security of LTE as a security layer for the transmission of classified information.\n(6)\tAutomated NATO Database Interface (ANDI) Interoperability Assessment – Continue to assess the automated exchange of targeting data between the US Joint Targeting Toolbox (JTT) and the NATO Joint Targeting System (JTS) which reduces manpower requirements and data entry errors by automating the transfer of targeting data.\n(7)\tHAMMERHEAD JCTD (P) and Mounted Long-Term Evolution (LTE) Node Technical Integration Assessment (MOLTEN Dragon) – Conduct a technical assessment of multi-purpose airborne pods supporting tactical and SATCOM communications, tactical datalinks, and intelligence sensors.\n(8)\tClassified Reconfigurable Operational Wireless Network (CROWN) Capability Integration – Develop and assess a deployable secure “Campus” wireless architecture based on layered software encryption in partnership with the National Security Agency (NSA).\n(9)\tProximity Lock Technology (PLT) Integration Assessment – Assess a proximity and heart beat dependent data-at-rest automatic locking capability for classified tactical mobile devices, partnership with NSA.\n(10)\tVirtual Enterprise Mobile Security (VEMS) Integrated Solutions – Assess the usability\/functionality of the Hypori Virtual Mobile Infrastructure (VMI) as a way to enable classified tactical communications on unclassified end-user devices, partnership with NSA.\n(11)\tCoalition Interoperability Assurance  and Validation (CIAV) – Resolute Support Mission – Afghanistan (RSMA) Assessments – Support ongoing overseas operations through continued interoperability assessments of coalition systems supporting coalition mission threads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.898"
                                            },
                                            "Text": {
                                                "val": "Conduct interoperability assessments and analysis in both field and persistent environments that evaluate capability and interoperability of fielded and emerging C5 systems in response to operational issues and shortfalls.  FY 2018 focus areas include: capability development in command and control, mission partner environment, joint fires support, and operations in cyberspace, and joint test and evaluation of digitally aided close air support. C5 assessments and analyses activities are conducted through (1) persistent, reconfigurable C5 laboratories that connect joint and coalition system of systems operational environments to other live, virtual, and constructive environments across national and multi-national operational, research, and test networks leveraging operational venues\/exercises; and (2) a deployable assessment capability (including contested joint environments) that allows range instrumentation and the collection and analysis of quantitative data in replicated operational environments. Projects include:\n\nCoalition interoperability assurance validation (CIAV) assessments – conduct interoperability assessments of coalition systems supporting coalition mission threads.  CIAV assessments validate complete and timely exchange of critical information and improve overall interoperability allowing coalition forces to fight more effectively and efficiently.\n\nAdvanced tactical wireless integration capability – perform technical integration and assessments of advanced communication systems hardware, software, and security solutions to identify capabilities that address warfighter requirements.\n\nJoint fires support joint mission thread interoperability assessment – assess joint and coalition fire support command and control systems digital (machine-to-machine) interoperability and provide findings and observations.\n\nAdvanced wide area network security capability integration – demonstrate an integrated wide area network security solution using NSA approved commercial solution for classified virtual private networks between two or more sites.\n\nCyber Guard \/ Cyber Flag 2018 assessment and technical support – provide C2 systems, a common operational picture, and conduct assessment of cyber effects on these systems integrated into the Navy defensive cyber operation DoD Information Network (DoDIN) Simulation, Training, and Exercise Platform (STEP) environment.\n\nBold Quest 2018 technical demonstration – design, build, accreditation, assessment and management of the exercise networks for U.S. and coalition partners.\n\nCounter-UAS (C-UAS) – data collection and analysis during RTD&E test events as well as in support of urgent operational needs in active operational theaters.\n\nC2 systems support to DoD Enterprise Cyber Range environment – provide a persistent and distributed cyber environment for cyber mission forces development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.648"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.648"
                                            },
                                            "Text": {
                                                "val": "Conduct analysis, assessment, and integration activities to inform and enhance Joint warfighter capabilities in support of national security requirements. Provide timely, facts-based findings and recommendations for action through formal DoD decision-making processes used to validate operational requirements and apply funding to field integrated, interoperable capabilities. Conduct interoperability assessments, analyses, and integration that evaluate and enhance capability and interoperability of fielded and emerging command, control, communications, computers, and cyber (C5), and systems in response to operational needs and issues.  Conduct integration and integration assessment efforts focused on emerging capabilities in wireless devices and security, tactical command and control and networking, satellite communications, advanced secure digital datalinks, and coalition data exchanges. Employ a deployable capability supporting the collection and analysis of decision quality data for command and control operations from the operational to lowest tactical echelons of command.  Joint analysis supports capability development, acquisition, and systems employment decisions based on quantifiable performance in both actual and replicated operational environments. Projects include:\n\nCoalition Interoperability and Assurance Validation (CIAV) – CIAV assessments of US and coalition systems support in-theater operations by ensuring C5 system adequacy before their operational employment in the Afghan and Iraq areas of operations.  CIAV is also increasing efforts in the Pacific.  CIAV assessments validate complete and timely exchange of critical information and improve interoperability, enabling coalition forces to fight more effectively and efficiently.\n\nClassified reconfigurable operational wireless network – the integration, employment, and assessment of a single, rapidly deployed and configurable wireless network that carries multiple classifications. Network is suitable for tactical field settings, temporary installations, and fixed headquarters thereby addressing tactical, operational, and strategic requirements. Employs National Security Agency approved communications security and provides secure communications faster with less hardware and overhead.\n \nJoint fires support joint mission thread interoperability assessment – assess joint and coalition fire support command and control systems digital (machine-to-machine) interoperability and provide findings and observations.\n\nAdvanced tactical cellular (4G\/LTE) integration – multiple efforts to increase the availability of 4G\/LTE to tactical forces.  Addresses communications security, smart-phone battlefield apps, and 4G\/LTE survivability in contested and austere environments. \n\nBold Quest (BQ) 2019 coalition interoperability demonstrations – support the design, plan, and execution of the BQ events which address close air support, counter UAS, IFF testing, and cyber effects on operations for U.S. forces and coalition partners.  Support includes accredited exercise networks, associated C2 systems, and data collection and analysis capabilities.\n \nJoint expeditionary integration capabilities – integrate, refine, and accelerate the migration of Special Operating Forces (SOF) battle-proven capabilities to general purpose forces in accordance with governing instructions. Rapid migration of SOF “best practices” provides greater capability to general purpose forces and enhances interoperability with SOF and coalition partners. The capabilities include integrated secure radio networks, tactical data links, tactical cellular, enroute satellite communications, enhanced situational awareness, fratricide prevention, and a more efficient kill-chain. \n\nBattlefield intelligence trusted network environment – the integration and assessment of an enterprise environment featuring a single, aggregated intelligence sharing capability for multiple partner nations that does not compromise respective national networks or domains.\n\nJoint Planning Services (JPS) – operational assessment of the JPS pilot will determine if the combatant commanders and Service operational planning requirements would be met by JPS.  JPS is intended to enable planners to develop and maintain complex strategic\/contingency plans in a dispersed, collaborative, cross-functional joint, interagency, intergovernmental, multinational environment.  JPS should also provide rapid access to authoritative, geospatially-enabled planning data and tools and efficient and expeditious information dissemination.\n\nMode 5 analysis – Plan and execute analysis events at various live venues (such as RED FLAG or BOLD QUEST) in support of certification of Service Mode 5 IFF capabilities.\n\nUSCENTCOM counter-UAS (C-UAS) support – Conduct analysis activities both at CONUS C-UAS events and in active operational theaters to evaluate effectiveness of rapidly fielded C-UAS systems. Results will inform follow-on fielding and rapid procurement decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding for FY 2019 is a result of mandated 25% Major Headquarters Activities (MHA) reductions prescribed by the 2016 NDAA and revised economic assumptions (inflation rate change)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        },
                        "PerformanceMetrics": {
                            "val": "1. Conduct a minimum of 15 interoperability assessments designed to identify joint and coalition interoperability issues and recommend solutions to program managers, Combatant Commands, Services, and agencies.\n\n2. Conduct a minimum of one broad-spectrum Counter-UAS (C-UAS) analysis event; providing data collection, analysis, and recommendations that directly address identified C-UAS capability gaps and interoperability shortfalls for partners including: Joint, Services, intergovernmental, and coalition stakeholders.\n\n3. Provide C2 systems and persistent command, control, communications, and computers (C4) environment supporting at least two Combatant Command exercises to satisfy Combatant Command training objectives, including the cyber threat to mission systems.\n\n4. Support up to four Squad-X experiment events, providing objective analysis on performance and interoperability that directly informs the acquisition of improved C2 capabilities for U.S. small units. \n\n5. Support a minimum of 30 coalition interoperability assurance and validation events and provide a minimum of 100 observations\/findings to resolve end-to-end mission based interoperability issues, validate tactics, techniques, and procedures, and support NATO future mission networking (FMN) and U.S. mission partner environment (MPE) plans.\n\n6. Provide analyses for at least six field assessments\/demonstrations in the areas of joint fires, C2, coalition intelligence, surveillance, and reconnaissance (CISR), digitally aided close air support (DACAS), FMN and MPE.  Analyses results will inform continued development of evaluated capabilities, including acquisition\/fielding decisions and tactics, techniques and procedures.  \n\n7. Provide C2 Systems and persistent C4 environment supporting at least four individual or team training events per year to meet cyber training and certification objectives.\n\n8. Provide C2 Systems and Persistent C4 Environment to support at least four cyber assessments promoting cyber capability development.\n\n9. Integrate at least two new capabilities per year supporting Combatant Command, Service, agency, and commercial solutions for classified and mobile computing program requirements."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Management and Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, Suffolk, Eglin"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.196"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "12.886"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.898"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.648"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.648"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint C5I"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "C5 Assessments and Analyses"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "C5 Capability Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.079"
                        },
                        "PriorYear": {
                            "val": "6.594"
                        },
                        "CurrentYear": {
                            "val": "6.590"
                        },
                        "BudgetYearOne": {
                            "val": "5.787"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.787"
                        },
                        "BudgetYearTwo": {
                            "val": "5.787"
                        },
                        "BudgetYearThree": {
                            "val": "5.787"
                        },
                        "BudgetYearFour": {
                            "val": "5.787"
                        },
                        "BudgetYearFive": {
                            "val": "5.787"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "C5 capability development functions as the DoD requirements lead for the joint command and control (C2) family of programs and requirements lead for mission partner environment (MPE); developer of joint C4 architectures, joint common systems functions, joint mission threads, lead in analysis and review of architectures and standards in joint capability development systems to ensure integration and interoperability; enable warfighter access to authoritative data sources and improve data interoperability by establishing common C2 data and service standards."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C5 Capability Development"
                                    },
                                    "Description": {
                                        "val": "Lead C2 capability development and integration in order to achieve an interdependent joint force.  Supports Chairman's focus of improving joint warfighter capability.  This will be accomplished through four focus areas: capability development, C4 architectures, data and services, and interoperability and integration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.594"
                                            },
                                            "Text": {
                                                "val": "(1) Capability Development – Continue to serve as direct liaison between operational users and materiel developers throughout the capability lifecycle, to include prioritization of requirement and development efforts.  Manage the Net-Enabled Requirements Identification Database (NRID) and the Decision Support Tool (DST) to provide accessibility and visibility into C2 capability needs and potential solutions.  Develop and seek JROC approval of FY 2019\/2020 Joint C2 Operational Requirements based upon top-down Integrated Priorities List and bottom-up warfighter requirements.  Host three Joint C2 Integration Workshops to synchronize Joint C2 materiel development efforts.  Coordinate with the warfighter community, to include multinational and other mission partners, to identify common requirements and priorities, as well as materiel and non-materiel solutions to address similar\/common needs and capability gaps.  Produce\/coordinate an Information System-Capability Development Document (IS-CDD) for an Enterprise Common Operational Picture capability for JROC approval.  Further, produce Capability Definition Packages and subordinate Capability Packages for Targeting and Geospatial Intelligence, Maritime Tactical C2, Unified Action Plan COP, Operational Design and Joint Planning Process, Joint Friendly Force Tracking, and Enterprise Force Structure.  Coordinate assessment of newly developed Command and Control of the Operational Environment capabilities. Facilitate collaboration between GCCS-J and AOC WS program offices to ensure synchronized release of capabilities with effective data exchanges.  Facilitate warfighter prioritization of GCCS-J Global COP requirements for incremental capability development and release.\n\n(2) C4 Architectures - Improve WMA Architecture Portal usability and develop a basic set of architecture analysis and visualization tools and services. Continue to improve the quality of and expand the amount of the C4\/Cyber portfolio architecture information available on the WMA Architecture Portal.  Establish and populate Joint Staff Protection and Force Application Functional Capability Board (FCB) portfolio architecture content on the WMA Architecture Portal to facilitate architecture information sharing, integration, analysis, and re-use. Validate JIE architectures, functional requirements documents and engineering design specifications to increase compliance with JIE architecture standards and metrics across DOD. Assist in the analysis of FYDP 2019 - 2023 Capability Gap Assessment (CGA), specifically the FCB IPL Review and the CGA gaps. Revise the Joint C2 Reference Architecture in conjunction with DISA Services Development Directorate. Align Joint Mission Thread guidance\/governance\/production priorities to Chairman’s priorities. Provide analytical support to the Chairman’s Joint Military Net Assessment and the Chairman’s Net Assessment. Support coalition partner efforts to define and develop mission threads.\n\n(3) Data and Services - Develop, promote and integrate data and services requirements, standards, technical specifications, and policy to support improved warfighter interoperability and information sharing with joint, mission partners and other U.S. Government departments and agencies. Collaborate with Allied Command Transformation (NATO) to develop the NATO Core Data Framework as a means to achieve coalition interoperability. Align and standardize emerging Tactical Data Link and Messaging standards with enterprise information sharing.  Develop and promulgate a major release of the National Information Exchange Data Model, Military Operations domain. Refine and mature enterprise IT service lifecycle management processes and procedures with the DoD CIO and Services.\n\n(4) Interoperability and Integration – Support emergent cyber priorities throughout all Department focus areas by performing analysis and assessments and support the development of the Persistent Training Environment (PTE) to emulate the C4\/cyberspace domain. Support C4\/cyber system developers with operational\/developmental Cyber Security testing and assessment, including integration of data collection and analysis instrumentation. Continue to lead the implementation of improved Combatant Command (CCMD) unity of effort and speed of command with mission partners through enhanced information sharing with partner nations by leading the continuing implementation of the JROC approved Future Mission Network 90 Day Study recommendations (known as Mission Partner Environment (MPE)). Facilitate use of force development events as operational environment opportunities to further explore and validate the potential for MPE concepts (e.g. virtualization of CENTRIX networks in exercises STEADFAST COBALT and JUDICIOUS RESPONSE). Support the deployment of a federated enduring MPE capability within the CCMDs. Lead the development and maturation of DoD MPE Joining Instructions providing the joint force a baseline technical document for establishing federated mission networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.590"
                                            },
                                            "Text": {
                                                "val": "Capability Development – oversee requirements management for the Department’s joint command and control (C2) family of programs. \n\nUtilize the net-enabled requirements identification database and the decision support tool to provide accessibility and visibility into C2 capability needs and potential solutions for C2 stakeholders. Analyze\/coordinate the Department’s 2020-2024 C2 integrated priority lists and capability gap assessment for JROC approval.  Develop\/coordinate annual joint C2 FY 2019 and FY 2020 operational priorities for JROC approval, and host four Joint C2 integration workshops to better integrate DoD strategic guidance, validated requirements, operational priorities, and materiel development. Align capability requirements and JCIDS documentation to enable material solution development, and ensure warfighter equities are represented through Joint C2 governance and management forums and formal processes. Chair the newly established Global Command and Control System-Joint Enterprise (GCCS-JE) Requirements Governance Board on behalf of the JROC to oversee the execution of requirements and management of capability development. Develop capability definition packages and capability packages to support on-going enterprise Common Operational Picture (COP) GCCS-JE development, command and control information exchange environment (C2IE), cyber C2, and joint planning services capabilities, and develop warfighter assessment criteria for these capabilities. Continue to co-chair DoD’s C2 Council of Colonels and update CJCSI\/M 3265.01, “Joint C2 Governance and Management,” to strengthen requirements management for enterprise-level, globally integrated operations.  Ensure requirements development efforts include architecture, data, cross-functional, cyber, mission partner environment and joint information environment capability areas and equities. Implement plans and schedules to assess Enterprise COP GCCS-JE incrementally developed capabilities.\n\nC4 Architectures - Provide architecture and joint mission thread development and analysis to support the Chairman's directed focus areas, specifically in areas of joint command and control, cyberspace, and joint and coalition interoperability. Provide architectures and analytical support as required to the Chairman's Joint Military Net Assessment.  Conduct analysis and validate architectures, functional requirements documents and engineering designs that support implementation of the joint information environment. Refine the joint common systems function list to support JCIDS and system\/service development.  Analyze JCIDS capability requirements documents and architectures for integration, interoperability, performance, cost and schedule. Update the warfighter mission area (WMA) architecture development standards to meet emerging JCIDS process improvements. Provide architecture integration and federation to support the WMA enterprise architecture by populating the WMA architecture portal with all relevant and available Functional Capabilities Board portfolio areas of interest architecture content. Improve the WMA architecture portal for the Combatant Command, Services and DoD agencies by broadening access, integration, reusability and information sharing of architecture artifacts and data sets through federation and standardized information and data exchanges.\n\nData and Services – continue to develop, promote, and integrate data and services requirements, standards, technical specifications, and policy to support improved warfighter interoperability and information sharing with joint, mission partners and other U.S. Government departments and agencies. Socialize and perform proof of concept activities of the NATO core data framework, to achieve coalition interoperability and demonstrate operational effectiveness. Continue to align and standardize emerging tactical data link and messaging standards with enterprise information sharing. Support the implementation of National Information Exchange Model (NIEM) as the common interoperability information exchange standard for new IT services. In coordination with the DoD CIO, implement IT enterprise service lifecycle management processes, procedures, and capabilities.\n\nInteroperability and Integration – lead mission partner environment (MPE) implementation and support cyber priorities across DoD by performing analysis, conducting assessments and supporting materiel developers. Review and monitor the continued development of the MPE information system to ensure it meets the operational requirements of the CCMDs and Services and complements the greater MPE initiative. Continue to shape NATO future mission networking implementation to ensure it remains aligned with MPE, including related capability development. Support development and maturation of DOD enterprise cyber-range environment and command and control information systems to support US and coalition cyber force readiness, cyber defense of coalition networks, integration, interoperability, and defensibility of mission partner environment federated networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.787"
                                            },
                                            "Text": {
                                                "val": "Capability Development – analyze and coordinate the Department’s FY 2021-2025 C2 integrated priority lists and capability gap assessment for JROC approval. Develop and coordinate annual Joint C2 FY 2020 and FY 2021 operational priorities for JROC approval.  Provide operational input to capability development efforts focused on migration of Global Command and Control Systems (GCCS) to a loosely coupled enterprise accessible solution. Ensure warfighter demands for a functional denied-disconnected, intermittent, low-bandwidth capability at the Combined\/Joint Task Force-level are adequately understood and addressed by the capability developer. Ensure capability needs are addressed for C2IE development and transition.\n\nProvide architecture and joint mission thread development and analysis efforts as required to support the Chairman's directed focus areas and Chief Information Officer (CIO) lines of operations. Provide architectures and analytical support as required to the Chairman's Joint Military Net Assessment. Conduct analysis and validate architectures and engineering designs for continued implementation of the joint information environment. Update the warfighter mission area (WMA) architecture development standards to improve WMA architecture portal usability. Continue to improve the quality of and expand the amount of the C4\/Cyber portfolio architecture information available on the WMA architecture portal. Conduct analyses and develop architectures and metrics for JCIDS capability requirement documents.\n\nData and Services – develop, promote, and integrate warfighter data and services requirements, standards, technical specifications, and policy to improve warfighter interoperability and information sharing with joint, mission partners, and other U.S. government departments and agencies. Perform and lead proof of concept activities of the North Atlantic Treaty Organization (NATO) core data framework and the National Information Exchange Model (NIEM) with selected communities of interest, such as robotics and autonomous systems, to achieve coalition interoperability and demonstrate operational effectiveness for the mission partner environment and for the federated mission networking domain. Continue to align and standardize emerging tactical data link, symbology (including cyber symbology) and messaging standards with enterprise information sharing. Support and guide the maturation of and implementation of NIEM in the interagency, joint and coalition domains as the common enterprise level interoperability information exchange standard for new and updated IT services. In coordination with the DoD CIO, implement IT enterprise service management processes and procedures including lifecycle management, enterprise level capability integration and operational data management. Support joint command and control governance and requirements documents development to ensure data and service equities are properly represented on behalf of the warfighter.\n\nIntegration and interoperability – lead mission partner environment (MPE) implementation and support cyber priorities across DoD by performing analysis, conducting assessments and supporting materiel developers. Review and monitor the continued development of the MPE information system to ensure it meets the operational requirements of the Combatant Commands and Services and complements the greater MPE initiative. Continue to shape NATO future mission networking implementation to ensure it remains aligned with MPE, including related capability development. Support development and maturation of DOD enterprise cyber-range environment command and control information system to support US and coalition cyber force readiness, cyber defense of coalition networks, integration, interoperability, and defensibility of mission partner environment federated networks. Coordinate and lead non-overseas contingency operations-funded coalition interoperability events across the geographic Combatant Commands."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $803K due to the transfer of funding to Joint Fires project to support the Bold Quest multinational network enhancement which greatly increases Bold Quest distributed operations, both within CONUS and in Europe and Australia."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort, and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        },
                        "PerformanceMetrics": {
                            "val": "1. Secure JROC approval of the Global Command and Control System-Joint Enterprise (GCCS-JE) Information Systems Capability Development Document (IS-CDD) to guide development of DoD’s primary situational awareness capability.\n\n2. Secure JROC approval of the FY 2019 and FY 2020 joint C2 operational priorities defining C2 capability needs\/gaps providing senior level oversight and direction to joint C2 capability development.\n\n3. Secure DoD approval for seven JCIDS requirements documents to support materiel development of Joint C2, GCCS-JE, planning and execution, intelligence support to C2, global-theater security cooperation, readiness, and cross-functional information technology capabilities enabling timely delivery of materiel solutions to meet warfighter capability needs\/gaps.\n\n4. Ensure Joint C2 requirements development supports the DoD-directed better buying power by continuing the rapid development and fielding of virtualized C2 system capabilities to Combatant Commands and Services.\n\n5. Validate the architectures and engineering design specifications for 27 JIE and MPE projects.\n\n6. Conduct three National Information Exchange Model Military Operations Domain Configuration Control Board sessions to improve and increase information sharing via promulgation of one domain content update.\n\n7. Lead a minimum of six Enterprise Service and Data Panels with the goal to improve and increase the interoperability and reusability of DOD enterprise services and authoritative data sources.\n\n8. Include mission partnering concepts in four Combatant Command and Service exercises.\n\n9. Establish at least two new or enhanced information\/sharing and collaboration areas NLT 30 Jun 19.\n\n10. Establish and refine processes and procedures to ensure FMN implementation is included in two NATO exercises."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Managemnt and Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk, Suffolk"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.079"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.594"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.590"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.787"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.787"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "C5 Capability Development"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "C5 Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "003"
                    },
                    "ProjectTitle": {
                        "val": "Joint Fires C2 Interoperability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "4.425"
                        },
                        "PriorYear": {
                            "val": "4.150"
                        },
                        "CurrentYear": {
                            "val": "4.150"
                        },
                        "BudgetYearOne": {
                            "val": "5.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.000"
                        },
                        "BudgetYearThree": {
                            "val": "5.000"
                        },
                        "BudgetYearFour": {
                            "val": "5.000"
                        },
                        "BudgetYearFive": {
                            "val": "5.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Lead interoperability efforts across DoD and partner nations at the operational and tactical level for mission partner operations, fire support, combat identification (CID), and friendly force tracking (FFT) capabilities. Conduct joint fire support, joint close air support and CID-FFT action plans to fulfill CJCS-directed, General Officer\/Flag Officer (GOFO) level responsibilities. Conduct Joint Fire Support Executive Steering Committee (JFS ESC) standardization team accreditation visits to U.S. and partner nation schoolhouses to ensure memorandum of agreement signatories are accomplishing schoolhouse training in compliance with the memoranda."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Fires C2 Interoperability"
                                    },
                                    "Description": {
                                        "val": "These efforts directly support Chairman, Joint Chiefs of Staff (CJCS) guidance to increase interoperability with allies and partners, to more effectively counter transregional threats.  Supports Chairman's focus area of improving joint warfighting capability and the SECDEF's line of effort to stenghten alliances and attract new partners.  Execute Joint Staff-sponsored Bold Quest systems-of-systems interoperability assessment, including integration of cyber capabilities with command and control of conventional and Special Operations Force missions from a multinational perspective at the tactical level. Lead the Joint Fire Support Executive Steering Committee (JFS ESC), composed of Flag\/General Officer representatives and supporting staffs from the U.S. Services, Special Operations Command and 21 partner nations. Those nations include NATO nations, Australia, Republic of Korea and key Gulf State allies. Also lead the Combat Identification – Friendly Force Tracking Executive Steering Committee (CID-FFT ESC), focused on more effective and efficient combat operations and reduced potential for friendly fire incidents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "Execute Joint Staff-sponsored Bold Quest systems-of-systems interoperability assessment, including integration of Cyber and ISR capabilities with command and control of Conventional and Special Operations Force missions from a multinational perspective at the tactical level. Continue incorporating Mission Partner Environment concepts to increase Allied and coalition interoperability. These efforts directly support the 2016 National Military Strategy and the CJCS’ focus areas. Continue leading accreditation visits of current JFS ESC member programs and provided staff assistance for development of new start close air support-related training and certification programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.150"
                                            },
                                            "Text": {
                                                "val": "Plan and execute Joint Staff-sponsored Bold Quest 2018 systems-of-systems interoperability assessment, including integration of Cyber and ISR capabilities with command and control of conventional and Special Operations Force missions from a multinational perspective at the tactical level. These efforts directly support the National Military Strategy and other CJCS focus areas. Continue leading accreditation visits of current JFS ESC member programs and provided staff assistance for development of close air support-related training and certification programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Plan and execute Joint Staff-sponsored Bold Quest 2019 capability demonstration and assessment, focused on interoperability for joint and coalition fires. Bold Quest data and assessments inform US and Partner Nation investment in multiple capability areas: combat identification, friendly force tracking, digitally aided close air support and fires, integrated air and missile defense, coalition intelligence surveillance and reconnaissance, and cyber.  These efforts directly support the National Military Strategy, the CJCS’ global integration objectives and the Combatant Commanders conventional and SOF international engagement programs. Continue leading accreditation visits of current JFS ESC member programs and provided staff assistance for development of close air support-related training and certification programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $850K due to the Bold Quest multinational network enhancement which greatly increases Bold Quest distributed operations, both within CONUS and in Europe and Australia."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Biannual review of C4\/Cyber resources includes an examination of the current and future Budget\/Spend Plan, Lines of Effort and Acquisition Strategy.\n\nThe award of a Multi Award Contract (MAC) seeks efficiencies in the performance of requirements for C4\/Cyber and Information services, and promotes contractor teaming to provide critical technical and management support.  The MAC approach also seeks to reduce the costs of current contract support through the elimination of multiple fees for service contracts, and through the competitive award of contract services."
                        },
                        "PerformanceMetrics": {
                            "val": "1. Lead development, demonstration and assessment of situational awareness and cooperative\/non-cooperative identification capabilities that enable U.S. and NATO\/Coalition warfighters to identify friendly, enemy, and neutral forces for “shoot\/don’t shoot” decisions.\n\n2. Synchronize Service testing, acquisition and fielding of Mode 5 IFF capability, with focus on Full Operational Capability (FOC) in 2020. Monitor Service fielding progress of 169 platform types.\n\n3. Lead the design, planning and execution of two Bold Quest coalition capability demonstrations and assessments in order to inform U.S. and partner nation investment in networked capabilities to improve the detection and engagement of targets via surface (ground and maritime) and air delivered fires and other non-kinetic means.\n\n4. Lead the digitally aided close air support (DACAS) coordinated implementation initiative among all US Services, USSOCOM, and 16 partner nations; develop and document engineering change proposals’ technical solutions to operational interoperability issues in the CAS mission area; maintain the associated equipment and currency of assessment tools software and licensing agreements.\n\n5. Lead US and partner nations with international fire support interoperability capability development initiatives, to ensure on-going efforts optimize: unity-of-effort; resource\/cost benefit; and enhanced fire support integration.\n\n6. Expand digital call-for-fire solution development to include enhanced multi-national interoperability with 11 partner nations.\n\n7. Lead, coordinate, organize, and execute an annual Joint Fire Support Symposium to exchange information, identify issues, examine capability shortfalls, assess emerging technologies, and recommend areas for DoD action\/resolution.\n\n8. Conduct accreditation assessments for 18 of 33 current signatory programs (11 Joint Terminal Attack Controller, 2 Forward Air Controller (Airborne), and 5 Joint Fires Observer).\n\n9. Lead development and refinement of four U.S. and NATO joint fires-related doctrine and tactics, techniques, and procedures publications.\n\n10. Plan and conduct quarterly Joint Fire Support and Combat ID-Friendly Force Tracking Executive Steering Committees and working group meetings to address identified shortfalls in those mission areas."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract Management amd Engineering Technical Services"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Norfolk"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.425"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Joint Fires C2 Interoperability"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Joint Fires C2 Interoperability"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}