{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603002A"
        },
        "ProgramElementTitle": {
            "val": "Medical Advanced Technology"
        },
        "R1LineNumber": {
            "val": "31"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "106.040"
            },
            "CurrentYear": {
                "val": "67.780"
            },
            "BudgetYearOne": {
                "val": "62.496"
            },
            "BudgetYearOneBase": {
                "val": "62.496"
            },
            "BudgetYearTwo": {
                "val": "59.386"
            },
            "BudgetYearThree": {
                "val": "64.195"
            },
            "BudgetYearFour": {
                "val": "68.515"
            },
            "BudgetYearFive": {
                "val": "70.418"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "498.830"
            }
        },
        "ProgramElementNote": {
            "val": "In project MM3 there are two title changes in FY19.  The Physiological (human physical and biochemical functions) Health and Environmental Protection (Sleep Research\/ Environmental Monitoring) title changes to Physiological Health and the Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments title changes to Environmental Health & Protection."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates advanced medical technologies including drugs, vaccines, medical diagnostic devices, measures for identification and vector control, and developing medical practices and procedures to effectively protect and improve the survivability of United States Forces across the entire spectrum of military operations. Tri-Service coordination and cooperative efforts are focused in four principal medical areas: Combat Casualty Care, Military Operational Medicine, Militarily Relevant Infectious Diseases, and Clinical and Rehabilitative Medicine.\n\nPromising medical technologies are refined and validated through extensive testing, which is conducted in compliance with FDA regulations for human medical products, and EPA regulations for insect-control products that impact humans or the environment (e.g., repellents and insecticides). The FDA requires medical products to undergo extensive preclinical testing in animals and\/or other models to obtain preliminary effectiveness and safety information before they can be tested in human clinical trials. Clinical trials are conducted stepwise: first to prove the product is safe in humans, second to demonstrate the desired effectiveness and optimal dosage (amount to be administered) in a small group human study, and third to demonstrate effectiveness in large, diverse human populations. Each successive phase includes larger numbers of human subjects and requires FDA cognizance prior to proceeding. Work conducted in this PE primarily focuses on late stages of technology maturation activities required to conduct safety and effectiveness clinical trials. Some high-risk technologies may require additional maturation with FDA guidance prior to initiating these clinical trials. Such things as proof of product stability and purity are necessary to meet FDA standards before entering later stages of testing and prior to transitioning into a formal acquisition program where large pivotal trials in diverse populations will be conducted for licensure. Activities in this PE may include completion of preclinical animal studies and small safety and effectiveness studies involving humans according to FDA and EPA requirements. Promising medical technologies that are not regulated by the FDA or EPA are modeled, prototyped, and tested in relevant environments.\n\nBlast research and research into maturing field rations in this PE are fully coordinated with the US Army Natick Soldier Research, Development, and Engineering Center. This coordination enables improved body armor design and rations for Soldiers. Additionally, the activities funded in this PE are externally peer reviewed and fully coordinated with all Services as well as other agencies through the Joint Technology Coordinating Groups of the Armed Services Biomedical Research Evaluation and Management (ASBREM) Community of Interest (COI). The ASBREM COI, formed under the authority of the Assistant Secretary of Defense for Research and Engineering, serves to facilitate coordination and prevent unnecessary duplication of effort within the Department of Defense's biomedical research and development community, as well as its associated enabling research areas.\n\nProject 810 matures and demonstrates FDA-regulated medical countermeasures such as drugs, vaccines, and diagnostic systems to naturally occurring infectious diseases of military importance, as identified by worldwide medical surveillance and military threat analysis. The project also supports testing of personal protective measures such as repellents and insecticides regulated by the EPA. This project is being coordinated with the Defense Health Program.\n\nProject 840 validates studies on safety and effectiveness of drugs, biologics (medical products derived from living organisms), medical devices, and medical procedures and practice guidelines intended to minimize immediate and long-term effects from battlefield injuries; advanced technology development and clinical studies for treatment of ocular and visual system traumatic injury; and restoration of function and appearance by regenerating skin, muscle, nerve, vascular and bone tissues in wounded Service Members . Additionally, this project develops and realistically tests improved occupant protection systems through medical research to characterize mechanisms of injuries sustained by occupants of ground-combat vehicles subjected to underbody blast events, determine human tolerance limits to underbody blast forces, and develop tools to predict injuries to ground-combat vehicle occupants exposed to underbody blast forces. \n\nProject ET5 conducts validation studies on safety and effectiveness of drugs, biologics, medical devices, procedures, and rehabilitative strategies intended to minimize long-term effects from battlefield injuries. This project supports advancing technology supporting clinical and rehabilitative solutions to restore function of ocular and visual system post injury; and advancing regenerative techniques to restore the function and appearance of damaged tissues by regenerating skin, muscle, nerve, vascular and bone tissues in wounded Service Members.\n\nProject FH4 matures, validates, and supports enhanced Force Health Protection of Soldiers against threats in military operations and training. Health-monitoring tools are matured to rapidly identify deployment stressors that affect the health of Joint Forces. These databases and systems enhance the DoDs ability to monitor and protect against adverse changes in health, especially mental health effects caused by changes in brain function. Force Health Protection work is conducted in close coordination with the Department of Veterans Affairs. The program is maturing the development of global health monitoring (e.g., development of neuropsychological evaluation methodologies), validating clinical signs and symptoms correlating to medical records, diagnosed diseases, and mortality rates. The key databases supporting this program are the Millennium Cohort Study and the Total Army Injury and Health Outcomes Database. These databases allow for the examination of interactions of psychological stress and other deployment and occupational stressors that affect Warfighter health behaviors. \n\nProject MM3 supports the Medical and Survivability technology areas with laboratory validation studies and field demonstrations of biomedical products designed to counteract myriad environmental and physiological stressors, as well as materiel hazards encountered in training and operational environments to protect, sustain, and enhance Soldier performance. The key efforts are to demonstrate and transition technologies, as well as validate tools associated with Soldier survivability, injury assessment and prediction, assessments for post-concussive syndrome, and enhancing performance during continuous operations. The three main thrust areas are\n(1) Physiological Health and Environmental Protection, (2) Injury Prevention and Reduction, and (3) Psychological Health and Resilience. This project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. \nWork funded in this project PE is fully coordinated with efforts undertaken in PE 0602787A and the Defense Health Program.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by Walter Reed Army Institute of Research (WRAIR), Silver Spring, MD; US Army Medical Research Institute of Infectious Diseases (USAMRIID) and the Armed Forces Institute of Regenerative Medicine (AFIRM), Ft Detrick, MD; US Army Research Institute of Environmental Medicine (USARIEM), Natick, MA; US Army Institute of Surgical Research, Joint Base San Antonio, TX; United States Army Aeromedical Research Laboratory (USAARL), Ft Rucker, AL; the Naval Medical Research Center (NMRC), Silver Spring, MD; US Army Dental Trauma Research Detachment (USADTRD), Joint Base San Antonio, TX."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "68.365"
                },
                "CurrentYear": {
                    "val": "67.78"
                },
                "BudgetYearOne": {
                    "val": "63.996"
                },
                "BudgetYearOneBase": {
                    "val": "63.996"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "106.04"
                },
                "CurrentYear": {
                    "val": "67.78"
                },
                "BudgetYearOne": {
                    "val": "62.496"
                },
                "BudgetYearOneBase": {
                    "val": "62.496"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "37.675"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.5"
                },
                "BudgetYearOneBase": {
                    "val": "-1.5"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "39"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.895"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.594"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.5"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.5"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.024"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increases in projects 814 Neurofibromatosis $15M, 97T Neurotoxin Exposure Treatment $16M, and MM2 Medical Advance Technology Initiatives $8M"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "810"
                    },
                    "ProjectTitle": {
                        "val": "Ind Base Id Vacc&Drug"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.414"
                        },
                        "CurrentYear": {
                            "val": "17.888"
                        },
                        "BudgetYearOne": {
                            "val": "16.788"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.788"
                        },
                        "BudgetYearTwo": {
                            "val": "17.755"
                        },
                        "BudgetYearThree": {
                            "val": "21.044"
                        },
                        "BudgetYearFour": {
                            "val": "21.405"
                        },
                        "BudgetYearFive": {
                            "val": "21.834"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "133.128"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project maturates and demonstrates United States (U.S.) Food and Drug Administration (FDA)-regulated medical countermeasures such as drugs, vaccines, and diagnostic (identification of the nature and cause of a particular disease) systems to naturally occurring infectious diseases that are threats to deployed United States military forces. The focus of the Project is on prevention, diagnosis, and treatment of diseases that can adversely impact military mobilization, deployment, and operational effectiveness. Prior to licensure of a new drug or vaccine to treat or prevent disease, the FDA requires testing in human subjects. Studies are conducted stepwise: first to prove the product is safe in humans, second to demonstrate the desired effectiveness and optimal dosage (amount to be administered) in a small study, and third to demonstrate effectiveness in large, diverse human populations. All test results are submitted to the FDA for evaluation to ultimately obtain approval (licensure) for medical use. This Project supports the studies for safety and effectiveness testing on small study groups after which they transition to the next phase of development for completion of expanded safety and initial studies for effectiveness in larger populations. If success is achieved for a product in this Project, the effort will transition into Advanced Development. The Project also supports testing of personal protective measures that can reduce disease transmission from arthropods to include products such as repellents and insecticides, which are regulated by the Environmental Protection Agency (EPA).\nResearch conducted in this Project focuses on the following four areas:\n\n(1)\tPrevention\/Treatment of Parasitic (organism living in or on another organism) Diseases\n(2)\tBacterial Disease Threats (diseases caused by bacteria)\n(3)\tViral Disease Threats (diseases caused by viruses)\n(4)\tDiagnostic Systems and Vector Identification and Control\n\nResearch is conducted in compliance with FDA regulations for medical products for human use and EPA regulations for insect-control products that impact humans or the environment (e.g., repellents and insecticides).\n\nWork is managed by the United States Army Medical Research and Materiel Command (USAMRMC) in coordination with the Naval Medical Research Center (NMRC). The Army is responsible for programming and funding all Department of Defense (DoD) naturally occurring infectious disease research requirements, thereby precluding duplication of effort within the Military Departments.\n\nPromising medical countermeasures identified in this Project are further matured under Program Element 0603807A, Project 808.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy.\n\nEfforts in this Project support the Soldier portfolio and the principal area of Military Relevant Infectious Diseases."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Technology Research on drugs and vaccines against parasitic diseases"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising anti-parasitic drug candidates for treating malaria and leishmaniasis for testing in humans, prepares data packages required for FDA approval of testing in humans. Studies have shown that the malaria parasite can become resistant to existing drugs, which makes it necessary to continually develop new and more effective and safe treatments. This effort selects candidate vaccines for various types of malaria, including the severe form of malaria (Plasmodium falciparum) and the less severe but relapsing form (Plasmodium vivax), prepares technical data packages required for FDA approval of testing in humans and conducts testing of promising malaria vaccine candidates in humans. A malaria vaccine would minimize the progression and impact of drug resistance and eliminate the need to take preventive anti-malarial drugs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.405"
                                            },
                                            "Text": {
                                                "val": "Will down-select a lead compound from Triazine group which will be used in clinical testing for safety and effectiveness (protection against controlled human malaria infection) in human volunteers. Will conduct clinical testing of eight-aminoquinoline class drugs (i.e. primaquine) to assess the break-down within human body in order to improve drug safety and effectiveness for treatment and prevention of relapsing malarias (persons getting sick second time after drug treatment). Will conduct trials in human volunteers with recombinant DNA and viral vector based vaccine candidates to assess their safety and effectiveness. Will test new particle based platform (self-assembling protein nanoparticle based vaccine) in humans to improve performance of selected vaccine candidates. Will down-select the best vaccine candidate for transition to advanced development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.916"
                                            },
                                            "Text": {
                                                "val": "Submit initial human testing data for FDA review and down-select lead Triazine compound for further human testing.  Assess improved strategy for safe and more effective use of primiquine-like drugs for radical cure in humans.  Continue to conduct trials in human volunteers using multiple technologies to evaluate efficacy of selected vaccine candidates in a controlled human malaria infection model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.565"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.565"
                                            },
                                            "Text": {
                                                "val": "Will initiate safety and analytic studies to assess natural break-down of candidate drugs within the human body to improve drug safety and effectiveness for treatment and prevention of malaria for selected triazine lead compound. Will complete laboratory clinical trials to assess performance of lead Plasmodium falciparum malaria vaccine candidates. These activities enable down-selection of a lead vaccine for transition to advanced development. Will validate laboratory-based immune measures of protection and correlate with protective effectiveness among candidate vaccines undergoing clinical trials"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Normal or planned progression of the effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Bacterial Disease Threats"
                                    },
                                    "Description": {
                                        "val": "This effort selects promising candidate vaccines against each of the three main bacterial causes of diarrhea (E. coli, Campylobacter, and Shigella) that pose significant threat during initial deployments for testing in human subjects. Data packages are prepared, as required for FDA approval, and testing is conducted in human subjects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.772"
                                            },
                                            "Text": {
                                                "val": "Will complete clinical trials with monovalent (one type) additional vaccine candidates identified in FY16 to present to the FDA for approval for human testing of vaccine candidates for bacterial diarrheal agents. Will conduct extended safety\/efficacy\/dosing study in humans by using different escalating doses of candidate vaccines against Shigella, and ETEC. This will also allow understanding protection mechanisms of these vaccine candidates. Will transition the new Shigella, and ETEC vaccine candidates to Advanced Development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.291"
                                            },
                                            "Text": {
                                                "val": "Conduct expanded (FDA) safety\/initial efficacy study in humans for Shigella and ETEC vaccine candidates. Perform analyses of samples obtained from human safety studies and make decisions regarding advancement of vaccine candidates for further testing at field sites. Conduct initial (FDA) safety study in humans for a Campylobacter vaccine candidate. Perform analyses of samples obtained from safety study of the Campylobacter vaccine candidate and make a decision regarding advancement of this candidate in efficacy testing studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.955"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.955"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and advance multiple vaccine candidates for Shigella, ETEC and Campylobacter. Will prepare data packages for the FDA to test suitable vaccine candidates in humans for safety and effectiveness. Will test the vaccine candidates in human clinical trials for safety and effectiveness for Shigella, ETEC and Campylobacter."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Normal or planned progression of the effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Viral Disease Threats"
                                    },
                                    "Description": {
                                        "val": "This effort progresses the most promising vaccine candidates against dengue fever (a severe debilitating disease caused by a virus and transmitted by a mosquito), and hantavirus (severe viral infection that causes internal bleeding and is contracted from close contact with rodents) and conducts FDA-required nonclinical safety and protection testing (laboratory- based) in animals, prepare FDA investigational new drug technical data packages, and conducts clinical testing of candidate vaccines in humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.017"
                                            },
                                            "Text": {
                                                "val": "Will assess safety and initial immunogenicity (ability to provoke an immune response) of vaccine candidates measured from sera and immune cells obtained from human volunteers enrolled in dengue vaccine trial conducted with commercial partner.  Will assess safety of controlled human dengue infection with newly developed Dengue attenuated viruses that will be used in future clinical trials in lieu of natural infection caused by mosquito bite to assess effectiveness of candidate dengue vaccines. Will assess if antibody responses will be acceptable over a traditional expanded safety, efficacy, and dosing studies in humans. There is currently no animal disease model for Hantavirus causing Hemorrhagic Fever with Renal Syndrome. Could prove difficult to conduct a traditional safety\/efficacy\/dosing study in humans for vaccine assessment due to the marginally low incidence of disease, we will pursue a vaccine efficacy evaluation strategy based on establishing surrogate markers of protection, i.e. antibodies that neutralize the virus(es) against the disease."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "Assess safety and  immunogenicity (ability to provoke an immune response) of vaccine candidates measured from sera (body fluids) and immune cells obtained from human volunteers enrolled in new dengue vaccine trial conducted with commercial partner. Continue to evaluate safety of controlled human dengue infection model with newly developed Dengue viruses. Validate effectiveness of candidate dengue vaccines using challenge model (mimics dengue in a controlled setting by infecting human volunteers with a weakened live dengue virus and measuring outcome. Conduct human trials to evaluate the biological activity of the DNA-based vaccine to prevent Hemorrhagic Fever with Renal Syndrome (HFRS)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.659"
                                            },
                                            "Text": {
                                                "val": "Will continue to evaluate safety and initial effectiveness of commercial partner dengue vaccine candidates undergoing testing in South East Asia and Latin America. Will complete vaccine immunogenicity(ability to provoke an immune response)  testing followed by dengue human infection model challenge and effectiveness testing of human subjects immunized with combination inactivated and weakened forms of virus vaccines. Will engage commercial partner to pursue development of purified inactivated dengue virus vaccine alone or in combination with live attenuated product. Will pursue an expanded Hemorrhagic Fever with Renal Syndrome (HFRS) DNA vaccine clinical trial in a country that has endemic HFRS cases. Will test for safety and effectiveness of the HFRS DNA vaccine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Normal or planned progression of the effort"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diagnostics and Disease Transmission Control"
                                    },
                                    "Description": {
                                        "val": "This effort conducts human subject testing of FDA-regulated field medical diagnostic devices and EPA-approved measures to control arthropods (i.e., insects, ticks & mites)-borne pathogens (infectious agents) that cause diseases such as Q fever, Sand fly fever, and Japanese encephalitis. Note: Diagnostics Systems funding will end at the beginning of FY19."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.22"
                                            },
                                            "Text": {
                                                "val": "Will conduct laboratory and field evaluations with commercial partners and outside of the continental United States (OCONUS) laboratories to evaluate RHDDs and Arthropods Vector Rapid Detection Device (AVRDDs) for infectious agents of military importance. The aim is to conduct initial validation studies required to ensure that the commercial assay meets military requirements and has the potential to obtain the requisite regulatory clearances from the FDA to facilitate military use. Will test new generation spatial repellant(s) in the field for efficacy against insect and other arthropod vectors. Will test bite-protection\/resistance capability of repellant treated fabrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.681"
                                            },
                                            "Text": {
                                                "val": "Advance the evaluation of new generation spatial repellant(s) in the field for efficacy against insect and other arthropod vectors. Continue to perform laboratory and field evaluations with commercial partners and OCONUS laboratories to evaluate rapid diagnostic assays for infectious agents applicable to military interests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.609"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.609"
                                            },
                                            "Text": {
                                                "val": "Will continue to improve data collection and characterization of arthropod vectors. Will evaluate new dipsticks (pathogen detection lateral flow diagnostic devices). Will continue to field test Ovitraps (mosquito detection\/monitor device) and other vector control methods including repellants spatial devices."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A change in the priority of the effort.  The civilian market is driving much of the innovation in this area of diagnostic research.  As such, it is cost effective to let the market develop diagnostic platforms and the DoD develop the military relevant test menu of assays.  This approach was successful with the BioFire FilmArray (Next Generation Diagnostic System).  While a dedicated diagnostic capability will be eliminated within the Military Infectious Diseases Research Program, many of the existing task areas have the knowledge and proficiency to develop diagnostic assays."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "814"
                    },
                    "ProjectTitle": {
                        "val": "NEUROFIBROMATOSIS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "15.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Neurofibromatosis Research Program"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurofibromatosis research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Neurofibromatosis Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "840"
                    },
                    "ProjectTitle": {
                        "val": "Combat Injury Mgmt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.631"
                        },
                        "CurrentYear": {
                            "val": "19.716"
                        },
                        "BudgetYearOne": {
                            "val": "19.785"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.785"
                        },
                        "BudgetYearTwo": {
                            "val": "21.645"
                        },
                        "BudgetYearThree": {
                            "val": "21.872"
                        },
                        "BudgetYearFour": {
                            "val": "23.972"
                        },
                        "BudgetYearFive": {
                            "val": "24.986"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "150.607"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project matures, demonstrates, and validates promising medical technologies and new clinical practices for control of severe bleeding, treatment for traumatic brain injury (TBI), resuscitation and stabilization of trauma patients, acute treatment of extremity (arms and legs) and facial injuries, treatment of severe burn wounds, treatment of single and multiple organ failures due to trauma, and predictive indicators and decision aids for life support systems. Emphasis is placed on provision of prolonged field care when evacuation to theater hospitals is delayed.\n\nResearch conducted in this project focuses on combat casualty care in the following four areas:\n\n(1)\tDamage Control Resuscitation\n(2)\tCombat Trauma Therapies\n(3)\tTraumatic Brain Injury\n(4)\tCombat Critical Care Engineering\n\nAll research is conducted in compliance with Food and Drug Administration (FDA) requirements for licensure of medical products for human use.\n\nPromising efforts identified through applied research conducted under Program Element (PE) 0602787A, Project 874, are further matured under this Project. Promising results identified under this Project (840) are further matured under PE 0603807A, Project 836.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Damage Control Resuscitation"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs and medical procedures to control or stop bleeding, maintain metabolism (the chemical processes that are required to maintain life) minimize harmful inflammation after major trauma preserving tissue function, and prevent or minimize secondary organ failure (including brain and spinal cord injury)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.058"
                                            },
                                            "Text": {
                                                "val": "Will evaluate existing drugs, devices, and techniques to stop severe bleeding in relevant hemorrhagic shock models and in humans. Will validate small volume resuscitative therapies, i.e., medicinal products that protect blood-deprived tissues from further damage and restore normal cell function. Smaller volume resuscitative products permit the medic to carry more products in aid bag, which increases availability for use at the point of injury in far forward areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.035"
                                            },
                                            "Text": {
                                                "val": "Perform preclinical studies to evaluate stem cell therapies in an animal model of severe traumatic bleeding.  Evaluate currently available and new products for control of compressible bleeding under prolonged field care scenarios, i.e., when medical evacuation is delayed and\/or prolonged.  Perform animal studies to determine impact of prolonged hypotensive (low blood pressure) resuscitation, due to delayed evacuation, on subsequent survival once patient receives definitive surgical care and full resuscitation.  Evaluate different types of mechanical interventions (e.g., compression, wound packing, use of tourniquets) to determine optimal practices for control of bleeding from junctional wounds.  Continue to evaluate small volume resuscitative therapies with blood products and hemostatic drugs (drugs that stop or slow down the flow of blood) to identify combinations that optimally mitigate the effects of inflammation and prolonged ischemia (inadequate or absent blood supply) in critical tissues.  Evaluate methods to refrigerate whole blood that do not impair platelet function."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.756"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.756"
                                            },
                                            "Text": {
                                                "val": "Will begin clinical trial to demonstrate safety of cold-stored platelets in human subjects. Will evaluate stem cell safety and effectiveness in animal model of severe traumatic injury, bleeding, and inflammation. Will assess current bleeding control products under prolonged care scenarios (i.e., when medical evacuation is delayed or prolonged). Will perform preclinical studies to determine physiological effects of endovascular (refers to device that is directly introduced into a major blood vessel) bleeding control product use on subsequent fluid resuscitation effectiveness. Will evaluate mechanical interventions for bleeding not controlled by application of pressure to determine best products and practices. Will assess animal studies to determine effect of prolonged low blood pressure resuscitation on survival following definitive surgical repair and full resuscitation. Will evaluate combinations of blood products and drugs to determine which optimally mitigate the effects of inflammation and prolonged ischemia (inadequate or absent blood supply) produced in critical tissues by traumatic bleeding. Will continue evaluation of methods to refrigerate whole blood that do not impair platelet function."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The Battlefield Platelets STO concluded in FY18 with a product transitioning to advanced development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Trauma Therapies"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from battlefield injuries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.342"
                                            },
                                            "Text": {
                                                "val": "Will pre-clinically validate combined-agent (a bacteria-killing protein in combination with a chemical that disperses bacterial colonies) antibacterial wound treatments in a large animal contaminated facial, mouth wound model. As follow on to the FY16 work, will evaluate therapies that reduce excessive connective tissue formation following traumatic muscle injury to determine their effect on remaining muscle and surgical repair. Will perform clinical studies to determine factors that impede wound healing. Will perform clinical studies to determine the burden of excessive scarring from burn injuries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.343"
                                            },
                                            "Text": {
                                                "val": "Follow on work to evaluate therapies that reduce excessive scar tissue formation following traumatic muscle injury moves under Clinical and Rehabilitative Medicine. Perform studies to determine impact of prolonged tourniquet use on antibiotic concentrations at wound site. Perform retrospective analyses to identify clinical determinants of long-term disability in casualties with musculoskeletal injuries. Perform animal studies to determine optimal concentration of dilute hypochlorite for initial wash-out of dismounted complex battlefield injuries. Perform preclinical studies to validate combined-agent (a bacteria-killing protein in combination with a chemical that disperses bacterial colonies) antibacterial wound treatments in a large animal contaminated facial, mouth wound model."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.389"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.389"
                                            },
                                            "Text": {
                                                "val": "Will assess path of healing in animal burn wounds and measure time to wound closure for various degrees of burn wounds. Will continue retrospective analyses to identify clinical determinants of long-term disability in casualties with musculoskeletal injuries. Will continue animal studies to determine optimal concentration of a commonly used antiseptic solution for initial wash-out of dismounted complex battlefield injuries. Will continue studies in animals to evaluate effectiveness of products to combat wound infection, inflammation and scarring of delayed wound healing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase is due to inflation adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Traumatic Brain Injury (TBI)"
                                    },
                                    "Description": {
                                        "val": "This effort supports work required to validate safety and effectiveness of drugs, biologics, and medical procedures intended to minimize immediate and long-term effects from TBI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.067"
                                            },
                                            "Text": {
                                                "val": "Will begin pre-clinical and early clinical studies of post-TBI hyperthermia (TBI-induced fever). Will begin pre-clinical and early clinical studies of potential neuro-regenerative mechanisms (mechanisms to restore damaged brain tissue). Will validate neuroprotection therapies (therapies to protect brain tissue from further damage following a TBI event) using validated small animal model of polytrauma (multiple traumatic injuries)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.085"
                                            },
                                            "Text": {
                                                "val": "Complete studies to mitigate post-TBI hyperthermia (TBI-induced fever) and transition knowledge to clinical practice guidelines.  Continue to further evaluate two neuroprotective drugs (therapies to protect brain tissue from further damage following a TBI event) with demonstrated synergistic effects in animal models of TBI.  Use a small animal model of severe TBI to evaluate the potential beneficial effects of resuscitative endovascular balloon occlusion of the aorta (a surgical technology used to control non-compressible hemorrhage in the abdomen) on TBI outcomes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.057"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.057"
                                            },
                                            "Text": {
                                                "val": "Will validate novel biomarkers of TBI using human serum samples across the spectrum of TBI severity. Will refine drugs and drug treatment protocols to optimize outcome during the subacute (first two to three weeks following injury) and chronic (one to three months following injury) TBI recovery time frames."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No-significant change."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combat Critical Care Engineering"
                                    },
                                    "Description": {
                                        "val": "This effort supports development of diagnostic and therapeutic medical devices, algorithms, software, and data- processing systems for resuscitation, stabilization and life support, and development of improved critical care nursing practices. The aim is to improve care of severely injured or ill casualties during transport and in theater hospitals, and to develop and evaluate technologies to treat vital organ failure caused by traumatic injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.164"
                                            },
                                            "Text": {
                                                "val": "Will use an animal model of survivable lung injury to test effectiveness of various therapeutic approaches. Will validate the FDA-approved Resuscitation Burn Decision Support System for other indications. Will continue work from FY16 to develop clinical practice guidelines for en-route nursing care and for identification and management of sepsis. Will perform clinical studies to determine best practice to prevent pressure ulcer development during evacuation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.253"
                                            },
                                            "Text": {
                                                "val": "Evaluate inhalation delivery of stem cells to treat lung injury in animal model.  Continue to clinically evaluate means to prevent pressure ulcer development during evacuation.  Transition knowledge from enroute nursing care and sepsis (the condition or syndrome caused by the presence of microorganisms or their toxins in the tissue or the bloodstream) management to clinical practice guidelines.  Perform animal studies to determine effects of endovascular balloon occlusion of the aorta (used for control of intra-abdominal bleeding) on organ function to ensure use is optimized to prevent organ failure and death."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.583"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.583"
                                            },
                                            "Text": {
                                                "val": "Will conduct safety\/effectiveness study of miniaturized extracorporeal life support system in trauma burn patients with lung injury. Will conduct large animal studies of an automated type of endovascular balloon occlusion of the aorta (used for control of intra-abdominal bleeding) to determine its safety and ability to prevent organ failure. Will create evidence-based competency assessment program for combat casualty care skills for all provider levels. Will create centralized support system that includes best practice guidelines for evidence-based trauma management throughout continuum of care and supports telemedicine. Will evaluate performance of life-saving intervention prediction algorithm in intensive care environment. Will measure the performance of the Burn Resuscitation Decision Support System (a device that guides fluid resuscitation in patients with severe burns) technology in civilian burn centers. Will develop a model to predict wound closure rate and time to full closure in burn patients."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project 840 funding for Combat Critical Care Engineering research area increased to accommodate maturing technologies."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "945"
                    },
                    "ProjectTitle": {
                        "val": "BREAST CANCER STAMP PROCEEDS"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.594"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "0.594"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project receives funds as proceeds from the sale of Breast Cancer Stamps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Breast Cancer Stamp Proceeds"
                                    },
                                    "Description": {
                                        "val": "This is a Congressional Interest Item."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.594"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "97T"
                    },
                    "ProjectTitle": {
                        "val": "NEUROTOXIN EXPOSURE TREATMENT"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "16.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Peer-Reviewed Neurotoxin Exposure Treatment Parkinson's Research Program"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Neurotoxin Exposure Treatment."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Peer-Reviewed Neurotoxin Exposure Treatment Parkinsons Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "16"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "ET5"
                    },
                    "ProjectTitle": {
                        "val": "Adv Tech Dev in Clinical & Rehabilitative Medicine"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "11.207"
                        },
                        "CurrentYear": {
                            "val": "9.958"
                        },
                        "BudgetYearOne": {
                            "val": "9.015"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.015"
                        },
                        "BudgetYearTwo": {
                            "val": "2.663"
                        },
                        "BudgetYearThree": {
                            "val": "2.582"
                        },
                        "BudgetYearFour": {
                            "val": "3.108"
                        },
                        "BudgetYearFive": {
                            "val": "3.168"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "41.701"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports basic research on experimental models that are developed to support in-depth trauma research studies. This project includes studies to understand the healing of burned or traumatically injured tissues including eye, bone, nerve, skin, muscle, organs and composite tissues. Such efforts will minimize lost duty time and provide military medical capabilities for post-evacuation restorative and rehabilitative care.\n\nResearch conducted in this project focuses on clinical and rehabilitative medicine.\n\nWork in this project complements and is fully coordinated with Program Element (PE) 0602787A (Medical Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology, priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Clinical and Rehabilitative Medicine"
                                    },
                                    "Description": {
                                        "val": "This effort supports clinical studies to advance treatment and restoration strategies of traumatically-injured tissues, to include skin, nerve, bone and ocular (eye) tissue to ultimately restore function and appearance. Areas of interest for regenerative medicine include healing without scarring, repair of compartment syndrome (muscle and nerve damage following reduced blood flow caused by swelling), replacement skin, facial reconstruction and vision restoration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.207"
                                            },
                                            "Text": {
                                                "val": "Will execute preclinical studies of drug delivery, diagnostic, tissue repair, and\/or treatment strategies for traumatic eye injury and assess the preclinical safety and efficacy of promising strategies to facilitate clinical translation. Will conduct early human clinical trials to ensure the safety of an ocular bandage. Will further advance novel drug delivery, diagnostic, reconstructive, and regenerative strategies including the combination of novel biological materials and cell-based therapies (e.g. stem cells) to restore soft (e.g. skin, muscle, nerve, vascular) and bone tissue form and function toward clinical translation; will enhance promising approaches from FY 2016 by performing preclinical safety and efficacy evaluation of candidate strategies for burns, scarless wound healing, bone and soft tissue repair for application to the eyes, extremities, face, genitalia and abdominal body regions. Will continue to advance improved monitoring technologies for tissue rejection during hand and face transplant procedures and improved vascular technologies that reduce the requirement for vein harvest."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.958"
                                            },
                                            "Text": {
                                                "val": "Advance early human clinical trials to ensure the safety and efficacy of an ocular bandage designed to rescue vision post-injury.  Conduct pre-clinical investigation of engineered skin substitutes for regeneration of functional skin without scarring.  Conduct pre-clinical trials of devices for repairing traumatic injury to craniofacial and extremity tissues.  Evaluate candidate biological therapies and drugs for reduced need of immunosuppressive (inhibition of the immune response) therapies following hand and face transplants.  Advance translation of candidate technologies and biologics that create a wound environment more conducive to bone healing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.015"
                                            },
                                            "Text": {
                                                "val": "Will conduct advanced pre-clinical trials to ensure the safety and effectiveness of an ocular bandage designed to rescue vision post-injury. Will continue pre-clinical investigation of engineered skin substitutes for regeneration of functional skin without scarring. Will conduct pre-clinical trials of devices for repairing traumatic injury to craniofacial and extremity tissues. Will evaluate candidate biological therapies and drugs for reduced need of immunosuppressive (inhibition of the immune response) therapies following hand and face transplants. Will down-select identified candidate technologies and biologics that create a wound environment more conducive to bone healing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrement due to change in priority of Regenerative Medicine and Sensory Systems intramural efforts.  New Task Area created for Battlefield Pain Management to accelerate research of several potential novel drugs for elimination of acute and battlefield pain."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM2"
                    },
                    "ProjectTitle": {
                        "val": "MEDICAL ADVANCE TECHNOLOGY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Peer-reviewed military burn research."
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Medical Advanced Technology Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Military Burn Trauma Research Program"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MM3"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Medical Protection & Performance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.194"
                        },
                        "CurrentYear": {
                            "val": "20.218"
                        },
                        "BudgetYearOne": {
                            "val": "16.908"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.908"
                        },
                        "BudgetYearTwo": {
                            "val": "17.323"
                        },
                        "BudgetYearThree": {
                            "val": "18.697"
                        },
                        "BudgetYearFour": {
                            "val": "20.03"
                        },
                        "BudgetYearFive": {
                            "val": "20.43"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "133.800"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "FY19 the Physiological (human physical and biochemical functions) Health and Environmental Protection (Sleep Research\/ Environmental Monitoring) title changes to Physiological Health.  In FY19 the Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments title changes to Environmental Health & Protection."
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the medical and survivability technology areas of the future force with laboratory validation studies and field demonstrations of biomedical products designed to protect, sustain, and enhance Soldier performance in the face of myriad environmental and physiological (human physical and biochemical functions) stressors and materiel hazards encountered in training and operational environments. This effort focuses on demonstrating and transitioning technologies as well as validated tools associated with biomechanical-based health risks, injury assessment and prediction, Soldier survivability, and performance during continuous operations. \nThe four main thrust areas are:\n(1) Physiological Health, \n(2) Environmental Protection, \n(3) Injury Prevention and Reduction \n(4) Psychological (mental) Health and Resilience.\n\nThis project contains no duplication with any effort within the Military Departments and includes direct participation by other Services. The cited work is fully coordinated with Natick Soldier Research Development (NSRDEC), Natick, MA.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology, focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Physiological (human physical and biochemical functions) Health and Environmental Protection (Sleep Research\/Environmental Monitoring)"
                                    },
                                    "Description": {
                                        "val": "This effort supports and matures laboratory prototypes, nutritional interventions, and decision aids for the validation of physiological status and prediction of Soldier performance in extreme environments. This effort supports Capability Demonstration 1.b, Force Protection--Warfighter and Small Unit in FY2014-2016 and also supports capability demonstrations in the area of decreasing Warfighter physical burden in FY2014-2016. Starting in FY2019 this effort moves to Physiological Health."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.629"
                                            },
                                            "Text": {
                                                "val": "Will assess the impact of nutritionally optimized ration items on body composition and physiological status in Warfighters. Will determine the effectiveness of nutritional interventions (e.g. zinc, Omega-3 polyunsaturated fatty acids, etc.) for accelerating recovery from impact-acceleration head injury. Will begin modeling of cognitive performance with caffeine consumption based on reaction time data from laboratory studies. Will characterize intra-individual responsiveness under operationally relevant sleep-loss conditions. Assess physiological metrics (or biomarkers) that are associated with resilience and long term military career success."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.214"
                                            },
                                            "Text": {
                                                "val": "Evaluate the impact of nutritionally optimized ration items on body composition and physiological status in Warfighters. Demonstrate the effectiveness of nutrient and dietary strategies (e.g., omega-3 polyunsaturated fatty acids, zinc, and hydration) for reducing the vulnerability to and\/or accelerating the recovery from mild TBI. Validate and transition a novel mathematical method for estimating thermal-work strain from non-invasive measures such as heart rate, skin temperature, and heat flux. Deliver a testable Cold Weather Ensemble Decision Aid (CWEDA), to compare different clothing ensembles for predicting cold weather endurance. Perform initial field trials and demonstrations of Real Time Physiological Status Monitoring (RT-PSM) for the Chemical, Biological, Radiological, Nuclear and Explosive (CBRNE) and United States Marine Corps (USMC) communities. The RT-PSM system will enable real-time health surveillance and immediate recognition, characterization, and response to changes in force health status. Mature an anatomically-correct Finite Element Thermoregulatory Model (FETM), which is used to simulate regional thermal differences in human physiology (e.g., sweat rate, heat production) and clothing (e.g., thermal and vapor resistance), as well as human-clothing thermal interactions, enabling individualized predictions of human responses to environmental, mission, and load carriage stresses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Physiological Health and Environmental Protection (Sleep Research\/Environmental Monitoring) is due to: 1) movement of funding for Nutrition & Weight Balance, Nutritionally Optimized Food Products for an Expeditionary Force, Warfighter Physical Performance, Optimizing Mental Acuity STO, Cognitive Health & Performance to Physiological Health in order to reduce the number of R-Form Research Areas addressing Physiological Health; 2) movement of funding for Warfighter Physical Performance to Environmental Health and Protection in order to reduce the number of R-Form Research Areas addressing Environmental Health; 3) movement of funding for Blunt, Blast & Accelerative Injury to Injury Prevention & Reduction in order to reduce the number of R-Form Research Areas addressing Injury Prevention & Reduction."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physiological Health"
                                    },
                                    "Description": {
                                        "val": "This effort supports and matures laboratory prototypes, nutritional formulations and interventions, and decision aids for the validation of physiological status and prediction of Soldier performance in extreme environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.702"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.702"
                                            },
                                            "Text": {
                                                "val": "Will evaluate interventions to mitigate sleep loss and fatigue and improve individual and team performance in operational settings, including multi-domain battle scenarios. Will demonstrate effectiveness of transcranial electrical stimulation of the prefrontal cortex for enhancing learning through the consolidation of emotional memories. Will evaluate the utility and effectiveness of transcranial direct current electrical stimulation technologies as neurocognitive interventions for the enhancement of the recuperative sleep and the development of operationally relevant sleep strategies. Will validate dietary interventions for promoting satisfaction and healthy eating in dining facilities to ensure optimal health and performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Physiological Health is increased due to 1) movement of funding for Nutrition & Weight Balance, Nutritionally Optimized Food Products for an Expeditionary Force, Optimizing Mental Acuity and Cognitive Health & performance to this task; 2) reduced funding for Nutrition & Weight balance due to realignment from this task to the Nutritionally Optimized Food Products for an Expeditionary Force STO; 3) increased funding for the Nutritionally Optimized Food Products for an Expeditionary Force STO due to realignment of funds from Nutrition & Weight Balance; 4) increased funding for Optimizing Mental Acuity due to normal progression and completion\/closeout of the STO; 5 increased funding for Cognitive Health & Performance due to introduction and alignment of funds to a new subtask."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments."
                                    },
                                    "Description": {
                                        "val": "This effort supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Warfighter protection and sustainment across the operational spectrum. This effort provides the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimize physical and cognitive performance during cold-weather and hot-humid operations. Starting in FY19 this effort is combined into Environmental and Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.9"
                                            },
                                            "Text": {
                                                "val": "Will provide evidence-based practice recommendations; continue to validate more specific biomarkers of physiological adaptation, and mathematical models for optimizing health and performance against combinations of environmental threats. Will increase finger blood flow, fine-motor dexterity and thermal comfort using facial heating during exposure to cold air for integration into a microclimate heating prototype. Will validate a tool for modernizing dexterity assessment. The assessment instrument will capture many embedded cognitive and sensory components of dexterity such as problem solving, planning, attention, vision, tactile sensation, and proprioception (sense of how our bodies are positioned)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.953"
                                            },
                                            "Text": {
                                                "val": "Provide validated evidence-based practice recommendations for biomarkers of physiological adaptation and mathematical models for optimizing health and performance against combinations of environmental threats. Develop a portable, field- detection device capable of diagnosing target organ injury following exposure to extreme environments and assessing risk of adverse health effects and informing command return-to-duty decisions. Develop a mobile application for identifying megacity chemical threats and adverse health effects and informing Command decisions, Integrate patented skin temperature feedback technology into current microclimate cooling system. Improve cooling efficiency by increasing the microclimate cooling surface area in direct contact with skin."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Environmental Health and Protection - Physiological (human physical and biochemical functions) Awareness Tools and Warrior Sustainment in Extreme Environments is reduced due to movement of funding for Heat, Cold & Terrestrial Altitude to Environmental Health & Protection in order to reduce the number of R-Form Research Areas addressing Environmental Health and Protection."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Health & Protection"
                                    },
                                    "Description": {
                                        "val": "This effort supports and maturates non-invasive technologies, decision-aid tools, and models to enhance Soldier protection and sustainment across the operational spectrum. The aim is to provide the scientific basis for developing focused heating and cooling solutions to maintain fine motor dexterity, core temperature, and optimized physical and cognitive performance during cold-weather and hot-humid operations. This effort tests a computational algorithm for identifying latent hepatic, renal, and cardiac injury after toxic metal and\/or toxic industrial chemical exposure during training and operations. This effort tests models to predict likelihood of neurologic and\/or physical injury as a result of hazardous exposure(s) in the operational environment."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.804"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.804"
                                            },
                                            "Text": {
                                                "val": "Will provide evidence-based practice recommendations for protecting health and performance against combined environmental threats. Will develop enhanced next generation of predictive algorithms for incorporation into wearable sensor systems. Will transition the Cold Weather Ensemble Decision Aid (CWEDA) to PEO Soldier and US Army Alaska, for assessing and comparing different clothing ensembles for predicting cold weather endurance. Will validate prototype focused heating capability to improve manual dexterity for individuals in cold weather operations. Will transition prototypes such as the Heat Strain Decision Application (HSDApp) to JPEO-Chemical Biological Defense, PEO Soldier, and Army Public Health Center. Will evaluate modeling paradigms which identify population subgroups at increased risk of military operational exposure-related health responses. Will develop and enhance a next generation of health, readiness and performance predictive algorithms for incorporation into wearable sensors systems. Will validate assessment technologies\/tools for physical and\/or neurological health outcomes in operational environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, increased funding for Environmental Health and Protection is due to: 1) movement of funding for Heat, Cold & Terrestrial Altitude from Environmental Health and Protection - Physiological Awareness Tools and Warrior Sustainment in Extreme Environments, Operational Exposure Dosimetry for Neurological and Physical Health (actually named Environmental Toxicant Exposure) from Health Research and Warfighter Physical Performance from Physiological Health and Environmental Protection (Sleep Research\/Environmental Monitoring); 2) consistent funding for Heat, Cold & Terrestrial Altitude due to normal progression of the effort; 3) consistent funding for Environmental Toxicant Exposure due to normal progression of the effort; and 4) consistent funding for Warfighter Physical Performance due to normal progression of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Injury Prevention and Reduction"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates injury prediction tools and return-to-duty assessments for brain, spine, and chest injury from blast, blunt, and ballistic impact. This effort also addresses need for validated aeromedical standards and strategies to enable aircrew to effectively fight, navigate, and land under a range of degraded visual environments and provide aeromedical return to duty guidelines after neurosensory injury (deficits in the nervous system control of vision, hearing, taste, smell, and touch)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.718"
                                            },
                                            "Text": {
                                                "val": "Will validate objective assessment criteria for the prediction of central and peripheral acoustic and hearing-balance sensory nerve injury. Will validate metrics that predict the type and severity of blast induced eye and visual pathway injuries. Will develop and validate methodology and standards to guide the design of Warfighter eye protection compatible with modern military systems in aviation and enable optimal visual performance. Disseminate top clinical factors (disease\/injuries) that impact aircrew performance and provide recommendations to update policy papers. Will monitor and quantify the long-term effects of neurosensory injury on military occupational performance and the long term consequences of retaining Warfighters with previous neurosensory injuries. Will continue surveillance and documentation of best practices to improve and transition an updated neurosensory performance return to duty toolkit."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.299"
                                            },
                                            "Text": {
                                                "val": "Collect human middle ear reflex data to validate objective auditory injury risk models. Evaluate metrics that predict the type and severity of blast-induced eye and visual pathway injuries. Provide improved auditory protection standards and guidelines for speech discrimination, attenuation, and localization properties of active and passive hearing protection systems. Validate objective assessment criteria for the prediction of protective capabilities of current Authorized Protective Eyewear List (APEL) spectacles and goggles resulting from blast-wave forces using multiple low and high energy pounds per square inch (PSI) forces. Provide improved aeromedical standards for human performance during degraded visual environments. Evaluate pilot metrics under selected visual and physiological stress conditions. Evaluate how components of oldier tasks contribute to musculoskeletal injury and incorporate these data into predictive musculoskeletal injury risk models for improved injury prevention guidance. Finalize and publish the Return to Duty (RTD) Toolkit and distribute it to clinical providers to enable RTD decisions. Publish provisional biomedical-based spinal injury criteria and assessment methodologies for two types of vertebral body fractures that seated occupants of military vehicles experience during vertical exposure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.227"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.227"
                                            },
                                            "Text": {
                                                "val": "Will use human head impact\/blast and clinical diagnosis of mild traumatic brain injuries (mTBIs) within the training environment (e.g., airborne operations, combatives) to improve and validate mTBI prediction algorithms that can be used for the development of improved head protection systems. Will validate musculoskeletal injury risk models with data collected from training and theatre. Will also determine cervical spine injury risk (Head Supported Mass Criteria) leveraging methods used by personal protective equipment developers to measure impact of clothing and equipment such as the Army's Load Effects Assessment Program (LEAP). Will evaluate and extend current auditory injury risk models to include auditory nerve damage and begin to evaluate with advanced animal models. Will improve current guidance using results from computational models and animal studies for protective eyewear against blast threats that will inform the Authorized Protective Eyewear List (APEL). Validate medical requirements that will inform Army Aviation fitness for duty requirements"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, funding for Injury Prevention and Reduction decreased due to: 1) movement of funding for Blunt, Blast, & Accelerative Injury to this task; 2) eliminated funding for Sensory Performance, Injury & Protection in order to accelerate new priority programs within MRMC; 3) consistent funding for Musculoskeletal Injury due to normal progression of the effort; 4) reduced funding for Blunt, Blast & Accelerative Injury due to realignment of funds to a new sub-task within another CMI task; and 5) increased funding for Aircrew Health and Performance due to revised scope of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Psychological Health and Resilience"
                                    },
                                    "Description": {
                                        "val": "This effort supports and validates neurocognitive (relating to or involving the central nervous system and cognitive abilities) assessment and brain injury detection methods, and validates tools and preclinical methods to treat post-traumatic stress disorder in a military population. This effort also supports validation of interventions in Warfighters for post-traumatic stress disorder (PTSD), validation of biomarkers of individual PTSD symptoms, validation of methods to follow effectiveness of PTSD treatments, validation of neuroprotective (protection of nerves and nervous system) interventions and validation of strategies to prevent neurocognitive deficits (reduced ability to learn and comprehend) and symptomatology associated with brain injury."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.956"
                                            },
                                            "Text": {
                                                "val": "Will continue to expand the Systems Biology Enterprise PTSD biomarker research to identify the impact of treatment upon PTSD disease biomarkers and will begin relating biomarker change to specific interventions toward development of prescriptive intervention regimen. Will continue human research funding of randomized controlled trials of pharmacologic PTSD intervention (Rilouzal). Will continue animal model research focused upon identification of molecular level intervention targets for PTSD treatment and matching with available Food and Drug Administration (FDA) approved drugs (for off label use or Investigational New Drug (IND) consideration). Will produce a prototype mathematical model for concussion risk prediction (links likelihood of concussion to an impact or blast exposure) based on animal study data, data from high school and collegiate athletes, input from breacher blast-exposure studies and in-theater measurements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.667"
                                            },
                                            "Text": {
                                                "val": "Expand the Systems Biology Enterprise PTSD biomarker research effort to focus on identifying the impact of treatment on PTSD disease biomarkers and to relate changes in biomarkers to specific interventions toward the development of a prescriptive intervention regimen. Validate at least one novel neurocognitive target of aggression and a corresponding intervention tool. Develop and test a gaming-based neurocognitive optimization application. Validate a mobile app platform by directly comparing response rates and behavioral health benchmarks across standard paper-and-pencil and app-based behavioral health assessments (both individual and unit-based)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.175"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.175"
                                            },
                                            "Text": {
                                                "val": "Will refine the Unit Behavioral Health Needs Assessment tool with metrics from combat operations, non-combat operations, and garrison. Will evaluate an evidence-based, team-level intervention that positively influences Soldier outcomes related to behavioral health, resilience, and unit readiness through the regulation of small-team dynamics (e.g., group effect). Will evaluate effectiveness of experimental compounds for PTSD symptom alleviation. Will continue characterizations of PTSD subtyping and collection of treatment associated blood specimens for development of precision medicine approaches to PTSD treatment. Will transition assessment tools to providers to augment return-to-duty decisions. Will transition to behavioral health providers a web-based model for dissemination of research findings addressing evidence-based PTSD treatments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, slightly reduced funding for Psychological Health and Resilience is due to: 1) consistent funding for Behavioral Health, Wellness & Resilience due to normal progression of the effort; 2) reduced funding for Psychiatry & Clinical Psychology Disorders due to realignment of funds to new high priority programs within MRMC."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Health Research"
                                    },
                                    "Description": {
                                        "val": "This effort develops and validates novel tools and strategies to advance individualized operational exposure dosimetry (measures of exposure) and establish dose-response links between operational exposures and neurological and physical health. Dosimetry tools may include new technologies, human biomarkers objective physiologic markers, physiological modeling, and validated algorithms to evaluate the health effects of military service, including deployments, and methods to detect a Warfighters exposure to environmental contamination and\/or toxic substances, e.g. toxic industrial chemicals. Starting in FY19 this effort is combined into Environmental Health & Protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.991"
                                            },
                                            "Text": {
                                                "val": "Will quantify dose-response relationships to operationally-relevant exposures in military personnel population specifically to permethrin (synthetic chemical, an insecticide and insect repellent) and polycyclic aromatic compounds (created when products like coal, oil, gas, and garbage are burned but the burning process is not complete). Will provide model parameters for assessment of real-time personal dose levels to operationally relevant exposures among the high risk military job population subgroups. Will document the specific patterns of health outcomes following exposure to permethrin and other operationally relevant chemicals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.085"
                                            },
                                            "Text": {
                                                "val": "Quantify dose-response relationships to operationally-relevant exposures of permethrin (a synthetic chemical found in insect repellants) and polycyclic aromatic compounds (created from the incomplete combustion of animal or plant matter, or carbon fuels, such as coal) in the military personnel population. Provide pertinent model parameters for the assessment of real-time personal dose levels to operationally relevant exposures among the high-risk military job population subgroups. Evaluate longer-term neurological and\/or physical health trajectories associated with operationally relevant exposures during military service."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, reduced funding for Health Research due to movement of funding for Operational Exposure Dosimetry for Neurological and Physical Health to Environmental Health and wrapped up in the Environmental Toxicant Exposure CMI."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}