{
    "id": "2019-Army-PB-2040-JBOOK-3be08eef265cbf3fa6ee9f25bc102fc8e7dd36b72efeeb78b5538ece49603c5b-6",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604823A"
        },
        "ProgramElementTitle": {
            "val": "Firefinder"
        },
        "R1LineNumber": {
            "val": "115"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "6.177"
            },
            "CurrentYear": {
                "val": "45.605"
            },
            "BudgetYearOne": {
                "val": "45.473"
            },
            "BudgetYearOneBase": {
                "val": "45.473"
            },
            "BudgetYearTwo": {
                "val": "48.745"
            },
            "BudgetYearThree": {
                "val": "49.874"
            },
            "BudgetYearFour": {
                "val": "48.167"
            },
            "BudgetYearFive": {
                "val": "49.479"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "293.520"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program funds design, development and test of primary target acquisition and counterfire radars to automatically detect, locate and classify hostile indirect fire weapons (mortars, artillery, and rockets).  The program directly supports the prioritization, tracking and locating of targets, and dissemination of that information for simultaneous attack of multiple threats.  It provides the Warfighter with continuous and responsive counterfire target acquisition systems for all types and phases of military operations. Project L86, Lightweight Counter Mortar Radar (LCMR), version AN\/TPQ-50 provides 360 degrees of azimuth coverage from ranges of 500 meters to 10 kilometers. The AN\/TPQ-50 and AN\/TPQ-53 radars are currently fielded to multiple Continental United States (CONUS) and Outside Continental United States (OCONUS) locations to include operational support to Operation Inherent Resolve (OIR) and Operation Freedom's Sentinel (OFS).  Project L88, AN\/TPQ-53 is a highly mobile radar system that leverages the latest in technology design to accelerate technology infusion and increase range while improving false location rate, reducing obsolescence and increasing reliability. The AN\/TPQ-53 provides a system with increased range and accuracy throughout a 90 degree search sector (stare mode) as well as 360 degree coverage (rotating) for locating mortar, artillery and rocket firing positions.\n\nThe Fiscal Year FY 2019 Base funding in the amount of $9.856 million will support ongoing AN\/TPQ-53 test efforts and Army interoperability certifications (AICs), AN\/TPQ-50 and AN\/TPQ-53 development and testing of modernization efforts for electronic protection and new and emerging threats as well as the performance of technical assessments, concept studies, risk reduction and required documentation.\n\nStarting in FY 2019, program office core employee labor costs have been moved from RDTE to OMA as part of an OSD auditability directive.\n \nThis program line also funds development of an integrated Hypervelocity Armament System (HAS), and associated technologies as they mature to support accelerated demonstration and transition of advanced gun weapon systems, command guided maneuverable projectiles, and tactical sensors. The development of HAS would include advancing artillery powder guns firing Hypervelocity Projectiles (HVPs), resulting in next-generation, common, low drag, guided cannon artillery projectiles capable of completing multiple missions with improved cost effectiveness across different gun systems. Integration with a fire control radar and sensor array will allow closed-loop targeting of moving and relocatable targets beyond the range of conventional artillery. Current estimates for follow on development efforts achieve transitionable technology solutions by FY 2023.\n\nFiscal Year FY 2019 Base funding in the amount of $35.617 million will support the continued initiation of accelerated transition planning, contract requirements package development, system evaluation, requirements\/specification work, integration development and test plans for the Hypervelocity Armament System. The Army will leverage Strategic Capabilities Office (SCO) prototypes and technologies to continue transition from the FY 2018 program into programs of record."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.235"
                },
                "CurrentYear": {
                    "val": "45.605"
                },
                "BudgetYearOne": {
                    "val": "47.023"
                },
                "BudgetYearOneBase": {
                    "val": "47.023"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.177"
                },
                "CurrentYear": {
                    "val": "45.605"
                },
                "BudgetYearOne": {
                    "val": "45.473"
                },
                "BudgetYearOneBase": {
                    "val": "45.473"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-3.058"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.55"
                },
                "BudgetYearOneBase": {
                    "val": "-1.55"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.004"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-2.81"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.244"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 3"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.55"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.55"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 Congressional General Reduction of $0.004 million is for FFRDC for both Lightweight Counter Mortar Radar (LCMR) and Enhanced AN\/TPQ-36 ($0.002 million per program).\nFY 2017 Congressional Directed Reduction of $2.810 million for Enhanced AN\/TPQ-36 carryover.\nFY 2017 SBIR\/STTR Transfer is split between LCMR ($0.121 million) Enhanced AN\/TPQ-36 ($0.123 million).\n\nFY 2019 Other Adjustments 3 reflects the following decreases:\n   *LCMR - $0.167 million\n   *Hypervelocity Armament System (HAS) - $0.383 million\n   *Enhanced AN\/TPQ-36 - $1.122 million"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "L86"
                    },
                    "ProjectTitle": {
                        "val": "LIGHTWEIGHT COUNTER MORTAR RADAR (LCMR)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.064"
                        },
                        "CurrentYear": {
                            "val": "2.136"
                        },
                        "BudgetYearOne": {
                            "val": "4.194"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.194"
                        },
                        "BudgetYearTwo": {
                            "val": "4.913"
                        },
                        "BudgetYearThree": {
                            "val": "5.379"
                        },
                        "BudgetYearFour": {
                            "val": "3.459"
                        },
                        "BudgetYearFive": {
                            "val": "4.288"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "27.433"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The AN\/TPQ-50 Lightweight Counter Mortar Radar (LCMR) is a highly mobile radar that automatically detects, classifies, tracks, and locates the point of origin of projectiles fired from mortar, artillery, and rocket systems with sufficient accuracy for first round fire for effect.  It mitigates close combat radar coverage gaps by providing 360 degrees of azimuth coverage from ranges of 500 meters to 10 kilometers and is capable of being deployed in two configurations, standalone or vehicle mounted.  The AN\/TPQ-50 system interoperates with mission command systems (MCSs) to provide the maneuver commander increased counterfire radar flexibility.  The AN\/TPQ-50 is deployed as part of the Counter-Rocket, Artillery, Mortar (C-RAM) system of systems.  It provides data to the Forward Area Air Defense Command and Control (FAAD C2) node for the sense and warn force protection capability.  The AN\/TPQ-50 is currently fielded to multiple Continental United States (CONUS) and Outside Continental United States (OCONUS) locations to include support to Operation Inherent Resolve (OIR) and Operation Freedom's Sentinel (OFS).\n\nThe Fiscal Year (FY) 2019 Research, Development, Test and Evaluation (RDTE) funds of $4.194 million will continue the work required to enhance the AN\/TPQ-50's capability to address electronic protection against cyber electromagnetic activity (CEMA) and other known, new, emerging and evolving threats identified in the System Threat Assessment Report (STAR). This effort will develop and integrate sensor protect capabilities into the software baseline, develop advanced protection techniques which take advantage of hardware upgrades, and develop documentation for hardware and software capability improvements. Funding supports all associated testing costs and program support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Protection"
                                    },
                                    "Description": {
                                        "val": "The effort develops spectrum management techniques, mitigates electromagnetic interference (EMI) from commercial and military bands in addition to hostile EMI, and improves signal processor protection algorithms to defeat radar targeting armaments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.797"
                                            },
                                            "Text": {
                                                "val": "Funding will continue the developmental efforts to improve spectrum management, mitigate EMI from commercial and military bands, and includes associated testing costs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modernization & New and Emerging Threats"
                                    },
                                    "Description": {
                                        "val": "Program modernization effort which completes the development of hardware kits and develops advanced electronic protection techniques via software to combat CEMA.  This effort funds the development of capabilities to address vulnerabilities identified in the bi-annual release of the STAR and changes on the battlefield due to new tactics, techniques, procedures (TTPs) and\/or areas of operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.267"
                                            },
                                            "Text": {
                                                "val": "This will continue the work required to enhance the AN\/TPQ-50's capability to accurately detect, track and locate new threats to the warfighter and includes associated testing costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.136"
                                            },
                                            "Text": {
                                                "val": "This will continue the work required to enhance the AN\/TPQ-50's capability to address electronic protection against CEMA and other known, new emerging and evolving threats identified in the STAR. This effort will complete the development of the sensor protect effort and develop hardware modifications for technical refresh. Funding supports all associated testing costs and program support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.194"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.194"
                                            },
                                            "Text": {
                                                "val": "This will continue the work required to enhance the AN\/TPQ-50's capability to address electronic protection against CEMA and other known, new, emerging and evolving threats identified in the STAR. In addition, it integrates developed capabilities into the baseline, develops documentation for hardware and software capability improvements, and includes operational testing for capability improvements. Funding supports all associated testing costs and program support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Additional funding in FY 2019 supports increased development scope."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B05201"
                                    },
                                    "Title": {
                                        "val": "SSN:  B05201 Lightweight Counter Mortar Radar"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "125.145"
                                        },
                                        "CurrentYear": {
                                            "val": "20.459"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.165"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.165"
                                        },
                                        "BudgetYearFour": {
                                            "val": "8.326"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.38"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "170.475"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The AN\/TPQ-50 Lightweight Counter Mortar Radar was developed in 2009 to meet Training and Doctrine Command (TRADOC) Capabilities Production Document (CPD) requirements. A favorable full rate production (FRP) decision was achieved on 21 June 2013. The AN\/TPQ-50 is currently in full rate production; 400 systems have been procured to complete the program's current AAO requirement. \n\nThe Fiscal Year (FY) 2019 Research, Development, Test and Evaluation (RDTE) funds of $4.194 million will continue the work required to enhance the AN\/TPQ-50's capability to address electronic protection against CEMA and other known, new, emerging and evolving threats identified in the STAR. This effort will develop and integrate sensor protect capabilities into the software baseline, develop advanced protection techniques which take advantage of hardware upgrades, and develop documentation for hardware and software capability improvements. Funding supports all associated testing costs and program support."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management (Government Support)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Activities"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.279"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.303"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.082"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.164"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.164"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management (Contractor Support)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.2"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.364"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.372"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.379"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.379"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Electronic Protection"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.87"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.46"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.330"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.410"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Modernization & New and Emerging Threats"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.656"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.817"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.382"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.206"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.206"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support (Government)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Activities"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.751"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.12"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.445"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.445"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_L86.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Electronic Protection"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Modernization & New and Emerging Threats"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Government Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "RDT&E funded testing is required at the end of each development period."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L87"
                    },
                    "ProjectTitle": {
                        "val": "Hypervelocity Armament System (HAS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "36"
                        },
                        "BudgetYearOne": {
                            "val": "35.617"
                        },
                        "BudgetYearOneBase": {
                            "val": "35.617"
                        },
                        "BudgetYearTwo": {
                            "val": "35.587"
                        },
                        "BudgetYearThree": {
                            "val": "35.581"
                        },
                        "BudgetYearFour": {
                            "val": "35.576"
                        },
                        "BudgetYearFive": {
                            "val": "35.567"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "213.928"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Project L87 The Hypervelocity Armament System (HAS) and associated technologies are composed of advanced gun weapon systems, command guided maneuverable projectiles, and tactical sensors. The development of HAS would include advancing artillery powder guns firing Hypervelocity Projectiles (HVPs), resulting in a next generation, common, low drag, guided cannon artillery projectiles capable of completing multiple missions with improved cost effectiveness. Integration with a fire control radar and sensor array will allow closed-loop targeting of moving and relocatable targets beyond the range of conventional artillery. Current estimates for follow on development efforts achieve transitionable technology solutions by FY 2023.\n\nFY 2019 Base funding in the amount of $35.617 million supports the continued initiation of contract requirements package development, system evaluation, develop and integrate advanced gun systems, requirements\/specification work, integration development, howitzer gun system integration and test plans. The Army will leverage Strategic Capabilities Office (SCO) prototypes and technologies to continue transition from the FY 2018 program into programs of record."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hypervelocity Armament System (HAS)"
                                    },
                                    "Description": {
                                        "val": "The Hypervelocity Armament System (HAS) will integrate advanced artillery gun systems firing HVPs with closed loop fire control sensors to engage high value moving targets beyond common artillery ranges."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36"
                                            },
                                            "Text": {
                                                "val": "Supports the initiation of accelerated transition planning, contract requirements package development, system evaluation, and requirements\/specification work, integration development and test plans."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ARDEC\/SCO (Strategic Capability Office) initiated the Hypervelocity Program for FY 2018.  Program was shifted in FY 2019 to Self-Propelled Howitzer Systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Development"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for all development efforts on Hypervelocity Armament System (HAS) technology transitions."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.444"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.444"
                                            },
                                            "Text": {
                                                "val": "Finalize initial incremental technology transition requirements and specifications, contract requirements package development and begin execution of contracts and development. Continue support for system evaluation, requirement\/specification work, integration development and test plans, prototyping, and developmental testing for the Hypervelocity Armament System to include projectile, sensor arrays and radars, launch platforms, fire control software and tracking to verify and validate performance against high value threats at greatly increased ranges."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ARDEC\/SCO (Strategic Capability Office) operated the Hypervelocity Program in FY 2018.  It was transferred to Self-Propelled Howitzer Systems in FY 2019 and funding is broken out between Development and Program Management."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Funding is provided for all program management efforts on Hypervelocity Armament System (HAS)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.173"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.173"
                                            },
                                            "Text": {
                                                "val": "Begin the development for all required documents, office staff and engineering Integrated Product Team (IPT) development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "ARDEC\/SCO (Strategic Capability Office) operated the Hypervelocity Program in FY 2018.  It was transferred to Self-Propelled Howitzer Systems in FY 2019 and funding is broken out between Development and Program Management."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Army will leverage Strategic Capabilities Office (SCO) prototypes and technologies to continue transition from the FY 2018 program into programs of record.\n\nThe Army is transitioning prototype articles from the SCO demonstration to develop advanced gun systems, command guided maneuverable projectiles, and fire control sensors capable of engaging tactical range targets. Emerging requirements include communication suite changes, munitions updates, and introduction of new munitions require software and\/or hardware updates to ensure full compatibility and maintain operational viability."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HAS Product Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "36"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "30.456"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "30.456"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "66.456"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PM\/PEO"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "VARIOUS"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.161"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.161"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.161"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_L87.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Hypervelocity Armament System Development"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L88"
                    },
                    "ProjectTitle": {
                        "val": "Enhanced AN\/TPQ 36"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.113"
                        },
                        "CurrentYear": {
                            "val": "7.469"
                        },
                        "BudgetYearOne": {
                            "val": "5.662"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.662"
                        },
                        "BudgetYearTwo": {
                            "val": "8.245"
                        },
                        "BudgetYearThree": {
                            "val": "8.914"
                        },
                        "BudgetYearFour": {
                            "val": "9.132"
                        },
                        "BudgetYearFive": {
                            "val": "9.624"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "52.159"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The AN\/TPQ-53 Counterfire Target Acquisition Radar System is a highly mobile radar set that automatically detects, classifies, tracks, and locates the point of origin of projectiles fired from mortar, artillery, and rocket systems with sufficient accuracy for first round fire for effect.  It mitigates close combat radar coverage gaps by providing a 90 degree search sector (stare mode) as well as 360 degree coverage (rotating) and will replace the current AN\/TPQ-36 and AN\/TPQ-37 Firefinder Radars.  The AN\/TPQ-53 system interoperates with mission command systems (MCSs) to provide the maneuver commander increased counterfire radar flexibility.  The AN\/TPQ-53 is deployed as part of the Counter-Rocket, Artillery, Mortar (C-RAM) system of systems.  It provides data to the Forward Area Air Defense Command and Control (FAAD C2) node for the sense and warn force protection capability.  The AN\/TPQ-53 is fielded to multiple Continental United States (CONUS) and Outside Continental United States (OCONUS) locations to include support to Operation Inherent Resolve (OIR).\n\nThe Fiscal Year (FY) 2019 funds of $5.662 million will support ongoing test efforts, a tropical regions test, Army interoperability certifications (AICs), testing of modernization efforts for electronic protection and new and emerging threats as well as the performance of technical assessments, concept studies, risk reduction and required documentation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Test support"
                                    },
                                    "Description": {
                                        "val": "Funding is provided to support testing efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.742"
                                            },
                                            "Text": {
                                                "val": "Test activities to include engineering and customer tests, an adversarial assessment, and associated Program Management Office (PMO) and test support costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.325"
                                            },
                                            "Text": {
                                                "val": "Test activities to include a Tropical Regions test, Army Interoperability Certification (AIC) testing, engineering and customer tests, an adversarial assessment, and associated Program Management Office (PMO) and test support costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.662"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.662"
                                            },
                                            "Text": {
                                                "val": "Test activities to include a Tropical Regions test, AIC testing, engineering and customer tests, an adversarial assessment, associated PMO and test support costs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in FY 2019 due to increased test scope to test multiple software versions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Protection \/ Worldwide Interoperability for Microwave Access (WiMAX)"
                                    },
                                    "Description": {
                                        "val": "This effort funds the development of radio frequency (RF) management tactical decision aids that improve operational frequency band selection, radar emplacement, and signal processor protection algorithms to defeat radar targeting armaments. The effort also improves spectrum management and mitigates electromagnetic interference (EMI) from commercial and military bands in addition to hostile EMI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.891"
                                            },
                                            "Text": {
                                                "val": "Continue to mitigate EMI from military bands, hostile EMI, and the Worldwide Interoperability for Microwave Access (WiMAX) commercial spectrum; this includes associated Program Management Office (PMO) and test support costs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.353"
                                            },
                                            "Text": {
                                                "val": "Continue to mitigate EMI from military bands, hostile EMI, and the WiMAX commercial spectrum. Funding supports all associated testing costs and program support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 development efforts will be redirected to address increased test scope. EP\/WiMAX development efforts will continue in FY 2020."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "New and Emerging Threats"
                                    },
                                    "Description": {
                                        "val": "This effort funds the development of capabilities not included in the current requirement resulting from the bi-annual release of the STAR and changes on the battlefield due to new TTPs and\/or areas of operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.48"
                                            },
                                            "Text": {
                                                "val": "Continue developmental efforts to accurately detect, track, and locate new and emerging threats to the warfighter as a result of changes in the battlefield and areas of operation; this includes associated Program Management Office (PMO) and test support costs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.791"
                                            },
                                            "Text": {
                                                "val": "Continue developmental efforts to accurately detect, track, and locate new and emerging threats to the warfighter as a result of changes in the battlefield and areas of operation. Funding supports all associated testing costs and program support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 development efforts will be redirected to address increased test scope. New and emerging threats development efforts will continue in FY 2020."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B05310"
                                    },
                                    "Title": {
                                        "val": "SSN B05310 AN\/TPQ-53"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "297.509"
                                        },
                                        "CurrentYear": {
                                            "val": "329.057"
                                        },
                                        "BudgetYearOne": {
                                            "val": "327.321"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "162.121"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "165.2"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.12"
                                        },
                                        "BudgetYearThree": {
                                            "val": "5.972"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.279"
                                        },
                                        "BudgetYearFive": {
                                            "val": "30.244"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "1007.502"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The AN\/TPQ-53 leverages technology developed in the multi-mission radar advanced technology objective (ATO) program.  In 2006, the Government awarded a contract following full and open competition for the design of the AN\/TPQ-53 radar and the purchase of four non-recurring engineering (NRE) radars.  Twelve additional quick reaction capability (QRC) radars were purchased under the same contract in response to an urgent directed procurement in July 2008.  The Milestone Decision Authority (MDA) approved the acquisition of up to 20 more QRC radars.  Twenty systems were procured through two separate contract actions in 2010 and 2011.  A competitive production contract for Low Rate Initial Production (LRIP) systems was awarded in 2012 and options for additional systems were awarded in 2013, 2014, and 2015.  Production and delivery of all QRC\/Initial Production (IP) systems are complete, and production of LRIP systems is ongoing.  A Full Rate Production (FRP) decision was obtained in December 2015.  The FRP contract to fill the remainder of the Army Acquisition Objective (AAO) was awarded in March 2017.  Additionally, all initial production systems will be retrofitted to the FRP configuration.  The AAO was increased to 189 systems in May 2017; 142 systems have been procured to date. The FRP system deliveries will continue through fiscal year (FY) 2021.  The system will replace all of the AN\/TPQ-36 and AN\/TPQ-37 systems in the fleet.\n\n\nThe Fiscal Year (FY) 2019 funds of $5.662 million will support ongoing test efforts, a tropical regions test, Army interoperability certifications (AICs), testing of modernization efforts for electronic protection and new and emerging threats as well as the performance of technical assessments, concept studies, risk reduction and required documentation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management (Government)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.567"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.02"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.356"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.276"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.276"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management (Contractor)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.969"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Electronic Protection\/Worldwide Interoperability for Microwave Access (WiMAX)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.155"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.891"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.353"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "High Clutter Environment"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.34"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.340"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Low Quadrant Elevation (QE) Shots"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.865"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.865"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "New and Emerging Threats"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.154"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.48"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.791"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Signal Data Processor (SDP)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.992"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.992"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Global Positioning System (GPS) Military Code (M-Code)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.411"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Wireless Communication Upgrade"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Syracuse, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.942"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.942"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Georgia Tech Research Institute (GTRI)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Atlanta, GA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.926"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.07"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Activities"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "51.154"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.652"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.969"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.086"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.086"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_L88.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Initial Operational Test and Evaluation (IOT&E) 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Full Rate Production Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Test Support"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Electronic Protection\/Worldwide Interoperability for Microwave Access (EP\/WiMAX)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "EP\/WiMAX"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New and Emerging Threats"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "New & Emerging Threats"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "FY 2019 development efforts will be redirected to address increased test scope. Development efforts will continue in FY 2020."
                        }
                    }
                }
            ]
        }
    }
}