{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-2493f0919bca3c9887c2149e77e4bc805cb5ac3396a194d2f3cb8b6ccd5038c5-26",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604774D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Readiness Reporting System (DRRS)"
        },
        "R1LineNumber": {
            "val": "137"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "29.942"
            },
            "PriorYear": {
                "val": "4.672"
            },
            "CurrentYear": {
                "val": "6.941"
            },
            "BudgetYearOne": {
                "val": "6.661"
            },
            "BudgetYearOneBase": {
                "val": "6.661"
            },
            "BudgetYearTwo": {
                "val": "6.724"
            },
            "BudgetYearThree": {
                "val": "6.793"
            },
            "BudgetYearFour": {
                "val": "6.858"
            },
            "BudgetYearFive": {
                "val": "6.925"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This funding supports the Defense Readiness Reporting System, (DRRS,) the comprehensive readiness reporting system for the Department of Defense mandated under Title 10 U.S. Code.  The system measures in an objective, accurate, and timely manner the capability of the armed forces to carry out the National Security Strategy prescribed by the President, as well as the defense planning guidance provided by the Secretary of Defense and the National Military Strategy prescribed by the Chairman of the Joint Chiefs of Staff.  DRRS hosts information and applications used to support the Geographic and Functional Combatant Commanders, the Services, Combat Support Agencies, the Joint Staff and the Office of the Secretary of Defense.\n\nThe transformation of readiness reporting into a new, more comprehensive system under DRRS, presents a number of significant challenges.  Included in these challenges is the expansion in scope of the entities who can, and do report readiness, as well as what they report.  Shifting from solely resource centric readiness reporting to a mission\/capabilities based reporting system oriented towards the National Military Strategy (NMS) makes substantially more complex demands on readiness reporting, but portrays a far more relevant and holistic picture of readiness.  DRRS allows the Department to assess readiness globally based on our integrated ability to project and sustain a mix of constructed forces in simultaneous engagements.  Additionally, the challenges associated with sourcing and evaluating the readiness of our forces engaged in on-going real operations mean that force managers need applications that will query the entire Department for suitable, available organizations to meet current needs.  The need for these applications and the underlying data are a top priority for the DRRS project.\n\nThe realization of DRRS requires integrating a host of key technologies in order to achieve an information system that supports distributed, collaborative, and dynamic readiness reporting in addition to continuous tool-based assessment.  The holistic perspective of the application necessitates its need to operate in multiple domains.  Additionally, the highly complex data structures and visualization tools needed to support the Global Force Management - Data Initiative and critical down-stream consumers of readiness information, must now be implemented within DRRS."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.678"
                },
                "CurrentYear": {
                    "val": "6.941"
                },
                "BudgetYearOne": {
                    "val": "6.661"
                },
                "BudgetYearOneBase": {
                    "val": "6.661"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.672"
                },
                "CurrentYear": {
                    "val": "6.941"
                },
                "BudgetYearOne": {
                    "val": "6.661"
                },
                "BudgetYearOneBase": {
                    "val": "6.661"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.006"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.006"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "Service Requirement Review Board - As part of the Department of Defense reform agenda, the incremental reduction accounts for consolidation and reduction of service contracts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "774"
                    },
                    "ProjectTitle": {
                        "val": "Defense Readiness Reporting System (DRRS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "29.942"
                        },
                        "PriorYear": {
                            "val": "4.672"
                        },
                        "CurrentYear": {
                            "val": "6.941"
                        },
                        "BudgetYearOne": {
                            "val": "6.661"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.661"
                        },
                        "BudgetYearTwo": {
                            "val": "6.724"
                        },
                        "BudgetYearThree": {
                            "val": "6.793"
                        },
                        "BudgetYearFour": {
                            "val": "6.858"
                        },
                        "BudgetYearFive": {
                            "val": "6.925"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding supports Defense Planning Guidance (DPG) directing the Department of Defense (DoD) components to develop guidelines and procedures for a comprehensive readiness reporting system that evaluates readiness on the basis of the actual missions and capabilities assigned to the forces. The Defense Readiness Reporting System (DRRS) establishes a capabilities-based, adaptive, near real-time readiness information system for the DoD.  This system is being designed to measure the readiness of military forces and supporting infrastructure to meet missions and goals assigned by the Secretary of Defense.  DRRS hosts information and applications used to support the Geographic and Functional Combatant Commanders, the Services, Combat Support Agencies, the Joint Staff and the Office of the Secretary of Defense.\n\nDRRS expands the scope of readiness reporting within the Department to create a more comprehensive assessment of the total force and its capability to perform the tasks and missions required of it to support the National Military Strategy.  DRRS allows the Department to assess readiness globally based on our integrated ability to project and sustain a mix of constructed forces in simultaneous engagements.  The program is the keystone for the readiness enterprise and architected to embrace the implementation of the Global Force Management - Data Imitative (GFM-DI), allowing for the Department’s efforts in the realm of Adaptive Planning and Execution to be fully supported.\n\nThe realization of DRRS requires integrating a host of key technologies in order to achieve an information system that supports distributed, collaborative, and dynamic readiness reporting in addition to continuous tool-based assessment.  The primary technical goal is the creation of a highly reliable and securely integrated readiness data environment to leverage and extend current readiness information systems.  This system is based on intelligent agents, dynamic databases, semantic middleware, and publish\/subscribe concepts; providing a logically uniform view into the multiple databases and information sources that feed DRRS.  Through this type of advanced information environment, the DRRS dramatically expands the range of readiness information available to manage the force.  This environment supports a suite of analysis tools that allow users to explore the consequences of readiness deficiencies in terms of the ability to generate forces and assess transportation feasibility as it pertains to specific scenarios. These tools and tool suites harness the power of the information environment to make possible the kind of quick-turnaround, excursion-driven readiness assessment that is at the heart of DRRS."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "774  Defense Readiness Reporting System"
                                    },
                                    "Description": {
                                        "val": "DRRS is the primary means by which Defense components (Combatant Commands, Services, Agencies and their subordinate elements and units) report their readiness. The system measures readiness of the Department's components to execute the full range of missions assigned by the Secretary of Defense. \n\nThe Defense Readiness Reporting System (DRRS) establishes a capabilities-based, adaptive, near real-time readiness information system for DoD.  DRRS measures the readiness of military forces and supporting infrastructure to meet missions and goals assigned by the Secretary of Defense.  The realization of DRRS required integrating a host of key technologies to achieve an information system that supports distributed, collaborative, and dynamic readiness reporting in addition to continuous tool-based assessment.  The primary technical goal was the creation of a highly reliable and securely integrated readiness data environment to leverage and extend current readiness information systems.  DRRS contains readiness metrics and supporting data for forces and support organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.672"
                                            },
                                            "Text": {
                                                "val": "• Continue refinement of data architecture\n• Continue development and refinement of the Air Force Input Tool\n• Continue full integration of GFM DI within DRRS\n• Support the integration of JPES and integration with APEX \n• Data quality improvement and latency improvement \n• Commence replacement of vulnerable & legacy software components for required cyber security \n• Continue development and integration with Interagency readiness and preparedness systems outside DoD."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.941"
                                            },
                                            "Text": {
                                                "val": "• Optimize system implementation within the Defense Enterprise Computation Center environment to include development of functionality need to replace Enterprise Messaging\n• Continue full integration of GFM DI within DRRS\n• Continue replacement of vulnerable & legacy software components\n• Implement functionality to support the needs of the Adaptive Planning and Execution initiatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.661"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.661"
                                            },
                                            "Text": {
                                                "val": "• Continue replacement of vulnerable & legacy software components\n• Optimize program architecture to make use of hosting technology advancements \n• Incorporate functionality enhancements required by evolving readiness reporting needs\n• GFM DI \"next steps\" development\n• Air Force Input Tool Enhancements"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The program's increased costs stem from a greater level or required developmental activities during FY 2019. These activities include the replacement out date core components such as SQL Server and Windows Server, with current, more secure versions, as well as hosting costs associated with the program's architectural changes."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Readiness Transformation - Accurate and timely Mission Readiness Assessment and Reporting\n• Capability Readiness Reporting and Assessment - Operational commonality of mission based capability readiness reporting and assessment\n• DRRS Operational Performance - Single integrated Readiness system capability for the Department\n• Achieving Reliable Data Architecture and Interoperability - Seamless integration with the departments readiness architecture and compatible with emerging adaptive planning systems\n• Transition to one readiness reporting system for DoD."
                        }
                    }
                }
            ]
        }
    }
}