{
    "id": "2019-Army-PB-2040-JBOOK-d3d3f82921b489871a1a4e67a87dc7ea6efd7f320a6682df27ed06f0007d5b08-49",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0708045A"
        },
        "ProgramElementTitle": {
            "val": "INDUSTRIAL PREPARDEDNESS"
        },
        "R1LineNumber": {
            "val": "233"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "59.891"
            },
            "CurrentYear": {
                "val": "60.877"
            },
            "BudgetYearOne": {
                "val": "53.958"
            },
            "BudgetYearOneBase": {
                "val": "53.958"
            },
            "BudgetYearTwo": {
                "val": "59.848"
            },
            "BudgetYearThree": {
                "val": "61.071"
            },
            "BudgetYearFour": {
                "val": "62.543"
            },
            "BudgetYearFive": {
                "val": "63.749"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "421.937"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) develops, demonstrates, and transitions manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army ground and air platforms, Soldier systems, weapons systems, air & missile defense systems, and sensors and electronics.  Initiatives within the PE result in cost savings and reduced risk of transitioning military-unique manufacturing processes into production. Project E25 fosters the transfer of new\/improved manufacturing technologies to the industrial base, including manufacturing efforts that have potential for high payoff across the spectrum of Army systems. \n\nWork in this PE is related to, and fully coordinated with, PE 0603710A (Night Vision Advanced Technology), PE 0602303A (Missile Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603002 (Medical Advanced Technology), and PE 0602705A (Electronics and Electronic Devices).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy. \n\nWork in this PE is performed by: the U.S. Army Research Development and Engineering Command (RDECOM), Aberdeen Proving Ground, MD; The U.S. Army Medical Research and Materiel Command (MRMC), Ft. Detrick, MD; and the Army Space and Missile Defense Command\/Army Forces Strategic Command (SMDC\/ARSTRAT), Huntsville, AL."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "62.287"
                },
                "CurrentYear": {
                    "val": "60.877"
                },
                "BudgetYearOne": {
                    "val": "59.083"
                },
                "BudgetYearOneBase": {
                    "val": "59.083"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "59.891"
                },
                "CurrentYear": {
                    "val": "60.877"
                },
                "BudgetYearOne": {
                    "val": "53.958"
                },
                "BudgetYearOneBase": {
                    "val": "53.958"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.396"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-5.125"
                },
                "BudgetYearOneBase": {
                    "val": "-5.125"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.366"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.125"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.125"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.03"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "E25"
                    },
                    "ProjectTitle": {
                        "val": "Mfg Science & Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "59.891"
                        },
                        "CurrentYear": {
                            "val": "60.877"
                        },
                        "BudgetYearOne": {
                            "val": "53.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "53.958"
                        },
                        "BudgetYearTwo": {
                            "val": "59.848"
                        },
                        "BudgetYearThree": {
                            "val": "61.071"
                        },
                        "BudgetYearFour": {
                            "val": "62.543"
                        },
                        "BudgetYearFive": {
                            "val": "63.749"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "421.937"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops and demonstrates manufacturing processes that enable improvements in producibility and affordability of emerging and enabling components and subsystems of Army ground and air platforms, Soldier systems, weapons systems, air & missile defense systems, and sensors and electronics. Focus is on components and subsystems such as advanced armor, lightweight structural components, sensors, propellants, and gun tubes. In addition, work is conducted to advance the state of the art in processing and fabrication techniques for coatings, multifunctional materials, and structural elements for Army specific applications.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science & Technology focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Long Range Precision Fires"
                                    },
                                    "Description": {
                                        "val": "The effort funds manufacturing improvements to support areas such as Advanced Weapon Systems, Fire Control, and Advanced Energetics and Warheads. Work focuses on addressing challenges in areas such as enhanced missile seekers; fuses and initiators for munitions; and boring, honing, and rifling cannon and mortar barrels."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.869"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.869"
                                            },
                                            "Text": {
                                                "val": "Will complete development of manufacturing processes for battery free initiators for scatterable munitions; develop methods to manufacture large caliber canon-boring tools at reduced cost; develop safer and more cost effective methods for mixing and packing of propellants; develop enhanced processes to fabricate large-caliber cannon and mortar tubes with longer range and higher durability than existing systems; and complete development of manufacturing technologies for complex missile seekers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of effort.  Continues work from Lethality."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Combat Vehicle (Formerly Ground Maneuver)"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for tactical and combat vehicles and weapons systems. Work focuses on addressing challenges in areas such as advanced armor, lighter weight components, insensitive propellants, precision munitions, and vehicle power devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.088"
                                            },
                                            "Text": {
                                                "val": "Will conduct pilot line fabrication of ceramic tile-based armors utilizing automated material consolidation techniques for vehicle armor solutions; will demonstrate and transition a gear machining pilot line capability at MRL 8 associated with cost-effective power-take-off systems to PM-ABCT; will demonstrate magnesium alloy manufacturing processes, to include additive manufacturing, on novel vehicle and small arms components; will demonstrate, validate and implement an instrumented bullet assembly process for producing XM1158 projectiles; will mature final formulations, confirm batch productions, and perform validations of paint products used for infrared management solutions; will mature a cathode coating process and enhance electrolyte optimization in the production of high energy density safe 5 volt lithium-ion batteries; will continue maturation of a manufacturing line and associated processes for adaptive protection modules; will demonstrate an automated, optimized and flexible process for manufacturing light weight, longer lasting aluminum Metal Matrix Composites (MMC); will demonstrate an agile manufacturing cell capable of efficiently welding thicker plate materials for improved protection for armored multi-purpose vehicle and other vehicles; will mature a lithium-ion battery assembly line leveraging multiple battery form factors leading to reduced cost and increased throughput; will complete the manufacturing process and demonstration maturity of Wide-Band Gallium Nitride MMIC?s for non-lethal weapon systems arrays."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.244"
                                            },
                                            "Text": {
                                                "val": "Fabricate hatch and ramps for demonstration on selected vehicles, document and transition magnesium alloy ballistic specifications; demonstrate a cathode coating process and enhanced production of high energy density safe 5 volt lithium-ion batteries for use in Army ground vehicle systems; prove out and deliver a manufacturing line and associated processes for adaptive protection modules; transition improved rocket nozzle insulation processes to PM Precision Fires; construct an agile manufacturing cell and sensor suite to demonstrate efficient welding of thicker plate materials used for armored multi-purpose and other vehicles; continue development of a lithium-ion battery pilot line leveraging multiple battery form factors leading to reduced cost and increased throughput; research novel joining technology processes that will replace existing steel components leading to lighter heavy combat vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.875"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.875"
                                            },
                                            "Text": {
                                                "val": "Will develop manufacturing technology to reduce the cost and improve the performance of weight sensitive armor protection systems against future threats; demonstrate manufacturing technologies to reduce cost and improve performance when joining dissimilar materials for ground platform structural components; develop manufacturing techniques for ground vehicle powertrain components with improved efficiency and power density."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Future Vertical Lift (Formerly Air Systems)"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable manned and unmanned aircraft components and subsystems. Work focuses on addressing challenges in areas such as engine performance and life, ballistically tolerant fuel bladders and composite transmission sumps, reliable component integration\/attachment, structural durability at low weight, sensors for aircraft protection and pilotage, and reduced corrosion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.373"
                                            },
                                            "Text": {
                                                "val": "Will complete component and engine testing of additively manufactured articles resulting in increased performance and reduced weight of the T700 platform; will transition three prototype AH-64 composite sumps of reduced weight and cost to PM Apache along with associated manufacturing metrics; will complete the demonstration of manufacturing techniques and tooling for ballistically tolerant fuel bladders including fit check, drop testing , pressure test, slosh & vibe tests on full scale article."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.557"
                                            },
                                            "Text": {
                                                "val": "Transition to Utility Helicopters Project Office for qualification testing direct digitally manufactured helicopter engine components of additively manufactured articles resulting in increased performance and reduced weight of the T700 platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.592"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.592"
                                            },
                                            "Text": {
                                                "val": "Will investigate novel manufacturing methods for fabrication of composite material air platform components with reduced weight and improved fatigue resistance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Networks and Command, Control, Communications and Intelligence (Formerly Command, Control, Communications and Intelligence Systems)"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems for intelligence, surveillance, reconnaissance and targeting systems, mission command systems, electronic warfare and improved explosive device detect\/defeat systems. Work focuses on addressing challenges in areas such as large format multi-color focal plane arrays, flexible displays, night vision sensors, target detectors, advanced antennas and sensors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.271"
                                            },
                                            "Text": {
                                                "val": "Will refine manufacturing process and conduct qualification lot runs in the fabrication of infrared sensors used in the application of low-cost, miniaturized short-wave infrared cameras; will complete yield improvement processes and production qualifications of focal plane arrays applicable to high definition cameras for sniper weapon sights and ground vehicles; will mature millimeter wave packaging improvements to include module development and antenna\/module interface advancements of devices used in radio frequency threat warning applications in air combat  platforms; will transition a production-ready, high yield manufacturing process for large format longwave, dual -band infrared focal plane arrays for vision systems; will mature a manufacturing process to produce ultra-thin, lightweight, wide-band conformal antennas; will conduct optimization for 3D, read-only integrated circuit manufacturing process resulting in sensors with improved sensitivity and dynamic range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.678"
                                            },
                                            "Text": {
                                                "val": "Transition improved processes for 12um focal plane arrays used in high definition cameras to Project Manager (PM) ? Soldier Sensors and Lasers; deliver to PM Aircraft Survivability Equipment millimeter wave packaging improvements to include module development and antenna\/module interface advancements of devices used in radio frequency threat warning applications in air combat platforms; continue optimization of a manufacturing process to produce ultra-thin, lightweight, wide-band conformal antennas; continue refining and validating a 3D, read-only integrated circuit manufacturing process resulting in sensors with improved sensitivity and dynamic range; improve assembly processes utilizing epoxies that resist high shocks & temperature cycling for weapon boresight systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.314"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.314"
                                            },
                                            "Text": {
                                                "val": "Will complete optimization of manufacturing process to produce ultra-thin, wide-band, conformal antennas for Army platforms; investigate process improvements for digital imagers and sensors for aviation protection and pilotage."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort.  Work continues in Future Vertical Lift and Soldier Lethality."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air & Missile Defense"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing improvements to support areas such as High Energy Laser system components (e.g. diodes, optics), interceptor components, and armament systems for counter-unmanned aerial systems and counter-rocket, artillery, and mortar systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.592"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.592"
                                            },
                                            "Text": {
                                                "val": "Will develop processes to improve manufacturing yield for high energy laser diodes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of effort.  Continues work from Lethality."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Lethality (Formerly Soldier Systems)"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable components and subsystems in areas such as combat feeding, aerial delivery of supplies, expeditionary basing, Soldier-borne sensors, clothing, and protective equipment. Work focuses on addressing challenges in areas such as multifunctional fabrics for shelters, uniforms and portage equipment; affordable, non-contaminating packaging for rations; lightweight materials for body armor; and medical technologies such as biotechnology and vaccine production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.42"
                                            },
                                            "Text": {
                                                "val": "Will develop and demonstrate a full scale manufacturing pilot along with test articles (flat panels, helmets, and torso plate prototypes) developed from polyethylene films; will optimize and transition a high-volume pilot manufacturing process for lower-cost flame retardant materials with biocidal modular insulation panels to PM Force Sustainment Systems; will mature a scaled-up, low cost , high yield, high throughput manufacturing process of gallium arsenide based solar cells enabling light weight, portable Soldier power sources; will mature a manufacturing process for low cost augmented reality eyepieces that provide the Soldier with high resolution imagery across a wide field of view for increased situational awareness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.554"
                                            },
                                            "Text": {
                                                "val": "Transition to Soldier protection systems programs of record a full scale manufacturing pilot line developed for polyethylene films; build a continuous reactor to demonstrate high yield manufacturing processes for gallium arsenide based solar arrays for portable Soldier power sources; refine manufacturing processes in the production of low cost augmented reality eyepieces that provide the Soldier with high resolution imagery across a wide field of view for increased situational awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.167"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.167"
                                            },
                                            "Text": {
                                                "val": "Will develop manufacturing techniques for flexible light-weight solar cells, low cost freeform prism eyepieces, and components for Infantry sighting systems; develop manufacturing process improvement techniques for optical coatings and optical components to reduce cost and improve performance; complete characterization of a scaled up process for Adenovirus vaccine production."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort. Continues work from Medical and Networks and Command, Control, Communications and Intelligence."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cross-cutting"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances with impact across processes or platforms of Army interest. Work focuses on addressing challenges in areas such as advanced additive manufacturing technologies for fabrication of weapons systems, platforms, and munitions; and novel manufacturing techniques for expedient and cost effective repair of worn or damaged platform components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.42"
                                            },
                                            "Text": {
                                                "val": "Will mature application of dissimilar metals for repaired aviation components, integrating in-process quality assurance methods and procedures to maximize reliability of high-value aviation components; will demonstrate and deliver processes and tooling requirements of 2D and 3D additively manufactured energetics and electronics for use in 40mm grenades; will begin the transfer of a laser enhanced net shaping (LENS) repair process to Anniston Army Depot in the qualification and reclamation of Army components; will mature Model Based Enterprise tools which include legacy technical data package updating, forensic manufacturing, and integration of DoD\/Army requirements; will demonstrate a software based module capable of aiding production engineers across the organic industrial base and S&T community to verify and implement best value part manufacturing programs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.643"
                                            },
                                            "Text": {
                                                "val": "Complete delivery to PM MAS processes and tooling requirements of 2D and 3D additively manufactured energetics and electronics for use in 40mm grenades; demonstrate a laser enhanced net shaping repair process at Anniston Army Depot for the qualification and reclamation of Army components; perform modeling and simulation for cold spray repair processes to reduce the sustainment cost of Army weapon systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.549"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.549"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advanced additive manufacturing capabilities for the build, remanufacture, and life extension of critical weapon systems components to improve performance, allow fabrication of structures not possible thorough subtractive methods, and\/or improve component affordability; demonstrate an integrated augmented reality solution for advanced machining."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Lethality"
                                    },
                                    "Description": {
                                        "val": "The effort funds manufacturing improvements to support areas such as  Advanced Weapon Systems, Fire Control, Logistics, Emerging Technologies, and Advanced Energetics and Warheads. Work focuses on addressing challenges in areas such as enhanced missile seekers; fuses and initiators for munitions; and boring, honing, and rifling cannon and mortar barrels."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.319"
                                            },
                                            "Text": {
                                                "val": "Will define manufacturing methods for new imaging technologies associated with the development of affordable multi-mode, all weather missile seekers; will characterize thermal and mechanical pre-impregnated material properties of rocket nozzle insulation; will mature an automated, scaled-up manufacturing process for programmable initiators addressing requirements for Family of Scatterable Munitions (FASCAM); will demonstrate a cost-effective, high throughput, Spark Plasma Sintering process to reduce cost and lead-times for large caliber cannon broaches and ordnance metal cutting tools; will demonstrate an additive manufacturing process capable of printing energetic inks for next generation hand grenades and small munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.1"
                                            },
                                            "Text": {
                                                "val": "Improve manufacturing methods, conduct materials analysis and demonstrate more efficient production processes that enable multi-mode missile seekers; build and test prototype programmable initiators of an automated, scaled-up manufacturing process addressing requirements for Family of Scatterable Munitions (FASCAM); develop smart tooling and process models of a software-based module capable of aiding production engineers across the organic industrial base and S&T community to verify and implement best value part manufacturing programs; fabricate disk components and test components to demonstrate spark plasma sintering process to reduce costs and lead times for large caliber cannon broach cutting tools; demonstrate processes on internal components that validate suitable energetic inks in the production of next generation hand grenades and small munitions; mature the manufacturing processes for the fabrication of small format liquid reserve batteries which support small to medium caliber munitions and hand emplaced munitions; mature waterjet milling to produce the rifling in large caliber cannon tubes in order to replace the expensive broaching process; investigate advanced manufacturing techniques for small caliber lightweight cartridge cases."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort. Work from this effort is continues in Long Range Precision Fires and in Air & Missile Defense."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical"
                                    },
                                    "Description": {
                                        "val": "This effort funds manufacturing technology advances needed for more affordable process methods in areas such as manufacturing of lighter weight multi-functional materials, biotechnology, vaccines, medical equipment power sources, and component ruggedization that directly address Soldier rehabilitation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate a modernized, scaled-up production process addressing spray drying and encapsulation methods of the Adenovirus vaccine."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.101"
                                            },
                                            "Text": {
                                                "val": "Produce test batches in the development of a modernized, scaled-up production process addressing spray drying and encapsulation methods of the Adenovirus vaccine."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of effort.  Work continues in Soldier Lethality."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Not applicable for this item."
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.018"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.018"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TBD"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "231.921"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "59.891"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "60.859"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "53.958"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "53.958"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "406.629"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260716_E25.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}