{
    "id": "2019-Navy-PB-1319-MJBOOK-3-0-1cb3285e5eb3096a00efd774d79545d93ed7b90effed5e9c90908e9fa9d3e340-19",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0606355N"
        },
        "ProgramElementTitle": {
            "val": "(U)Warfare Innovation Management"
        },
        "R1LineNumber": {
            "val": "202"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "14.846"
            },
            "CurrentYear": {
                "val": "28.841"
            },
            "BudgetYearOne": {
                "val": "41.918"
            },
            "BudgetYearOneBase": {
                "val": "41.918"
            },
            "BudgetYearTwo": {
                "val": "36.877"
            },
            "BudgetYearThree": {
                "val": "37.714"
            },
            "BudgetYearFour": {
                "val": "47.726"
            },
            "BudgetYearFive": {
                "val": "43.596"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Beginning in FY19, Allied\/Coalition Interoperability and Information Dominance (ACIID) (now called Allied\/Coalition Maritime Environment (ACME)) Project 0798, Space & Electronic Warfare (SEW) Engineering Project 2144, and Intelligence, Surveillance, and Reconnaissance (ISR) Architecture Project 2147 were realigned from PE 0604707N to PE 0606355N."
        },
        "ProgramElementMissionDescription": {
            "val": "The FY 2019 funding request for project 2144 was reduced by $2.222 million and project 3319 was reduced by $1.840M to account for the availability of prior year execution balances.\n\nAllied\/Coalition Interoperability and Information Dominance (ACIID) project now called Allied\/Coalition Maritime Environment (ACME) 0798:\nThis project promotes interoperability with allied and coalition forces by facilitating maritime interoperability in both processes and communication systems, including emerging capabilities, to counter growing high-end asymmetric threats. \n\nSpace & Electronic Warfare (SEW) Engineering 2144:\nThis project is a systems engineering non-acquisition program to develop, test, implement Technical Authority (TA) products, and validate Naval Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System architectures to support naval, Joint and Coalition missions across normal, contested, and degraded cyber\/operational environments.  The objective of this project is carried out by multiple tasks that ensure development and delivery of naval Information Warfare (IW) capabilities that are well-integrated, interoperable, secure, and resilient to meet validated warfighting requirements.  \n\nThe Intelligence, Surveillance, and Reconnaissance (ISR) Architecture 2147:\nThis project is intended to guide system of systems capability development and promote interoperability across Navy ISR programs, as well as interoperability and alignment with Department of Defense (DoD)-wide enterprise initiatives including Joint Information Environment (JIE) and Intelligence Community (IC) Information Technology Environment (ITE). This effort to develop integrated ISR architectures will also help instill systems engineering discipline and standardization across the Navy ISR Enterprise and provide a means by which to assess ISR POR progress in conforming to a single Navy architecture.\n\nFleet Experimentation 3319:  \nThe U.S. Navy's Fleet Experimentation (FLEX) project advances\/augments operational and tactical warfighter capabilities through the experimentation of high payoff initiatives, technologies and concepts, Fleet Concepts of Operations (CONOPS), doctrine, and new tactics, techniques and procedures (TTP). The main focus of FLEX between 2018 and 2023 is to operationalize \"A Design For Maintaining Maritime Superiority\" Blue Line of Effort (LOE) through the execution of Fleet Design materiel\/non-materiel capability employment.  \n\nTrident Warrior Project 3320: \nThe U.S. Navy's FLEX Trident Warrior (TW) experimentation campaign enables early delivery of capabilities to the warfighter via Fleet-directed Trident Warrior operational events with an emphasis on United States Fleet Forces\/Commander Pacific Fleet (USFF\/CPF) directed focus areas.  Trident Warrior was transferred from 0604231N (Tactical Command Systems) to 0606355N (Warfare Innovation Management) in FY17.\n  \nMaritime Communications Demonstration Project 3420:\nClassified Project Maritime Communications Demonstration (MCD) is not a new start.  Funding was realigned from project 3319 FLEX in FY18. The Expeditionary SFOC Communications is developing and experimenting innovative concepts designed to validate both materiel and non-materiel methodologies to provide resilient command and control within the maritime domain.  Identified previous work done within OSD channels, and will leverage lessons learned."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "21.123"
                },
                "CurrentYear": {
                    "val": "28.841"
                },
                "BudgetYearOne": {
                    "val": "19.529"
                },
                "BudgetYearOneBase": {
                    "val": "19.529"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.846"
                },
                "CurrentYear": {
                    "val": "28.841"
                },
                "BudgetYearOne": {
                    "val": "41.918"
                },
                "BudgetYearOneBase": {
                    "val": "41.918"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.277"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "22.389"
                },
                "BudgetYearOneBase": {
                    "val": "22.389"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.570"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "22.601"
                                },
                                "BudgetYearOneBase": {
                                    "val": "22.601"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.001"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.212"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.212"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Directed Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.700"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request for project 2144 was reduced by $2.222 million and project 3319 was reduced by $1.840M to account for the availability of prior year execution balances.\n\nFunding added to FY19 for Navy Additive Manufacturing (AM) technology to aligns to CNO priorities to deliver revolutionary capabilities to improve fleet readiness.  These enterprise solutions will provide the foundation to (1) enhance warfighter capability through new innovative system designs; (2) increase readiness through low volume production of hard to source items; and (3) improve warfighting capacity by enabling production at or near the point of need."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0798"
                    },
                    "ProjectTitle": {
                        "val": "Allied\/Coalition Interoperability and Information Dominance (ACIID)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.076"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.076"
                        },
                        "BudgetYearTwo": {
                            "val": "1.062"
                        },
                        "BudgetYearThree": {
                            "val": "0.983"
                        },
                        "BudgetYearFour": {
                            "val": "1.001"
                        },
                        "BudgetYearFive": {
                            "val": "1.021"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Project title changed as follows:  Allied\/Coalition Maritime Environment (ACME) (Previously called Allied\/Coalition Interoperability and Information Dominance (ACIID) in FY17 and prior.)"
                        },
                        "ProjectMissionDescription": {
                            "val": "The ACME program advances Information Warfare (IW) (to include Command, Control, Communications, Computers; Intelligence, Surveillance and Reconnaissance (C4ISR); Electronic Warfare (EW); and Cyber Warfare), interoperability with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS), North Atlantic Treaty Organization (NATO), and other Allied and Coalition partners. The program determines maritime operational gaps with our allies, identifies Doctrine, Organization, Training, Material, Leadership, Personnel, and Facilities (DOTMLPF) solutions with the potential to fill those gaps, and assesses these solutions and associated concepts of operation in laboratory and at-sea environments. The ACME program includes integration and testing in support of joint and Allied war fighting capabilities, including interoperability testing of IW equipment. Allied and joint interoperability is critical for future maritime operations, especially as the United States Navy (USN) expands Internet Protocol (IP) networking throughout the fleet via Consolidated Afloat Networks and Enterprise Services (CANES), Next Generation Networks (NGEN), Mission Partner Environment\/ Future Mission Networking (MPE\/FMN), the U.S. Battlefield Information Collection and Exploitation System - eXtended (BICES-X), and with the Joint Information Environment (JIE).\nCurrently, IP connectivity with AUSCANNZUKUS and other Allied\/Coalition forces is limited, requiring extensive backhaul through ashore infrastructure. Higher bandwidth solutions suitable for use over tactical networks require development and assessment for emerging coalition and joint interoperability requirements, such as Maritime Domain Awareness (MDA), Network Operations Without Shore (NOWS), Satellite Communications (SATCOM) Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations, and to counter Anti-Access Area Denial (A2\/AD) threats. Increases in data throughput are required for the effective exchange of rich IW data sets and services via Service Oriented Architectures (SOA) within the limitations of High Frequency (HF), Ultra-High Frequency (UHF), and other portions of the radio frequency spectrum, coupled with appropriate Information Assurance and Computer Network Defense (IA\/CND) mechanisms. Development and assessment of potential solutions will integrate improved IP capabilities with the Advanced Digital Network Systems (ADNS) and existing international standards (e.g. Allied Communications Publication 200, NATO Standardization Agreements 5066 and 4691). The continued development and refinement of advanced tactical networking technologies and protocols, to include Low Probability of Intercept (LPI), Low Probability of Detection (LPD), and Anti-Jam (AJ) capabilities as well as Automatic Link Establishment (ALE) standards, will provide for a significant improvement in secure data sharing within, and between, coalition maritime elements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Relay Capabilities"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 Allied\/Coalition Maritime Environment (ACME) funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Allied\/Coalition Maritime Environment (ACME) funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.076"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop and evaluate secure and interoperable technologies and capabilities supporting Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operations, to include multibearer routing, distributed applications and services and their integration with Mission Partner Environment\/ Future Mission Networking (MPE\/FMN).  This will include Allied\/Coalition Shared Situational Awareness, cross-domain and data labeling solutions in maritime tactical networking environments, and advanced Information Assurance and Computer Network Defense (IA\/CND) solutions (with common and interoperable processes and technologies). \n- Assess technologies for interoperable maritime networking with the continued refinement of advanced tactical networking and communication capabilities, including high-latitude\/polar environments, which promote task group-centric operations. Solutions will address higher bandwidth, Low Probability of Intercept (LPI)\/Low Probability of Detection (LPD)\/Anti-Jam (AJ) technologies across the Radio Frequency (RF) and Optical spectrum and include airborne capabilities. Evaluation of electromagnetic spectrum management and visualization technologies, force-level Electronic Warfare\/Electro-magnetic Maneuver Warfare (EW\/EMW) will also enhance interoperable Information Warfare (IW). \n- Continue to increase Allied IW interoperability with other joint and maritime multi-national forums, such as the Combined Communications Electronic Board (CCEB), Multinational Maritime Information-system Interoperability Steering Group (M2I2), MPE\/FMN, and Joint Information Environment (JIE) forums.\n- Continue to assess and validate individual technologies, integrated solutions, and associated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) through experimentation, trials and demonstrations with Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS) and other Allied\/Coalition partners during operational venues, such as the United States Navy (USN) Rim of the Pacific (RIMPAC) or United Kingdom (UK) Joint Warrior exercise series."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the ACME funding profile transferred from PE 0604707N to PE 0606355N.\n\nThe $20K decrease between FY 2018 to FY2019 is attributed to reduction in assessments of various technologies including the U.S. Battlefield Information Collection and Exploitation System - extended (BICES-X)."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Allied\/Coalition Maritime Environment (ACME) is a non-acquisition program that promotes United States Navy (USN) interoperability with allied and coalition forces to achieve the Chief of Naval Operations (CNO) vision by facilitating maritime interoperability in both processes and communications systems, including emerging capabilities, to counter growing high-end asymmetric threats, and is a key enabler of the force multiplying benefits achieved through cooperation among the Australia, Canada, New Zealand, United Kingdom, United States (AUSCANNZUKUS), North Atlantic Treaty Organization (NATO), and other partner nations. Activities include acquiring intellectual capital in emerging technical areas through contracts providing technical engineering expertise and surge capacity for emerging tasks."
                        },
                        "PerformanceMetrics": {
                            "val": "Advanced Relay Capabilities: The ACME program will employ laboratory testing and at-sea demonstrations to assess specific technologies, operational concepts, and integrated Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel and Facilities (DOTMLPF) solutions pertaining to Denied, Degraded, Intermittent and Low-bandwidth (DDIL) operational environments, Network Operations Without Shore (NOWS), Maritime Domain Awareness (MDA), Mission Partner Environment\/ Future Mission Networking (MPE\/FMN), Joint Information Environment (JIE), and other aspects of Information Warfare (IW). These assessments will report on identified capability gaps, link capability gaps to technology\/DOTMLPF gaps, identify technologies and DOTMLPF solutions considered ready for deployment, transition to a program of record to enhance Fleet war fighting capability, and enhance Allied interoperability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2144"
                    },
                    "ProjectTitle": {
                        "val": "Space & Elec Warfare Engineering"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "22.058"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.058"
                        },
                        "BudgetYearTwo": {
                            "val": "19.799"
                        },
                        "BudgetYearThree": {
                            "val": "20.806"
                        },
                        "BudgetYearFour": {
                            "val": "31.206"
                        },
                        "BudgetYearFive": {
                            "val": "26.746"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "To support Navy objectives in advancing Information Warfare (IW) capabilities, the Space and Electronic Warfare (SEW) Engineering project provides six main functions:\n\n(1) Develop the architectures, specifications and standards, tools, and processes to support a single integrated Navy plan for cybersecurity. These engineering artifacts provide Navy specific guidance to drive common and consistent implementation of security controls across current and future Navy Programs of Record\/projects. This eliminates redundancies and inefficiencies characteristic of previous stove-pipe development efforts in which each system addressed security individually. These efforts enable a standardized approach to move out faster to improve the Navy's cyber resiliency. \n\n(2) Provide the cybersecurity vulnerability and functional test capability which supports cybersecurity test requirements and the Command, Control, Communications, Computers, Intelligence (C4I) components of USS Secure. USS Secure is a cyber assessment program within the Navy. This System of Systems (SoS) (Afloat, Aloft, C4I & Shore) capability in a test laboratory environment provides a rapidly re-configurable capability that integrates maritime hardware systems into a virtual platform. This platform level SoS provides cybersecurity research, development, test and evaluation, and training, not otherwise possible. This combination of Systems Commands (SYSCOM) laboratories, cyber ranges, and Red Teams simulating Navy platforms in operational maritime environments is critical for effectively evaluating cyber threats against specified mission threads.\n\n(3) Define an integrated Enterprise Architecture to support design, development and delivery of integrated Navy Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System capabilities. This architecture reflects current (as-is) and future (target) end states to support technical analyses, program planning, and enterprise-level investment decisions across IW capabilities. Perform mission based system of systems analysis to ensure integration and interoperability, and validate end-to-end warfighting capabilities to quickly address emerging threats. \n\n(4) Provides engineering tools and processes to drive rigorous Systems Engineering discipline across the acquisition lifecycle to support rapid development and delivery of secure and interoperable C4ISR, Business IT, and Space Systems capabilities that meet Fleet requirements. Conduct Systems Engineering Technical Reviews (SETRs) to provide independent, objective assessments of technical maturity and compliance with applicable architectures, specifications and standards across IW capabilities. \n\n(5) The Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX) provides a means to demonstrate and evaluate the interoperability of United States (US), North Atlantic Treaty Organization (NATO), and coalition information sharing systems.\n\n(6) Navy Additive Manufacturing (AM) technology aligns to CNO priorities to deliver revolutionary capabilities to improve fleet readiness.  These enterprise solutions will provide the foundation to (1) enhance warfighter capability through new innovative system designs; (2) increase readiness through low volume production of hard to source items; and (3) improve warfighting capacity by enabling production at or near the point of need. Specific efforts include the development of an Enterprise Digital Manufacturing Architecture which addresses design and certification of AM capabilities for both afloat and ashore, development of Cyber Security Risk Management Profiles for devices and applications on operational networks, definition of a secure Technical Data Package to describe components that can be digitally manufactured, and the development of an overarching, enterprise-level Digital Manufacturing Thread (device management, digital rights management, licensing, configuration management, data storage rule\/access and application programing interfaces)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cybersecurity Architecture, Specifications and Standards"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 Cybersecurity Architecture, Specifications and Standards funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Cybersecurity Architecture, Specifications and Standards funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.890"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.890"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop the architectures, specifications, and standards that provide the technical foundation of a single, integrated Navy plan for cybersecurity in accordance with changes in the threat environment, advances in technology, evolving Department of Defense (DoD) guidance, and results of USS SECURE cyber test activities.\n- Continue to assess Navy Programs of Record (PoR) plans for implementation of cybersecurity controls, assess compliance to determine cyber risk with Informational Assurance (IA) Technology Authority (TA) cybersecurity architectures and standards, and perform risk assessments that articulate systems' ability to effectively support operational missions in various cyber conditions. \n- Continue Defense-in-Depth Functional Implementation Architecture Network Transformation (DFIANT) work across Naval Systems Commands (SYSCOMs) to develop domain-specific implementations of the Defense-in-Depth Functional Implementation Architecture (DFIA) by defining control points, IA and logical attributes, controlling parameters, and inheritable security controls to establish a layered approach to cybersecurity.\n- Develop detailed design artifacts for PoRs to ensure integration between Navy Cyber Situational Awareness (NCSA) tools and the Defensive Cyber Operations (DCO) enclave to enable command and control of Navy networks under all cyber conditions.\n- Continue to assess Acquisition Category (ACAT) programs compliance with Information Technology (IT) and IA TA architectures, specifications and standards."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the Cybersecurity Architecture, Specifications and Standards funding profile transferred from PE 0604707N to PE 0606355N. \n\nThe $570K decrease between FY18 to FY19 in attributed to the completion of NCSA requirements and interface specifications and standards."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cybersecurity Vulnerability & Functional Test Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 Cybersecurity Vulnerability & Functional Test Capability funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Cybersecurity Vulnerability & Functional Test Capability funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.123"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.123"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Install Command, Control, Communications, Computers, Intelligence (C4I) components within two test laboratory assets procured in FY18 to allow platforms to test their C4I systems in a threat environment. \n- Continue to develop and mature connectivity (including assessment and authorization) strategies to combine Systems Command (SYSCOM) laboratories, cyber ranges, and Red Teams to develop more accurate simulations of Navy platforms in operational maritime environments allowing for critical, effective, and expeditious evaluation of cyber threats against specified mission threads."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the Cybersecurity Vulnerability & Functional Test Capability funding profile transferred from PE 0604707N to PE 0606355N. \n\nThe $17.2M decrease between FY18 to FY19 is attributed to the initial planning and procurement to establish the USS Secure lab infrastructure in FY18. Funding in FY19 will complete the installations of the two test laboratory assets to allow platform testing of cyber threat profiles across platforms and enclaves."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 Enterprise Architecture funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Enterprise Architecture funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of an overarching Space and Naval Warfare Systems Command (SPAWAR) Enterprise Architecture with associated specifications, standards and profiles to support effective engineering, design, development, acquisition, and delivery of Navy Command, Control, Communications, Computers, Intelligence,Surveillance, and Reconnaissance (C4ISR), Business Information Technology (IT), and Space System capabilities. \n- Continue to develop the capabilities of the Architecture Data Repository. \n- Continue development of Model Based System Engineering (MBSE) capabilities, processes and tools to support technical performance gap analysis and trade recommendations by identifying capability gaps and overlaps, interoperability issues, and cybersecurity risks between Navy System of Systems (SoS) capabilities.  \n- Continue to refine the Integration and Interoperability (I&I) Capability framework to support SoS analyses of how well systems operate together across the Naval enterprise to deliver validated warfighting capabilities. \n- Continue to use Command and Control (C2), Battlespace Awareness, and Integrated Fires (IF) Integrated Capabilities Technical Baseline (ICTBs) to perform analysis of mission performance, identify capability gaps,  and perform engineering trade studies, to better inform investment decisions and ensure alignment to all emerging Digital Warfare Office (DWO) objectives for increased interoperability and information sharing across weapons, sensors, and shooters."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the Enterprise Architecture funding profile transferred from PE 0604707N to PE 0606355N. \n\nThe $30K increase between FY18 to FY19 is attributed to development of MBSE capabilities, processes and tools to support technical performance gap analysis and trade recommendations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SYSCOM Systems Engineering"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 SYSCOM Systems Engineering funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 Systems Commands (SYSCOM) Systems Engineering funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to perform Systems Engineering Technical Reviews (SETRs) of acquisition programs ensuring compliance with statutory and regulatory directives, as well as applicable Information Technology (IT) and Information Assurance (IA) Technical Authority (TA) architectures, specifications, standards and profiles.\n- Continue to develop and perform technical reviews of formal acquisition and engineering documentation to ensure the application of sound systems engineering analysis and design principles to system planning requirements, design, testing, and supportability. Provide independent technical analyses to support Milestone Decisions.\n- Continue to conduct Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) certifications through design and testing analysis, ensuring interoperablity with platform, force level, and joint\/allied\/coalition forces.\n- Continue engineering evaluations, assessments of compliance with authoritative architectures and technical standards, and address technical issues in the following domains: Command and Control (C2); Intelligence, Surveillance, & Reconnaissance\/Information Operations (ISR\/IO); Space Systems, Business IT; and Communications & Networks.\n- Continue maturation of the Space and Naval Warfare Systems Command (SPAWAR) Engineering Competency Development Model (CDM) framework."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the SYSCOM Systems Engineering funding profile transferred from PE 0604707N to PE 0606355N. \n\nThe $19K increase between FY18 to FY19 is attributed to the need to perform additional technical reviews of formal acquisition and engineering documentation to remain current with standard engineering processes."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 CWIX funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 CWIX funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.033"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Continue to develop interoperability and information sharing through coalition engagement, technology, demonstrations, and assessments leading to improvements of Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR) systems within the Navy and in conjunction with Joint Services and Coalition efforts.\n-Continue to pursue and utilize greater Pacific Command (PACOM) and Southern Command (SOUTHCOM) Partner Nation engagement by fostering a connected, distributed experimentation environment suitable for expanded experimentation in those areas.\n-Continue to enhance interoperability across North Atlantic Treaty Organization (NATO) and affiliated Coalition Partners by participating in the planning and execution of Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX).\n-Continue to assess Coalition Interoperability assurance, validation, and verification as related to the engineering and execution of the Mission Partner Environment (MPE) in the appropriate venues.\n-Utilize connected environments such as the Combined Federated Battle Laboratories Network (CFBLNet) to experiment with innovative technical solutions in order to evaluate their value in fostering enhanced interoperability across Coalition Partner Nations and the United States (US)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the Coalition Warrior Interoperability eXploration, eXperimentation, eXamination, eXercise (CWIX). funding profile transferred from PE 0604707N to PE 0606355N."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.050"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Stand-up the Additive Manufacturing (AM) Test-bed, a rapid prototyping environment that facilitates risk reduction through the integration of AM machines, hardware and software in a controlled environment.\n-Develop architectural baselines supporting the digital thread to be incorporated in Afloat and Ashore networked AM nodes.\n-Develop Risk Management Framework (RMF) Profiles for the various components and interfaces required to network AM hardware and software assets.\n-Establish certification and technical authority for the AM effort."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $6.05M increase between FY18 to FY19 is attributed to the initiation of the Additive Manufacturing effort across the Navy by developing the initial standards, interfaces and capabilities to share AM data across the Navy enterprise."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Space and Electronic Warfare (SEW) Engineering is a non-acquisition program that develops, tests, implements technical authority, and validates Naval Command, Control, Communications, Computers, Intelligence, Surveillance, and Reconnaissance (C4ISR); provides integrated Architecture products and supports C4ISR systems engineering processes and standards. Activities include acquiring intellectual capital in emerging technical areas through contracts providing technical engineering expertise and surge capacity for emerging tasks."
                        },
                        "PerformanceMetrics": {
                            "val": "The SEW engineering program will employ rigorous and consistent system engineering practices in an evolving value model to support development and deployment of shipboard, undersea, and land based capabilities based on mission and performance requirements, integrated enterprise architectures, model-validated solutions, and sustainment and supportability needs for the Command and Control (C2), Intelligence, Networks, Communications, Space, and Business Information Technology (IT) domains.\n\nCWIX Performance Metrics: Three key metrics: (1) Interoperability and compliance with Naval (Navy and Marine Corps), joint, coalition and other non-governmental organization architectures, systems and equipment; (2) Compliance with Defense Information Services Agency (DISA), National Security Agency (NSA), and other joint and coalition information assurance and security standards; and (3) warfighter utility assessment across the joint and coalition spectrum. Specific metrics validate performance of individual technologies participating in CWIX as well as in other venues as appropriate."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "2147"
                    },
                    "ProjectTitle": {
                        "val": "ISR  Architecture"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.583"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.583"
                        },
                        "BudgetYearTwo": {
                            "val": "1.539"
                        },
                        "BudgetYearThree": {
                            "val": "1.540"
                        },
                        "BudgetYearFour": {
                            "val": "1.571"
                        },
                        "BudgetYearFive": {
                            "val": "1.600"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Integrated architectures provide a technical framework for assessing capability gaps and performance of individual systems and System of Systems (SoS) and their ability to effectively provide the desired effects to support warfighting missions. They also serve as a means to influence and drive Programs of Record (PoR) toward a common, more efficient state that promotes interoperability and security.\n\nThe Naval Intelligence, Surveillance, and Reconnaissance (ISR) Reference Architecture project is intended to guide system of systems capability development and promote interoperability across Navy ISR programs, as well as interoperability and alignment with Department of Defense (DoD)-wide enterprise initiatives including Joint Information Environment and Intelligence Community Information Technology Environment and Space & Naval Warfare Systems Command-wide Enterprise Architecture policies. This effort to develop integrated ISR architectures will also help instill systems engineering discipline and standardization across the Navy ISR Enterprise and provide a means by which to assess ISR PoR progress in conforming to a single Navy architecture. These efforts will help reduce Information Technology\/ISR infrastructure complexity and variances, making it easier to manage, operate and defend our ISR capabilities, and help inform investment decisions across the Navy's ISR enterprise to support Assured Command and Control, Battlespace Awareness and Integrated Fires.\n\nThis effort will encompass the documentation and analysis of current ISR enterprise architectures to inform and guide requirements for target architecture development and performance requirements to support full use and incorporation of ISR capabilities to advance Navy operations afloat. The associated studies will produce both technical and non-technical implementation guidance across the Doctrine, Organization, Training, Material, Leadership, Personnel and Facilities spectrum."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Intelligence, Surveillance, and Reconnaissance (ISR) Architecture"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY17 ISR Architecture funding resides under PE 0604707N."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY18 ISR Architecture funding resides under PE 0604707N."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ISR Architecture funding was transferred from PE 0604707N to PE 0606355N from FY19 forward.\n\n-Continue to analyze the current ISR capabilities of afloat, ashore, joint, and national systems within mission contexts to demonstrate gaps and overlaps in Information Warfare capabilities and document in engineering artifacts and architectures. Perform trade space analysis and develop and quantify solutions using technical and operational performance parameters.\n-Continue to build on the documentation and analysis of the enterprise ISR capabilities to support System of Systems engineering assessments to identify integration and interoperability gaps, trades, and solutions to support investment decision-making across the ISR portfolio.\n-Continue to integrate the National, Joint, and Naval ISR architectures within mission contexts to identify functional capacities, materiel integration and interoperability gaps and overlaps, as well as any policy and doctrine impacts.\n-Continue to perform verification and validation (V&V) to ensure ISR architecture and analytic products accurately capture system performance specifications. \n-Continue to capture all architectural data in the Space & Naval Warfare Systems Command (SPAWAR) analysis tool suite to support rigorous engineering assessments and architecture excursions against solution alternatives.\n-Continue to ensure alignment and interoperability between ISR Architectures and Joint Information Enterprise, Intelligence Community Information Technology Enterprise and SPAWAR Enterprise Architectures."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, the Intelligence, Surveillance, and Reconnaissance (ISR) Architecture funding profile transferred from PE 0604707N to PE 0606355N. \n\nThe $4K decrease between FY18 to FY19 is attributed to the reduced amount of support for documenting and analyzing enterprise ISR capabilities due to efficiencies in the decision-making process."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The Naval ISR Architecture project is a non-acquisition program that provides integrated architecture products, engineering analysis of current and target\/future capabilities to identify capability gaps and shortfalls, and provides solution recommendations. These combined efforts support the ability to articulate risks, and align\/prioritize investment decision recommendations within the ISR domain for the Navy."
                        },
                        "PerformanceMetrics": {
                            "val": "The Naval (Navy and Marine Corps) ISR Reference Architecture effort will use consistent systems engineering practices to support development of integrated ISR enterprise architectures, and model-validated solution recommendations against quantified technical and operational performance parameters."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3319"
                    },
                    "ProjectTitle": {
                        "val": "Fleet Experimentation"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "12.749"
                        },
                        "CurrentYear": {
                            "val": "11.572"
                        },
                        "BudgetYearOne": {
                            "val": "9.090"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.090"
                        },
                        "BudgetYearTwo": {
                            "val": "12.187"
                        },
                        "BudgetYearThree": {
                            "val": "12.050"
                        },
                        "BudgetYearFour": {
                            "val": "11.563"
                        },
                        "BudgetYearFive": {
                            "val": "11.797"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The U.S. Navy's Fleet Experimentation (FLEX) program examines the doctrine, organization, training, materiel, leadership and education, personnel, facilities, and policy (DOTMLPF-P) solutions to identified warfighter capability gaps within the Future Years Defense Program (FYDP). The Navy's FLEX program considers warfighting gaps identified in: Integrated Prioritized Capability Lists (IPCL) generated by Warfighting Development Centers (WDC); Navy Integrated Priorities Letter (IPL); Navy Commanders' FLEX Guidance; and Navy Urgent Operational Needs Statements.  Additionally, the Navy's FLEX program addresses innovative concepts, and tactics, techniques, and procedures (TTP), and Fleet Concepts of Operation (CONOPS) that collectively mitigate Fleet-identified warfighting capability gaps.   Through experimentation activities such as workshops, system or seminar war simulations, live at-sea events, and experimentation campaigns, the FLEX program examines potential materiel and non-materiel tangible solutions that will enhance the Fleet's ability to execute assigned missions. FLEX events and campaigns are comprised of all facets of experimentation including design, planning, systems engineering and integration, execution, data collection, analysis, assessment, and the delivery of tangible products to the fleet. While Naval-centric, FLEX efforts include joint, coalition, Science and Technology (S&T), academia, and industry partners.\n\nThe U.S. Navy's FLEX program directly supports four of the five elements outlined in the Secretary of the Navy's Innovation Vision: (1) Build the Naval Innovation Network, (2) Improve the Use of DON Information, (3) Accelerate Emerging Operational Capabilities to the Fleet, and (4) Develop Game-Changing Warfighting Concepts.  Experimentation is vital to continuously improving naval warfighting capabilities"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Fleet Experimentation"
                                    },
                                    "Description": {
                                        "val": "The U.S. Navy's Fleet Experimentation (FLEX) program is a collaborative effort with multiple partners designed to address fleet prioritized capability gaps to produce doctrine, organization, training, materiel, leadership development, personnel, facilities, and policy (DOTMLPFP) actions.  The FLEX program deliverables are focused on operational and tactical warfighting capability in the near term (within the Future Years Defense Program), and prioritized by annual U.S. Navy guidance.  Warfighting Development Centers (WDCs) plans and executes approved multi-year Fleet experimentation campaigns and final reports. U. S. Navy staff manages the follow-on DOTMLPF-P actions to establish or enhance warfighting capability in Fleet Design, Integrated Air and Missile Defense (IAMD), Amphibious Warfare (AMW), Surface Warfare (SUW), Strike Warfare (STW), Anti-Submarine Warfare (ASW), Expeditionary Warfare (EXW), Information Dominance (ID), Mine Warfare (MIW) and Anti-Terrorism\/Force Protection (AT\/FP)\n \nFLEX supports Operational\/Tactical venues to experiment, demonstrate, assess warfighting CONOPS development, concepts, doctrine\/training development, techniques and procedures (TTPs), and technologies. Multi-year experiment campaigns focus on warfighting capability in accordance with guidance to evaluate and transition to DOTMLPF-Policy change recommendations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.749"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FY17 FLEX EXPLAN was based on four focus areas to include, in very broad terms, Multi-mission Electromagnetic Maneuver Warfare, Naval Integrated Fires, Full Spectrum Mine Warfare, and Unmanned Systems. FLEX was also leveraged to support new platform introduction capabilities. The FLEX Execution Plan supported the following events: \n\na. Fleet Battle Experiment 2017 At-Sea\nb. Spectral Tsunami 2017 Seminar War Simulation\nc. USFF Independent Deployment At-Sea (One ship)\nd. Space War Simulation\ne. Netted Sensors At-Sea\nf. Trident Warrior 2017 At-Sea\ng. Bold Alligator 2017 At-Sea\nh. Red Nitrum At-Sea\ni. Navy Integrated Fire Control - Counter Air System (NIFC-CA) System War Simulation\nj. Counter Unmanned Systems (UxS) At-Sea\nk. Office of Naval Research (ONR) Technology Innovation Games (TIGs)\nl. Logistics Force Assured Command and Control War Simulation 2017\nm. Unmanned Systems Escalation\/De-escalation War Simulation\n\nAdditionally, this project provided funds for technical and subject matter expertise support throughout the experiment planning, execution, and analysis process in support of the FLEX ExPlan for FY 2017 At-Sea events and War simulations.  The outcomes will advance or augment warfighting capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.572"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The FY18 FLEX program will align to the \"Fleet Design\" end state of fleet-centric fighting power, enabled by integration, distribution and maneuver to simultaneously employ synchronized kinetic\/non-kinetic mission execution across multiple domains in a complex\/contested environment.  The FY18 FLEX program campaign areas comprise Multi-mission Electromagnetic Maneuver Warfare, Naval Force Integration, Full Spectrum Mine Warfare, Operational\/Tactical Level of War Integration\nFY18 OBJECTIVES\n(1)Fleet Tactical Grid (FTG) and MAGTF Grid Development \n - FLEX\/exercises\n(2)Fleet Level CONOPS\n - Contested Environment; Maritime Maneuver and Push Logistics  \n(3)Warfighter Decision Making \n - Digital Warfare Office pilots\n - Artificial Intelligence pilots\n(4)Non-kinetic\/kinetic effects integration \n - NIFC-EW & Passive  Targeting\n(5)War Simulations (Naval War College, Naval Post Graduate School)\n - MOC to MOC TACMEMO\n - Joint and Coalition in support of Fleet Design"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.090"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "The Navy's FY19 FLEX program aligns to the U.S. Navy Fleet Design and the Associated Campaign Plan will drive implementation of Fleet Design by 2023.  \n\nRealizing Fleet Design necessitates introduction of three enabling components.  \n\n(1) Fleet Fighting Power via Distributed Maritime Operations - Material\/Non- Material Capabilities.  The FY19 FLEX program will execute the following events:  \n\na. Command and Control \nb. Operational Level Multi-Domain Joint Enablers \nc. Maneuver Fleet Tactical Grid\nd. Cooperative Engagements Mode Options \n\n(2) Digital Spectrum Warfare via a Fleet Tactical Grid will integrate communications, command and control systems, computers, sensors, combat systems, and weapons at the technical level to facilitate an intelligent exchange and analysis of data to provide warfighters with actionable knowledge in support of Distributed Maritime Operations. The FY19 FLEX program will execute the following events:  \n\na. Combat Identification and Targeting\nb. Battlespace Management and Decision Aids \nc. Tactical Networking\nd. NET Enabled Weapons\ne. Unmanned Systems Autonomy\nf. Sensor\/Platform\/Weapon Employment\ng. Fleet Tactical Grid\/Netted Sensors\n\n(3) Fleet Warfighting Training Construct (FWTC) will develop a holistic, agile, and integrated environment that replicates the high end fight, to train a fleet centric fighting force and allow for future warfighting innovation within the construct of Force Generation.  As such, Fleet Design implementation requires fleet experimentation to support Force Development and inform Force Generation for fleet-centric fighting power, enabled by integration, distribution and maneuver to simultaneously employ synchronized kinetic\/non-kinetic mission execution across multiple domains in a complex\/contested environment.  The FY19 FLEX program will execute the following events:  \n\na. Tactical and Technical Integration in support of FWTC Force Generation, Large Scale Exercise (LSE) 2020; specifically, increased use of Modeling and Simulation (M&S) lines of effort to accelerate capability development and learning."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A FY19 reduction of $180K is a re-spread of a POM19 procurement efficiency.  The FY 2019 funding request was reduced by $1.84 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "FLEX is a non-acquisition program."
                        },
                        "PerformanceMetrics": {
                            "val": "Fleet Experimentation Measure of Performance (MOP):\nFLEX funding is used for approximately 20-25 experimental initiatives annually, focused on addressing Fleet-identified capability gaps. The majority of this funding is used to acquire intellectual capital in technical areas through contracts providing engineering expertise, experiment design, execution and analysis support, and also used to fund select engineering and integration costs.\nFleet Experimentation Measure of Effectiveness (MOE):\n-\tCNO\/CUSFF\/CPF directed experiment for emerging future capability\n-        Fleet Design outcomes\n-\tMitigate critical capability gaps\n-\tInform Doctrine TTP, and training\n-\tInform Fleet Platform Wholeness or Warfighter CONOPS validation\n-\tImpact to Fleet Warfighting within the FYDP"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3320"
                    },
                    "ProjectTitle": {
                        "val": "TRIDENT Warrior"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "2.097"
                        },
                        "CurrentYear": {
                            "val": "2.269"
                        },
                        "BudgetYearOne": {
                            "val": "2.284"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.284"
                        },
                        "BudgetYearTwo": {
                            "val": "2.290"
                        },
                        "BudgetYearThree": {
                            "val": "2.335"
                        },
                        "BudgetYearFour": {
                            "val": "2.385"
                        },
                        "BudgetYearFive": {
                            "val": "2.432"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Trident Warrior (TW) was transferred from 0604231N (Tactical Command Systems) to 0606355N ((U)Warfare Innovation Management) in FY 2017."
                        },
                        "ProjectMissionDescription": {
                            "val": "U.S. Navy's TW experiment campaign enables early delivery of Information Warfare (IW) capabilities to the warfighter via Fleet-directed TW operational events. Integrates stand-alone systems and efforts to achieve substantially enhanced capability, demonstrates\/tests these capabilities in both laboratory and operational environments, and evaluates their effectiveness. Develops supporting concepts and Concept of Operations to improve warfighting effectiveness. Coordinates IW efforts with other Service\/Joint\/Department of Defense\/National efforts to ensure Joint\/Interagency\/ Allied\/Coalition applicability and interoperability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Trident Warrior"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.097"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluated executed experiments from Trident Warrior 2016 (TW16) and recommended next steps. \n- In accordance with standardized procedures, led TW participant efforts with the following: specific goal identification; risk identification; experiment plans (including data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provided subject matter experts (SMEs) for core ship services during the experimentation period. Provided independent experts to ensure compliance with experiment plans, led analysis effort, and delivered unbiased assessments.\n- Provided results to government sponsors to support the program's engineering recommendations.\n- Planned and executed Trident Warrior 2017 (TW17) experiments accelerating the transition of IW capability to the Fleet.\n- Began Trident Warrior 2018 (TW18) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.269"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate Trident Warrior 2017 (TW17) executed experiments and recommend next steps for Warfighting Development Centers (WDC)s.\n- Promote broad participation in TW by researching advanced technology solution candidates, in conjunction with other services, commercial entities and academic research in order to fill IW technology gaps.\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide Subject Matter Expertise (SME) for core ship services during the experimentation period. Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute Trident Warrior 2018 (TW18) experiments to accelerate the transition of IW capability to the Fleet.\n- Begin Trident Warrior 2019 (TW19) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.284"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Evaluate TW18 executed experiments and recommend next steps for WDC.\n- Promote broad participation in Trident Warrior (TW) by researching advanced technology solution candidates, in conjunction with other services, commercial entities and academic research in order to fill Information Warfare (IW) technology gaps.\n- In accordance with standardized procedures, lead TW participant efforts with the following: specific goal identification; risk identification; experiment plans (to include data requirements and collection); and required installation and security certifications, accreditations, and approvals.\n- Provide Subject Matter Expertise (SME) for core ship services during the experimentation period. Provide independent experts to ensure compliance with experiment plans, lead analysis effort, and deliver unbiased assessments.\n- Provide results to government sponsors to support the program's engineering recommendations.\n- Plan and execute Trident Warrior 2019 (TW19) experiments to accelerate the transition of IW capability to the Fleet.\n- Begin Trident Warrior 2020 (TW20) planning, taking into consideration identified Naval Capability Gaps."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The $15K increase between FY 2018 to FY 2019 is attributed to increased Information Assurance SME support associated with TW experiments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Confirmation of Fleet and Joint Interoperability with technology candidates, Information Assurance Certification and Accreditation, and alignment with U.S. Navy Guidance, as well as related Program Executive Office (PEO) objectives and stakeholder projected architectures."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3420"
                    },
                    "ProjectTitle": {
                        "val": "Expeditionary Submarine Fiber Optic Cable (SFOC)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "15.000"
                        },
                        "BudgetYearOne": {
                            "val": "5.827"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.827"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "20.827"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Maritime Communications Demonstration (MCD) project, also called the Expeditionary Submarine Fiber Optic Cable (SFOC) Communications Project, is a classified program responsible for developing concepts designed to validate material and non-material solutions providing resilient C2 within the maritime domain. The focus is to demonstrate capabilities leveraging existing DOD investments and infrastructure to move data and information. Demonstration will include maritime assets, experimental methodologies, and current backhaul architecture for data movement. Solutions will address technologies across the RF and Optical spectrum using SFOC communications systems. The key deliverable will be a series of at-sea demonstrations to validate maritime segment components in an operationally representative environment.\n\nThis is not a new start.  In FY17 $2.8M of funding was managed from within the Fleet Experimentation (FLEX) program and used for Maritime Communications Demonstration (MCD) project tasking for transparency.  This effort is part of Secretary of Defense's (SECDEF) third offset initiative and was identified as a required operational capability by USEUCOM, USNORTHCOM, USPACOM, and USSTRATCOM.  This effort will fund limited technical development and a series of at-sea demonstrations raising the technical readiness levels of various components with a cable handling and deployment system in an operationally representative environment, with the intent to rapidly transition to an operational capability."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Expeditionary Submarine fiber Optic Cable (SFOC)"
                                    },
                                    "Description": {
                                        "val": "Classified Project: The Maritime Communications Demonstration (MCD) project is developing and experimenting innovative concepts designed to validate both materiel and non-materiel methodologies to provide resilient command and control within the maritime and littoral domains. The project focus is to demonstrate capabilities that leverage existing industry and DOD investments and infrastructure using non-traditional means to move data and information. The key deliverable will be a series of at-sea demonstrations to validate maritime segment components in an operationally representative environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Funding was in project 3319 of this PE in FY17. Initial project planning activities to result in an end-to-end shallow water communications demonstration on a Southern California Navy range in FY19. Award of a vendor contract to deliver the expeditionary cable handling and deployment system. System architecture and design of the deployable communications segment to include initial lab demonstration of communications CONOPS in September, 2017. Note: The $4.7M HAC mark made the planned FY19 shallow water comms test unexecutable as initially envisioned. That fact, combined with revised sponsor guidance received in Q4FY17, resulted in a complete replanning of the MCD project late in FY17."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2018 Base Plans:\nThis project will provide funds for the development and refinement of advance networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat of Anti-Access Area Denial(A2\/AD). Initial FY18 technology development will showcase advanced technologies in expeditionary cable design that will be demonstrated in a harsh and operationally representative environment.\n- Conduct system concept development study\n- Begin SFOC design and prototyping\n- Begin connection design and prototyping\n- Conduct deployment system feasibility AoA\n- Additional details provided at a higher classification level"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.827"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "This project will continue to provide funds for the development and refinement of advance networking and communication capabilities in a maritime environment that promote C2 interoperability in Satellite Communications (SATCOM) - Restricted and SATCOM - Denied environments, and support the defeat of Anti-Access Area Denial(A2\/AD). FY19 technical tasking will showcase advanced technologies in deep water cable connection design that will be demonstrated in a harsh and operationally representative environment.\n- Complete SFOC design and prototyping\n- Complete connection design and prototyping\n- Charter vessel for hardware demonstration\n- Complete cable and connection demonstration\n- Begin deployment subsystem development\n- Additional details provided at a higher classification level"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $9.173M million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Expeditionary SFOC Communications is a non-acquisition program that promotes DoD interoperability to achieve resilient C2 data flows by facilitating maritime architectures in both processes and communications systems, including emerging capabilities, to counter growing high-end asymmetric threats, and is a key enabler of the Combatant Commanders C2\nfunctionality."
                        },
                        "PerformanceMetrics": {
                            "val": "Expeditionary SFOC Communications will employ laboratory testing and at-sea demonstrations to assess specific technologies, operational concepts, and integrated Doctrine,Organization, Training, Materiel, Leadership, Personnel and Facilities (DOTMLPF) solutions pertaining to C2 communications and other aspects of Information Dominance. These assessments will report on identified capability gaps, link capability gaps to technology\/DOTMLPF gaps, and identify technologies and DOTMLPF solutions considered ready for deployment to enhance war fighting capability and enhance interoperability."
                        }
                    }
                }
            ]
        }
    }
}