{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-20",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603728A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Demonstrations"
        },
        "R1LineNumber": {
            "val": "50"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "21.415"
            },
            "CurrentYear": {
                "val": "10.421"
            },
            "BudgetYearOne": {
                "val": "9.136"
            },
            "BudgetYearOneBase": {
                "val": "9.136"
            },
            "BudgetYearTwo": {
                "val": "9.352"
            },
            "BudgetYearThree": {
                "val": "9.538"
            },
            "BudgetYearFour": {
                "val": "9.735"
            },
            "BudgetYearFive": {
                "val": "9.931"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "79.528"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates technologies that assist the Army to reduce or eliminate environmental impacts both in the United States and abroad, and provide science and technology solutions to Army environmental challenges as a force multiplier in mission planning, material acquisition and soldier preparedness. Project 002 demonstrates tools and methods for compliance with environmental laws relevant to conservation of natural and cultural resources while providing a flexible realistic training environment for mission activities. The Army also requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This project matures and demonstrates tools for robotic and autonomous agile infrastructure modification and custom designed construction for expeditionary structures on demand. Project 025 demonstrates pollution prevention tools and methods to minimize the Army's use and generation of toxic chemicals and hazardous wastes. Project 03E focuses on technologies for advanced life cycle analysis, advanced sensing, and technologies to empower rapid fielding of next generation energetics, propellants and munitions.   \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priorities for Air Missile Defense, Next Generation Combat Vehicle, and Network\/C3I, and supports the Army Strategy for the Environment.  \n\nThis PE is fully coordinated and complementary to PE 0602720A (Environmental Quality Technology).\n\nWork in this PE is performed by the Army Engineer Research and Development Center, Vicksburg, MS, and the United States (U.S.) Army Research, Development, and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "11.137"
                },
                "CurrentYear": {
                    "val": "10.421"
                },
                "BudgetYearOne": {
                    "val": "10.624"
                },
                "BudgetYearOneBase": {
                    "val": "10.624"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "21.415"
                },
                "CurrentYear": {
                    "val": "10.421"
                },
                "BudgetYearOne": {
                    "val": "9.136"
                },
                "BudgetYearOneBase": {
                    "val": "9.136"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "10.278"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.488"
                },
                "BudgetYearOneBase": {
                    "val": "-1.488"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.468"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.187"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.488"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.488"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.003"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increase in project 03F Environmental Quality Tech Demonstrations\nDecrease in FY19 due to removal of pollution prevention task."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Compliance Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.682"
                        },
                        "CurrentYear": {
                            "val": "2.203"
                        },
                        "BudgetYearOne": {
                            "val": "2.353"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.353"
                        },
                        "BudgetYearTwo": {
                            "val": "2.455"
                        },
                        "BudgetYearThree": {
                            "val": "2.503"
                        },
                        "BudgetYearFour": {
                            "val": "2.554"
                        },
                        "BudgetYearFive": {
                            "val": "2.606"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.356"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies transitioned from Program Element (PE) 0602720A (Environmental Quality Technology), Projects 048 and 896, and PE 0602784 (Military Engineering), Projects T41 and T45. This project assists Army installations and operations in achieving environmental compliance. Army facilities are subject to fines and facility shutdowns for violations of federal, state, and local environmental regulations. Efforts under this Project enable the Army to reduce environmental constraints at installations while complying with the myriad of federal, state, local, and host country environmental regulations and policy. In addition, this project matures capabilities to assess, establish, upgrade, and construct infrastructure to project power and enable deployed force operations. Current and planned efforts enable the Army to perform additive and advanced manufacturing for deployed force infrastructure, support robotic and autonomous engineering during combat operations, and ensure infrastructure resiliency. Technologies demonstrated aim to reduce the cost of resolving compliance issues for the Army, sustain the viability of testing and training ranges, protect critical resources, and expand capacity to perform construction and supporting tasks in high risk\/threat and dynamic environments.\n\nWork in this Project supports the Army Science and Technology Military Engineering and Environmental Technology, Simulation and Computing Portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas, supports the Army Strategy for the Environment, and supports the Army Modernization Priority for Next Generation Combat Vehicle, Air Missile Defense and Network\/C3I."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Sustainable Ranges and Lands"
                                    },
                                    "Description": {
                                        "val": "This effort provides ecosystem vulnerability assessment and ecosystem analysis, monitoring, modeling, and mitigation technologies to support sustainable, unconstrained, realistic access and use of the Army's ranges and lands. This effort demonstrates environmentally safe and cost effective technologies to manage and reduce the increase in noise and pollution concerns associated with training ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.059"
                                            },
                                            "Text": {
                                                "val": "Will exploit assessment methodologies that quantify the adaptive capacity of social-ecological systems to understand potential climate change drivers on the continental United Stated (CONUS) and outside of the continental United States (OCONUS) installation security, resilience, and sustainability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.106"
                                            },
                                            "Text": {
                                                "val": "Integrate and mature methodologies for high-resolution permafrost\/ground-ice mapping for improved risk characterization. Extended permafrost heat transfer models to account for near surface ground heterogeneity and provide a real-time feedback system for early warning of ground stability, including permafrost change development, for existing infrastructure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Infrastructure for Combat Operations (Previous Titled: Adaptive & Resilient Installations)"
                                    },
                                    "Description": {
                                        "val": "The Army requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This effort matures and demonstrates tools for the assessment of physical and ecological impacts on operations, agile infrastructure modification, and custom?designed construction for expeditionary structures on?demand."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.623"
                                            },
                                            "Text": {
                                                "val": "Will complete software validations and transition contingency base planning modeling tools to the Army Facilities Components System and to the Joint Construction Management System. Will demonstrate an automated construction capability to print a custom-designed 500 square foot expeditionary structure within 24 hours that will reduce operational logistics demands and improve energy efficiency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.097"
                                            },
                                            "Text": {
                                                "val": "Mature and validate representative hardware and software to assess the relative risk associated with autonomous construction activities, and the degree to which risk may be mitigated through the employment of innovative robotic construction methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Mature and demonstrate robotic and autonomous technologies for Engineer operations supporting mobility, countermobility, and advanced construction methods for deployed operations."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.353"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.353"
                                            },
                                            "Text": {
                                                "val": "Will mature risk mitigation frameworks associated with contingency autonomous construction methods and activities. Mature algorithms and decision making software for control processes (bandwidth needs, response time lag, and override response times) developed to facilitate autonomous methods necessary for expedient point of need construction."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Initiate effort in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "025"
                    },
                    "ProjectTitle": {
                        "val": "Pollution Prevention Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.431"
                        },
                        "CurrentYear": {
                            "val": "1.488"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "2.919"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates pollution prevention advanced technologies required for sustainable operation of Army weapon systems, to include compliance with regulations mandated by federal, state, and local environmental and health laws. Technology thrusts under this Project include demonstration of advanced technologies to enable sustainment of propellant, explosive, and pyrotechnic production and maintenance facilities and training ranges through elimination or significant reduction of environmental impacts. These technologies will ensure that advanced energetic materials required for the future force's high performance munitions are developed that meet weapons lethality and survivability goals and that are compliant with environmental and health laws. Technology thrusts also include demonstration of more sustainable technologies for surface finishing processes, paints and coatings, cleaning solvents, refrigerants, and fire suppressants.  \n\nWork in this Project supports the Army Science and Technology Environment and Terrain Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Army Strategy for the Environment.  \n\nThe Project is fully coordinated and complementary to Program Element (PE) 0602720A, Project 895.  This Project transitions technologies developed under that PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Pollution Prevention Technology"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates pollution prevention advanced technologies required to sustain operation of Army weapons systems to comply with state, federal, and local environmental and health laws and regulations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.431"
                                            },
                                            "Text": {
                                                "val": "Will formulate environmentally sustainable high explosive compositions from kilogram-scale batches of novel energetic materials; will demonstrate non-chromate sealers for use in depot-level maintenance processes; will evaluate commercially available refrigerants with low global warming potential against military-unique flammability and toxicity requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.488"
                                            },
                                            "Text": {
                                                "val": "Mature and characterize nanoporous silicon-based energetic materials as potential alternatives to lead-based primary explosives; demonstrate the use of Chemical Agent Resistant Coating formulations that replace hazardous isocyanate compounds with polysiloxane-based resins; demonstrate alternative refrigerants with low global warming potential in military environmental control unit applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ended in FY18."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03E"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Restoration Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.302"
                        },
                        "CurrentYear": {
                            "val": "6.73"
                        },
                        "BudgetYearOne": {
                            "val": "6.783"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.783"
                        },
                        "BudgetYearTwo": {
                            "val": "6.897"
                        },
                        "BudgetYearThree": {
                            "val": "7.035"
                        },
                        "BudgetYearFour": {
                            "val": "7.181"
                        },
                        "BudgetYearFive": {
                            "val": "7.325"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.253"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies transitioned from Program Element (PE) 0602720A (Environmental Quality Technology), Projects 835 and 896 by addressing the management and mitigation of materials and chemicals with focus on impacts of new materiel that will enter the Army inventory within the next decade and beyond; shape and protect Army investments in next generation fires by delivering proactive scientifically sound risk and environmental impact management strategies; environmental factors in mission planning activities impacting the battlefield landscape of future threats; and opportunities and impacts to mission success in sparse data environments, enabling mission planners to identify the industrial\/commercial resources used as components of weapons development. Technologies matured within this Project inform the Army of potential environmental threats, opportunities and impact to mission; to understand the environmental threat in urban and industrial contested environments; and rapidly sense and assess the presence and extent of dangerous compounds in battlefield environments. A key aspect of this work is the enhancement of risk assessment and life cycle analysis techniques that can more accurately predict and identify the environmental liabilities associated with fielding new systems and technologies. Efforts also identify ways to economically comply with myriad federal, state, and host country regulations dealing with contaminated soil and water. This Project includes pilot scale field studies to demonstrate technological feasibility and optimize performance and productivity of the risk mitigation techniques.\n\nWork in this Project supports the Army Science and Technology Military Engineering and Environmental Technology, Simulation and Computing Portfolio. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priority for Network\/C3I, Air Missile Defense, and Long Range Precision Fires, and supports the Army Strategy for the Environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hazard Assessment for Military Materials"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates tools to assess hazard and risk of Army-unique chemicals and materials. The tools provide for rapid environmental baseline survey reporting and screening assessments of existing and future militarily relevant compounds and allow for improved predictive risk assessment and provide environmental life cycle assessment capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.4"
                                            },
                                            "Text": {
                                                "val": "Will mature environmental lifecycle tool for use in developing new materials. Will demonstrate sensor technologies that are field-rugged and long-lasting for accurate assessment of contaminant presence in complex operating environments. Will provide algorithms for sensor systems to auto-populate Environmental Baseline forms as required by the Engineer Field Manual."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.398"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a novel passive chemical sensor to detect multiple contaminants (copper, arsenic, and nitrate) in water to provide sensing devices that are rapid, robust, and cost-efficient for real time water quality monitoring."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.278"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.278"
                                            },
                                            "Text": {
                                                "val": "Will characterize environmental fate, degradation and transport of obscurants and tone-down materials in different environments ranging from open lands to dense urban areas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program reduction to support priority objectives."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technologies for Sustainable and Green Operations and Acquisition"
                                    },
                                    "Description": {
                                        "val": "This effort exploits and matures technologies to control contaminant transport in environmental media on Army lands and mission spaces as well as assesses and demonstrates novel detection, remediation, and mitigation capabilities for existing and emerging contaminants."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.095"
                                            },
                                            "Text": {
                                                "val": "Will validate novel treatment approaches with reactive membrane materials and mature an operational effluent treatment system that will minimize water demand and minimize decontaminated waste."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.331"
                                            },
                                            "Text": {
                                                "val": "Demonstrate an operational field effluent treatment system that will minimize water demand, decontaminated waste, and reduce logistic demands. Validate computationally developed environmentally relevant physical and chemical properties of emerging and traditional munitions compounds essential to predict their fate and transport in natural water. Validate an artificial intelligence model that will predict adverse outcomes based on chemical-biological interactions for assessment of military compounds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Risk Prediction and Decision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and provides integrated science and technology solutions to Army environmental challenges with a focus on predicting the environmental attributes of emerging chemicals and materials, predictions that inform acquisition lifecycle models in order to minimize impacts to the mission and to the Soldier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.807"
                                            },
                                            "Text": {
                                                "val": "Will begin demonstration of fate and transport models of contaminant movement and persistence in the environment using a novel soils informatics approach. Will begin expansion of the environmental lifecycle assessment methodology beyond new materials to weapons system approaches."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.001"
                                            },
                                            "Text": {
                                                "val": "Validate an environmental lifecycle forecasting tool designed to provide quantitative environmental impact assessment for emerging materials and technologies. Mature qualitative and quantitative methods for assessing synthetic biology environmental impacts of military relevance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Risk Analysis of Fires"
                                    },
                                    "Description": {
                                        "val": "This effort is focused on health implications of new, to-be fielded munitions and investigates the overall life cycle of the materials to shape and protect Army investments in next generation fires supporting Army Modernization Priority Long Range Precision Fires."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.874"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.874"
                                            },
                                            "Text": {
                                                "val": "Demonstrate proactive environment, safety, and occupational health risk assessment tools to ensure rapid fielding of energetics, propellants, and munitions. Validate models to predict chemical impacts on select species using embryo gene expression, and demonstrate new computational technologies with high potential for meeting the Army?s needs to predict the toxicity of new and novel chemical agents used in munitions, smoke screens, and energetics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort for FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding the Environment as a Threat"
                                    },
                                    "Description": {
                                        "val": "This effort provides environmental conditions and hazards in contested environments to enable operational planning and decisions to understand environmental threats from informed modeling and simulation supporting Modernization Priority Network\/C3I Mission Planning Applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.938"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.938"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate predictive tools to inform engineer reconnaissance and provide environmental situational awareness for mission planning. Demonstrate in silico prediction of physical, chemical and biological properties of insensitive munitions compounds and their transformation products in the natural water, arid and semi-arid environments, and mature models capable of predicting chemical behavior in complex environments to support scientifically defensible knowledge, tools, and guidance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Sensing in Contested Environments"
                                    },
                                    "Description": {
                                        "val": "This effort provides robust tools for environmental reconnaissance missions and environmental sensing technologies for mission readiness. Supports Modernization Priority C3I Persistent Surveillance. Enhanced situational understanding reduces surprise, and can prevent detection, acquisition and engagement."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.693"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.693"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate advanced environmental sensor technologies to enable rapid collection and data analysis of environmental information. Will demonstrate printed, functionalized carbon nano-tube sensor elements to promote properties critical for sensing contaminants of interest (e.g., copper, arsenic, and nitrites), and demonstrate\/validate experimental protocols for improved selectivity for passive samplers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort for FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "03F"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Tech Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Program increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "This is a Congressional Interest Item."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}