{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-22",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603699D8Z"
        },
        "ProgramElementTitle": {
            "val": "Emerging Capabilities Technology Development"
        },
        "R1LineNumber": {
            "val": "49"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "244.377"
            },
            "PriorYear": {
                "val": "54.279"
            },
            "CurrentYear": {
                "val": "57.876"
            },
            "BudgetYearOne": {
                "val": "48.338"
            },
            "BudgetYearOneBase": {
                "val": "48.338"
            },
            "BudgetYearTwo": {
                "val": "51.309"
            },
            "BudgetYearThree": {
                "val": "52.137"
            },
            "BudgetYearFour": {
                "val": "52.962"
            },
            "BudgetYearFive": {
                "val": "53.795"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The Emerging Capabilities Technology Development (ECTD) Program Element (PE) produces risk-reducing, conceptual and operational prototypes and conducts demonstrations of emerging technologies to support the priorities of the new Under Secretary of Defense for Research and Engineering (USD(R&E)).  ECTD supports the USD(R&E) with experimentation and longer-term, mission-focused capability development that crosses functional domains and enhances warfighter technical superiority, adaptability, and resilience.  The office collaborates with government labs, academia, and industry to execute projects that target specific mission capability gaps identified by the Combatant Commands (CCMDs), the Joint Staff, and senior leadership in the Office of the Secretary of Defense.\n\nService Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The ECTD funding supports projects that reduce technology risk of emerging capabilities by advancing conceptual and operational prototypes in support of near- and mid-term operational engagements and stability operations.  With an emphasis on interagency and joint partnerships, ECTD matures capability options to anticipate and inform formal joint and interagency requirements and acquisition processes.  Individual projects generally span one to three years through efforts that emphasize affordability, typically at a cost of less than $6.000 million.  The ECTD program focuses on rapid prototyping of emerging technologies to accelerate capabilities to the joint warfighter, including electromagnetic spectrum-agile capabilities; multi-domain, autonomous systems; counter-weapons of mass destruction capabilities; and, dismounted soldier systems.  Project selection is guided by Department-level strategies and priorities, such as the Chairman’s Gap Assessment, USD(R&E) strategic guidance, and CCMD Integrated Priority Lists (IPLs).\n\nIn anticipation of a heightened emphasis by the new USD(R&E) on outpacing threats and seizing technical opportunities, ECTD is structured to mature emerging technologies and highlight their military capabilities through joint demonstrations and ECTD sponsored venues for defense-wide experiments and demonstrations.  These include Stiletto, a maritime experimentation and demonstration platform; Thunderstorm, an intelligence, surveillance, and reconnaissance venue; and, other tailored experimentation and demonstration events.  Together, these events enable newly-developed capabilities to be showcased in realistic environments with operational user involvement.  The ECTD program supports red teaming efforts to identify vulnerabilities in emerging technologies early, ensuring follow-on systems are resilient to adversaries.\n\nIn response to changing Department of Defense priorities, two new project lines are being added to the ECTD PE.  The high energy laser (HEL) project will begin development work to integrate a HEL onboard an AC130 aircraft.  This will enhance special operations forces’ ability to provide precision fires.  The red teaming project line will assess the susceptibility and vulnerability of emerging technologies.  This will enable the new Office of the Under Secretary of Defense for Research and Engineering to make informed decisions on building new capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.895"
                },
                "CurrentYear": {
                    "val": "57.876"
                },
                "BudgetYearOne": {
                    "val": "48.037"
                },
                "BudgetYearOneBase": {
                    "val": "48.037"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "54.279"
                },
                "CurrentYear": {
                    "val": "57.876"
                },
                "BudgetYearOne": {
                    "val": "48.338"
                },
                "BudgetYearOneBase": {
                    "val": "48.338"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.384"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.301"
                },
                "BudgetYearOneBase": {
                    "val": "0.301"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "6.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.548"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.061"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Internal Baseline Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "0.572"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.572"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.271"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.271"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 funding increase of $6.000 million was provided by Congress to support high energy density composites and air base resiliency.\n\nThe FY 2019 baseline adjustment reflects the net of other DoD requirements and funding for the Red Teaming project code."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "795"
                    },
                    "ProjectTitle": {
                        "val": "Emerging Capabilities Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "244.377"
                        },
                        "PriorYear": {
                            "val": "54.279"
                        },
                        "CurrentYear": {
                            "val": "39.876"
                        },
                        "BudgetYearOne": {
                            "val": "40.338"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.338"
                        },
                        "BudgetYearTwo": {
                            "val": "41.309"
                        },
                        "BudgetYearThree": {
                            "val": "42.137"
                        },
                        "BudgetYearFour": {
                            "val": "42.962"
                        },
                        "BudgetYearFive": {
                            "val": "43.795"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "ECTD funding supports projects that reduce technology risk, create capabilities across functional domains, and prototype technologies that deliver the capabilities needed to enhance warfighter adaptability and resilience.  Individual projects typically cost less than $6.000 million and focus on rapid prototyping and demonstrations of emerging technologies.  ECTD funding also supports demonstration venues that develop and mature emerging technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Voidstar"
                                    },
                                    "Description": {
                                        "val": "This project demonstrated and delivered advanced Electronic Warfare (EW) capabilities using tactical software-defined radio (SDR) technology.  The capabilities and radio are vertically-scalable to operate on platforms with varying size, weight, and power (SWaP) constraints; and, horizontally-scalable to coherently operate across disparate platforms.  The Voidstar project culminated in a successful demonstration of the capability and transitioned to the Air Force.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.504"
                                            },
                                            "Text": {
                                                "val": "Voidstar will improve the capability for tactical units to provide (near) real-time counters to threat signals.  When successful the Voidstar capability will transition to the Air Force.  Further details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Engagement Weapon (LREW)"
                                    },
                                    "Description": {
                                        "val": "This project completed the engineering and design work required to rigorously demonstrate the feasibility of a multi-role, long-range interceptor missile for maintaining air dominance.  The LREW concept combines proven components from existing missile systems with new, innovative technologies to provide a leap-ahead increase in overall performance.  Efforts included analysis validating systems design, wind tunnel testing, engineering assessments, and kill chain investigations to inform potential future programs for the Navy and Air Force.  LREW products transitioned to the Air Force for further development.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.686"
                                            },
                                            "Text": {
                                                "val": "LREW will complete systems design, engineering, and kill chain investigations in FY 2017.  When successful, LREW will transition to multiple Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Raven Flash"
                                    },
                                    "Description": {
                                        "val": "The Raven Flash project will develop and demonstrate an adaptable, agile, Electronic Warfare capability using integrated source system components and associated high performance materials.  FY 2017 efforts included development and characterization of system components and baseline effects testing using surrogate electronic system testbeds.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.222"
                                            },
                                            "Text": {
                                                "val": "The Raven Flash project will develop, characterize, and integrate source system components.  FY 2017 efforts will enhance and integrate measurement and analysis sub-systems.  Baseline effects testing against selected representative target classes will be conducted in accordance with established level-of-effect (LOE) metrics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.063"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 accomplishments, Raven Flash will continue the development and integration of component sub-systems culminating in a “brass-board” system demonstrator.  A functional assessment of the Raven Flash architecture in a laboratory environment against challenging classes of surrogate electronic systems will be conducted."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.480"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.480"
                                            },
                                            "Text": {
                                                "val": "Raven Flash will develop a fully integrated, functionally-relevant prototype system.  Activities to design, fabricate, assemble, and test the prototype will be conducted.  The relative performance of the system will be characterized, assessed, and validated against a selected high-fidelity, relevant electronic system in a laboratory environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Raven Flash level of effort remains largely the same from FY 2018 to FY 2019.  Final integration and testing occurs in FY 2019 and results in higher material and testing costs, reflected in the $0.420 million increase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronic Warfare Laboratory (AEWL)"
                                    },
                                    "Description": {
                                        "val": "This project will develop an extensible Advanced Electronic Warfare Laboratory (AEWL) technical framework that can be replicated at multiple Service labs and government research and development facilities.  The AEWL concept will support technical risk assessments of emerging blue force electronic warfare (EW) subsystems and system prototypes in a realistic electromagnetic spectrum (EMS) environment.  AEWL will support hardware-in-the-loop testing, enabling the Department of Defense to evaluate the effectiveness of prototype systems or subsystems against realistic signals early in development.  This effort includes the hardware and software implementation of the first instantiation of the AEWL technical framework.  In FY 2017, AEWL designed and procured final hardware components and subsystems and completed installation and integration of several prototype subsystems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.167"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.150"
                                            },
                                            "Text": {
                                                "val": "This project will complete final integration of the hardware subsystems and acceptance testing of the integrated AEWL.  Once operational, the initial instantiation of AEWL will be transitioned to the U.S. Army for evaluation and use.  Technical data packages will also be available to the other Services."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This project will be completed in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Data Link for Unmanned Aerial Systems"
                                    },
                                    "Description": {
                                        "val": "This project developed an advanced, extended-range datalink for tactical unmanned aerial systems (UAS).  The project culminated in a final capability demonstration.  This capability expands warfighters’ battlespace awareness by increasing the range of existing theater surveillance assets.  The prototype system transitioned to the U.S. Navy for further development and integration into an existing tactical UAS program.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Composite Flywheel Energy Storage and Power System"
                                    },
                                    "Description": {
                                        "val": "This project developed and demonstrated a prototype Advanced Composite Flywheel Energy Storage and Power System Module (AESPM); and, evaluated its potential application for underwater systems and humanitarian assistance missions.  With FY 2017 funding, this project incorporated the AESPM into a ruggedized, transportable configuration with flexible input and output power capabilities for a multitude of potential DoD missions.  This technology area is a congressional interest item and additional resources were provided above the President’s budget request."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air Base Resilience Sensor"
                                    },
                                    "Description": {
                                        "val": "This project developed an advanced sensor to enhance detection and tracking of threat systems.  Previous funding developed an advanced integrated sensor chip assembly (SCA) prototype.  FY 2017 funding integrated the SCA into a sensor system prototype for demonstration in an operationally-relevant environment.  This technology area is a congressional interest item and additional resources were provided above the President’s budget request.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Procurement of hardware components and subsystems will continue.  The transition partner will verify AEWL software and hardware subsystems’ performance and conduct acceptance testing."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "X-Lab"
                                    },
                                    "Description": {
                                        "val": "X-Lab developed a robust architecture and analytic toolset to monitor and exploit numerous extremely large data sets and provided a flexible means for addressing evolving strategic threats.  The delivered X-Lab system enables monitoring of adversary activities to identify anomalies and recognize subtle threat activity patterns.  Initial work focused on leveraging data sets to provide early indications of activities leading to a large-scale terrorist or state-sponsored attack.  Using expanded live and archived classified and unclassified data sets, X-Lab can address other Combatant Commands’ problem sets.  Early detection and warning of precursor activities can enable early intervention, such as queuing of intelligence, surveillance, and reconnaissance (ISR) capabilities; and, earlier deployment of countermeasures.  X-Lab transitioned to a classified operational user.  Details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.762"
                                            },
                                            "Text": {
                                                "val": "This project will complete integration and testing of the prototype culminating in a final demonstration.  The prototype will transition to the U.S. Navy for integration into currently fielded UAS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quartz Disk Resonator Gyroscope (QDRG)"
                                    },
                                    "Description": {
                                        "val": "Quartz Disk Resonator Gyroscope (QDRG) will demonstrate a next-generation low size, weight, power, and cost (SWaP-C), navigation-grade gyroscope for position, navigation, and timing (PNT) applications.  This micro-electromechanical systems (MEMS) technology will enable precision targeting, navigation, and tracking with a reduced error in Global Positioning System (GPS) denied environments.  The projected SWaP will enable the technology to be incorporated into hand-held and small autonomous systems across the Services.  FY 2017 efforts included successful risk-reduction activities to demonstrate that high-quality quartz disks can be reliably manufactured.  The project will demonstrate an integrated, miniature gyroscope prototype in FY 2019 for inclusion into targeting control systems, laser rangefinders, and inertial measurement units."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.400"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Building on FY 2017 accomplishments, QDRG will etch optimized quartz disks, design and fabricate control electronics, and vacuum package the resonator for laboratory test and validation.  FY 2018 development and testing will allow for package design modifications before integration into an internal navigation system (INS).  With FY 2018 funds, QDRG will complete package design and integration to demonstration critical performance parameters.  The final prototype can be leveraged as a north-finding system or integrated with a MEMS accelerometer to demonstrate a navigation-grade INS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "QDRG will be completed early in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Wide Area Motion Imagery (WAMI)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Wide Area Motion Imagery project developed and demonstrated a reduced size, weight, and power (SWaP), day\/night WAMI capability that is compatible with multiple manned and unmanned platforms across the Department of Defense (DoD).  The advanced WAMI project developed the overall system design in FY 2017 completing both the preliminary design review (PDR) and critical design review (CDR) milestones.  Using FY 2017 funds, work continues in FY 2018 to complete the prototype unit and conduct flight testing on a surrogate platform for U.S. Southern Command.  After successful testing, the sensor prototype will transition to U.S. Army Special Operations Command for integration with fixed-wing unmanned aerial vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectral Exploitation Camera for Targeting and Reconnaissance (SPECTRE)"
                                    },
                                    "Description": {
                                        "val": "The Spectral Exploitation Camera for Targeting and Reconnaissance (SPECTRE) project will develop and demonstrate a greatly reduced size, weight, and power (SWaP) hyperspectral imaging (HSI) capability that is compatible with multiple manned and unmanned platforms across the Department of Defense (DoD).  The SPECTRE prototype will provide the ability to perform stand-off detection of materials or targets of interest.  Initial efforts focused on the system design, modeling, and testing of various high risk design aspects.  SPECTRE completed both preliminary design review (PDR) and critical design review (CDR) milestones in FY 2017.  Additional project work includes design of a first-in-its-class, dual-field-of-view telescope with the ability to change optical path and field-of-view to adjust for off-nadir imaging.  To accommodate this telescope, a larger and more robust pointing and stabilization mirror will be designed along with a customized pod to enable integration with unmanned platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, designs will continue and the telescope and the pod will begin construction, integration, and lab testing.  FY 2018 will complete the development and build efforts for SPECTRE leading to a flight test in FY 2019 and planned transition to a deployed unmanned aerial system.  This effort also informs Program Objective Memorandum (POM) efforts for two Army program of record aerial systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This project will be completed in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Collaborative Electronic Warfare & Radar (DISCOVER)"
                                    },
                                    "Description": {
                                        "val": "The Distributed Collaborative Electronic Warfare & Radar (DISCOVER) project will develop and demonstrate an integrated, multi-function, net-centric capability to support multiple Radio Frequency (RF) concepts of operation (CONOPs) in a small radio form factor.  The prototype software-defined radio (SDR) will provide the dismounted warfighter with simultaneous robust voice and data communications, collaborative electronic warfare (EW), and distributed radar in an integrated capability.  DISCOVER activities in FY 2017 included project design and modeling, and procurement of long lead-item components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.638"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.300"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, DISCOVER will develop demonstration CONOPs and system-level specifications for the FY 2019 demonstration.  The project will also design and prototype RF subsystem hardware, develop EW and radar algorithms, and assess hardware performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.803"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.803"
                                            },
                                            "Text": {
                                                "val": "To support a FY 2019 multi-function (radar, EW, and communications) field demonstration, DISCOVER will integrate and test final RF hardware and antennas, complete algorithm development, and integrate a robust communications capability with the RF hardware.  DISCOVER will transition to Marine Corps for initial demonstration and CONOPS experimentation followed by continued development by the U.S. Army."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "DISCOVER efforts conclude at the end of FY 2019 with a demonstration of an integrated, multi-function, net-centric capability.  The majority of hardware and software development, integration, and testing occurs during FY2019 with a surge during the final quarter to support a field demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Compact Adaptable Ballistic Technology (CAB-T)"
                                    },
                                    "Description": {
                                        "val": "The Compact Adaptable Ballistic Technology project will integrate lightweight materials and simplified cycling to provide compact kinematic performance in an adaptable design.  The demonstrated prototype will achieve a modular ballistic system in a compact form factor to enable joint users to rapidly adapt to mission requirements.  CAB-T assessments in FY 2017 included the effects of material properties, mechanical interaction, operating pressure, and cartridge-mechanism interactions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Further integration and testing of the prototype will be completed.  FLAIR will transition to the U.S. Navy for further development.  Details are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, CAB-T will develop and integrate custom components, assess user interface, and validate compact ballistic technology modeling.  Subsystem laboratory testing will validate CAB-T modeling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "Final integration of compact ballistic technology with CAB-T user interface will be completed.  CAB-T prototype and final assessment with technical data package will transition to a classified user."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "CAB-T efforts will be completed at the end of FY 2019 and the prototype will transition for further development and sustainment by the user.  Due to the mid-year transition, CAB-T has a reduced level of effort for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Thunderstorm"
                                    },
                                    "Description": {
                                        "val": "The Thunderstorm demonstration venue examines emerging technologies and prototypes through a series of technology demonstrations, experiments, vignettes, and related activities.  Thunderstorm provides the Department of Defense (DoD) and interagency partners with an opportunity to identify and evaluate new and emerging technologies both from commercial and government sectors.  Operational users leverage Thunderstorm to experiment with mature and emerging commercial technologies that may meet mission-critical gaps.  In addition, Thunderstorm provides an opportunity for small businesses and non-traditional technology developers to demonstrate capabilities in operationally relevant scenarios while interacting with operational commands and other government personnel.  Thunderstorm demonstration objectives, performance measures, lessons learned, post-demonstration assessments, and data evaluations serve to identify new capabilities and new ways to employ existing capabilities.  Thunderstorm annually features approximately 55 technologies resulting in about $3.000 million in cost avoidance.  In FY 2017, Thunderstorm demonstrations and experimentation focused on port security, dense urban and subterranean warfare, and maritime-to-shore access control; and, demonstrated 42 technologies to representatives from 30 Department of Defense and interagency organizations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Building on previous experience, three Thunderstorm demonstrations are planned for FY 2018.  Focus areas will include dense urban environments and subterranean warfare, integrated bridge technologies, metamaterials, and other priorities identified through engagement with stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Thunderstorm’s focus will continue to reflect the most pressing challenges to DoD and provide a venue to explore new and innovative technological solutions.  Focus areas will be based on needs and priorities identified through engagement with stakeholders in the Military Services, the Combatant Commands, the U.S. Coast Guard, the Intelligence Community, and other operational users."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stiletto Maritime Demonstration Program"
                                    },
                                    "Description": {
                                        "val": "Stiletto is a maritime technology demonstration, experimentation, and assessment venue for exploring emerging technologies and prototypes.  The program is guided by focus areas identified by Combatant Commands, military Services, other defense organizations, and interagency partners.  Stiletto includes an experimental, all carbon fiber 88-foot boat that serves as a maritime demonstration platform.  The Stiletto program also includes other maritime platforms to assist in the exploration, assessment, and development of prototypes.  \n\nStiletto supports the rapid discovery and transition of emerging technologies across the range of military operations, thereby increasing the speed of response to emerging threats.  The boat supports special operations forces, expeditionary forces, and interagency users by experimenting with new technologies and exploring their military utility to reduce the risk of emerging technologies and concepts of operation.  The Stiletto Maritime Demonstration Program offers a streamlined experimentation and demonstration process that encourages system developers to engage directly with the warfighter in the maritime environment, and to rapidly adapt new technologies to meet operational needs.  Stiletto annually demonstrates approximately 65 technologies resulting in about $4.000 million in cost avoidance.  In FY 2017, Stiletto conducted 14 demonstration and experimentation events focused on maritime electro-optical and infrared surveillance; counter unmanned underwater vehicles (C-UUV); and, maritime intelligence, surveillance, and reconnaissance from unmanned aerial vehicles.  These events demonstrated 78 emerging technologies to 21 Department of Defense and interagency organizations.  The Stiletto vessel is home-ported in Norfolk, Virginia."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The X-Lab architecture will be expanded to include access to more live and archived classified and unclassified data sets to increase applications and system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue engagement with operational partners to determine urgent demonstration requirements for FY 2018.  Four capability demonstrations are planned for FY 2018.  These demonstrations will focus on operations in megacities, non-lethal vessel stopping, military information support operations (MISO), and improved decision making for autonomous vehicles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue to focus on emerging capabilities and threats.  Engagement with stakeholders from the Military Services, the Combatant Commands, the U.S. Coast Guard, the Intelligence Community, and other operational users will identify needs and priorities to guide capability demonstrations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects"
                                    },
                                    "Description": {
                                        "val": "Emerging Capabilities Technology Development (ECTD) funding supports projects requiring less than one million dollars for execution.  In FY 2017, ECTD selected, executed, and transitioned low cost innovative projects including:\n•  Advanced Digital Radio Frequency Memory (DRFM): A coherent countermeasure (CoCM) prototype using photonic technology to achieve a wide operational bandwidth, fast frequency tuning, and wide instantaneous bandwidth.  Additionally, the prototype provided sophisticated digital signal processing and generation of advanced CoCM waveforms and techniques.  The advanced DRFM transitioned to Naval Air Systems Command for further development. \n•  Persistics Software Enhancement: This project developed and delivered systems that automatically integrate and analyze open source imagery data to predict adversary behavior and track weapons of mass destruction in denied areas.  The capability transitioned to U.S. Pacific Command and U.S. Special Operations Command.  Further project details are classified.\n•  Multi-Thread Experiment (MTX):  Enabled concept experimentation with autonomous unmanned vehicles (UxVs) in an operationally-relevant, multi-domain environment.  Efforts focused on collaboration via a distributed control network, which parses sensing, control, navigation, and communication information through a network to achieve mission objectives.\n•  Robust Airworthy Optical Systems:  This project integrated government-developed optical subsystems to inform design of a sub-scale operationally representative solid state laser (SSL) weapon system.  Related efforts will validate and test design performance in a simulated airborne flight environment.\n•  Low-Cost Precision Intercept:  This project developed and demonstrated an ultra-low size, weight, power, and cost terminal guidance seeker.  The seeker was paired with a small unmanned aerial system to demonstrate a low-cost, long-range, terminally guided platform.  The capability transitioned to U.S. Special Operations Command for further development.  \n•  United Nations (U.N.) Peacekeeping Operations (PKO) Technology: A pilot project demonstrated the utility of integrating proven Department of Defense (DoD) technologies to enhance multilateral peacekeeping operations and improved DoD collaboration with the U.N. and other peacekeeping stakeholders.  U.N. PKO prototypes transitioned to deployed forces in the U.S. Africa Command and U.S. Central Command areas of responsibility."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.300"
                                            },
                                            "Text": {
                                                "val": "This project will transition to the new Program Element 0604132D8Z Missile Defeat Defense Technology Innovation for additional work in FY 2017."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Conceptual Prototyping Focus Area"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on cost-effective, limited-duration activities to design, develop, and deliver prototypes of cutting-edge land, sea, undersea, air, and space systems.  Conceptual prototyping activities seek to rapidly develop and demonstrate asymmetric capabilities that can help maintain the U.S. competitive advantage.  Selected projects provide an affordable venue to innovate new capabilities and increase speed to market through conceptual prototyping.  These prototypes will be delivered to Joint Service users to evaluate operational capabilities and inform requirements and technical feasibility of future acquisition programs.  Potential venues for prototype assessment include the Stiletto Maritime Demonstration Program, Thunderstorm integration exercises, and multi-domain demonstration venues across the Department of Defense (DoD).  Development of advanced prototypes will involve partnerships with the Services, industry, academia, and non-traditional DoD partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.110"
                                            },
                                            "Text": {
                                                "val": "This focus area will be used to develop concepts and designs through conceptual prototyping that will result in asymmetric capabilities.  While project determinations are generally made in the year of execution, projects to be considered will rapidly mature capabilities that address DoD needs across multiple domains.  Two to three prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution and will support DoD research and engineering enterprise strategic priorities.  Projects will focus on cost-effective, mission-focused efforts to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force.  Focus areas for prototyping projects include force protection, lethality, autonomous learning systems, manned-unmanned combat teaming, assisted human operations, warfighter resilience, command & control, mobility, and electronic warfare.  Two to three prototype efforts are anticipated in FY 2019 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Spectrum Agility Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area includes prototypes that create new concepts and capabilities which protect Department of Defense (DoD) systems and extend capability across the electromagnetic spectrum.  DoD communication and sensing capabilities are increasingly compromised by congestion and spectrum loss, as is evidenced by the recent radio frequency (RF) spectrum auction and the spectrum relocation fund.  In other operational environments, emergent electronic warfare (EW) threats, technologies, and tactics contest the use of the RF spectrum and erode U.S. capabilities in ways that are difficult to predict and counteract.  This focus area helps address the dual challenges of anti-access and area denial though improved spectrum agility, allowing our forces to operate when and where they are needed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.610"
                                            },
                                            "Text": {
                                                "val": "This focus area will develop concepts and designs through conceptual prototyping that will result in next-generation electronic warfare, communications, and RF sensing capabilities in one to three years.  While project determinations are generally made in the year of execution, prototypes from this focus area will address spectrum sharing, spectrum relocation, and spectrum competition requirements; and, will be evaluated under the electromagnetic (EM) conditions expected in the U.S. and abroad.  Two to three prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.064"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.064"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution and will support DoD research and engineering enterprise strategic priorities.  Selected projects will focus on cost-effective, mission-focused efforts to design, develop, and deliver new concepts and technology prototypes aimed at protecting DoD systems and extending capabilities through agile electromagnetic spectrum prototypes.  Two to five prototype efforts are anticipated in FY 2019 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Sensing Concepts to Asymmetrically Counter Unconventional Weapons and Missile Threats Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses threats from weapons of mass destruction (WMD) and advanced cruise and ballistic missiles through low-cost, rapidly-deployed, distributed sensing concepts and enabling technologies.  Projects leverage networked sensors and autonomous learning systems to asymmetrically defeat emerging threats.  The focus area is aimed at developing prototype technologies and demonstrations of distributed networked sensors for: enhanced detection capabilities for chemical, biological, radiological, nuclear, and high yield explosives threats; persistent intelligence and target discrimination in anti-access\/area denial (A2\/AD) environments; and, advanced sensors and sensor technologies for detection, tracking, and cueing missile defenses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Three Thunderstorm spirals are planned for FY 2017, building on the experience garnered from previous spirals.  Focus areas will include the continuation of physical security of critical port facilities, dense urban and subterranean warfare, and other priorities identified through engagement with stakeholders.  A demonstration will be conducted in coordination with the Stiletto maritime demonstration platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.603"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include pursuing development of concepts and designs for low cost distributed sensing initiatives that will result in innovative prototype systems in one to three years.  FY 2018 projects will include data mining for indications and warnings of a WMD or missile attack and unattended measurement and signature intelligence (MASINT) sensors to provide situational awareness of WMD activities in denied areas.  One to two prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.390"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.390"
                                            },
                                            "Text": {
                                                "val": "Projects will be selected in the year of execution.  Projects to be considered will support DoD research and engineering enterprise strategic priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force with critical enablers in distributed networked sensors, unattended intelligence systems, force protection, and data fusion.  Two to three prototype efforts are anticipated in FY 2019 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping of Autonomous or Semi-Autonomous Systems for Human-Machine Combat Teaming Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area addresses the need to develop new operational capabilities; speed up the observe, orient, decide, and act (OODA) loop; and, enhance situational awareness through the teaming of humans with autonomous or semi-autonomous robotic or software-enabled systems.  Related capabilities that enable autonomy are multiplying due to sensors that can understand the environment and software algorithms that can make a decision or seek human assistance.  The focus area is aimed at rapidly developing prototype technologies and demonstrations of systems to: semi-autonomously detect, identify, track, prioritize, and engage targets with operator determination; and, autonomously detect and classify threats then recommend defensive or offensive actions to the operator."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The Stiletto Maritime Demonstration Program will continue engagement with operational partners to determine urgent demonstration requirements for FY 2017.  Four capability demonstrations are planned for FY 2017, including combatant craft integrated bridge systems, maritime disablement, precision engagement, and maritime electronic intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.124"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include pursuing development of concepts and designs for human-machine teaming that will result in innovative concept of operations (CONOPS) and prototype systems in one to three years.  FY 2018 projects will include autonomous threat classification, target tracking, and systems to recommended actions to operators.  The focus will be on low-cost, innovative capabilities.  One to two prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.920"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.920"
                                            },
                                            "Text": {
                                                "val": "FY 2019 projects will be selected in the year of execution.  Projects to be considered will support DoD research and engineering enterprise strategic priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes aimed at supporting the Joint Force with a focus on assisting human decisions through robotic and software controlled systems.  The focus will be on low-cost, innovative capabilities.  Two to three prototype efforts are anticipated in FY 2019 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-domain Experimentation and Demonstration Focus Area"
                                    },
                                    "Description": {
                                        "val": "This new portfolio will focus on developing conceptual prototypes and demonstrating them at multiple venues to enhance the capabilities of multi-domain joint warfighters.  ECTD sponsors experimentation and demonstration venues to asses these prototypes and other concepts identified by partners across the defense community.  Venues and targeted experimentation and demonstration events explore rapidly-developing aviation, maritime, and ground combat systems.  Projects include development of prototypes and modifications of existing capabilities to address emerging challenges through relevant operational demonstrations.  This focus area supports prototype development and targeted experimentation and demonstration activities.  This focus area also complements related efforts through the new Red Teaming Project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.104"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include featuring new and adapted prototypes at demonstration and experimentation events.  While project determinations are generally made in the year of execution, projects to be considered will look at opportunities to address emerging challenges through relevant operational demonstrations.  Projects under consideration include low-cost, prototype systems with autonomous behaviors; weapon systems with increased lethality; force protection capabilities; experimentation with new logistical models; and advanced, distributed intelligence, surveillance, and reconnaissance sensors.  One to two prototype efforts leading to a demonstration are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.897"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.897"
                                            },
                                            "Text": {
                                                "val": "FY 2019 projects will be selected in the year of execution.  Projects to be considered will support DoD research and engineering enterprise strategic priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new capabilities that transition through a demonstration event.  Two to three prototype efforts are anticipated in FY 2019 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping of Individual Warfighter Systems Focus Area"
                                    },
                                    "Description": {
                                        "val": "This portfolio will focus on expedited delivery of field-ready prototypes to directly support dismounted soldier systems.  Projects include capabilities for human assisted operations that increase soldier performance, resiliency, lethality, mobility, energy, communications, and situational awareness.  These systems will support the Joint Force and Combatant Command priorities, in addition to emerging needs and opportunities as they are identified.  Technology development will counter emergent threats to the warfighter both while en-route to, and operating within, expeditionary environments alongside partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.312"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include pursuing development of concepts and designs for individual warfighter systems that will result in innovative concept of operations and prototypes in one to three years.  While project determinations are generally made in the year of execution, projects to be considered will look at dismounted soldier systems that support the Joint Force with capabilities for human assisted operations to increase soldier performance, resiliency, lethality, mobility, energy, communications, and situational awareness.  One to two prototype efforts are anticipated in FY 2018 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.184"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "FY 2019 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities and will focus on cost-effective, mission-focused projects to design, develop, and deliver new concepts and technology prototypes for individual warfighter systems aimed at supporting the Joint Force.  One to two prototype efforts are anticipated in FY 2019 leveraging Joint, Service, and interagency partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "India Science and Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "The India Science and Technology (S&T) Focus Area is a Secretary of Defense directed project designed to deepen defense cooperation between the U.S. and India.  By sharing research resources, capabilities, and expertise, the United States and India can jointly develop the technological innovations needed to enable our defense industrial bases to support our militaries now and in the future.  Further, development of vibrant S&T cooperation is a key step in building an enduring partnership."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "The India Science and Technology Focus Area and related funding will continue to develop and execute cooperative S&T projects.  Additional cooperative S&T areas targeted include: munitions development, advanced manufacturing, micro-power grids, and other identified project areas.  In FY 2018, funding will be transferred from Joint Capability Technology Demonstration (JCTD) (Program Element 0603648D8Z) to better enable alignment and execution of the allocated funds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "FY 2019 projects will be selected in the year of execution.  Projects to be considered will support DoD Research and Engineering Enterprise Strategic Priorities that can be jointly developed through cooperative S&T projects."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2019, generic performance metrics applicable to Emerging Capabilities Technology Development include the DoD Strategic Performance goal to transition 40 percent of completing demonstration programs per year.  In addition, project completions and success are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target dates, production measures, performance metrics, and demonstration goals.  In FY 2017, Emerging Capabilities Technology Development achieved a transition rate of approximately 70 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "713"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "18.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This initiative supports the U.S. Special Operations Command’s (USSOCOM) effort to explore the operational capability for an AC-130 modified with a high energy laser (HEL).  This funding enables analysis and risk reduction efforts to accelerate development of a HEL weapon system for USSOCOM missions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "AC-130 High Energy Laser (HEL)"
                                    },
                                    "Description": {
                                        "val": "This is a Department of Defense (DoD) directed effort initiated in FY 2018.  This project includes risk reduction efforts to help accelerate development and operational demonstration of an electric laser with a rechargeable magazine on an AC-130.  Activities covered by this funding include modeling, simulation, testing subsystems, and coordination with industry to support a subsequent USSOCOM HEL development program.  Success for the subsequent program will be realized by integrating an HEL capability into the AC-130 precision strike package (PSP).  The subsequent program will provide special operations forces with a materiel solution capable of addressing current warfighter gaps."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.000"
                                            },
                                            "Text": {
                                                "val": "Plans for FY 2018 include modeling, simulation, system design, and subsystem testing.  Risk reduction efforts will include characterization of aircraft window optical effects and mitigation for optimal beam quality, validation of coelostat inertial stabilization and pointing (anti-jitter), and characterization of the bio-effects and hazards necessary to support program planning for the HEL system.  After this initial risk reduction work the AC-130 HEL project will transition to the U.S. Special Operations Command for further development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This project will be completed in FY 2018."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A – USSOCOM will support subsequent development and acquisition strategy."
                        },
                        "PerformanceMetrics": {
                            "val": "USSOCOM defines specific performance metrics to evaluate the risk reduction effort and determine future investments.  The project results are reviewed by a senior review group comprised of representatives from the Office of the Secretary of Defense, USSOCOM, other Combatant Commands, and outside subject matter experts.  The ultimate measure of success is transition to the USSOCOM customer."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "717"
                    },
                    "ProjectTitle": {
                        "val": "Red Teaming"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "8.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.000"
                        },
                        "BudgetYearTwo": {
                            "val": "10.000"
                        },
                        "BudgetYearThree": {
                            "val": "10.000"
                        },
                        "BudgetYearFour": {
                            "val": "10.000"
                        },
                        "BudgetYearFive": {
                            "val": "10.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Red Teaming project helps assess the susceptibility and vulnerability of emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps.  The program supports field demonstrations and red-teaming to stress and assess emerging systems in key areas for gaining or maintaining overmatch earlier in the life-cycle.  This project improves systems by reducing vulnerabilities and providing a holistic understanding of employment risks in operationally-representative environments and against potential threats.  It informs requirements and helps accelerate acquisition pathways for joint missions.  This effort leverages the innovative capabilities of the Federally Funded Research and Development Centers (FFRDCs), government laboratories, academia, and industry to develop a construct that current or future systems can be gamed against in a distributed, operationally-relevant environment employing traditional and non-traditional players.  Deliverables will inform technology acquisition and new concept of operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Red Teaming in Support of Prototyping"
                                    },
                                    "Description": {
                                        "val": "The project funds red teaming and wargaming efforts to explore new capabilities in a competitive environment.  Projects will explore unconventional approaches to counter DoD technologies through red teams, wargames, and studies that employ government laboratory scientists; subject matter experts; and, students of science, technology, engineering, and math (STEM) disciplines.  Efforts range from distributed table-top games to simulated and live field exercises with non-traditional and operationally experienced participants including warfighters, scientists, engineers, students, and academics.  Deliverables include recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  The new Under Secretary of Defense for Research and Engineering (USD(R&E)) will leverage these products to inform how technologies and integrated systems can perform in hostile environments and develop new concepts of operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "The investment decisions for red teaming are made during the execution years in response to Department, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Red teaming in support of prototyping is a new project code for FY 2019 that informs the new Under Secretary of Defense for Research and Engineering."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics for FY 2019 will include specific details to each effort and include measures identified in individual project plans.  Project completions and successes are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target milestone dates, specific performance measures, fielding dates, and demonstration goals."
                        }
                    }
                }
            ]
        }
    }
}