{
    "id": "2019-Army-PB-2040-JBOOK-19f845352605fba4a6f3023996f0354f921fbe2e4ae425fd1d2a4fef03ce50a1-2",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601103A"
        },
        "ProgramElementTitle": {
            "val": "University Research Sciences"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "66.506"
            },
            "CurrentYear": {
                "val": "67.027"
            },
            "BudgetYearOne": {
                "val": "65.283"
            },
            "BudgetYearOneBase": {
                "val": "65.283"
            },
            "BudgetYearTwo": {
                "val": "65.858"
            },
            "BudgetYearThree": {
                "val": "67.214"
            },
            "BudgetYearFour": {
                "val": "68.552"
            },
            "BudgetYearFive": {
                "val": "69.923"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "470.363"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP), the Presidential Early Career Awards for Scientists and Engineers (PECASE) program, and the Army's efforts in the Minerva Research Initiative (MRI). The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority.  Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g., Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research.  The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.  The MRI is a university-based social science research program.\n\nWork in this PE provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "69.166"
                },
                "CurrentYear": {
                    "val": "67.027"
                },
                "BudgetYearOne": {
                    "val": "65.283"
                },
                "BudgetYearOneBase": {
                    "val": "65.283"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.506"
                },
                "CurrentYear": {
                    "val": "67.027"
                },
                "BudgetYearOne": {
                    "val": "65.283"
                },
                "BudgetYearOneBase": {
                    "val": "65.283"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.66"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.627"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.033"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "D55"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiative"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "63.547"
                        },
                        "CurrentYear": {
                            "val": "66.201"
                        },
                        "BudgetYearOne": {
                            "val": "65.283"
                        },
                        "BudgetYearOneBase": {
                            "val": "65.283"
                        },
                        "BudgetYearTwo": {
                            "val": "65.858"
                        },
                        "BudgetYearThree": {
                            "val": "67.214"
                        },
                        "BudgetYearFour": {
                            "val": "68.552"
                        },
                        "BudgetYearFive": {
                            "val": "69.923"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "466.578"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Multidisciplinary University Research Initiative (MURI), the Defense University Research Instrumentation Program (DURIP) and the Presidential Early Career Awards for Scientists and Engineers (PECASE) program.  The MURI program funds university based basic research in a wide range of scientific and engineering disciplines pertinent to maintaining land combat technology superiority.  Army MURI efforts involve teams of researchers investigating high-priority, transformational topics that intersect more than one traditional technical discipline (e.g. Intelligent Luminescence for Communication, Display, and Identification).  For many complex problems, this multidisciplinary approach serves to accelerate research progress and expedite transition of results to application.  The DURIP provides funds to acquire major research equipment to augment current, or devise new, research capabilities in support of Army transformational research.  The PECASE program funds single-investigator research efforts performed by outstanding academic scientists and engineers early in their independent research careers.\n\nWork in this Project provides a foundation for applied research initiatives at the Army laboratories and research, development and engineering centers.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multidisciplinary University Research Initiative (MURI)"
                                    },
                                    "Description": {
                                        "val": "MURI programs are typically 5 years in length at a cost of $1.25 million per year."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.083"
                                            },
                                            "Text": {
                                                "val": "Will provide support for MURI awards made in prior years, and will start six to eight new FY17 MURI awards critical to supporting the future force.  Effective transition mechanisms will include collaboration among principal investigators, participation by applied research and advanced technology development program managers in MURI program reviews, and communication of the MURI research results to the ARL, RDECs, ERDC, MRMC, ARI and industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "53.153"
                                            },
                                            "Text": {
                                                "val": "Provide support for MURI awards made in prior years and identify six to eight new FY18 MURI awards to support basic science and\/or engineering research at institutions of higher education that is of critical importance to national defense."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.102"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.102"
                                            },
                                            "Text": {
                                                "val": "Will provide support for MURI awards made in prior years and will identify six to eight new FY 19 MURI awards to enable advances in select interdisciplinary basic science and\/or engineering research areas determined to be of critical importance to national defense."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of Presidential Early Career Awards for Scientists and Engineers (PECASE) program and the Army Single Investigator Basic Research Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Presidential Early Career Awards for Scientists and Engineers (PECASE)"
                                    },
                                    "Description": {
                                        "val": "Supports PECASE investigators started in prior years."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.373"
                                            },
                                            "Text": {
                                                "val": "Will continue support for prior year awardees and select four new awards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.574"
                                            },
                                            "Text": {
                                                "val": "Support prior year awardees and select four new PECASE candidates."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.581"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.581"
                                            },
                                            "Text": {
                                                "val": "Will support prior year awardees and will select four new PECASE candidates."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased due to inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defense University Research Instrumentation Program (DURIP)"
                                    },
                                    "Description": {
                                        "val": "Supports basic research through competitive grants for research instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.091"
                                            },
                                            "Text": {
                                                "val": "Will award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.474"
                                            },
                                            "Text": {
                                                "val": "Evaluate proposals to award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research critical to Army transformation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.6"
                                            },
                                            "Text": {
                                                "val": "Will evaluate and award competitive grants for research instrumentation to enhance universities' capabilities to conduct world class research and enhance educational capabilities critical to Army transformation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding level decreased to enable support of the Army Single Investigator Basic Research Program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "V72"
                    },
                    "ProjectTitle": {
                        "val": "Minerva"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.959"
                        },
                        "CurrentYear": {
                            "val": "0.826"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.785"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project terminates in FY18."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports the Minerva Research Initiative (MRI), a university-based social science research program initiated by the Secretary of Defense in Fiscal Year (FY) 2009.  It focuses on areas in the social sciences that are of strategic importance to national security policy which have not been substantially pursued in the past.  The Minerva research effort will be performed to understand the internal military-political dynamics of repressive regimes, the vulnerabilities of regimes and institutions to various kinds of disruption and instability, the nature of crowd dynamics, group violence, community belief structures, the potential to influence public opinion and attitudes in diverse cultures, cultural effects on network security and military operations, the influence of technology on military capabilities of potential adversaries and allies, and other intersections of social-cultural issues with military activities and national security.  Predictive models and other analysis tools will be developed.  Leveraging the expertise in the social sciences within the academic community is needed to provide understanding of the roots of terrorist organizations and the challenges and opportunities for military operations in a culturally diverse environment.  Better understanding at a fundamental level and new computational tools will provide a beneficial impact on war fighting capabilities at the national policy, military strategy, operational, and tactical levels, and will enhance the capabilities of intelligence activities at all levels.  All research results are open source.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "The Minerva Research Initiative (MRI)"
                                    },
                                    "Description": {
                                        "val": "The MRI is a university-based social science research program initiated by the Secretary of Defense. It focuses on areas in the social sciences of strategic importance to national security policy. It seeks to increase the Department's intellectual capital in the social sciences and improve its ability to address future challenges and build bridges between the Department and the social science community. Minerva will bring together universities, research institutions, and individual scholars and support multidisciplinary and cross-institutional projects addressing specific topic areas determined by the Department."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Text": {
                                                "val": "Will develop and validate new computational models that represent how failures in telecommunications, energy, transportation, and economic, systems propagate into civil and governmental systems, thus putting nations and regions at risk of conflict and sociopolitical instability,  Will build and validate new models for interdependence between natural resources and state power structures.  This work will provide insight regarding national and regional risk of conflict, sociopolitical instability, and threat of violence resulting from studied failures allowing for the development of appropriate mitigation and intervention strategies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.826"
                                            },
                                            "Text": {
                                                "val": "Create new quantitative models to detect vulnerabilities in government systems throughout the world that engender sociopolitical instability and susceptibility to hostile movements from both within a nation and from outside. The models focus on shifts in population movement that arise from interdependencies between economic markets, health, and natural resources needed to support social communities.  This research will enable a capacity to detect emerging conflict zones before they erupt, and enabling an early capacity to stabilize at-risk regions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program ended and funds re-directed to support Social Scientific research, an underpinning knowledge base for enhanced Soldier performance leading to augmented Soldier Lethality."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}