{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-15",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605716A"
        },
        "ProgramElementTitle": {
            "val": "Army Evaluation Center"
        },
        "R1LineNumber": {
            "val": "167"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "55.46"
            },
            "CurrentYear": {
                "val": "56.246"
            },
            "BudgetYearOne": {
                "val": "57.049"
            },
            "BudgetYearOneBase": {
                "val": "57.049"
            },
            "BudgetYearTwo": {
                "val": "58.152"
            },
            "BudgetYearThree": {
                "val": "60.085"
            },
            "BudgetYearFour": {
                "val": "62.24"
            },
            "BudgetYearFive": {
                "val": "57.993"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "407.225"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides the resources to operate the Army Evaluation Center (AEC) which is responsible for all assigned developmental and independent operational evaluation of Army materiel, information and acquisition systems, an inherently governmental mission. AEC assists the Chief of Staff of the Army decision making process by supporting the Army Requirements Oversight Council (AROC) and the Strategic Portfolio Analysis Review (SPAR) processes. AEC determines impacts to readiness through Human Systems Integration (HSI), Unit Systems Integration (USI), and Army Systems Integration (ASI), DOTMLPF-P impacts, integrated suitability reviews (ISR) and operational suitability reviews (OSR) in partnership with the Deputy Assistant Secretary of the Army for Acquisition Policy and Logistics (DASA APL). AEC evaluates ballistics survivability and lethality missions, adversarial assessments\/threat computer network operations, cooperative vulnerability and penetration assessments (CVPA) and electronic warfare (EW) (attack, support) countermeasures in support of the National Defense Authorization Act (NDAA) 2016 Section 1647, Establishment of Cybersecurity and Electromagnetic Affects (CEMA).  AEC manages, plans, and executes Information Assurance (IA) operational assessments during annual Combatant Command and Army Service exercises in support of the congressionally mandated Office of the Secretary of Defense Director, Operational Test and Evaluation (OSD DOT&E) assessment, and performs the operational test agency (OTA) duties for the Ballistic Missile Defense System.\n\nThis PE funds direct civilian labor and minimum non-labor requirements to include: Temporary Duty (TDY), personnel training, career development, supplies and equipment, hardware, software, and other external Other Government Agency (OGA) support as well as methodology development required to evaluate emerging technologies and instrumentation requirements.\n\nAEC consists of seven directorates (Aviation-Fires Evaluation Directorate, Ballistic Missile Defense (BMD) Evaluation Directorate (funded by the Missile Defense Agency (MDA)), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Evaluation Directorate, Integrated Suitability & Methodology Directorate, Mounted Systems Evaluation Directorate, Soldier & Support System Evaluation Directorate and Survivability Evaluation Directorate) and a headquarters element.  AEC receives staff services from the Army Test and Evaluation Command Headquarters (ATEC HQ). The primary competencies of these directorates is to: independently evaluate effectiveness, suitability, survivability; determine if Program Management (PM) and user directed requirements are met; direct the test strategy; and verify system safety."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "55.905"
                },
                "CurrentYear": {
                    "val": "56.246"
                },
                "BudgetYearOne": {
                    "val": "58.463"
                },
                "BudgetYearOneBase": {
                    "val": "58.463"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "55.46"
                },
                "CurrentYear": {
                    "val": "56.246"
                },
                "BudgetYearOne": {
                    "val": "57.049"
                },
                "BudgetYearOneBase": {
                    "val": "57.049"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.445"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.414"
                },
                "BudgetYearOneBase": {
                    "val": "-1.414"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.439"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.414"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.414"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "302"
                    },
                    "ProjectTitle": {
                        "val": "Army Evaluation Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "55.46"
                        },
                        "CurrentYear": {
                            "val": "56.246"
                        },
                        "BudgetYearOne": {
                            "val": "57.049"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.049"
                        },
                        "BudgetYearTwo": {
                            "val": "58.152"
                        },
                        "BudgetYearThree": {
                            "val": "60.085"
                        },
                        "BudgetYearFour": {
                            "val": "62.24"
                        },
                        "BudgetYearFive": {
                            "val": "57.993"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "407.225"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides the resources to operate the Army Evaluation Center (AEC) which is responsible for all assigned developmental and independent operational evaluation of Army materiel, information and acquisition systems, an inherently governmental mission. AEC assists the Chief of Staff of the Army decision making process by supporting the Army Requirements Oversight Council (AROC) and the Strategic Portfolio Analysis Review (SPAR) processes. AEC determines impacts to readiness through Human Systems Integration (HSI), Unit Systems Integration (USI), and Army Systems Integration (ASI), DOTMLPF-P impacts, integrated suitability reviews (ISR) and operational suitability reviews (OSR) in partnership with the Deputy Assistant Secretary of the Army for Acquisition Policy and Logistics (DASA APL). AEC evaluates ballistics survivability and lethality missions, adversarial assessments\/threat computer network operations, cooperative vulnerability and penetration assessments (CVPA) and electronic warfare (EW) (attack, support) countermeasures in support of the National Defense Authorization Act (NDAA) 16 Section 1647, Establishment of Cybersecurity and Electromagnetic Affects (CEMA).  AEC manages, plans, and executes Information Assurance (IA) operational assessments during annual Combatant Command and Army Service exercises in support of the congressionally mandated Office of the Secretary of Defense Director, Operational Test and Evaluation (OSD DOT&E) assessment, and performs the operational test agency (OTA) duties for the Ballistic Missile Defense System.\n\nThis Project funds direct civilian labor and minimum non-labor requirements to include: Temporary Duty (TDY), personnel training, career development, supplies and equipment, hardware, software, and other external Other Government Agency (OGA) support as well as methodology development required to evaluate emerging technologies and instrumentation requirements. \n\nAEC consists of seven directorates (Aviation-Fires Evaluation Directorate, Ballistic Missile Defense (BMD) Evaluation Directorate (funded by the Missile Defense Agency (MDA)), Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR) Evaluation Directorate, Integrated Suitability & Methodology Directorate, Mounted Systems Evaluation Directorate, Soldier & Support System Evaluation Directorate and Survivability Evaluation Directorate) and a headquarters element.  AEC receives staff services from the Army Test and Evaluation Command Headquarters (ATEC HQ). The primary competencies of these directorates is to: independently evaluate effectiveness, suitability, survivability; determine if Program Management (PM) and user directed requirements are met; direct the test strategy; and verify system safety."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Evaluation Center  (AEC)"
                                    },
                                    "Description": {
                                        "val": "Provide integrated technical and operational evaluations and continuous evaluation of assigned weapon systems and major automated information systems for major milestone decisions, materiel changes, and materiel releases in support of the Army Acquisition Executive and force development. Develop the evaluation strategy, design technical and operational tests, and evaluate the test results to address the combat effectiveness, suitability, and survivability factors pertinent to the decision process, of hundreds of systems\/programs across the Army, other services and agencies. Prepare integrated System Evaluation Plans and conduct integrated technical and operational evaluations for all assigned systems. In support of Overseas Contingency Operations (OCO) and other real-world events, AEC continues to provide Capability & Limitation Reports and safety verification documents."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.46"
                                            },
                                            "Text": {
                                                "val": "Fund operational costs for AEC including civilian pay and non-labor costs (approximately 94% of AEC's total budget is civilian labor).  Additionally, provide funding for the Underbody Blast Modeling and Simulation support that provides early identification of vehicle improvements that directly impact Soldier survivability; improves test design; provides additional evaluation data to support acquisition.  Also, provides funding for the Center for Reliability and Growth in response to policies mandating Reliability Growth programs and periodic assessments for major systems. AEC is projected to support over 50 milestone decisions to include milestone A: Next Generation Chemical Detector (NGCD) Incr 4 (JPEO CBD); milestone B: Maneuver Support Vessel (L) (PEO CSCSS); milestone C: Bradley ECP 2 (PEO GCS), XM784\/XM785 (PEO Ammo), JACM (PEO Missiles & Space); full rate production: WIN-T INC 3 (PEO C3T); and materiel release of 155mm-SCAM (PEO Ammo), Enhanced Night Vision Goggle (ENVG) (PEO Soldier) and AN\/APR-39 (PEO IEW&S). AEC will continue to provide Capability & Limitation Reports and safety verification documents to support real-world operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "56.246"
                                            },
                                            "Text": {
                                                "val": "Fund operational costs for AEC including civilian pay and non-labor costs (approximately 94% of AEC's total budget is civilian labor). Additionally, provide funding for the Underbody Blast Modeling and Simulation support that provides early identification of vehicle improvements that directly impact Soldier survivability; improves test design; provides additional evaluation data to support acquisition. Also, provide funding for the Center for Reliability and Growth in response to policies mandating Reliability Growth programs and periodic assessments for major systems. AEC is projected to support over 100 acquisition milestone decisions and  will continue to provide Capability & Limitation Reports and safety verification documents to support real-world operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "57.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "57.049"
                                            },
                                            "Text": {
                                                "val": "Fund operational costs for AEC including civilian pay and non-labor costs (approximately 94% of AEC's total budget is civilian labor). Assist TRADOC in developing operational relevant, total system focused critical operational issues and criteria that can be evaluated. Develop and apply new techniques in data mining, data visualization and presentation of large data sets. Research and develop evaluation metrics for new and emerging technologies such as signature management and human cognition."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor change due to routine program adjustments."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}