{
    "id": "2019-UnitedStatesSpecialOperationsCommand-PB-0400-MJBOOK-0-0-ba015dfd5ba1e04656e21d824cef6502faf4b76e93da3cd1c0ac80829ad37380-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-SOCOM-U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_United_States_Special_Operations_Command_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "United States Special Operations Command",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1160402BB"
        },
        "ProgramElementTitle": {
            "val": "SOF Advanced Technology Development"
        },
        "R1LineNumber": {
            "val": "67"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "United States Special Operations Command"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "1196.512"
            },
            "PriorYear": {
                "val": "88.324"
            },
            "CurrentYear": {
                "val": "72.605"
            },
            "BudgetYearOne": {
                "val": "79.380"
            },
            "BudgetYearOneBase": {
                "val": "79.380"
            },
            "BudgetYearTwo": {
                "val": "89.565"
            },
            "BudgetYearThree": {
                "val": "101.181"
            },
            "BudgetYearFour": {
                "val": "107.638"
            },
            "BudgetYearFive": {
                "val": "109.767"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Advanced Technology Development (project S200) conducts rapid prototyping and Advanced Technology Demonstrations (ATDs).  ATDs provide a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by Special Operations Forces (SOF) users.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  ATDs also address projects that are a result of unique joint special mission or area-specific needs for which a few-of-a-kind prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase.  \n\nEngineering Analysis (project SF101) provides rapid response capability for the investigation, evaluation, and demonstration of technologies for SOF platform (ground, air, and maritime) and soldier system-unique requirements. Timely application of SOF-unique technology is critical and necessary to meet requirements in such areas as: sensor integration; enhanced situational awareness; near-real-time intelligence to include data fusion, threat detection and avoidance; electronic support measures for threat geo-location and specific emitter identification; navigation; target detection; weapon performance integration; and future SOF platform and soldier system requirements.  Provides additional engineering analysis and testing required to transition items from national forces to theater forces.\n\nInformation and Broadcast Systems Advanced Technology (project S225) conducts rapid prototyping, advanced technology demonstrations, and advanced concept technology demonstrations of information and broadcast systems technology.  Includes planning, analyzing, evaluating, and production information systems capabilities and distribution\/dissemination broadcast systems capabilities.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project also integrates efforts with each other and conducts technology demonstrations in conjunction with joint experiments and other assessment events.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs for which prototypes must be developed on a rapid response basis, or are of sufficient time sensitivity to accelerate the prototyping effort of a normal acquisition program in any phase."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "61.620"
                },
                "CurrentYear": {
                    "val": "72.605"
                },
                "BudgetYearOne": {
                    "val": "79.132"
                },
                "BudgetYearOneBase": {
                    "val": "79.132"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "88.324"
                },
                "CurrentYear": {
                    "val": "72.605"
                },
                "BudgetYearOne": {
                    "val": "79.380"
                },
                "BudgetYearOneBase": {
                    "val": "79.380"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "26.704"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.248"
                },
                "BudgetYearOneBase": {
                    "val": "0.248"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "28.029"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.800"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.125"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.248"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.248"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding:\n\nFY 2017:  Net increase of $26.704 million is due to a decrease for transfer of funds to Small Business Innovative Research\/Small Business Technology Transfer programs (-$2.125 million), an increase reprogramming action for Phase II Directed Energy Study ($0.800 million), and Congressional adds of $26.029 million for Light Attack and $2.000 million for Defense Technology Innovation.\n\nFY 2018:  None.\n\nFY 2019:  Net increase of $0.248 million due to increase of $0.213 million for social media engagement incorporating Artificial Intelligence in the digital domain efforts, $0.693 million increase across numerous project tasks and a decrease of $0.658 million for Departmental economic assumption.  \n\nSchedule:  None.\n\nTechnical:  None."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "S200"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Technology Development"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "1167.777"
                        },
                        "PriorYear": {
                            "val": "74.202"
                        },
                        "CurrentYear": {
                            "val": "53.362"
                        },
                        "BudgetYearOne": {
                            "val": "57.648"
                        },
                        "BudgetYearOneBase": {
                            "val": "57.648"
                        },
                        "BudgetYearTwo": {
                            "val": "67.702"
                        },
                        "BudgetYearThree": {
                            "val": "79.031"
                        },
                        "BudgetYearFour": {
                            "val": "85.042"
                        },
                        "BudgetYearFive": {
                            "val": "86.744"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides for rapid prototyping, Advanced Technology Demonstrations (ATDs) and Joint Capability Technology Demonstrations.  It is a means for demonstrating and evaluating the utility of emerging\/advanced technologies in operationally relevant environments with Special Operations Forces (SOF) users.  This project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.  Evaluation results often facilitate the initiation of new programs and the insertion of appropriate technologies to acquisition programs.   The element also addresses unique, joint special mission or area-specific needs for which a few rapid prototypes must be developed on a responsive basis, or are of sufficient time sensitivity to accelerate prototyping efforts of a normal acquisition program in any phase."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "S200:  SOST Light Attack"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "26.029"
                                        },
                                        "Text": {
                                            "val": "Released Light Attack support for USSOCOM Broad Agency Announcement (BAA). Topics of the BAA include platform agnostic capabilities (i.e. munitions, sensors and mission systems) applicable to Light Attack aircraft."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "S200:  Defense Technology Innovation"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.000"
                                        },
                                        "Text": {
                                            "val": "SOST Advanced Manufacturing."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SOF Special Technology Sub-Project"
                                    },
                                    "Description": {
                                        "val": "This sub-project integrates emerging technologies and presents them in technology demonstrations, in conjunction with joint experiments and other assessment events.  This project received two congressional adds in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.164"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and insert technology into existing programs.  Technologies include, but are not limited to: reduced signature profiles, improved weapons, communications, command, and control systems, sensors, and situational awareness tools; lightweight armor and materials, alternative power systems, eco-friendly sustainable energy devices, long duration, reduced size, high output power supplies, and technologies that reduce the load of the operator.  Continue development of technologies supporting undersea and ground mobility.  Evaluate and develop sensors across the electromagnetic spectrum to meet operational requirements.  Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Continue developing unique robotic systems to reduce the load of the operator and augment human performance. Continue to develop Command, Control, Computer, and Intelligence Technology to implement a robust, ultra-wideband communication capability.  Continue effort for field prototype system incorporating technologies likely to transition to fielded systems.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record, and conduct field experimentations at various venues to facilitate technology insertion."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.003"
                                            },
                                            "Text": {
                                                "val": "Continue the development and insertion of technology into existing programs.  Technologies include, but are not limited to: reduced signature profiles, improved weapons, communications, command, and control systems, machine learning\/artificial intelligence, sensors, and situational awareness tools; lightweight armor and materials, alternative power systems, eco-friendly sustainable energy devices, long duration, reduced size, high output power supplies, and technologies that reduce the load of the operator.  Continue development of technologies supporting undersea, air and ground mobility.  Evaluate and develop sensors across the electromagnetic spectrum to meet operational requirements.  Continue the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Continue developing unique robotic systems to reduce the load of the operator and augment human performance. Continue to develop command, control, computer, and Intelligence Technology to implement a robust, ultra-wideband communication capability.  Continue effort for field prototype system incorporating technologies likely to transition to fielded systems.  Based upon agreed technology maturity metrics, transfer successful projects into programs of record, and conduct field experimentations at various venues to facilitate technology insertion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "33.046"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "33.046"
                                            },
                                            "Text": {
                                                "val": "Continues the development and insertion of technology into existing programs.  Technologies include, but are not limited to: reduced signature profiles, improved weapons, communications, command, and control systems, machine learning\/artificial intelligence, sensors, and situational awareness tools; lightweight armor and materials, alternative power systems, eco-friendly sustainable energy devices, long duration, reduced size, high output power supplies, and technologies that reduce the load of the operator.  Continues development of technologies supporting undersea, air and ground mobility.  Evaluates and develops sensors across the electromagnetic spectrum to meet operational requirements.  Continues the integration of critical technologies focused on providing the dismounted special operator leap-ahead capabilities via innovative collaborative processes.  Continues developing unique robotic systems to reduce the load of the operator and augment human performance. Continues to develop Command, Control, Computer, and Intelligence Technology to implement a robust, ultra-wideband communication capability.  Continues effort for field prototype system incorporating technologies likely to transition to fielded systems.  Based upon agreed technology maturity metrics, transfers successful projects into programs of record, and conducts field experimentations at various venues to facilitate technology insertion."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $2.730 million due to an increased number of higher technology readiness level technology development efforts to support SOF needs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tagging, Tracking, and Locating Technologies (TTL) Sub-Project"
                                    },
                                    "Description": {
                                        "val": "TTL funds SOF unique ATDs identified in the USSOCOM Quick Look Capabilities Based Assessments (QL-CBA).  TTL rapidly prototypes and expeditiously transitions projects from laboratory to acquisition Programs of Record\/operational use to address SOF capability deficiencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.553"
                                            },
                                            "Text": {
                                                "val": "Exploit and integrate recently-proven and emerging technologies for TTL and TTL-enabling systems. Continue projects toward maturity that are linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA.  Increase focus on tactical sensors and enabling technologies in support of the special reconnaissance mission set."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.572"
                                            },
                                            "Text": {
                                                "val": "Continue to exploit and integrate recently-proven and emerging technologies for TTL and TTL-enabling systems.  Continue projects toward maturity that are linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA.  Continue to increase focus on tactical sensors and enabling technologies in support of the special reconnaissance mission set."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.750"
                                            },
                                            "Text": {
                                                "val": "Continues to exploit and integrate recently-proven and emerging technologies for TTL and TTL-enabling systems.  Continues projects toward maturity that are linked to the USSOCOM\/DOD TTL Roadmap, which is updated via the JCS\/J8-approved annual TTL QL-CBA.  Continues to increase focus on tactical sensors and enabling technologies in support of the special reconnaissance mission set."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $1.178 million to address TTL shortfalls in the maritime and GPS denied environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Classified Sub-Project"
                                    },
                                    "Description": {
                                        "val": "Classified Sub-Project (provided under separate cover)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.456"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.787"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.852"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.852"
                                            },
                                            "Text": {
                                                "val": "Details provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SF101"
                    },
                    "ProjectTitle": {
                        "val": "Engineering Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.188"
                        },
                        "PriorYear": {
                            "val": "8.911"
                        },
                        "CurrentYear": {
                            "val": "14.827"
                        },
                        "BudgetYearOne": {
                            "val": "17.140"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.140"
                        },
                        "BudgetYearTwo": {
                            "val": "17.283"
                        },
                        "BudgetYearThree": {
                            "val": "17.461"
                        },
                        "BudgetYearFour": {
                            "val": "17.795"
                        },
                        "BudgetYearFive": {
                            "val": "18.126"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project provides a rapid response capability to support Special Operations Forces (SOF) platforms (ground, air and maritime), Unmanned Aerial Vehicle (UAV) payload sensors and soldier systems.  The purpose is to correct system deficiencies, improve asset life, and enhance mission capability through the means of feasibility studies, analysis of alternatives, pre-developmental risk reduction studies, and engineering analyses. This project provides the engineering required to improve the design and performance integrity of the SOF platforms, UAV payload sensors and soldier support systems, sub-systems, equipment, and embedded computer software as they relate to the maintenance, overhaul, repair, quality assurance, modifications, materiel improvements, and service life extensions.  This project also conducts risk reduction studies, analyses, and demonstrations to support emerging, time-critical weapons and sensor enhancements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Platform Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Funding supports the development of  rapid response capabilities to support SOF platform and soldier systems.  Rapidly addresses technology needs for insertion into Programs of Record.  Supports technology development to correct system deficiencies, improve platform asset life, and enhance mission capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.647"
                                            },
                                            "Text": {
                                                "val": "For small UAV payloads, identify, assess, and evaluate the risks\/benefits of efforts to reduce the size, weight, and power of current capabilities to be integrated into Group I-III UAV.  Air-to-ground interoperability efforts identify shortfalls and gaps in current SOF air-to-ground communications architecture and recommend and evaluate interoperability enhancements.  For mission suite architectures, identify, assess, and evaluate open architecture approaches to reduce life-cycle costs, increase responsive integration of new capabilities, and increase competition.  In the area of common sensor suites, assess and evaluate individual sensors and suites of sensors to optimize the commonality of sensors between manned ISR fleet and Group IV\/V UAV.  Identify low-cost and high load-out SOPGM and air-launched UAV commodities to reduce costs and provide force multipliers.  Identify, assess, and evaluate risks\/benefits\/suitability of emerging ISR products and suites.  This includes but not limited to: hyper-spectral imaging, moving target indication, LIDAR, SIGINT and high definition EO\/IR capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.649"
                                            },
                                            "Text": {
                                                "val": "Continue to assess concepts and prototypes that provide increased ballistic protection of air, ground and undersea mobility platforms to include manned and unmanned UAVs, and mobility platform improvements to meet emerging threats.  Assess and evaluate advanced precision guided munitions and scalable effects weapons.  Identify, assess and evaluate improved C4 systems that incorporate significant improvements to operate in contested environments, systems that improve situational awareness on the battlefield, and next generation manned and unmanned Intelligence, Surveillance, and Reconnaissance (ISR) systems and common sensors and sensor suites."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.483"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.483"
                                            },
                                            "Text": {
                                                "val": "Continues to assess concepts and prototypes that provide increased ballistic protection of air, ground and undersea mobility platforms to include manned and unmanned UAVs, and mobility platform improvements to meet emerging threats.  Assess and evaluate advanced precision guided munitions and scalable effects weapons.  Identify, assess and evaluate improved C4 systems that incorporate significant improvements to operate in contested environments, systems that improve situational awareness on the battlefield, and next generation manned and unmanned ISR systems and common sensors and sensor suites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.103 million due to minor adjustments in funding required for individual taskings."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Funding supports engineering assessments and evaluation of technology feasibility, producibility, and integration readiness in the following areas: 1) next generation lightweight low-cost body armor and ballistic helmets 2) ballistic and laser variable light transmission protective eyewear 3) soldier worn sensors to assess ballistic and blast events as well as soldier health 4) next generation soldier worn load carriage systems 5) soldier worn head borne communications that provide greater situational awareness and hearing protection."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.477"
                                            },
                                            "Text": {
                                                "val": "Continue to assess advanced body armor and ballistic helmet materials, concepts and prototypes to reduce soldier load and provide increased ballistic protection against the latest emerging threats. Reduce the number of eyewear lenses needed and to have one lens that provides ballistic and laser protection as well as automatically darkens\/lightens based on combat conditions. Evaluate soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assess technologies feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices. Assess proof of concepts and technologies for next generation head borne communications systems that provide reliable and secure wireless transmission in all combat conditions, as well as provide 360 degree situational awareness and noise attenuation while increasing hearing protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Text": {
                                                "val": "Continue to assess advanced body armor and ballistic helmet materials, concepts and prototypes to reduce soldier load and provide increased ballistic protection against the latest emerging threats.  Reduce the number of eyewear lenses needed and to have one lens that provides ballistic and laser protection as well as automatically darkens\/lightens based on combat conditions.  Evaluate soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assess technologies feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices.  Assess proof of concepts and technologies for next generation head borne communications systems that provide reliable and secure wireless transmission in all combat conditions, as well as provide 360 degree situational awareness and noise attenuation while increasing hearing protection."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.489"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.489"
                                            },
                                            "Text": {
                                                "val": "Continues to assess advanced body armor and ballistic helmet materials, concepts and prototypes to reduce soldier load and provide increased ballistic protection against the latest emerging threats.  Reduces the number of eyewear lenses needed and to have one lens that provides ballistic and laser protection as well as automatically darkens\/lightens based on combat conditions.  Evaluates soldier worn sensors and heads up displays for operability within soldier worn components and subsystems.  Assesses technologies feasibility and integration readiness of next generation load carriage systems such as exoskeletons and load-assist devices.  Assesses proof of concepts and technologies for next generation head borne communications systems that provide reliable and secure wireless transmission in all combat conditions, as well as provide 360 degree situational awareness and noise attenuation while increasing hearing protection."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "None."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "National to Theater Engineering Analysis"
                                    },
                                    "Description": {
                                        "val": "Provides additional engineering analysis and testing required to transition items from national forces to theater forces."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.077"
                                            },
                                            "Text": {
                                                "val": "Conduct additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.182"
                                            },
                                            "Text": {
                                                "val": "Conduct additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.202"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.202"
                                            },
                                            "Text": {
                                                "val": "Conducts additional testing and evaluation required on various equipment items such as communications, intelligence, weapons, and operator protection planned for transition to SOF Theater Forces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.020 million is due to minor adjustments required for testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Mission Improved Survivability"
                                    },
                                    "Description": {
                                        "val": "Funding supports engineering analysis activities to address aviation survivability such as signature management, situational awareness, and versatile mission equipment (payloads, communications and weapons) to achieve SOF mission objectives."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.710"
                                            },
                                            "Text": {
                                                "val": "Begin engineering analysis activities to improve SOF aviation mission survivability.  Activities include, but are not limited to signature management (acoustic, infrared, radio frequency), situational awareness with full spectrum threat warning and countermeasures, and versatile mission equipment (payloads, communications and weapons) to improve SOF survivability in less than permissive operating environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "Continue engineering analysis activities to improve SOF aviation mission survivability.  Activities include, but are not limited to signature management (acoustic, infrared, radio frequency), situational awareness with full spectrum threat warning and countermeasures, and versatile mission equipment (payloads, communications and weapons) to improve SOF survivability in less than permissive operating environments.  Proof of concepts will be developed and evaluated for purposes of Advanced Technology Development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.966"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.966"
                                            },
                                            "Text": {
                                                "val": "Continues engineering analysis activities to improve SOF aviation mission survivability.  Activities include, but are not limited to signature management (acoustic, infrared, radio frequency), situational awareness with full spectrum threat warning and countermeasures, and versatile mission equipment (payloads, communications and weapons) to improve SOF survivability in less than permissive operating environments.  Proof of concepts with potential from prior year will be further matured."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $2.466 million is due to expected maturation of early alternative technologies into advanced prototypes capable of flight testing."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "S225"
                    },
                    "ProjectTitle": {
                        "val": "Information and Broadcast Systems Adv Tech"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "14.547"
                        },
                        "PriorYear": {
                            "val": "5.211"
                        },
                        "CurrentYear": {
                            "val": "4.416"
                        },
                        "BudgetYearOne": {
                            "val": "4.592"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.592"
                        },
                        "BudgetYearTwo": {
                            "val": "4.580"
                        },
                        "BudgetYearThree": {
                            "val": "4.689"
                        },
                        "BudgetYearFour": {
                            "val": "4.801"
                        },
                        "BudgetYearFive": {
                            "val": "4.897"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project conducts rapid prototyping of information and broadcast system technology.  Includes cyber capabilities that predict the best media channels to reach potential target audiences, data mining and information collections tools, propaganda and social behavior analytical tools, cultural analysis tool sets and emerging technologies that support the planning and analytical needs for the Military Information Support Operations (MISO) forces.  It provides a means for demonstrating and evaluating the utility of emerging\/advanced technologies in as realistic an operational environment as possible by SOF users.  This project integrates efforts and conducts technology demonstrations in conjunction with joint experiments and other assessment events and performs market research on emerging technologies that support all phases of MISO.  Evaluation results are included in a transition package, which assists in the initiation of or insertion into an acquisition program.  The project also addresses unique, joint special mission or area-specific needs.  Seeks technologies that will transform current MISO capabilities through two major objectives: 1) Exploit technologies capable of disseminating products to reach target audiences across a variety of media to include audiences in denied areas.  2) Automate and improve MISO planning and analytical capability through technologies that are integrated into SOF planning systems (Cultural Analysis, Targeting, Theme Development, Media & Product Selection, Distribution & Dissemination, and Measures of Effectiveness).  Develops software applications that increases the efficiency and shortens the timeline to get MISO dissemination packages approved.  Develops hardware\/software tools that facilitate the collaboration and sharing of information and other critical data."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Broadcast and Dissemination Modernization"
                                    },
                                    "Description": {
                                        "val": "Develops emerging technologies available in the marketplace to transform and modernize planning, analysis, development, broadcast, distribution, dissemination, and feedback capabilities for MISO forces. This initiative will also continue development of appropriate emerging technologies initially identified by Advance Technology Demonstrations and Joint Capability Technology Demonstrations to transition to acquisition programs. Technologies include: multi-frequency broadcast systems; digital broadcast capabilities; remote controlled electronic paper; near-real-time command and control of unattended systems, especially in denied areas; focused\/beam speaker sound technologies; visual projection technologies; advanced commercial broadcast technologies including amplitude modulation and frequency modulation radio transmitters and antenna; television transmitter and antenna systems; internet and telephony dissemination and broadcast systems; technologies capable of long-loiter broadcast and delivery in denied and permissive environment; and technologies that automate and improve planning and analytical capability through integrated capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.211"
                                            },
                                            "Text": {
                                                "val": "Continue to perform engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.416"
                                            },
                                            "Text": {
                                                "val": "Continue performance of engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.592"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.592"
                                            },
                                            "Text": {
                                                "val": "Continues performance of engineering studies, development, and demonstrations of planning, analysis, distribution, and broadcast capabilities.  Incorporate social media engagement to include Artificial Intelligence in the digital domain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $0.213 million due to social media engagement incorporating Artificial Intelligence in the digital domain."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}