{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-3",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605103A"
        },
        "ProgramElementTitle": {
            "val": "Rand Arroyo Center"
        },
        "R1LineNumber": {
            "val": "155"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.863"
            },
            "CurrentYear": {
                "val": "20.14"
            },
            "BudgetYearOne": {
                "val": "19.821"
            },
            "BudgetYearOneBase": {
                "val": "19.821"
            },
            "BudgetYearTwo": {
                "val": "19.913"
            },
            "BudgetYearThree": {
                "val": "20.294"
            },
            "BudgetYearFour": {
                "val": "20.906"
            },
            "BudgetYearFive": {
                "val": "22.032"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "142.969"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) funds the RAND Arroyo Center, the Department of the Army's Federally Funded Research and Development Center (FFRDC) for studies and analysis.  The Arroyo Center draws its researchers from RAND's staff of nearly 700 professionals trained in a broad range of disciplines.  Most staff members work in RAND's principal locations-Santa Monica, California; Arlington, Virginia; and Pittsburgh, Pennsylvania.  The RAND Arroyo Center provides for continuing analytical research across a broad spectrum of issues and concerns, grouped in four major research areas:  Strategy, Doctrine, and Resources; Military Logistics; Manpower and Training; and Force Development and Technology.  The RAND Arroyo Center research agenda is primarily focused on mid\/long-term concerns.  Results and analytical findings directly affect senior leadership deliberations on major issues.  Arroyo Center research is sponsored by the Chief of Staff, Vice Chief, the Deputy Chiefs of Staff of the Army; the Army Assistant Secretaries; and most of the Army's major commands.  The Arroyo Center is provided guidance from the Army through the Arroyo Center Policy Committee (ACPC), which is co-chaired by the Vice Chief of Staff of the Army and the Assistant Secretary of the Army (Acquisition, Logistics and Technology).  The ACPC reviews, monitors, and approves the annual Arroyo Center research plan.  Each project requires General Officer (or Senior Executive Service (SES) equivalent) sponsorship and involvement on a continuing basis.  RAND Arroyo provides the Army with a unique multidisciplinary capability for independent analysis."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.658"
                },
                "CurrentYear": {
                    "val": "20.14"
                },
                "BudgetYearOne": {
                    "val": "20.147"
                },
                "BudgetYearOneBase": {
                    "val": "20.147"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.863"
                },
                "CurrentYear": {
                    "val": "20.14"
                },
                "BudgetYearOne": {
                    "val": "19.821"
                },
                "BudgetYearOneBase": {
                    "val": "19.821"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.795"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.326"
                },
                "BudgetYearOneBase": {
                    "val": "-0.326"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.785"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.01"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "CivPay"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.326"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.326"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "732"
                    },
                    "ProjectTitle": {
                        "val": "Arroyo Center Spt"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.863"
                        },
                        "CurrentYear": {
                            "val": "20.14"
                        },
                        "BudgetYearOne": {
                            "val": "19.821"
                        },
                        "BudgetYearOneBase": {
                            "val": "19.821"
                        },
                        "BudgetYearTwo": {
                            "val": "19.913"
                        },
                        "BudgetYearThree": {
                            "val": "20.294"
                        },
                        "BudgetYearFour": {
                            "val": "20.906"
                        },
                        "BudgetYearFive": {
                            "val": "22.032"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "142.969"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the RAND Arroyo Center, the Department of the Army's Federally Funded Research and Development Center (FFRDC) for studies and analysis. The Arroyo Center draws its researchers from RAND's staff of nearly 700 professionals trained in a broad range of disciplines. Most staff members work in RAND's principal locations-Santa Monica, California; Arlington, Virginia; and Pittsburgh, Pennsylvania.  The RAND Arroyo Center provides for continuing analytical research across a broad spectrum of issues and concerns, grouped in three major research areas: Strategy, Doctrine, and Resources; Forces and Logistics; and Personnel, Training, and Health. The RAND Arroyo Center research agenda is primarily focused on mid\/long-term concerns. Results and analytical findings directly affect senior leadership deliberations on major issues. Arroyo Center research is sponsored by the Chief of Staff, Vice Chief, the Deputy Chiefs of Staff of the Army; the Army Assistant Secretaries; and most of the Army's major commands. The Arroyo Center is provided guidance from the Army through the Arroyo Center Policy Committee (ACPC), which is co-chaired by the Vice Chief of Staff of the Army and the Assistant Secretary of the Army (Acquisition, Logistics and Technology). The ACPC reviews, monitors, and approves the annual Arroyo Center research plan. Each project requires General Officer (or Senior Executive Service (SES) equivalent) sponsorship and involvement on a continuing basis.  RAND Arroyo provides the Army with a unique multidisciplinary capability for independent analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Research addressing manpower and training"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including recruiting and personnel fill requirements; reserve component readiness; leader development; training (major combat operations and stability operations skills); distance learning, simulation training development and application; training support systems; retention (active command\/reserve command); officer career fields, selection, assignment sequencing; and medical forces and operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.899"
                                            },
                                            "Text": {
                                                "val": "The Planned Study program includes numerous key issues for the Army such as recruiting and personnel fill requirements; reserve component readiness; leader development; training (major combat operations and stability operations skills); distance learning, simulation training development and application; training support systems; retention (active command\/reserve command); officer career fields, selection, assignment sequencing; and medical forces and operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.093"
                                            },
                                            "Text": {
                                                "val": "The Planned Study program will include numerous key issues for the Army such as recruiting and personnel fill requirements; reserve component readiness; leader development; training (major combat operations and stability operations skills); distance learning, simulation training development and application; training support systems; retention (active command\/reserve command); officer career fields, selection, assignment sequencing; and medical forces and operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing force development and technology"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including systems and technology analysis; networks and Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR); modeling and simulation; force and organizational development; acquisition policies; and assessment of tactics, techniques, and procedures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.791"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in force development and technology includes key issues for the Army such as systems and technology analysis; networks and C4ISR; modeling and simulation; force and organizational development; acquisition policies; and assessment of tactics, techniques, and procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.979"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in force development and technology will include key issues for the Army such as systems and technology analysis; networks and C4ISR; modeling and simulation; force and organizational development; acquisition policies; and assessment of tactics, techniques, and procedures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing Army logistics"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including supply chain management; fleet management and modernization; logistics force development; and infrastructure management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.253"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in Army logistics includes key issues for the Army such as supply chain management; fleet management and modernization; logistics force development; and infrastructure management."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.42"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in Army logistics will include key issues for the Army such as supply chain management; fleet management and modernization; logistics force development; and infrastructure management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing strategies, doctrine, and resources"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including the evolving operating environment; capabilities to face new challenges; partner capabilities; capabilities for stability operations; improvement of resource management; learning from past and present operations; and supporting Army wargames and analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.682"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in strategy, doctrine, and resources includes key issues for the Army such as the evolving operating environment; capabilities to face new challenges; partner capabilities; capabilities for stability operations; improvement of resource management; learning from past and present operations; and supporting Army wargames and analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.361"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in strategy, doctrine, and resources will include key issues for the Army such as the evolving operating environment; capabilities to face new challenges; partner capabilities; capabilities for stability operations; improvement of resource management; learning from past and present operations; and supporting Army wargames and analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing military health"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including the impact of deployment on soldiers and families; quality of Army health care; medical manpower requirements; medical readiness of soldiers and programs; and implications of advances in medical technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.238"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in military health includes key issues for the Army such as the impact of deployment on soldiers and families; quality of Army health care; medical manpower requirements; medical readiness of soldiers and programs; and implications of advances in medical technology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.287"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in military health will include key issues for the Army such as the impact of deployment on soldiers and families; quality of Army health care; medical manpower requirements; medical readiness of soldiers and programs; and implications of advances in medical technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing personnel, training, and health"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including total workforce management; recruiting and retention; leader development; training readiness and effectiveness; Soldier and family wellness and support."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.341"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.341"
                                            },
                                            "Text": {
                                                "val": "The Planned Study program will include numerous key issues for the Army such as total workforce management; recruiting and retention; leader development; training readiness and effectiveness; Soldier and family wellness and support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing forces and logistics"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including systems and technology analysis; networks and Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance (C4ISR); acquisition policy; force and organizational development; assessment of tactics, techniques, and procedures; supply chain management; fleet maintenance, management and modernization; and tactical, operational, and strategic logistic support"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.45"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.45"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in forces and logistics will include key issues for the Army such as systems and technology analysis; networks and C4ISR; acquisition policy; force and organizational development; assessment of tactics, techniques, and procedures; supply chain management; fleet maintenance, management and modernization; and tactical, operational, and strategic logistic support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Research addressing strategy, doctrine, and resources"
                                    },
                                    "Description": {
                                        "val": "Addresses key issues for the Army, including current and potential threats to national interests and U.S. forces; operating environments and their implications for the Army; doctrine and operational concepts for addressing threats; operating and generating force size, scope, and mix to meet demand; building partner capabilities; learning from past and present operations; strategic risk analysis and resource policy; and Army wargames and related analyses."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.03"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.03"
                                            },
                                            "Text": {
                                                "val": "The Planned Study Program in strategy, doctrine, and resources will include current and potential threats to national interests and U.S. forces; operating environments and their implications for the Army; doctrine and operational concepts for addressing threats; operating and generating force size, scope, and mix to meet demand; building partner capabilities; learning from past and present operations; strategic risk analysis and resource policy; and Army wargames and related analyses."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding represents a continuation of FY18 funding adjusted for civilian pay and inflation rate assumptions. Descriptions of Planned Programs represent a revised categorization of study types, not a termination of ongoing efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}