{
    "id": "2019-AirForce-PB-3600-MJBOOK-2-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-51",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0207605F"
        },
        "ProgramElementTitle": {
            "val": "Wargaming and Simulation Centers"
        },
        "R1LineNumber": {
            "val": "216"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "4.090"
            },
            "CurrentYear": {
                "val": "12.839"
            },
            "BudgetYearOne": {
                "val": "6.141"
            },
            "BudgetYearOneBase": {
                "val": "6.141"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "6.256"
            },
            "BudgetYearThree": {
                "val": "6.365"
            },
            "BudgetYearFour": {
                "val": "6.496"
            },
            "BudgetYearFive": {
                "val": "6.615"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "4.245"
                },
                "CurrentYear": {
                    "val": "12.839"
                },
                "BudgetYearOne": {
                    "val": "13.054"
                },
                "BudgetYearOneBase": {
                    "val": "13.054"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "4.090"
                },
                "CurrentYear": {
                    "val": "12.839"
                },
                "BudgetYearOne": {
                    "val": "6.141"
                },
                "BudgetYearOneBase": {
                    "val": "6.141"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.155"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.913"
                },
                "BudgetYearOneBase": {
                    "val": "-6.913"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.155"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.913"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.913"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY19, PE 0207605F (Wargaming and Simulation Centers), Project 672888, Distributed Mission Operations Center (DMOC) is reduced $6.913M to transfer funds to PE 0207601F (Air, Space, and Cyberspace Constructive Environment - Information Operations Suite, ACE-IOS), Project 674567, Modeling and Simulation Foundations."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "672888"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Mission Operations Center (DMOC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.090"
                        },
                        "CurrentYear": {
                            "val": "12.839"
                        },
                        "BudgetYearOne": {
                            "val": "6.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.141"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.256"
                        },
                        "BudgetYearThree": {
                            "val": "6.365"
                        },
                        "BudgetYearFour": {
                            "val": "6.496"
                        },
                        "BudgetYearFive": {
                            "val": "6.615"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY19, PE 0207605F (Wargaming and Simulation Centers), Project 672888, Distributed Mission Operations Center (DMOC) realigns Air, Space, and Cyberspace Constructive Environment - Information Operations Suite (ACE-IOS), Project 674567, Modeling and Simulation Foundations funds to PE 0207601F (USAF Modeling and Simulation) in order to support execution of Air Force Space Command's information operations simulation efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Mission Operations Center (DMOC) -  The DMOC provides comprehensive Live, Virtual, and Constructive (LVC) simulation capabilities which prepare warfighters to conduct dominant operations in air, space, and cyber domains for theater-level, full spectrum combat training for Air Force, joint service, and coalition partners.  The DMOC training capabilities reach 31 geographically separated LVC locations across 17 time zones representing such assets as real-world weapon systems, operator-in-the-loop, and constructive or computer-driven simulations.  It is responsible for development and integration of scenarios, models, and databases and the integration of participating sites into Virtual Flag (VF) training events via numerous network connections, DMOC-developed interoperability tools, and controlled interfaces in support of Air Force, joint, and coalition warfighter readiness.  In addition, activities include Distributed Mission Operations (DMO) technology and capability studies\/analyses which support both current and future program planning and execution by:\n \n1. Distributed Mission Operations Capability\/Battlespace Systems Development:  The DMOC upgrades and enhances the capabilities of various systems, tools, and simulators to incorporate ever-changing technology and emerging training requirements into DMO events; such as, Virtual Flag (VF) and Coalition VF (CVF) to enhance the quality of warfighter training.  Activities include Environment Generator development, DMO Tool Development, and Simulator Enhancement.  DMOC is in partnership with the US Naval Air Warfare Center-Aircraft Division (NAWCAD) to enhance the capabilities of the Next Generation Threat System (NGTS).  The NGTS is the primary environment generator for both Blue and Red Air in DMOC White Force.  DMO Tool development includes: a.  DMOC Replay Tool (DRT) facilitates a more complete mission review and debrief capability of the exercises as more sites and systems are added to events, b. enhancement & improvement of the Distributed Interactive Simulation (DIS) Filter and the Doctor-J (Dr. J) tools to enable tactical datalinks to be communicated and translated between disparate simulator and operationally fielded (i.e. live aircraft) communication formats, c. Development of Intelligence, Surveillance, and Reconnaissance (ISR)\/Battle Damage Assessment (BDA) to improve damage state models used by intelligence analysts in exercises, and d. development of solutions for integrating Contested Degraded Operations (geographical and communications jamming) into DMO events; and simulator enhancement efforts to incorporate Mission Package standards upgrades into the Control and Reporting Center (CRC) Simulation Package (CSP) to allow a real-world system to be used as a simulator when needed in DMO events.\n\n2. Assessment & Authorization (A&A)\/Software Certification:  The DMOC supports cybersecurity requirements definition, integration\/test support, analysis, systems engineering support, A&A of core systems, and support software certification.  The DMOC implements cybersecurity requirements and is working towards the application of the Risk Management Framework (RMF) and Continuous Monitoring.  Efforts include Cross-Domain Information Sharing \/ Multi-national Information Sharing (CDIS\/MNIS) ruleset development, load sharing, and testing; integration and testing of various newly developed \/ updated systems such as the DMOC Replay Tool, Dr. J, DIS Filter, and the DMOC Battlespace; and support of AFNIC software certification.\n\n3. Distributed Training Sites & Systems Integration:  DMOC integrates up to 30 geographically separated LVC training locations and 50+ systems into LVC DMO training events such as VF and CVF by resolving interoperability issues between disparate systems and networks so that all exercise participants can interact in the DMO environment.  New sites and systems are incorporated into LVC DMO events each year based on higher headquarters and Combatant Commander's (CCDRs) emerging requirements.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver the DMOC weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, and 0605898F.\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipated production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Mission Operations (DMO) Capability \/ Battlespace Systems Development"
                                    },
                                    "Description": {
                                        "val": "Simulation software\/hardware development in support of users conducting RDT&E, mission\nrehearsal, and concepts of operation development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.025"
                                            },
                                            "Text": {
                                                "val": "- Continue NGTS development; enhance NGTS source code to implement future Air Force DMO requirements; enhance versions 3.1.4 - 3.2.0 as future requirements are identified - Continue DMO tool development (DIS Tools, DMOC Replay Tool, Dr. J etc.) as modifications\/improvements are identified after completion of DMO events to support changing M&S technology and emerging AF and CCDR requirements - Support DMOC-S by upgrading systems that incorporate space aspects into DMO events - Commence design on a dedicated network to allow design and testing of new\/updated systems without impacting operational battlespace"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.548"
                                            },
                                            "Text": {
                                                "val": "- Continue DMO tool enhancements\n- Complete testing of software and DMO tools for Win 10\/Red Hat Enterprise Linux (RHEL) 6 conversion\n- Strengthen DMOC\/NAWCAD Partnership: Enhance Next Generation Threat System (NGTS) source code to implement Air Force DMO requirements; develop and install NGTS 3.2.0\n- Develop & execute proof of concept for a virtualization suite; with future goal of full virtualization of the battlespace"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.589"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.589"
                                            },
                                            "Text": {
                                                "val": "- Continue DMO tool enhancements\n- Continue DMOC\/NAWCAD Partnership: Enhance NGTS source code to implement future Air Force DMO requirements, Develop\/Install NGTS 3.2.X\n- Continue to explore, improve,and execute the plan for battlespace virtualization\n- Provide support to Virtual Test and Training Center (VTTC) at Nellis AFB as needed to provide interoperability, integration, and testing of high end advanced training and\ntactics capabilities"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Normal Contract Inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assessment and Authorization (A&A)\/Software Certification"
                                    },
                                    "Description": {
                                        "val": "Support requirements definition, integration test support, scenario development, analysis, systems\nengineering support, and Certification and Accreditation (C&A) and Networthiness of core systems. Implement requirements of Cybersecurity, Risk Management Framework, and Continuous Monitoring."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.353"
                                            },
                                            "Text": {
                                                "val": "- Begin accreditation of the Jumper Room enclave to conduct high-side \/ 5th Generation operations - Commence RMF activities to accredit battlespace by January 2018 - Continue C&A activities to re-accredit DMO Tools, systems, and battlespace modifications - Commence certification of DMOC - Develop software within the Air Force Network Integration Center (AFNIC) Enterprise Product Listing (EPL) standards - Continue support of CVF and RED KITE with Cross Domain Information Sharing (CDIS) ruleset development, testing, and implementation"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.505"
                                            },
                                            "Text": {
                                                "val": "- Support integration\/testing for the following A&A activities: \n  -- Initial and Phase 1 RMF ATO from HAF\/A3 for Battlespace\n  -- Renewal of ATO for Jumper Room with accompanying Systems Security Plan (SSP) modifications for new facility requirements\n  -- Implement architecture design changes to improve cybersecurity measures (fiber upgrade, virtualization, tech refresh)\n  -- Conduct high-side and low-side operations for simultaneous event, utilizing both DMOC enclaves\n- Successfully test and certify DMOC software through AFNIC Enterprise\/Approved Products List (E\/APL) process with new Windows 10 standard\n- Support CVF and RED KITE with CDIS ruleset development, testing, and implementation"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.514"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.514"
                                            },
                                            "Text": {
                                                "val": "- Will continue testing for the following Assessment and Authorization activities:\n  -- Will obtain Phase 2 and final ATO from HAF\/A3 for Battlespace \n  -- Will maintain ATO for Jumper Room with accompanying SSP modifications for even-driven needs\n- Will continue to assess DMOC software for AFNIC E\/APL process viability and test accordingly- Continue support of CVF and RED KITE with CDIS ruleset development, testing, and implementation"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Normal Contract Inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Distributed Training Sites and Systems Integration"
                                    },
                                    "Description": {
                                        "val": "Establish distributed training site system integration and interoperability between DMOC, operational units, and modeling & simulation facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.712"
                                            },
                                            "Text": {
                                                "val": "- Continue development of Live, Virtual, and Constructive (LVC) concepts in support of VF\/CVF\/RED FLAG (RF) integration - Continue 5th Generation and future Distributed Mission Operations Network (DMON) infrastructure integration into DMOC Jumper Room -- Commence support of VF 17-2, NORTHCOM defense in depth of the CONUS from near peer systems, 1st planned use of advanced systems integration (4th\/5th gen fighters, AEGIS, and Patriot) -- Support\/leverage\/collaborate DMOC efforts with Virtual Warfare Center-Nellis (VWC-N), to enable a high end testing and tactics development capability - Support emerging higher headquarters\/Combatant Commander (CCDR) requirements - Commence Virtual-into-Live integration and testing with RF to include virtual Rivet Joint, virtual JSTARS, etc."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.018"
                                            },
                                            "Text": {
                                                "val": "- Continue development of LVC concepts in support of VF\/CVF\/RED FLAG (RF) integration efforts\n- Continue integration of 5th generation capabilities and infrastructure into DMOC Jumper Room\n  -- VF 18-2, NORTHCOM homeland defense in depth of the CONUS with advanced systems integration (4th\/5th generation fighters, AEGIS, and Patriot)\n- Support\/leverage\/collaborate DMOC efforts with Virtual Test and Traiing Center (VTTC) at Nellis to enable a high end advanced testing and tactics (HEAT2) capability\n- Support emerging higher headquarters\/Combatant Commander's (CCDR) requirements\n- Continue Virtual-into-Live integration and testing with Nellis Test and Training Range (NTTR)\/Virtual Test and Training Center (VTTC)\/Red Flag (RF) to include virtual Rivet Joint, virtual JSTARS, Battle Space Command and Control Center (BC3), etc."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.038"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.038"
                                            },
                                            "Text": {
                                                "val": "- Will continue the development of LVC concepts in support of VF\/CVF\/RF integration efforts\n- Will continue to support\/leverage\/collaborate DMOC efforts with Virtual Test and Training Center at Nellis to enable a high end advanced testing and tactics (HEAT2) capability\n- Continue to support emerging higher headquarters\/CCDR requirements\n- Continue Virtual-into-Live integration and testing with NTTR\/VTTC\/RF"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Normal Contract Inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air, Space and Cyberspace Collaborative Environment - Information Operations Suite (ACE-IOS)"
                                    },
                                    "Description": {
                                        "val": "Air, Space and Cyberspace Collaborative Environment - Information Operations Suite (ACE-IOS) provides the authoritative representation of Air Force information operations. ACE-IOS is comprised of models that support training and mission rehearsal for the Air Force, Joint Task Force commanders, and Combatant Commander's battle staffs during Joint and Service exercises and experimentations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.768"
                                            },
                                            "Text": {
                                                "val": "- Complete ACE-IOS version 5.0.19 open systems architecture design and underlying communication infrastructure, evolving from 5.0.18 \n- Complete development of license-free replacements for two commercial licensed applications \n- Complete control Graphical User Interfaces (GUIs) and run-time scripts for process monitoring and control of the system \n- Complete design of Supervisory Control and Data Acquisition (SCADA) and cascading battlefield effects \n- Replace National Wargaming System \n- Complete the capability for initial intelligence paint and fused intelligence reporting \n- Will maintain Certification and Accreditation to achieve certificate to field award"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to ACE-IOS efforts being transferred to PE 0207601F, USAF Modeling and Simulation."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "Distributed Mission Operations Center (DMOC):\n\nThe DMOC supports AF\/Joint\/Coalition DMO and the Joint National Training Capability (JNTC) through the development and integration of DMO training and test events, networks, scenarios, and databases. Due to evolving modeling & simulation technology, the DMOC is an on-going, evolutionary effort to keep pace with those changes by continuously developing\/upgrading DMO environment generators, systems, and tools and ensuring integration\/interoperability of new systems into DMO to provide the best warfighter training possible.\n\nDMOC has the following two primary contracts that manage the acquisition, development, testing, and integration of DMO standards, training, modeling and simulation, cross-domain information sharing testbed, and exercises on AF\/Joint\/Coalition DMO networks.  Additionally, Military Interdepartmental Purchase Requests (MIPRs) are sent to other external organizations (i.e. NAWCAD and DMOC-S) to fund development of DMO tools that support DMOC efforts.\n\nInfrastructure, Development, and Engineering (IDE) Contract: Develops\/upgrades various DMOC tools, systems, and simulators that are needed to conduct DMO training events. Develops, implements, and tests technical solutions for the integration of sites\/systems into VF, CVF, and other DMO events. The current IDE contract is cost-plus-fixed-fee with multiple task orders awarded for individual projects over the course of the fiscal year, and the follow-on IDE contract, which is scheduled to be awarded in the 2nd quarter of FY17, will be firm-fixed-price.\n\nCommand and Control Technical Support Contract (C2TSC): Supports government by assisting with development of technical requirements for upgrades to various systems and tools that will be developed by the IDE contractor and then performs acceptance testing of the those products. Develops requirements for site\/system integration of sites\/systems into VF, CVF, and other DMO events. C2TSC is a firm-fixed-price contract."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Distributed Mission Operations (DMO) Capability \/ Battlespace Systems Development, Certification & Accreditation (C&A) and Networthiness, and Distributed Training Sites& Systems Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.225"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.165"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "94.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Follow-on Distributed Mission Operations (DMO) Capability \/ Battlespace Systems Development, Certification& Accreditation (C&A) and Networthiness, and Distributed Training Sites & Systems Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.355"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-05"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.656"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.656"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "75.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "NAWCAD NGTS Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "J.F. Taylor, Inc."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.340"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ACE-IOS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CACI, Inc"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lackland AFB, TX"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.193"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "50.665"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical requirements development, integration\/acceptance testing, and engineering support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Alpha-Omega"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.148"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-07"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.562"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "30.000"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Follow-on requirements development, integration\/ acceptance testing, and engineering support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.043"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.185"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.185"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DMOC Program Management Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "705 CTS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.377"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "ACE-IOS Program Management Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "90 COS"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Lackland AFC, TX"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.791"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "DMO"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "DMO Capability \/ Battlespace Systems Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Virtual Flag (VF)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Virtual Flag \/ Coalition Virtual Flag exercises"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ACE-IOS"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "ACE-IOS Version 5.0.19"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}