{
    "id": "2019-Navy-PB-1319-JBOOK-537288bb42cd06b820f36efcf65b2a737491c736bab4820c1757960e05e3c4ff-17",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603114N"
        },
        "ProgramElementTitle": {
            "val": "Power Projection Advanced Technology"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "97.122"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "97.122"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The activities described in this program element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security.  They are based on input from Naval Research Enterprise stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains.\n\nThe programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "96.406"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "97.122"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.716"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.301"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.585"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding decrease from FY 2017 to FY 2018 reflects the realignment of the remaining Precision Strike Technology efforts to PE 0603758N Navy Warfighting Experimentation and Demonstration.  Additionally, Innovative Naval Prototypes (INPs) Electromagnetic Railgun (EMRG) and Solid State Laser (SSL) program work will continue in the new INP PE 0603801N Innovative Naval Prototypes.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "2911"
                    },
                    "ProjectTitle": {
                        "val": "Power Proj Adv Tech"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "97.122"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "97.122"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project supports the Time Critical Strike (TCS) and ForceNet FNC components which address technological issues associated with the development of strike weapons that significantly decrease the launch to engagement timeline; provide the Navy of the future the ability to quickly locate, target, and strike critical targets; and enhance mission capabilities and operational utility of Naval forces by dramatically increasing the autonomy, performance, and affordability of Naval organic, Unmanned Vehicle systems. The Navy is furthering the development of solid state, high energy laser technology for use as a weapon system on future surface ships."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PRECISION STRIKE TECHNOLOGY"
                                    },
                                    "Description": {
                                        "val": "Efforts in this area support Naval Precision Strike Operations, providing the Navy capability to quickly locate, target, and strike critical targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "97.122"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued kill-chain studies to identify and recommend engineering trades to enable weapon system interoperability and data fusion alternatives. These studies assess engineering feasibility of various kill-chain options and assess the capability provided.\n\n- Continued EMRG.  The EMRG capability will support Naval Surface Fire Support (NSFS), Integrated Air and Missile Defense (IAMD), Fast Attack Craft and Fast Inshore Attack Craft (FAC\/FIAC) and Anti-Surface Warfare (ASuW) missions.  Design, fabricate and integrate Electro Magnetic (EM) railgun subsystems and components into a system prototype capable of rep-rate operations.  Assess the manufacturability of major components such as the railgun launcher and pulsed power modules, which are key to the technology capability. Conduct preliminary prototype system tests and demonstrations to prove the technological feasibility of the EMRG capability and assess sub-system and componentoperability under stressing rep-rate conditions.  Continue developing and testing a prototype rep-rate railgun launcher that is suitable for installation in a prototype railgun gun mount, where the design of the power and energy architecture necessary to support the prototype EMRG system can be assessed. Continue to test and build full-scale electro-magnetic railgun system prototypes that include the battery charging system, the pulsed power subsystem, and the electromagnetic launcher. Perform full-scale testing of long-life railgun launcher material solutions inserted in laboratory launchers. Design, build, test, and evaluate iterative electromagnetic railgun composite launcher prototypes to demonstrate the technological feasibility, performance, multi-shot life, and suitable firing rate of the system.  Continue activities to integrate and test a Hyper Velocity Projectile (HVP) for use with the EMRG.\n\n- Continued SSL TM.  Continue development of a maritime laser weapons system prototype and test it on a representative test platform for a naval surface combatant. Conduct the required laser weapon system engineering, design, integration and testing necessary to have a testable, experimental prototype. This system will be capable of supporting missions such as defense against small boat and Unmanned Aerial Vehicle (UAV) swarms and Intelligence, Surveillance and Reconnaissance (ISR) disruption and defeat.  The results of scientific and engineering trade studies, including those that measure atmospheric absorption and turbulence, will be used to support the integration and testing of a maritime beam director and a high power, Solid State Laser (SSL) capable of tracking and engaging surface and airborne targets at a relevant stand-off distance in the maritime environment.  A Hybrid Predictive Avoidance Safety System (HPASS) will be integrated with a solid state laser weapon system demonstrator to de-conflict laser operations with friendly sensors and platforms. At-sea testing will be conducted on the full laser weapon system demonstrator (i.e., prototype) from a representative test platform for a naval surface combatant."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2017 to FY 2018 reflects the realignment of the remaining Precision Strike Technology efforts to PE 0603758N Navy Warfighting Experimentation and Demonstration.  Additionally, Innovative Naval Prototypes (INPs) Electromagnetic Railgun (EMRG) and Solid State Laser (SSL) program work will continue in the new INP PE 0603801N Innovative Naval Prototypes."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "The metrics used are programmatic milestones and technical milestones, such as completion of technical trade studies examining suitable technologies for subsequent prototype development; incremental laboratory and field testing of components and sub-systems; and delivery of industry-developed prototypes for demonstration."
                        }
                    }
                }
            ]
        }
    }
}