{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-f6ce2d6fdd72f55e6bde81509aa64b9e4fd9e88c2a3ca324177acd603679c7b4-6",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602715E"
        },
        "ProgramElementTitle": {
            "val": "MATERIALS AND BIOLOGICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "208.855"
            },
            "CurrentYear": {
                "val": "224.440"
            },
            "BudgetYearOne": {
                "val": "226.898"
            },
            "BudgetYearOneBase": {
                "val": "226.898"
            },
            "BudgetYearTwo": {
                "val": "224.572"
            },
            "BudgetYearThree": {
                "val": "249.278"
            },
            "BudgetYearFour": {
                "val": "241.391"
            },
            "BudgetYearFive": {
                "val": "244.914"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Materials and Biological Technology Program Element is budgeted in the Applied Research Budget Activity because its objective is to develop material, biological and energy technologies that make possible a wide range of new military capabilities.\n\nThe major goal of the Materials Processing Technology project is to develop novel materials, fabrication and processing techniques, models, devices and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems. Included in this project are efforts across a wide range of technology areas including manufacturing, electronics, sensors, optics, and complex and autonomous systems.\n\nThe Biologically Based Materials and Devices project acknowledges the growing and pervasive influence of the biological sciences on the development of new DoD capabilities. This influence extends throughout the development of new materials, devices, and processes and relies on the integration of biological breakthroughs with those in engineering and the physical sciences. Contained in this project are thrusts that apply biology's unique fabrication and manufacturing capabilities to produce novel chemicals and materials at scale, as well as research to develop new high-throughput methods and devices to analyze biological changes at the cellular and molecular level. Additional work leverages advances in synthetic biology to engineer novel biological systems and develop new approaches to biosecurity. This project also includes major efforts aimed at integrating biological, computational, and digital sensing methodologies to explore neuroscience technology and maintain human combat performance."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "220.456"
                },
                "CurrentYear": {
                    "val": "224.440"
                },
                "BudgetYearOne": {
                    "val": "232.700"
                },
                "BudgetYearOneBase": {
                    "val": "232.700"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "208.855"
                },
                "CurrentYear": {
                    "val": "224.440"
                },
                "BudgetYearOne": {
                    "val": "226.898"
                },
                "BudgetYearOneBase": {
                    "val": "226.898"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.601"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.802"
                },
                "BudgetYearOneBase": {
                    "val": "-5.802"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-3.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.601"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-5.802"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.802"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects Congressional reduction, reprogrammings and the SBIR\/STTR transfer.   \nFY 2018:  N\/A\nFY 2019:  Decrease reflects completion of the BioDesign and Biological Robustness in Complex Settings programs in FY 2018."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MBT-01"
                    },
                    "ProjectTitle": {
                        "val": "MATERIALS PROCESSING TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "114.655"
                        },
                        "CurrentYear": {
                            "val": "112.050"
                        },
                        "BudgetYearOne": {
                            "val": "108.766"
                        },
                        "BudgetYearOneBase": {
                            "val": "108.766"
                        },
                        "BudgetYearTwo": {
                            "val": "111.608"
                        },
                        "BudgetYearThree": {
                            "val": "130.928"
                        },
                        "BudgetYearFour": {
                            "val": "130.928"
                        },
                        "BudgetYearFive": {
                            "val": "141.029"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The major goal of the Materials Processing Technology project is to develop novel materials, fabrication and processing techniques, models, devices and components that will lower the cost, increase the performance, and\/or enable new missions for military platforms and systems.  Included in this project are efforts across a wide range of technology areas including manufacturing, electronics, sensors, optics, and complex and autonomous systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Materials Processing and Manufacturing"
                                    },
                                    "Description": {
                                        "val": "The Materials Processing and Manufacturing thrust is exploring new manufacturing and processing approaches that will dramatically lower the cost and decrease the time required to fabricate DoD parts and systems.  It will also develop approaches that yield new materials, materials capabilities and parts that cannot be made through conventional processing approaches, as well as address efficient, low-volume manufacturing.  As a result of recent advances in manufacturing techniques such as 3D printing and manufacture on demand, and the push towards programmable hardware in embedded systems, the development cycle from design to production of both hardware and software is severely bottlenecked at the design phase.  Integration of advanced materials with superior properties into manufacturing approaches is also complex and slow, hampering new materials integration and evolution of design.  Research within this thrust will create methods to translate natural inputs into software code and mechanical design, as well as reduce manufacturing complexity through new material feedstock formats with reconfigurable processing technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.098"
                                            },
                                            "Text": {
                                                "val": "-  Completed verification and validation of probabilistic processing model suite.\n-  Validated phenomenological model framework. \n-  Demonstrated rapid qualification capability on demonstration components. \n-  Developed an aligned and tailorable planar material feedstock that meets or exceeds state-of-the-art aerospace materials capability.\n-  Delivered a reconfigurable forming machine for reinforced matrix compounds to be formed into complex shapes for DoD parts. \n-  Initiated creation of a cost model that assesses cost competitiveness and rate insensitivity of the new material format and forming process.\n-  Established process limits of forming capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.216"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate capability to fabricate metallic hardware using direct metal laser sintering (DMLS) displaying defect distribution similar to prediction of process simulation hardware. \n-  Demonstrate ability of process-microstructure-tensile models to define optimized probabilistic process window for electron beam additive manufacturing (EBAM) to ensure fabricated material meets minimum properties. \n-  Account for effects of scale in composite bond process model by building larger component box test articles. \n-  Develop and demonstrate integrated hierarchical framework of empirical, process, and physics models that predicts cumulative density functions for component quantities of interest.\n-  Demonstrate a reconfigurable forming method at production rate for short element reinforced matrix compounds that meets or exceeds current DoD performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.800"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate pilot-scale production of tailorable, high-performance carbon fiber-based feedstock that meets or exceeds state-of-the-art aerospace materials capability.\n-  Demonstrate that a multifunctional element can be incorporated into the feedstock while maintaining performance. \n-  Demonstrate that a multifunctional component can be formed without degradation of performance in either the structural or the functional component."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is due to refocus of efforts outside of manufacturing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Chemical Processing for Force Protection"
                                    },
                                    "Description": {
                                        "val": "Research in this thrust is focused on the development of new chemical approaches and technologies across a broad spectrum of DoD needs.  One area involves development of innovative approaches for scalable small molecule synthesis coupled with predictive tools for route design, possibly offering a new strategy to discover how to make new molecules such as pharmaceuticals and explosives.  Another focus combines existing strategies for destruction of chemical agents with development of new processing methods to provide a remediation system that can process any chemical agent at the site of storage.  In addition, investments in this thrust will advance chemical characterization, information management and analysis, and automation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "26.654"
                                            },
                                            "Text": {
                                                "val": "-  Validated in-line analytical monitoring of newly developed chemical remediation approaches.  \n-  Increased chemical remediation\/conversion of DoD-relevant model compounds to 99.9%. \n-  Initiated designs for extension of small-scale, continuous flow molecular syntheses to metric ton\/year equivalent. \n-  Demonstrated the automated route design and continuous flow synthesis of one challenge molecule identified by DARPA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.434"
                                            },
                                            "Text": {
                                                "val": "-  Increase chemical remediation\/conversion of DoD-relevant model compounds to 99.999%. \n-  Integrate inline monitoring with remediation\/conversion system to yield initial prototype. \n-  Demonstrate the automated route design and continuous flow synthesis of a structurally complex active pharmaceutical ingredient (API) such as naproxen or pregabalin. \n-  Integrate the automated route design with the continuous flow system to yield a fully automated synthesis of three DARPA-defined challenge molecules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.452"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate continuous flow synthesis of a molecule requiring a convergent approach (e.g., synthesis and subsequent combination of two intermediates). \n-  Scale fully automated synthesis of one molecule and demonstrate capability for 1 metric ton\/year equivalent with three days of continuous operation.\n-  Develop a computational map of synthetic capabilities for existing modules that outlines the potential suite of molecules that can be generated in the automated device. \n-  Demonstrate rapid search of reaction conditions (1,000s of reactions per hour) and initiate integration of these data into route design algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Functional Materials and Devices"
                                    },
                                    "Description": {
                                        "val": "The Functional Materials and Devices thrust is developing advanced materials, components and systems to improve device performance for DoD sensing, imaging and communication applications.  One focus of this thrust involves development of advanced transductional materials that convert one form of energy to another for DoD-relevant applications in areas such as thermoelectrics.  While promising transduction materials are known for a variety of applications, integration into devices has not been realized.  Another focus area involves development of new multi-functional materials and device designs that will radically decrease the size, weight and power requirements of neutron sources for high-resolution neutron and x-ray imaging.  Such devices should enable fieldable detection units for non-destructive evaluation of parts, detection of explosives and other DoD-relevant targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.597"
                                            },
                                            "Text": {
                                                "val": "-  Developed multi-physics transductional material modeling capability that incorporates interface modeling and phonon engineering. \n-  Delivered proof of concept thermoelectric devices with improved performance over the state-of-the-art. \n-  Delivered proof of concept devices based on multiferroic or phase change materials with improved performance over the state-of-the-art. \n-  Identified successful compact neutron source components and began to integrate them into prototype systems. \n-  Performed initial integrated compact neutron source prototype testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.320"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate integrated transductional materials and device multi-physics models. \n-  Perform final round of optimization of transductional materials and devices, and characterize their technical performance. \n-  Provide updates to transductional models and deliver them in modeling software. \n-  Integrate earlier developed materials\/devices into a system proof of concept. \n-  Refine final integrated compact neutron source prototypes.  \n-  Perform final integrated compact neutron source prototype testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.845"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.845"
                                            },
                                            "Text": {
                                                "val": "-  Initiate research in high velocity energy transfer. \n-  Initiate applications of novel quantum mechanical systems to computing. \n-  Demonstrate new computational architectures based on new state-change and\/or state-manipulation in materials. \n-  Design and demonstrate metamaterial based sensors that have the ability to observe\/detect through complex media."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects shift in focus to the Accelerating Discovery and Innovation thrust area."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Systems"
                                    },
                                    "Description": {
                                        "val": "In the Reconfigurable Systems thrust, new approaches are being developed to enable more rapid and robust adaptation of defense systems and systems-of-systems to changing mission requirements and unpredictable environments.  This includes development of capabilities across sensing, perception, planning and control for autonomous, high-speed operation in cluttered environments without Global Positioning System (GPS) information.  Additional work in this thrust focuses on how sensing systems and military systems-of-systems are designed for real-time resilient response to dynamic, unexpected signals and contingencies.  Research is developing a more unified view of system behavior that allows better understanding and exploitation of complex interactions among components, including development of formal mathematical approaches to complex adaptive system composition and design.  These capabilities will impact autonomous systems and systems-of-systems, including those that involve humans, in a variety of DoD-relevant contexts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.285"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated high speed (>10 meters per second (m\/s)) GPS-free flight in low clutter environment. \n-  Demonstrated fully autonomous GPS-free flight in unknown environment. \n-  Developed novel representations and behaviors that enable an ISR mission in a high-clutter environment. \n-  Established new paradigms for how systems-of-systems and their constituent parts are represented, manipulated, integrated and optimized. \n-  Demonstrated management of complexity to enable dynamic design and composition of system-of-systems and their capabilities. \n-  Demonstrated utility of new mathematical and algorithmic methods for system-of-systems design challenges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.280"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate high speed (>10 m\/s) GPS-free flight in moderate clutter. \n-  Demonstrate end-to-end mission capabilities including transition from outdoor to indoor flight. \n-  Demonstrate integration of new mathematical and algorithmic methods into design framework.  \n-  Determine limitations of composable abstractions and formally define composability constraints.  \n-  Validate time-dynamic function model against war game data.\n-  Initiate development of computationally tractable strategies for distributed, autonomous detection and tracking of chemical threats in urban environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.889"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.889"
                                            },
                                            "Text": {
                                                "val": "-  Develop capability for self-diagnosis of current system performance from arbitrary set of sensors, behaviors, and constraints. \n-  Demonstrate closed-loop single functional recomposition from a set of sub-system components.  \n-  Demonstrate redesign of system function to attrition and environmental change.  \n-  Develop generalizable strategies for sensor network designs that minimize complexity and maximize coverage. \n-  Develop data collection and processing strategies that maximize signal-to-noise and enable determination of signal directionality with conventional sensors. \n-  Integrate sensors in a network to determine and track signal location in complex (turbulent) airflow conditions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerating Discovery and Innovation"
                                    },
                                    "Description": {
                                        "val": "The Accelerating Discovery and Innovation thrust is developing new approaches, tools and technologies to speed the pace of scientific discoveries and technological innovations from idea generation and fundamental research through integration of technologies into fieldable products and systems in production.  The path from idea generation to a discovery is a lengthy, complex process involving many unpredictable steps, cycles and stages across fundamental and applied research and development.  Research in this thrust is focused on developing and implementing strategies to address many of the challenges and bottlenecks inherent along this path and to speed the rate at which an idea can be advanced into a concrete capability.  Specific approaches include advanced multiplayer gaming technologies to catalyze development of new technology concepts, development of tools for data collection and visualization to accelerate fundamental and applied research, and strategies to understand how seemingly benign commercially available technologies may be converted or combined into threats to military operations, equipment or personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.021"
                                            },
                                            "Text": {
                                                "val": "-  Built prototypes of commercially available threats and completed detailed assessments.  \n-  Developed methods to rapidly explore potential applications of newly discovered or newly developed science and technology. \n-  Developed computational methods to automate analysis of scientific and engineering data which improve its accessibility and enable new discoveries. \n-  Executed pilot projects to analyze data collected in current DARPA programs and tested the automated analysis methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.800"
                                            },
                                            "Text": {
                                                "val": "-  Develop high rate, integrated assembly processes that bridge the nanometer to centimeter length scales. \n-  Investigate the applicability of feedstock assembly techniques for complex and heterogeneous systems. \n-  Test methods for accelerating discoveries in the research community to demonstrate reduction in time for new idea generation and technology application.  \n-  Define integrated technology demonstrations to support scientific discovery and engineering innovation in areas of agency focus."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "34.780"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "34.780"
                                            },
                                            "Text": {
                                                "val": "-  Investigate methods for the scale-up of nano- and micro-assembly techniques.\n-  Test and evaluate retention of nanoscale properties when assembly process is scaled-up. \n-  Develop software tools to facilitate an analytic multi-disciplinary conversation to facilitate the collective understanding and potential implications of emerging science and technology. \n-  Develop software systems to aid in identifying emerging science and technology concepts and applications based on existing understanding. \n-  Design and build a set of interoperable kits for military applications from easily obtainable components.\n-  Design and build a highly capable reconnaissance-strike system that integrates the interoperable kits. \n-  Test the reconnaissance-strike system(s) with military partners. \n-  Investigate the understanding of what enables projected animations to be perceived as real. \n-  Investigate new methods for studying human collectives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects acceleration of technology advancements to support the warfighter and new investments in scientific discovery."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MBT-02"
                    },
                    "ProjectTitle": {
                        "val": "BIOLOGICALLY BASED MATERIALS AND DEVICES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "94.200"
                        },
                        "CurrentYear": {
                            "val": "112.390"
                        },
                        "BudgetYearOne": {
                            "val": "118.132"
                        },
                        "BudgetYearOneBase": {
                            "val": "118.132"
                        },
                        "BudgetYearTwo": {
                            "val": "112.964"
                        },
                        "BudgetYearThree": {
                            "val": "118.350"
                        },
                        "BudgetYearFour": {
                            "val": "110.463"
                        },
                        "BudgetYearFive": {
                            "val": "103.885"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Biologically Based Materials and Devices project will leverage the growing and pervasive influence of the biological sciences for the development of new DoD capabilities.  Contained in this project are thrusts that apply biology's unique fabrication and manufacturing capabilities to produce and detect novel DoD relevant chemicals, materials at scale, and devices for overmatch.  Example projects include analyzing biological threats at the cellular and molecular level, mitigating the effect of threat agents on deployed warfighters, and developing remote, persistent sensor systems to detect terrestrial and maritime threats.  This project also includes efforts to develop neuroscience technology for maintaining human combat performance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Living Foundries"
                                    },
                                    "Description": {
                                        "val": "The goal of the Living Foundries program is to create a revolutionary, biologically-based manufacturing platform for the DoD and the Nation.  With its ability to perform complex chemistries, be flexibly programmed through DNA code, scale, adapt to changing environments, and self-repair, biology represents one of the most powerful manufacturing platforms known.  Living Foundries seeks to develop the foundational technological infrastructure to transform biology into an engineering practice, speeding the biological design-build-test-learn cycle and expanding the complexity of systems that can be engineered.  Ultimately, Living Foundries aims to provide game-changing manufacturing paradigms for the DoD, enabling adaptable, on-demand production of critical and high-value molecules.\n\nResearch thrusts will focus on the development and demonstration of open technology platforms to prove out capabilities for rapid (months vs. years) design and construction of new bio-production systems.  The result will be an integrated, modular infrastructure across the areas of design, fabrication, debugging, analysis, optimization, and validation -- spanning the entire development life-cycle and enabling the ability to rapidly assess and improve designs.  Key to success will be tight coupling of computational design, fabrication of systems, debugging using multiple characterization data types, analysis, and further development such that iterative design and experimentation will be accurate, efficient and controlled.  Demonstration platforms will be challenged to build a variety of DoD-relevant, novel molecules with complex functionalities, such as synthesis of advanced, functional chemicals, materials precursors, and polymers (e.g., those tolerant of harsh environments).  This program has basic research efforts funded in PE 0601101E, Project TRS-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.712"
                                            },
                                            "Text": {
                                                "val": "-  Further advanced infrastructure pipelines capable of rapidly prototyping and generating DoD-relevant molecules, with significant emphasis on system integration, throughput, and process optimization.\n-  Continued pressure tests of the infrastructure facilities to test capabilities of the design and prototyping pipelines in demonstrating the speed, breadth, and efficacy of the infrastructure designs.\n-  Tested the ability to produce ten molecules that are relevant to the DoD.\n-  Incorporated learn capabilities into design algorithms based on testing and characterization of previously prototyped targets in order to improve the processes.\n-  Developed the infrastructure pipelines to prototype production of molecules."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.020"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate infrastructure pipelines capable of rapidly prototyping and generating DoD-relevant molecules in a semi-automated manner and initiate efforts to achieve full automation.\n-  Test the ability to produce an additional set of ten molecules that are relevant to the DoD.\n-  Demonstrate that the infrastructure pipeline is capable of rapidly prototyping strains that produce molecules.\n-  Characterize impact of machine learning capabilities on design algorithms and identify increases in prototyping process efficiency."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.430"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.430"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a fully automated infrastructure pipeline capable of prototyping and generating DoD-relevant molecules.\n-  Demonstrate ability to scale production of molecules to kilogram scale using biology.\n-  Conduct pressure tests at the prototyping and design facility to evaluate the speed, breadth, and efficacy of the infrastructure designs.  \n-  Investigate methods to generate molecules that have not been previously synthesized using traditional chemistry."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects focused effort and limited infrastructure pipeline pressure testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Immunomodulation-Based Therapeutics"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Immunomodulation-Based Therapeutics program will develop platform technologies to interrogate and define the biological pathways that will enhance operational readiness for DoD personnel.  This program will aid the warfighter by improving immune response, minimizing inflammation, and restoring critical organ function post trauma.  One approach to achieve this capability will require the development of new tools to stimulate and measure responses of the nervous system in order to harness the bioelectric code, enabling targeted therapy without the need for pharmacological products, ultimately reducing logistical requirements.  An additional approach involves characterizing the host response in patients with severe infections, which provides a quantitative framework to guide therapy.  Algorithms will be developed to evaluate and predict various physiological conditions for military personnel.  Advances made under the Adaptive Immunomodulation-Based Therapeutics program will improve the response capabilities against severe biological threats and offer new avenues for treating disease or organ function to improve force readiness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.460"
                                            },
                                            "Text": {
                                                "val": "-  Initiated demonstrations of advanced peripheral nerve interface technologies in small and large animal models to improve inflammatory and neuropsychiatric disease outcomes.\n-  Developed computational models to simulate noninvasive peripheral nerve modulation approaches for desired physiological outcome.\n-  Elucidated mechanisms of action for peripheral nerve modulation via noninvasive techniques.\n-  Identified panels of relevant biomarkers that are indicative of diseased state and provided reliable and specific surrogate measures to track physiological response to peripheral nerve modulation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.962"
                                            },
                                            "Text": {
                                                "val": "-  Refine anatomical maps and computational models of function for target neurophysiological circuits.\n-  Quantify on-target responses to neurostimulation to validate computational models of feedback signals and therapeutic benefit.\n-  Demonstrate the components comprising an integrated, closed-loop neuromodulation system to control health status in human or large animal studies.\n-  Conduct in vivo safety and efficacy studies to evaluate long-term bio-interface functionality."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.006"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.006"
                                            },
                                            "Text": {
                                                "val": "-  Quantify on-target responses to neurostimulation to validate feedback biomarkers, evaluate therapeutic benefit, and demonstrate circuit specificity.\n-  Implement computational models of integrated neuromodulation and biomarker signaling for feedback control of health status.\n-  Demonstrate sustained functionality of novel bio-interfaces for neuromodulatory control of health status in animal models.\n-  Initiate clinical trials of closed-loop neuromodulation system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhancing Neuroplasticity"
                                    },
                                    "Description": {
                                        "val": "The DoD needs tools to rapidly and effectively train military personnel in multifaceted and complex tasks.  The Enhancing Neuroplasticity program will explore and develop stimulation methods and non-invasive devices to promote synaptic plasticity for improved learning paradigms.  Key advances anticipated from this research will both create an anatomical and functional map of the underlying biological circuitry that mediates plasticity and optimize stimulation and training protocols to enable long-term retention for military personnel.  Once successfully identified, the underlying mechanisms of targeted plasticity training can be applied to a broad range of cognitive skill training within the DoD, including foreign language learning, or data and intelligence analysis."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.601"
                                            },
                                            "Text": {
                                                "val": "-  Investigated effects of peripheral nerve stimulation parameters on brain regions that modulate plasticity.\n-  Initiated comparison of effectiveness of nerve stimulation sites and stimulation intensity parameters on synaptic plasticity and performance impacts on select learning tasks.\n-  Demonstrated effects of training on neurons in task-specific sensory and\/or motor areas of the brain.\n-  Initiated studies to compare efficacy of invasive and noninvasive stimulators."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.430"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate effects of training on neurons and neuronal network connectivity in task-specific areas of the brain.\n-  Evaluate mechanistic components of targeted neuroplasticity training on brain neurophysiology and learning rate.\n-  Investigate mechanisms for modulating neuroplasticity in humans with peripheral neurostimulation devices.\n-  Test for off-target effects of peripheral neurostimulation and training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.290"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.290"
                                            },
                                            "Text": {
                                                "val": "-  Compare effects of various nerve stimulation targets on brain neurophysiology and learning rate.\n-  Assess the combined impacts of neuromodulator receptor optimization with peripheral nerve stimulation to improve cognitive task performance.\n-  Determine efficacy of various biomarkers to validate target nerve stimulation.\n-  Initiate clinical studies of non-invasive nerve stimulation on learning."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects transition of successful technologies to initial clinical studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Genome Protection Technologies*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Biosecurity for Biotechnology\n\nThe Genome Protection Technologies program will develop advances in critical efforts to generate a biodefense capability to control, counter, and reverse the effects of accidental or malicious misuse of gene editing technologies.  This research will investigate new approaches for developing tunable controls to enable the safe and predictable use of synthetic genes and pathways.  Additional work will develop protecting measures to prevent or limit unintended genome editing or engineering and develop new tools to recall or reverse engineered changes.  Advances within this program will ensure that the U.S. remains at the vanguard of this now widespread, rapidly advancing field that poses potential national security threats due to the large-scale democratization of gene editing technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "-  Investigated novel gene editing controller mechanisms and failure modes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.844"
                                            },
                                            "Text": {
                                                "val": "-  Investigate novel small molecule and genetic countermeasures to prevent gene editing in cells.\n-  Design and create engineered, reversible genetic elements for evaluation in a laboratory testbed.\n-  Characterize the efficacy, stability, and fitness of engineered genetic constructs and countermeasures in a contained laboratory testbed.\n-  Refine computational models to inform the design and function of engineered genetic controls and countermeasures and predict experimental outcomes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.900"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.900"
                                            },
                                            "Text": {
                                                "val": "-  Conduct laboratory animal model testing for safety and efficacy of small molecule and genetic countermeasures.\n-  Use computational models to evaluate efficacy, stability, and fitness of gene editing controllers and countermeasures.\n-  Demonstrate efficacy, stability, and fitness of gene editing controllers and countermeasures in laboratory animal models.\n-  Characterize failure modes of gene editor controllers and countermeasures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects transition from cells to animal model testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Defend Against Crop System Attack*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Accelerated Agricultural Engineering\n\nThe Defend Against Crop System Attack program will develop a platform technology aimed at increasing the speed of DoD response to state or non-state actor release of biological threats directed at our crop systems. Conventional methods to defend against these threats are generally slow and ineffective.  This program will leverage recent advances in molecular and synthetic biology to enable rapid delivery of genes to plants for large-scale trait modification, improving resilience against adversary attack or emerging natural threats.  Research within this program will develop an agnostic, scalable capability for protecting entire crop systems from emerging threats posed to food security by U.S. adversaries."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.250"
                                            },
                                            "Text": {
                                                "val": "-  Investigated novel approaches for delivery of gene editing technology to multiple plant tissues."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.700"
                                            },
                                            "Text": {
                                                "val": "-  Develop a flexible plant transformation platform to genetically modify plants.\n-  Demonstrate deployment of transgenes in contained greenhouse settings using environmental vectors that can be managed.\n-  Integrate technologies developed for controlled deployment of genetic materials with the late-stage plant gene alteration methods.\n-  Demonstrate the alteration of plant protein production through emerging gene editing technologies in a contained laboratory testbed."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.434"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.434"
                                            },
                                            "Text": {
                                                "val": "-  Scale deployment of flexible plant transformation platforms in a controlled greenhouse setting.\n-  Initiate integration of novel and existing failsafe capabilities for the trait delivery platform.\n-  Investigate new approaches to increase the efficacy of genetic transmission.\n-  Demonstrate predictable and repeatable transmission of genetic materials to plants."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects technology scale-up and transition to greenhouse testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Terrestrial Living Sensors*"
                                    },
                                    "Description": {
                                        "val": "*Formerly part of Accelerated Agricultural Engineering\n\nThis program will develop engineered biological sensor platforms capable of detecting land-based threats (e.g., chemicals, radiation, explosives) and relaying unique signals to existing DoD ground, air, and space assets.  Unlike conventional methods that passively monitor threats and are limited by sensor energy needs, these biological sensors are effectively energy independent, increasing the potential for wide distribution and environmental robustness.  Resulting platforms developed within this program will enable a variety of remote, persistent monitoring and reporting capabilities to address threat scenarios relevant for national security, including detecting improvised explosive devices (IEDs) and protecting infrastructure.  These sensors will provide a flexible suite to complement conventional sensor systems within the DoD."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate novel approaches and genetic machinery designs for developing biology-based sensor systems.\n-  Identify and modify plant resource allocation strategies to accommodate plant sensing and reporting operations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.012"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.012"
                                            },
                                            "Text": {
                                                "val": "-  Develop a quantitative model to guide plant-based sensor resilience and environment flexibility.\n-  Demonstrate the feasibility of combining high-specificity detection traits with physiological response traits by first exploring plant cell expression and quantitative modeling, and then by altering the physiology of plants.\n-  Begin production of plants with individual sense and report traits."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects addition of modeling effort as well as preliminary technology testing and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transient CBRN Threat Defense*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Engineering Function\n\nThe Transient CBRN Threat Defense program will create a transient, near immediate prophylaxis to protect military personnel against chemical, biological, radiological, and\/or nuclear (CBRN) threats.  Currently, military personnel rely on physical barrier technology (i.e., personal protective equipment) to mitigate the harmful effects of CBRN stressors.  This program will include research to develop novel transient and reversible epigenetic therapies for prophylactic and therapeutic protections against a broad range of CBRN threats (e.g., nerve agents).  In addition to overcoming constraints of traditional countermeasures to threat agents, successful work within this project will extend upon the DoD's limited protective capabilities (e.g., vaccines, anti-virals) to respond to re-emerging (e.g., Ebola, Zika), newly emerging, or engineered biothreats."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.510"
                                            },
                                            "Text": {
                                                "val": "-  Generate foundational knowledge concerning cellular stress resistance against a broad range of CBRN threats.\n-  Initiate investigation of novel delivery toolsets to facilitate CBRN stressor resistance in vivo.\n-  Begin development of bioinformatics tools and validation methods that will improve the design and specificity of transient gene therapy strategies.\n-  Explore scalable and adaptable platforms for a broad range of CBRN threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.060"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.060"
                                            },
                                            "Text": {
                                                "val": "-  Determine feasibility for transient and reversible gene therapy for stress resistance.\n-  Demonstrate genetic basis for cellular stress resistance in vivo.\n-  Characterize effective delivery tools for gene therapy that enable stress resistance.\n-  Characterize specificity of transient gene therapy in animal models.\n-  Demonstrate effectiveness of stress resistance constructs to specific CBRN threats.\n-  Initiate development of platform capabilities for scalable and adaptable CBRN threat response platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects preliminary technology testing and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Aquatic Living Sensors"
                                    },
                                    "Description": {
                                        "val": "The Persistent Aquatic Living Sensors program will develop novel capabilities to sense and surveil submersibles (e.g., submarines, unmanned underwater vehicles) and divers in littoral waters using living organisms present in the environment.  This effort will focus on characterizing marine biological behavior in response to targets of interest and developing the hardware, software, and algorithms that will translate organism behavior into DoD actionable information.  By harnessing the unique capabilities of biology, including adaptation, response, and replication, work in this program will enable persistent surveillance in contested waters.  Results from this research will enhance security for maritime activities and provide DoD naval operations with new sensing paradigms to complement current sensor technologies used in traditionally challenging regions across the world."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigate organism response to targets of interest in a laboratory environment using benchtop instrumentation.\n-  Initiate research to convert organism response into robust sensing system by developing algorithms to classify organism response in relation to targets.\n-  Research new reporting schemes to communicate signal detection and actionable information to existing DoD systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BioDesign"
                                    },
                                    "Description": {
                                        "val": "BioDesign will employ system engineering methods in combination with advances in biological and chemical technologies to create novel methods for threat response.  This thrust will develop new high-throughput technologies for monitoring the function of cellular machinery at the molecular level and the response(s) of that machinery to physical, chemical, or biological threats.  While conventional approaches typically require decades of research, new high-throughput approaches will permit rapid assessment of the impact of known or unknown threats on identified biomolecules and cell function.  Successful research in this thrust will both reduce the time required to understand the mechanism of action for new pharmaceutical compounds and enhance response capabilities for emerging and engineered threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.265"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated the ability to localize relevant molecules and events to one or more intracellular compartment(s) (e.g., membrane, nucleus, or cytoplasm) upon the application of a challenge compound.\n-  Demonstrated the ability to identify intracellular components and events that occur within seconds after the application of a challenge compound.\n-  Reconstructed and confirmed greater than 80 percent of the molecules and mechanistic events that comprise the canonical mechanism of action for a demonstration compound which has been applied to cells."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.962"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to localize relevant molecules and events to all intracellular compartment(s) (e.g., membrane, nucleus, or cytoplasm) upon the application of a challenge compound.\n-  Demonstrate the ability to identify intracellular components and events that occur within milliseconds after the application of a challenge compound.\n-  Reconstruct and confirm greater than 95 percent of the molecules and mechanistic events that comprise the canonical mechanism of action for a demonstration compound which has been applied to cells.\n-  Demonstrate the ability to detect proteins at low concentrations after exposure to a challenge compound."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biological Robustness in Complex Settings (BRICS)"
                                    },
                                    "Description": {
                                        "val": "The Biological Robustness in Complex Settings (BRICS) program will develop innovative approaches to engineer forensic microbial systems, creating unique microbial signatures for environmental forensic operations.  Integrating the fundamental component technologies developed under PE 0601101E, TRS-01, this program will focus on engineering microbial communities, detection signatures, and mechanisms to enable the potential safe deployment of engineered systems in open environments.  The resulting technologies will improve the speed and portability of detection and analysis systems for microbiome forensics, thereby enabling the addition of more advanced functions such as identifying objects that have come in contact with a labeled environment of interest."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.162"
                                            },
                                            "Text": {
                                                "val": "-  Identified promising component technologies that may be readily adapted into a platform for engineering robust, stable, and safe biological communities.\n-  Demonstrated reliable function of engineered microbial communities in laboratory environments.\n-  Demonstrated potential for safe use of engineered consortia under conditions relevant to specific applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.962"
                                            },
                                            "Text": {
                                                "val": "-  Integrate promising component technologies to engineer forensic microbial communities.\n-  Test the robustness, stability, and safety of newly engineered microbial communities in environments of interest.\n-  Evaluate the utility of forensic microbial communities to determine whether objects have traversed an area of interest."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}