{
    "id": "2019-DefenseLogisticsAgency-PB-0400-MJBOOK-0-4-32521504027ebdb13752e3b88d1670fe1a293063bafd6431aca8a5e28b29fb53-2",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Logistics Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603713S"
        },
        "ProgramElementTitle": {
            "val": "Deployment and Distribution Enterprise Technology"
        },
        "R1LineNumber": {
            "val": "51"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Logistics Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "175.886"
            },
            "PriorYear": {
                "val": "6.618"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "0.000"
            },
            "BudgetYearOneBase": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "0.000"
            },
            "BudgetYearThree": {
                "val": "0.000"
            },
            "BudgetYearFour": {
                "val": "0.000"
            },
            "BudgetYearFive": {
                "val": "0.000"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "182.504"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2017, PE 0603713S (BA3) Deployment and Distribution Enterprise Technology and PE 0603264S (BA3) Agile Transportation for the 21st Century Theater were transferred to a single PE in the Air Force budget (PE 0604776F) in order to support auditability, increase management efficiency, and reduce administrative actions."
        },
        "ProgramElementMissionDescription": {
            "val": "USTRANSCOM is tasked to provide globally integrated, agile deployment and distribution solutions as well as related enabling capabilities to support national security, force readiness and sustainability within an increasingly constrained defense budget. Unpredictable\/extended global distribution routes, limited visibility of sustainment requirements, force packaging limitations, lift constraints, anti-access\/area denial concerns, complex supply chains, as well as non-networked battlefield command and control, planning, and decision support tools impede timely customer logistical support.  To project unimpeded global power and influence, USTRANSCOM must have access to relevant, real-time information, invest in enabling capabilities that contribute to mission success, ensure the viability of our capabilities, and implement a relevant transportation strategy.  Effective knowledge sharing, decision support and transparency across the joint logistics enterprise, facilitated by secure enterprise-wide visibility into logistical processes as well as the ability to effectively collaborate\/operate in a contested cyberspace, is required to promote the effective\/efficient\/responsive global management of force projection and sustainment resources."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "6.618"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.618"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "6.618"
                    }
                }
            },
            "SummaryExplanation": {
                "val": "NOTE:  In FY 2017, PE 0603713S (BA3) Deployment and Distribution Enterprise Technology and PE 0603264S (BA3) Agile Transportation for the 21st Century Theater were transferred to a single PE in the Air Force budget (PE 0604776F) in order to support auditability, increase management efficiency, and reduce administrative actions.\n\nUnder the FY2017 CR, this program remained in DLA's baseline. Once the budget was enacted, DLA is working, to get the funding returned from USTRANSCOM. Currently, the remaining programs awaiting the return of funds is Generic Logistics R&D (PE 30603712S) and Defense Agencies Initiatives (DAI) (PE50605080S)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0"
                    },
                    "ProjectTitle": {
                        "val": "Prior Years"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "62.214"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "62.214"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Prior Years includes:\n-Capabilities Based Logistics: $7.342M. The Department requires procedures and technologies which provide enterprise-level capabilities critical to the distribution system to improve performance of the end-to-end DOD supply chain in direct support of the full range of military operations.  Ability to rapidly respond to customers’ changing demands, with a reliably high level of service.  These needs include: capabilities which enhance any supply or transportation mission (aeromedical, air refueling, joint logistics over-the-shore, and seabasing); analysis, tailoring and implementation of selected best enterprise-level practices from industry; and tools\/procedures to optimize transportation plus supply (distribution) plans and schedules in support of an entire operation.  This project addresses the required mission support to combatant commanders and other customers in the area of capability-based logistics.\n\n-Deployment and Distribution Velocity Management: $6.869M. DOD requires procedures\/technologies targeted at optimizing throughput at the nodes and through the conduits of the deployment and distribution supply chains, from origin to point of use and return to include: inventory management enhancers (includes node cargo management\/tracking); materiel handling innovations (including methods of reducing handling); improved physical access to nodes (includes aircraft all-weather visual systems); port throughput enhancements (includes in-port time reduction methods); and innovative delivery methods (for example, precision airlift, autonomous re-supply).  This project addresses required mission support to combatant commanders and other customers of DOD’s distribution and transportation systems in the area of deployment\/distribution velocity management.\n\n-Cross Domain Intuitive Planning: $2.408M. Procedures\/technologies which improve decision-making and collaboration within the supply chain, from the planning stage to real-time execution and retrograde operations, without need for highly specialized operators of the tools.  Projects in this area address following areas: decision support tools for any echelon of the supply chain or decision-maker, distribution process simulations and models for analysis and training, distribution demand forecasting\/execution monitoring tools, on-line training, automated decision-maker support (e.g., queuing, alerting, recommended courses of action), automated status monitoring with information fusion and drilldown capability, and resilient C2 infrastructure capabilities.  This project will provide required mission support to combatant commanders and other distribution\/transportation customers in the area of collaborative planning\/execution\/information sharing\/decision support tools.\n\n-End-to-End Visibility: $7.039M. Enhanced end-to-end visibility of all aspects of power projection\/sustainment spectrum is required to improve the effectiveness\/efficiency of deployment\/distribution\/redeployment operations to ensure warfighter support and confidence.  This requires investigation into next generation Automated Information Technology (AIT)\/Total Asset Visibility (TAV) technologies and\/or container security to improve end-to-end distribution visibility, enhance planning\/execution, and transform sustainment operations.  Includes the ability to determine immediate, reliable, and accurate shipment status through system access or event management.  Develop an over-arching process\/system architecture which will integrate existing and innovative new programs across the supply chain to provide complete In Transit Visibility (ITV) data, to include visibility of non-DoD cargo during humanitarian\/disaster relief operations. The ability of USTRANSCOM to supply transportation support for homeland defense and\/or disaster relief depends on effective ways to link with other governmental and civilian agencies.  Additionally need to explore the many barriers across the Joint Deployment and Distribution Enterprise (JDDE), to include non-DoD government entities, coalition partners, non-government organizations, and commercial industry, which can create confusion\/conflict or detract from the optimization of the JDDE.\n\n-Distribution Planning and Forecasting: $8.504M. There is a lack of collaborative distribution planning, based on an understanding of aggregated customer requirements, for optimizing the end-to-end distribution process. Planning, forecasting and collaboration are insufficiently advanced to fully synchronize people, processes and assets to execute planned operations. Automated tools should be able to dynamically analyze\/predict demand and provide input to advanced distribution planning systems.  Project investigates the need for flexible end-to-end enhanced modeling and simulation and collaborative decision support tools.\n\n-Joint Transportation Interface: $14.917M. Synchronizing strategic\/theater delivery capabilities to meet increasingly dynamic customer needs.  Transportation information exchange across the DOD is inhibited by the disparity of systems, differing data standards, and insufficient interfaces.  Queries and retrieval of status and shipment information cannot be executed due to lack of connectivity between the various components of the supply chain.  The ability to maintain situational awareness of movements at macro\/micro (drill down) levels, with associated force and sustainment cargo on board; to track force packages progress, and rapidly determine the impact of any delays or changes to sailing progress and arrival at port of debarkation; and to conduct \"what -if\" impact assessment of possible changes to delivery asset’s course, speed or departure\/arrival information as it relates to force or force package delivery\/impact of any change on the closure of force packages in theater is required.  The ability of USTRANSCOM to supply transportation support for homeland defense and\/or disaster relief depends on effective ways to link with other governmental and civilian agencies.  Also need to explore the many barriers across the Joint Deployment and Distribution Enterprise (JDDE), to include non-DOD government entities, coalition partners, non-government organizations, and commercial industry, which can create confusion\/conflict or detract from the optimization of the JDDE.\n\n-Distribution Protection\/Safety\/Security: $15.135M. The Theater Commander has not always been able to provide the appropriate security in a timely manner during deployment.  In some cases there are insufficient security assets to oversee convoy security in-country; therefore, all movement requirements are competing for the same limited resources.  Additionally need to explore new, portable methods of detecting hazardous\/asymmetric materials in very small quantities to support safe logistics operations.  Also explore technologies to enhance the capability to deliver personnel\/materiel to anti-access\/austere airfields and seaports."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "8"
                    },
                    "ProjectTitle": {
                        "val": "Command and Control\/Optimization\/Modeling and Simulation"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "73.951"
                        },
                        "PriorYear": {
                            "val": "2.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "75.951"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Capabilities which improve deployment, distribution and supply chain decision-making\/collaboration (e.g., planning stage to real-time execution\/retrograde operations) without need for highly specialized operators. Projects in this area address the following: decision support tools, distribution process simulations\/analytics, distribution demand forecasting\/execution monitoring, training, automated decision-maker support (e.g., queuing, alerting, courses of action), automated status monitoring with information fusion to include drilldown capability, and resilient C2 infrastructure capabilities. Current planning\/forecasting\/collaboration capabilities do not permit full synchronization of people, processes and assets to execute planned operations. Automated tools must be able to dynamically analyze\/predict demand and provide input to advanced distribution planning systems to include the capability for Combatant Commanders to manage theater transportation operations from the port of debarkation to the point of need. Transportation information exchange across the DOD is inhibited by disparate systems, multiple data standards and insufficient interfaces. The ability to rapidly determine the impact of any delays\/changes and conduct \"what -if\" impact assessments on the closure of force packages is required. This project addresses the required mission support to combatant commanders and other customers in the area of C2, Optimization, and Modeling and Simulations."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9"
                    },
                    "ProjectTitle": {
                        "val": "Cyber"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "11.216"
                        },
                        "PriorYear": {
                            "val": "1.018"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "12.234"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "USTRANSCOM requires mission assurance in a persuasive\/dynamic cyber environment.  USTRANSCOM requires the procedures\/technologies to improve cyber surveillance and control of networks across multiple domains and the ability to continue critical network operations in contested unclassified and classified network environments.  The Command also needs the ability to differentiate between valid\/unauthorized users and determine\/quantify the trustworthiness of hardware\/software systems.  Additionally must have the ability to rapidly analyze & correlate data regarding malicious activities, select\/evoke real-time defense actuators, perform automated reasoning capabilities that address data quality issues, and the ability to rapidly return to a known\/safe operating state."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "10A"
                    },
                    "ProjectTitle": {
                        "val": "Global Access"
                    },
                    "SpecialProject": {
                        "val": "1"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "28.505"
                        },
                        "PriorYear": {
                            "val": "3.600"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "32.105"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DoD requires procedures\/technologies targeted at optimizing throughput at the nodes as well as across the conduits of the deployment and distribution supply chains, from origin to point of use as well as return.  Needed capabilities include inventory\/cargo management, materiel handling innovations, improved physical node access, port throughput enhancements, innovative delivery methods (e.g., precision airlift, autonomous re-supply), and cargo\/container security.  This project addresses required mission support to combatant commanders and other customers of DoD’s distribution and transportation systems in the area of deployment\/distribution velocity management, manned\/unmanned systems to the point of effect, and increased global reach in austere\/anti-access environments."
                        }
                    }
                }
            ]
        }
    }
}