{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-f6ce2d6fdd72f55e6bde81509aa64b9e4fd9e88c2a3ca324177acd603679c7b4-2",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0602115E"
        },
        "ProgramElementTitle": {
            "val": "BIOMEDICAL TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "9"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "95.801"
            },
            "CurrentYear": {
                "val": "109.360"
            },
            "BudgetYearOne": {
                "val": "101.300"
            },
            "BudgetYearOneBase": {
                "val": "101.300"
            },
            "BudgetYearTwo": {
                "val": "130.831"
            },
            "BudgetYearThree": {
                "val": "135.970"
            },
            "BudgetYearFour": {
                "val": "138.497"
            },
            "BudgetYearFive": {
                "val": "138.497"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "115.213"
                },
                "CurrentYear": {
                    "val": "109.360"
                },
                "BudgetYearOne": {
                    "val": "153.797"
                },
                "BudgetYearOneBase": {
                    "val": "153.797"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "95.801"
                },
                "CurrentYear": {
                    "val": "109.360"
                },
                "BudgetYearOne": {
                    "val": "101.300"
                },
                "BudgetYearOneBase": {
                    "val": "101.300"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-19.412"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-52.497"
                },
                "BudgetYearOneBase": {
                    "val": "-52.497"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-11.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.103"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-6.309"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-52.497"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-52.497"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects Congressional reduction, reprogrammings and the SBIR\/STTR transfer.   \nFY 2018:  N\/A\nFY 2019:  Decrease reflects completion of the Restoration of the Brain Following Trauma and Enhanced Monitoring of Health and Disease programs in FY 2018."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "BT-01"
                    },
                    "ProjectTitle": {
                        "val": "BIOMEDICAL TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "95.801"
                        },
                        "CurrentYear": {
                            "val": "109.360"
                        },
                        "BudgetYearOne": {
                            "val": "101.300"
                        },
                        "BudgetYearOneBase": {
                            "val": "101.300"
                        },
                        "BudgetYearTwo": {
                            "val": "130.831"
                        },
                        "BudgetYearThree": {
                            "val": "135.970"
                        },
                        "BudgetYearFour": {
                            "val": "138.497"
                        },
                        "BudgetYearFive": {
                            "val": "138.497"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Biomedical Technology Program Element focuses on applied research for medical related technology, information, processes, materials, systems, and devices.  Successful battlefield medical and neural interface technologies developed within this Program Element address a broad range of DoD challenges to ensure warfighter readiness, including both resilience to infectious disease and neurotechnology for improved warfighter performance.  To maintain warfighter health, battlefield medical technologies research in this project will investigate disease forecasting, detection, and therapeutic response.  Example projects include a predictive platform for forecasting disease outbreak, identification of early infection biomarkers to diagnose and prevent widespread infection in-theater, new methods to rapidly develop medical countermeasures in response to an emerging biothreat, and in-theater manufacturing capabilities for field-relevant pharmaceuticals to reduce the logistical burden and infrastructure requirements.  To improve warfighter performance, this project will develop new neural architectures and data processing algorithms to interface the nervous system with multiple devices, enabling control of robotic prosthetic-limb technology.  Additionally, advanced evidence-based techniques will be developed to supplement warfighter healthcare and the diagnosis of post-traumatic stress disorder (PTSD) and traumatic brain injury (TBI)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neuro-Adaptive Technology"
                                    },
                                    "Description": {
                                        "val": "The Neuro-Adaptive Technology program will explore and develop advanced technologies for real-time detection and monitoring of neural activity.  One shortcoming of today's brain functional mapping technologies is the inability to obtain real-time correlation data that links neural function to human activity and behavior.  Understanding the structure-function relationship as well as the underlying mechanisms that link brain and behavior is a critical step in providing real-time, closed-loop therapies for military personnel suffering from a variety of brain disorders.  Efforts under this program will specifically examine the networks of neurons involved in post-traumatic stress disorder (PTSD), traumatic brain injury (TBI), depression, and anxiety as well as determine how to best ameliorate these disorders.  The objective for this program is to develop new hardware and modeling tools to better discriminate the relationship between human behavioral expression and neural function and to provide relief through novel devices.  These tools will allow for an improved understanding of how the brain regulates behavior and will enable new, disorder-specific, dynamic neuro-therapies for treating neuropsychiatric and neurological disorders in military personnel.  Technologies of interest under this thrust include devices for real-time detection of brain activity during operational tasks, time synchronized acquisition of brain activity and behavior, and statistical models that correlate neural activity with human behavioral expression."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.285"
                                            },
                                            "Text": {
                                                "val": "-  Completed high-resolution large-brain imaging using novel optical tools.\n-  Demonstrated optimized optical protocols for human tissue. \n-  Integrated neural state classification, stimulation parameters, and targeted brain networks into a comprehensive computational model to support disorder-specific closed-loop implantable neural devices.\n-  Demonstrated real-time application of integrated disorder-specific stimulation parameters and targeted brain networks.\n-  Utilized clinical data and computational model determinants to refine hardware and software components of an implantable neural device.\n-  Began fabrication of updated devices for multi-site brain stimulation.\n-  Initiated submission process for regulatory approval of updated parameters of the novel neural device."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.500"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration of computational model software with prototype device hardware.\n-  Fabricate complete prototype device for use in acute clinical studies.\n-  Submit prototype device design for regulatory approval.\n-  Use prototype device components in clinical patients to demonstrate modulation of disorder-specific psychiatric or neurologic behaviors through real-time, closed-loop stimulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.955"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.955"
                                            },
                                            "Text": {
                                                "val": "-  Utilize clinical data to further refine biomarkers, computational models, and stimulation paradigms for closed-loop modulation of psychiatric or neurologic conditions.\n-  Integrate approaches targeting psychiatric or neurologic conditions with complementary biomarkers, neural targets, and computational models. \n-  Demonstrate use of the prototype neural device in a clinical setting to modulate relevant psychiatric or neurologic function through real-time, closed-loop, biomarker-driven stimulation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects focused effort for final integration and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX)"
                                    },
                                    "Description": {
                                        "val": "Wounded warriors with amputated limbs get limited benefit from recent advances in prosthetic-limb technology because the user interface for controlling the limb is low-performance and unreliable.  Through investments in the DARPA Reliable Neural-Interface Technology (RE-NET) program, novel interface systems have been developed that overcome these issues and are designed to last for the lifetime of the patient.  The goal of the Prosthetic Hand Proprioception & Touch Interfaces (HAPTIX) program is to create the first bi-directional (motor & sensory) peripheral nerve implant for controlling and sensing advanced prosthetic limb systems.  With a strong focus on transition, the HAPTIX program will create and transition clinically relevant technology in support of wounded warriors suffering from single or multiple limb loss."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.800"
                                            },
                                            "Text": {
                                                "val": "-  Initiated functional validation of input\/output signal transfer and wireless communication of power and data.\n-  Initiated safety studies of HAPTIX system to support submission of investigational device exemption (IDE) application to the U.S. Food and Drug Administration (FDA).\n-  Demonstrated novel nerve stimulation and recording technologies.\n-  Demonstrated closed-loop control of a physical prosthesis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.374"
                                            },
                                            "Text": {
                                                "val": "-  Validate novel outcome metrics for quantifying effects of sensory prosthetic technologies.\n-  Initiate testing of advanced sensorized prosthetic limbs.\n-  Refine models for sensorimotor function in prosthetic technologies.\n-  Submit technology for regulatory approval."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.985"
                                            },
                                            "Text": {
                                                "val": "-  Obtain regulatory approval for HAPTIX technology.\n-  Initiate take-home studies utilizing HAPTIX technology and sensorized prosthetic limbs.\n-  Conduct novel outcome metric testing on HAPTIX amputee participants."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Performance Optimization in Complex Environments"
                                    },
                                    "Description": {
                                        "val": "The Performance Optimization in Complex Environments program will develop neurotechnology to mitigate the effects of physical injury to the auditory and visual systems of military personnel.  Research will also focus on understanding various forms of sensing and actuation to improve outcomes and how biofeedback over time can alter human brain function.  Technologies developed through this program will provide foundational neural interface technology for restoring lost capability, improving situational awareness, and enhancing cognitive and physical effectiveness."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.541"
                                            },
                                            "Text": {
                                                "val": "-  Conducted research on biological interfaces for enabling input and output of neural information.\n-  Identified component technologies to be integrated into a device for reading and writing neural signals from the cortex.\n-  Evaluated novel approaches to reduce the size, weight, and power requirements for the integrated device.\n-  Developed preliminary system architectures for highly-scaled input-output of information.\n-  Developed biological interfaces with the precision to target individual neurons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "19.400"
                                            },
                                            "Text": {
                                                "val": "-  Finalize system designs for highly-scaled input-output of information, and pass a critical design review.\n-  Validate system designs and safety methods against standard regulatory practices.\n-  Conduct a bench demonstration of system components.\n-  Perform in vivo demonstration of input-output techniques for individual neurons.\n-  Produce a neural input\/output platform to monitor and modulate large-scale neural activity for a variety of applications relevant to the central nervous system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.485"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.485"
                                            },
                                            "Text": {
                                                "val": "-  Refine final validated system designs for prototyping and manufacture.\n-  Demonstrate large-scale read and write capabilities using a fully integrated system.\n-  Develop, harden, and validate security protocols of complete integrated system.\n-  Collect data for the development and refinement of neural decoding and encoding algorithms.\n-  Prepare regulatory documents for therapeutic applications of the brain machine interface."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neural Signal Interfaces and Applications (NSIA)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Generalizing Complex Biological Signals\n\nAs part of their daily duties, many military personnel must handle large volumes of data and interact with complex systems.  These tasks could be made less difficult with advanced neurotechnology platforms, but all such devices currently require invasive surgery to implement.  The Neural Signal Interfaces and Applications (NSIA) program will develop non-invasive neurotechnologies able to interface with the nervous system with high resolution and precision without surgery.  NSIA will utilize recent advances to transduce neural signals through tissue.  Resulting technologies will facilitate standard human-machine interfaces for improved workload balance between man and machine."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.140"
                                            },
                                            "Text": {
                                                "val": "-  Develop concepts for noninvasive and minutely invasive sensor\/stimulator systems design.\n-  Evaluate neural interface device designs for resolution, stability, and safety aspects.\n-  Initiate research efforts to build required sensors, stimulators, and transducers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.895"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.895"
                                            },
                                            "Text": {
                                                "val": "-  Finalize system level design to optimize power usage.\n-  Engineer prototypes of neural interface subcomponents and neural transducers.\n-  Assess neural read and write subcomponents and neural transducers in vitro.\n-  Verify and validate the safety, resolution, and stability of subcomponents."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects integration work and advanced engineering."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pandemic Prevention"
                                    },
                                    "Description": {
                                        "val": "Military personnel are deployed all over the world for traditional operations, and are often specifically called upon in response to emerging or re-emerging disease outbreaks with pandemic potential (e.g., Ebola).  In both instances, the DoD needs effective countermeasures to protect its deployed forces and maintain warfighter readiness.  The Pandemic Prevention program will focus on novel methods to rapidly accelerate countermeasure discovery, pre-clinical testing, and manufacturing.  This program seeks to advance and integrate newly developed approaches including bioinformatics assessment of genetic sequencing and nucleic acid-based vaccines and to address technology bottlenecks associated with each stage of medical countermeasure development.  Additional research will investigate new methods improving the manufacturability, distribution, and delivery of novel therapeutics.  Pandemic Prevention will enable an integrated therapeutic development platform that leverages state-of-the-art technologies to prevent disease outbreaks."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.100"
                                            },
                                            "Text": {
                                                "val": "-  Develop high-throughput screening technologies to rapidly identify appropriate medical countermeasures against a diversity of biological threats.\n-  Begin developing tools to scale the manufacturability of medical countermeasures.\n-  Initiate development of a validated system for medical countermeasure production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.985"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.985"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate the ability to rapidly discover and mature antibodies against viral infections.\n-  Establish gene-encoded antibody delivery methods in animal models.\n-  Demonstrate protection from pathogen challenge in animal models.\n-  Conduct preliminary demonstration of integrated technologies identifying, maturing, and delivering a gene-encoded antibody to provide protection against viral challenge in animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects integration and multiple technology demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Indicators of Threat Exposure (FITE)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Enhanced Monitoring of Health and Disease program, the Forensic Indicators of Threat Exposure (FITE) program will develop a field-deployable resource for indicators of an individual's exposure history to Weapons of Mass Destruction (WMD) and WMD precursors.  FITE will investigate the ability to characterize epigenetic signatures in an individual's genome caused by specific exposures.  The program will create the framework for modular technology capable of performing forensic analysis using epigenetic information to provide high specificity of the type of exposure and when it occurred.  This novel capability could serve as a field-forward forensic tool for use by the DoD to assist in chemical, biological, radiological, and nuclear (CBRN) threat detection and response."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.750"
                                            },
                                            "Text": {
                                                "val": "-  Define the type of the samples (e.g., blood, serum, plasma, oral and nasal swabs, saliva) to be used for the creation of the epigenetic signature datasets.\n-  Generate candidate datasets to establish a combinatorial epigenetic signature."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.995"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.995"
                                            },
                                            "Text": {
                                                "val": "-  Identify exposure-specific epigenetic marks that reflect WMD or WMD precursor exposure events.\n-  Validate sensitivity and specificity in representative models.  \n-  Create bioinformatics algorithms to decode and characterize differences in the complex epigenetic marks associated with each exposure event.\n-  Initiate development of bioanalytical platform prototype to integrate multiple epigenetic analysis techniques and perform signature analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects integration and advanced engineering of bioanalytical device platform."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Restoration of Brain Function Following Trauma"
                                    },
                                    "Description": {
                                        "val": "The Restoration of Brain Function Following Trauma program will exploit recent advances in the understanding and modeling of brain activity and organization to develop approaches to treat traumatic brain injury (TBI).  Critical to success will be the ability to detect and quantify functional and\/or structural changes that occur in the human brain during the formation of distinct new memories, and to correlate those changes with subsequent recall of those memories during performance of behavioral tasks.  This program will also develop neural interface hardware for monitoring and modulating neural activity responsible for successful memory formation in a human clinical population.  The ultimate goal is identification of efficacious therapeutic approaches that can bypass and\/or recover the neural functions underlying memory, which are often disrupted as a consequence of TBI."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "17.400"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated improvement of human performance on spatial and semantic memory tasks through the use of real-time, closed-loop, biomarker-driven stimulation.\n-  Utilized clinical data and computational model developments to refine hardware and software components.\n-  Fabricated and tested integrated device for memory restoration in clinical patients.\n-  Developed computational model of integrated neural, physiological, and environmental effects on neural replay and subsequent memory recall in the context of task performance relevant to military training and\/or operations.\n-  Developed and used a real-time intervention and an interface system to assess, enable, and improve skill performance in human participants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.316"
                                            },
                                            "Text": {
                                                "val": "-  Refine stimulation parameters to optimize closed-loop, biomarker-driven stimulation for restoration of verbal and spatial memories.\n-  Use an integrated device to demonstrate facilitation of performance on memory tasks through real-time, closed-loop, biomarker-driven stimulation.\n-  Use a computational model of integrated neural, physiological, and environmental signals to quantify the influence of memory replay parameters on subsequent performance of skills relevant to military training and\/or operations.\n-  Demonstrate use of a closed-loop, non-invasive intervention to facilitate neural replay and subsequent performance of skills."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Monitoring of Health and Disease"
                                    },
                                    "Description": {
                                        "val": "The Enhanced Monitoring of Health and Disease program will improve military health and force readiness by leveraging advanced data collection methods and prognostic capabilities to predict changes in health and spread of infectious disease from the individual to the population scale.  While new technology platforms have enhanced our ability to respond to illness and disease, there is a need for predictive and pre-emptive technologies that enable us to correctly prepare a response prior to its obvious need, such as in a barracks or in a confined environment (e.g., submarine).  Research in this program will investigate new methods for the collection and detection of multiplexed biological markers as well as the analysis, correlation, and ultimate integration of vast personalized data into the clinical care information technology infrastructure.  Additionally, this program will develop new approaches to integrate multi-source data streams to create effective predictive models of disease outbreak and spread.  Technologies developed in this program will enable clinically actionable information, even when an individual has no awareness of symptoms, and extend infectious disease forecasting into a real-time, accurate capability for decision support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.100"
                                            },
                                            "Text": {
                                                "val": "-  Initiated collection of biological samples to assess asymptomatic, symptomatic, and co-infection rates among a research cohort.\n-  Evaluated banked and initiated evaluation of new samples from clinical cohort or intervention trials to discover candidate prognostic biomarkers for the prediction of contagiousness.\n-  Identified key parameters of robust epidemiological models for predicting disease transmission.\n-  Initiated evaluation of the predictive capability of dynamic, ensemble-based epidemiological models for disease forecasting."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.280"
                                            },
                                            "Text": {
                                                "val": "-  Select a minimal set of biomarkers that accurately predict contagiousness.\n-  Develop a prognostic assay that predicts contagiousness using the minimal set of biomarkers.\n-  Evaluate models and prognostic tests for accuracy prospectively."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The overarching goal of the Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program is to increase our ability to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing centralized laboratory capabilities at non-tertiary care settings.  ADEPT will focus on the development of Ribonucleic Acid (RNA)-based vaccines, potentially eliminating the time and labor required for traditional manufacture of a vaccine while at the same time improving efficacy.  Additionally, ADEPT will develop methods to transiently deliver nucleic acids for vaccines and therapeutics, and kinetically control the timing and levels of gene expression so that these drugs will be safe and effective for use in healthy subjects.  ADEPT will also focus on advanced development of key elements for simple-to-operate diagnostic devices.  A companion basic research effort is budgeted in PE 0601117E, Project MED-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.762"
                                            },
                                            "Text": {
                                                "val": "-  Initiated regulatory approval submission package for transient nucleic-acid based formats against infectious disease with safety and efficacy data.\n-  Initiated studies to demonstrate production of gene-encoded antibodies in human safety trials.\n-  Initiated clinical studies to enable a dose escalation study of nucleic acid-encoded antibody against antibiotic resistant bacteria."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate safety of gene-encoded antibodies in a dose escalation study against a viral pathogen."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Biomedical Technologies"
                                    },
                                    "Description": {
                                        "val": "The Tactical Biomedical Technologies thrust developed new approaches to deliver life-saving medical care on the battlefield.  Uncontrolled blood loss is the leading cause of preventable death for soldiers on the battlefield.  While immediate control of hemorrhage is the most effective strategy for treating combat casualties and saving lives, currently no method, other than surgical intervention, can effectively treat intracavity bleeding.  A focus in this thrust was the co-development of a materials-based agent(s) and delivery mechanism capable of hemostasis and wound control for non-compressible hemorrhage in the abdominal space, regardless of wound geometry or location within that space.  This thrust also investigated non-invasive techniques and equipment to use laser energy to treat intracranial hemorrhage through the skull and tissues in a pre-surgical environment.  Finally, in order to address logistical delays associated with delivering necessary therapeutics to the battlefield, this thrust developed a pharmacy on demand that will provide a rapid response capability to enable far-forward medical providers the ability to manufacture and produce small molecule drugs and biologics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.913"
                                            },
                                            "Text": {
                                                "val": "-  Developed continuous synthesis of Lisinopril and Linezolid in miniaturized integrated manufacturing platform.\n-  Demonstrated end-to-end manufacturing and solid formulation in miniaturized integrated manufacturing platform.\n-  Demonstrated end-to-end manufacturing of four additional biologics in miniaturized integrated platform.\n-  Developed a miniaturized integrated manufacturing platform to produce Ciprofloxacin under Good Manufacturing Practices."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}