{
    "id": "2019-AirForce-PB-3600-MJBOOK-1-0-c3a203aa28182b60f61dc370dc004d262f4542c92e834cf238859eb5ffc78d51-36",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "1206730F"
        },
        "ProgramElementTitle": {
            "val": "Space Security and Defense Program"
        },
        "R1LineNumber": {
            "val": "66"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "32.399"
            },
            "CurrentYear": {
                "val": "41.385"
            },
            "BudgetYearOne": {
                "val": "45.542"
            },
            "BudgetYearOneBase": {
                "val": "45.542"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "46.453"
            },
            "BudgetYearThree": {
                "val": "47.216"
            },
            "BudgetYearFour": {
                "val": "48.246"
            },
            "BudgetYearFive": {
                "val": "49.123"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.399"
                },
                "CurrentYear": {
                    "val": "41.385"
                },
                "BudgetYearOne": {
                    "val": "45.884"
                },
                "BudgetYearOneBase": {
                    "val": "45.884"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.399"
                },
                "CurrentYear": {
                    "val": "41.385"
                },
                "BudgetYearOne": {
                    "val": "45.542"
                },
                "BudgetYearOneBase": {
                    "val": "45.542"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.342"
                },
                "BudgetYearOneBase": {
                    "val": "-0.342"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.342"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.342"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "64A025"
                    },
                    "ProjectTitle": {
                        "val": "Space Protection Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.399"
                        },
                        "CurrentYear": {
                            "val": "41.385"
                        },
                        "BudgetYearOne": {
                            "val": "45.542"
                        },
                        "BudgetYearOneBase": {
                            "val": "45.542"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "46.453"
                        },
                        "BudgetYearThree": {
                            "val": "47.216"
                        },
                        "BudgetYearFour": {
                            "val": "48.246"
                        },
                        "BudgetYearFive": {
                            "val": "49.123"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This Program Element funds the Department of Defense (DoD)\/Air Force component of the Space Security and Defense Program (SSDP). The SSDP is a Joint DoD and Office of the Director of National Intelligence (ODNI) organization established to function as the center of excellence for options and strategies (materiel, non- materiel, cross-Title, cross-domain) leading to a more resilient and enduring National Security Space (NSS) Enterprise. The SSDP Operates under the authority of the Deputy Secretary of Defense (DEPSECDEF) and Principal Deputy Director of National Intelligence (PDDNI) to lead and collaborate on space protection vulnerability, susceptibility, and mitigation assessments of NSS services for the purpose of identifying, assessing, validating and introducing protection solutions into existing requirements, budgeting, acquisition, technology development and operational development processes. This unique mission provides an ongoing and crucial core protection competency that advances specific projects\/activities (including non-kinetic techniques) to deliver comprehensive, economical and actionable solutions for both programmatic and operational domains.\n\nThe SSDP scope spans multiple space missions and stakeholders including the DoD, Intelligence Community (IC), civil, commercial, and international space entities that support NSS missions in both peacetime and throughout all phases of conflict. It is focused on being responsive to NSS stakeholders in providing technical and operational assessments of emergent threat concepts, and developing near- and far-term plans to address strategies, threats, and vulnerabilities. Specific SSDP Projects are structured\/designed to have an impact across all time horizons; near-term focused efforts to complicate adversary operations, mid-term focused efforts to improve system and enterprise survivability, and long-term focused efforts to render adversary capabilities ineffective.\n\nThe current and future space domain demands that space systems be responsive to new and changing threats, and can rapidly integrate new capabilities to make our warfighting force more resilient in a contested battlespace. This agility, survivability, and rapid reconstitution must extend through the entire space warfighting enterprise, to include how we learn about the threat; develop solutions; acquire, test, deploy, train, operate and integrate new systems into the greater system of systems; and ensure our space mission force is ready to defeat a thinking adversary in a complex, multi-domain battlespace. The enterprise will use all of its elements to accelerate decision-making, prototype potential solutions, rapidly integrate decision-making tools and sustain a war-winning capability by delivering multi-domain effects in, from, and through space and cyberspace enabling battle management and resilience options to \"fight through.\" \n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver capability leading to a more resilient and enduring NSS enterprise.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 1206392F and 1206398F.\n\nThis program is in Budget Activity 4, Advanced Component Development and Prototypes (ACD&P) because efforts are necessary to evaluate integrated technologies, representative modes or prototype systems in a high fidelity and realistic operating environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Protection and Survivability"
                                    },
                                    "Description": {
                                        "val": "SSDP organizes, plans, and executes specific projects in three focus areas: Enterprise Capabilities & Solutions; Mission Area Protection Concepts & Architectures; and Operational Tactics, Experiments & Prototypes. Enterprise Capabilities & Solutions projects focus on identifying and advocating for NSS enterprise-level protection requirements and architecture updates\/modifications, informing\/assisting policy-makers and analyzing policy to enhance the space protection posture across the NSS Enterprise. Mission Area Protection Concepts & Architectures projects constitute Protect and Defend (P&D) efforts focused on specific mission areas and\/or systems. These projects entail the specific technical efforts, activities and engagements supporting capability and architecture development in mission areas such as Space Control, Command and Control (C2), Satellite Communication (SATCOM), Position-Navigation and Timing (PNT), Missile Warning (MW), Space Situational Awareness (SSA), Indications and Warning (I&W), and Intelligence - Surveillance - Reconnaissance (ISR). Finally, Operational Tactics, Experiments & Prototypes projects leverage operations expertise, experimentation and prototyping to improve operational capabilities and develop, refine, document and demonstrate Tactics, Techniques and Procedures (TTPs), Concepts of Operation (CONOPS), and associated C2 functions. Some of these projects hold the potential to leave-behind residual operational prototypes\/capabilities when partnered with the appropriate mission organization. Additionally, these projects will support development of TTPs and CONOPS for protection solutions developed by SSDP partners across the NSS Enterprise.  Projects in all three areas will include non-kinetic solutions for protecting specific capabilities and the NSS Enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.399"
                                            },
                                            "Text": {
                                                "val": "FY2017 projects will focus on high-priority DoD & IC space protect and defend (P&D) considerations such as the Space Strategic Portfolio Review (SPR) and AFSPC Space Enterprise Vision (SEV) while being flexible and responsive to the evolving protection needs and priorities throughout the NSS Enterprise. Individual projects, both in house and in coordination with our mission partners, will work to validate candidate solutions through various means, such as technical analysis, Modeling & Simulation (M&S), and operator engagement. Projects will: Pursue new P&D solutions, develop CONOPS for both programmed and proposed systems, use M&S resources to mature and shape CONOPS, document architectures and inform programmatic decisions, and utilize experiment results along with M&S recommendations to influence NSS Enterprise requirement and architecture choices. Projects will include prototyping and experimenting with BMC2, SSA and Space Control concepts, planned capabilities and TTPs. Projects will be executed in SSDP facilities, mission partner facilities, and often in coordination with the Joint Space Operations Center (JSpOC), Joint Interagency Combined Space Operations Center (JICSpOC), and National Reconnaissance Operations Center (NROC). Projects will incorporate objectives to demonstrate DoD\/IC space protection coordination as well as explore data fusion including the integration of commercial tools & services. SSDP will: Continue independent review and assessment for programmatic planning and architectures covering DoD, IC and Civil space operations; will engage on strategic protection and policy integration efforts across all facets of the NSS Enterprise; and will work with the NSS community to incorporate P&D requirements into policy and guidance to drive future program development and execution. M&S resources will be used to conduct architecture trades at both the enterprise and system level to identify the right mix of systems to meet NSS requirements and examine..."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "41.385"
                                            },
                                            "Text": {
                                                "val": "FY2018 projects will focus on high-priority DoD & IC space Protect and Defend (P&D) considerations and DoD strategic evaluations on future space investments while remaining flexible and responsive to address evolving protection needs and priorities throughout the NSS Enterprise. SSDP will also further the integration of DoD & IC space protection efforts through the delivery and integration of targeted analysis, policy recommendations, and initiatives. Individual projects, both in house and in coordination with mission partners, will concentrate on validating candidate solutions through technical engineering-based analysis, modeling & simulation (M&S), and operator engagement. SSDP will pursue definitive protection solutions encompassing countermeasures, inherently resilient architectures, data fusion, and CONOPS; employing its tailored, organic M&S resources to mature and refine CONOPS, deliver conceptual protocols, evaluate architectures, assess the integration of commercial tools & services, and accomplish various Joint Space Warfighting Forum (JSWF) objectives. Results will inform system trades, programmatic decisions, experiment planning\/design, prototyping proposals, and influence NSS Enterprise requirement and architecture choices. SSDP will additionally define and, where appropriate, execute distinctive Space Control prototypes and experiments to include the Space Situational Awareness (SSA) and Command & Control (C2) mission areas. The program will execute these projects, prototypes, and experiments in SSDP facilities and\/or mission partner facilities; often in coordination with key space operational centers to ensure full applicability and integration with evolving operational environments and threats. Increased FY2018 funding will enable development of higher- fidelity M&S tools necessary to tie campaign level modeling to the physics-based models developed in FY2017 and earlier."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "45.542"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "45.542"
                                            },
                                            "Text": {
                                                "val": "FY2019 activities will rapidly engage and provide timely, validated solutions throughout the year to high-priority DOD & IC space initiatives and evolving NSS Enterprise needs while maintaining focus on planned projects to address evolving threat and protection priorities to advance the spectrum of space protection and defense solutions at both system and enterprise levels.  The program will utilize in-depth technical analysis tailored modeling & simulation (M&S) and warfighter\/operator engagement along with other means\/methods as required to deliver actionable, timely and efficient protection solutions.  This includes the use of expanded in-house analytical capabilities (tailored\/adapted as necessary) and the fielding of high-fidelity M&S tools for additional space protection concepts, greater integration of physics-based tools into campaign-level models, and the employment of next-level analytical rigor essential for informing prototype selection and design to ensure the highest possible pay-off and mission impact.  Specific to FY2019, Enterprise Capabilities & Solutions projects will utilize the broad and robust physics-based M&S, engineering-based analysis, and campaign\/enterprise level rapid architecture analysis capabilities proved out during FY2018 to: 1) influence policy and guidance across the NSS enterprise and drive more resilient future architectures; 2) examine planned DoD & IC programs, experiments and demonstrations to provide program protection recommendations to preserve Blue capabilities; and 3) recommend architecture and policy solutions\/changes to enable the necessary C2 and optimize the deployment of new capabilities to deliver critical warfighting effects.  Finally, FY2019 Operational Tactics, Experiments & Prototypes projects will utilize in-house and mission-partner coordinated efforts to mature and shape CONPS for programed and anticipated systems.  These projects will seek to incorporate C2, SSA and Space Control concepts, planned capabilities and TTPs into relevant\/targeted prototyping and experimentation activities.  Projects in this area will incorporate objectives to demonstrate Title 10\/50 space protection coordination, explore data fusion and, potentially, include the integration of commercial tools and services.  Continued expansion of SSDP concept development & visualization tools and prototypes into\/throughout FY2019 will provide the space C2 community toolsets to build, evaluate and select operational-level COAs (Courses of Actions).  SSDP will execute FY2019 projects with our mission partners both in-house and, when appropriate, in their facilities to ensure the best application and use of toolsets, expertise and technology.  These FY2019 projects will have the combined impact of continuing to mature and enhance the protection-oriented tools, policies, requirements and programs necessary to maintain and accelerate progress towards achieving resilience across the NSS community.  Increased FY2019 funding delivers the means to move forward with maturing the program's analysis and M&S capabilities to provide the fidelity and depth of analytic competency necessary to support the efficient and informed design, development and prototyping of protection-based alternatives and solutions.  In the face of an increasingly complex and contested space environment this increased capacity and capability is central to national space protection efforts and is a critical advancement for staying abreast and ahead of both current and next-generation threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY2019 increased compared to FY2018 by $4.157M.  Justification for this increase is described in plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Note: The AF\/DoD portion of the SSDP is funded entirely from this Program Element.  Funding to support the complimentary\/partnership National Reconnaissance Office (NRO) activities (as part of the joint\/integrated program effort between AFSPC and the NRO) are programmed in the NRO classified funding request."
                        },
                        "AcquisitionStrategy": {
                            "val": "All contracts funded in this program element will be awarded using competitive procedures to the maximum extent possible.  The program consists of numerous small projects."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Space Protection and Survivability"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "29.321"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "37.057"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "40.240"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "40.240"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Support and Infrastructure (Gov't PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.062"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.587"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.738"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.738"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Oversight, Advisory and other Technical Support (Contractor PMA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.016"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.741"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.564"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.564"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Space Protection and Survivability"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Enterprise Capabilities Solutions"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Area Protection Concepts and Architectures"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Tactics, Experiments and Prototypes"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}