{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-22",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602785A"
        },
        "ProgramElementTitle": {
            "val": "Manpower\/Personnel\/Training Technology"
        },
        "R1LineNumber": {
            "val": "27"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.475"
            },
            "CurrentYear": {
                "val": "20.216"
            },
            "BudgetYearOne": {
                "val": "21.862"
            },
            "BudgetYearOneBase": {
                "val": "21.862"
            },
            "BudgetYearTwo": {
                "val": "23.651"
            },
            "BudgetYearThree": {
                "val": "24.176"
            },
            "BudgetYearFour": {
                "val": "24.261"
            },
            "BudgetYearFive": {
                "val": "24.659"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "162.300"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). This PE develops new personnel measures and methods that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE develops new performance measures and metrics for individuals and units, designs innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.   \n\nEfforts in this PE support the Army Science and Technology Soldier portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Human Capital Strategy.\n\nWork in this PE is performed by the U.S. Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.045"
                },
                "CurrentYear": {
                    "val": "20.216"
                },
                "BudgetYearOne": {
                    "val": "21.902"
                },
                "BudgetYearOneBase": {
                    "val": "21.902"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.475"
                },
                "CurrentYear": {
                    "val": "20.216"
                },
                "BudgetYearOne": {
                    "val": "21.862"
                },
                "BudgetYearOneBase": {
                    "val": "21.862"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.57"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.04"
                },
                "BudgetYearOneBase": {
                    "val": "-0.04"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.563"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.04"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.04"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "790"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.475"
                        },
                        "CurrentYear": {
                            "val": "20.216"
                        },
                        "BudgetYearOne": {
                            "val": "21.862"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.862"
                        },
                        "BudgetYearTwo": {
                            "val": "23.651"
                        },
                        "BudgetYearThree": {
                            "val": "24.176"
                        },
                        "BudgetYearFour": {
                            "val": "24.261"
                        },
                        "BudgetYearFive": {
                            "val": "24.659"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "162.300"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied behavioral and social science research to enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). This Project develops new personnel measures and methods that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This Project develops new performance measures and metrics for individuals and units, designs innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Research in this Project will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.   \n\nEfforts in this Project support the Army Science and Technology (S&T) Soldier portfolio. \n\nThe cited work is consistent with the S&T priorities of the Army Chief of Staff, Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Human Capital Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Personnel Measures and Assessments"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that provides the Army with improved prediction and modeling of potential performance, behaviors, attitudes, and resilience of Soldiers, as well as an improved ability to recruit and sustain an effective career force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.742"
                                            },
                                            "Text": {
                                                "val": "Will validate new assessments for predicting performance in cyber-related jobs; Will create leader self-development feedback packages to accelerate career progression; Will develop non-cognitive assessments for officer job performance and\/or advancement within a branch."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9"
                                            },
                                            "Text": {
                                                "val": "Conduct research on developing integrated assessments (i.e., comprehensive (vs. single) personnel assessments) for predicting high-potential Soldiers and high-risk behavior (i.e., integrated measures collected across the Soldier Lifecycle that feeds holistic assessments and predictive models of behaviors, performance, and outcomes)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.568"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.568"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop a vocational interest inventory for increased prediction and selection of assignment and performance within select critical Military Occupational Specialties (e.g. cyberwarfare); conduct research for the application of non-cognitive measures to inform branching choices for cadets to support sustainment of professional military careers and reduce Soldier attrition costs; conduct research in Big Data applications to develop automatically generated test items for personnel assessment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding in Personnel Measures and Assessment to accelerate research in applying Big Data approaches to personnel assessment, performance modeling, and career modeling."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel Readiness and Performance"
                                    },
                                    "Description": {
                                        "val": "This effort funds research to provide the Army with effective leader assessment, development, and training methods to measure, develop, and sustain individual\/leader competencies and performance across the Soldier lifecycle."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.668"
                                            },
                                            "Text": {
                                                "val": "Will initiate research to develop measures of individual resilience and for assessing unit cohesion and unit resilience; will continue research to develop training methods to promote behavior and attitude change in units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.506"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop holistic training methods to help officers and non-commissioned officers (NCOs) enhance and sustain unit resilience; conduct research to create integrated assessments of individual Soldier and unit readiness by researching holistic training methods that combine traditional and lecture-based training with integrative learning methods and training techniques that allow for connections among concepts\/experiences so that information\/skills can be applied to novel and complex issues or challenges)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.894"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.894"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop methods for assessing and developing complex leader competencies to perform effectively in multi-domain operations (e.g., systems and strategic thinking)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreased funding to support the acceleration of Personnel Measures and Assessments.  The decrease in funding delays research in creating methods to accelerate expertise development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unit Performance and Cohesion"
                                    },
                                    "Description": {
                                        "val": "Previously titled ?Unit Readiness,? this effort conducts applied research to ensure cohesive, high performing teams for future operational environments. This effort develops methods to optimize team composition to enhance unit performance, methods to rapidly build and sustain team cohesion, and assessments of unit performance to shape collective training and inform unit readiness indicators."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.065"
                                            },
                                            "Text": {
                                                "val": "Will initiate research to identify behaviors (e.g., hazing, bullying, sexual harassment\/assault, cyber aggression) that detract from unit morale, cohesion, and readiness; Will develop new training methods that target attitude and behavioral change to support improved morale, cohesion, and readiness in small units."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.71"
                                            },
                                            "Text": {
                                                "val": "Conduct research to develop methods and tools that enable Army leaders to build improved morale, cohesion, and readiness in small units; conduct research to identify and measure command climate factors that predict overall unit readiness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.4"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to develop empirically-validated climate assessments based on objective behaviors (e.g., behavior checklists, unobtrusive measures) that efficiently and accurately assess key aspects of command climate; conduct research to develop methods to assess cohesion in non-traditional teams (e.g., dispersed, diverse, new tasks\/missions)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding will be applied to research in developing methods to assess cohesion in non-traditional teams."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}