{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-4",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605301A"
        },
        "ProgramElementTitle": {
            "val": "Army Kwajalein Atoll"
        },
        "R1LineNumber": {
            "val": "156"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "219.271"
            },
            "CurrentYear": {
                "val": "246.663"
            },
            "BudgetYearOne": {
                "val": "246.574"
            },
            "BudgetYearOneBase": {
                "val": "246.574"
            },
            "BudgetYearTwo": {
                "val": "243.535"
            },
            "BudgetYearThree": {
                "val": "238.897"
            },
            "BudgetYearFour": {
                "val": "239.278"
            },
            "BudgetYearFive": {
                "val": "243.953"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "1678.171"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) is unique in the Research, Development, Test & Evaluation (RDTE) portfolio due to the comprehensive scope of RDTE funding at Army Garrison Kwajalein Atoll, directly supporting 11 leased islands with radars, telemetry, and optics in support of 24\/7 New Foreign Launch surveillance, space surveillance, space object identification, offensive and defensive strategic ballistic and interceptor missile testing. In addition, responsibilities include provision of the totality of the logistics and municipal services required to maintain a strategically vital mission support infrastructure in a remote Pacific island chain 2,300 miles southwest of Hawaii. Kwajalein's flexible frequency spectrum, equatorial locale, deep water, and the Department of Defense's (DoD) only land-impact missile testing site, coupled with unmatched instrumentation, make the nation's space and missile operations possible.  \n\nThe United States (U.S.) Army Kwajalein Atoll\/Ronald Reagan Ballistic Missile Defense Test Site (USAKA\/RTS), located in the Republic of the Marshall Islands, is a remote, secure activity of the Major Range and Test Facility Base (MRTFB) supported by U.S. Army Garrison Kwajalein Atoll (USAG-KA). USAKA\/RTS supports test and evaluation of major Army and DoD missile and space acquisition programs and provides new foreign launch surveillance, space operations (surveillance and object identification) in support of U.S. Strategic Command (USSTRATCOM), US Air Force, and National Aeronautics and Space Administration (NASA) scientific and space programs. USAG-KA provides Base Operations (BOS), Infrastructure and Services (DW7\/8\/9) support to the USAKA\/RTS mission and other resident Programs (i.e. Army missile defense, Air Force & Navy Intercontinental Ballistic Missile (ICBM) developmental and operational tests; Army, Air Force, Navy and Defense Advanced Research Projects Agency (DARPA) hypersonic developmental tests; Air Force Space Fence, Missile Defense Agency (MDA) operational \/demonstration\/ validation tests; USSTRATCOM space situational awareness requirements (including contributions to the U.S. Space Surveillance Network); and space experiments). Base Operations Services at Kwajalein Atoll are conducted predominantly through a contracted workforce with governmental oversight. These PE-funded contracts provide: installation\/base operations and maintenance for all facilities, logistics, and security; power generation fuel supporting the installation and radars; transportation; and mission essential bandwidth via a fiber optic cable system. \n\nThe Network Enterprise Technology Command (NETCOM) utilizes Project DX2 to provide civilian pay, manpower service contracts, supporting Information Technology (IT), equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management at Army Kwajalein Test Ranges. This Project provides C4IM services in accordance with the Department of Army Pamphlet (DA PAM) PAM 25-1-1 and the Army C4IM Services List."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "236.648"
                },
                "CurrentYear": {
                    "val": "246.663"
                },
                "BudgetYearOne": {
                    "val": "249.157"
                },
                "BudgetYearOneBase": {
                    "val": "249.157"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "219.271"
                },
                "CurrentYear": {
                    "val": "246.663"
                },
                "BudgetYearOne": {
                    "val": "246.574"
                },
                "BudgetYearOneBase": {
                    "val": "246.574"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-17.377"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-2.583"
                },
                "BudgetYearOneBase": {
                    "val": "-2.583"
                }
            },
            "AdjustmentDetails": {
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-9.07"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-8.201"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.583"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.583"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.106"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In effort to separate operations from installation management functions, funding for operations in Project DX2 (Army Kwajalein Test Ranges and Mission Support) were realigned in Fiscal Year 2018 to Program Element (PE) 0606002A (Ronald Reagan Ballistic Missile Defense Test Site) \/ Project XW9 (Reagan Test Site)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DW7"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Facilities Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.935"
                        },
                        "CurrentYear": {
                            "val": "41.905"
                        },
                        "BudgetYearOne": {
                            "val": "44.666"
                        },
                        "BudgetYearOneBase": {
                            "val": "44.666"
                        },
                        "BudgetYearTwo": {
                            "val": "47.067"
                        },
                        "BudgetYearThree": {
                            "val": "47.489"
                        },
                        "BudgetYearFour": {
                            "val": "48.295"
                        },
                        "BudgetYearFive": {
                            "val": "49.3"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "294.657"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides resources for preventive maintenance and repair necessary to sustain Kwajalein facilities, preventing further deterioration and keeping good facilities in working order in accordance with industry standards. Proposed Fiscal Year (FY) 2019 funding provides 75% of the Department of Defense (DoD) Facility Sustainment Model (FSM) version 18.2 requirement. Kwajalein facilities currently exhibit significant deterioration due to harsh environmental climate and historical resource shortfalls."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Facility Sustainment"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY18, Facility Sustainment activities are delineated into three separate Titles: Army Family Housing, Real Property Maintenance, and Environmental Quality."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.935"
                                            },
                                            "Text": {
                                                "val": "Sustains current condition of facility infrastructure on US Army Garrison Kwajalein Atoll (USAGKA)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Family Housing (AFH) Maintenance"
                                    },
                                    "Description": {
                                        "val": "Provide the operations to support a Family Housing (FH) inventory consisting of 372 units, Billeting consisting of 147 transient rooms, and Unaccompanied Personnel Housing dormitory inventory consisting of 692 units."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.413"
                                            },
                                            "Text": {
                                                "val": "Continue to perform change of occupancy maintenance which includes deep cleaning, small interior repairs and interior painting to make the housing habitable and ready for occupancy. Perform spalling repairs on the aged housing masonry housing. Repair interior ceilings of the ?stick construction? homes to prevent further deterioration and prevent mold."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.462"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.462"
                                            },
                                            "Text": {
                                                "val": "Continue to perform change of occupancy maintenance which includes deep cleaning, small interior repairs and interior painting to make the housing habitable and ready for occupancy. Perform spalling repairs on aged housing masonry. Repair interior ceilings of the ?stick construction? homes to prevent further deterioration and prevent mold."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Cost change accommodates inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Real Property Maintenance"
                                    },
                                    "Description": {
                                        "val": "Provide maintenance and repair activities necessary for preventive maintenance and repair necessary to sustain Kwajalein facilities and utilities preventing further deterioration. Fund facilities and utilities at minimum acceptable levels to mitigate risk of catastrophic failures. Includes regularly scheduled adjustments and inspections, preventive maintenance tasks and emergency response and service calls for minor repairs. Also includes costs of major repairs or replacement of facility components that are expected to occur periodically throughout the expected service life. This work includes: regular roof replacement; refinishing wall surfaces; repairing and replacing electrical, plumbing, and cooling systems; replacing tile and carpeting; and similar types of work. Sustainment, however, is not intended to keep facilities adequately functioning beyond their expected service lives."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "39.378"
                                            },
                                            "Text": {
                                                "val": "Continue to service over 1,477 facilities on Kwajalein, Roi-Namur, and the 9 other islands totaling 2.6 Million square feet. Execute an aggressive maintenance plan based on the significant corrosive environment; prepare maintenance plans and schedules for recurring or preventive maintenance; perform periodic pre-maintenance inspections; perform preventive and corrective maintenance; report the need for major repair, replacement, or rehabilitation; prepare records of maintenance actions performed and deficiencies discovered; and perform post-maintenance inspections."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.082"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.082"
                                            },
                                            "Text": {
                                                "val": "Continue to service over 1,477 facilities on Kwajalein, Roi-Namur, and the 9 other islands totaling 2.6 Million square feet. Continue an aggressive maintenance plan based on the significant corrosive environment; prepare maintenance plans and schedules for recurring or preventive maintenance; perform periodic pre-maintenance inspections; perform preventive and corrective maintenance; report the need for major repair, replacement, or rehabilitation; prepare records of maintenance actions performed and deficiencies discovered; and perform post-maintenance inspections."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Cost change accommodates inflation and increased maintenance requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality"
                                    },
                                    "Description": {
                                        "val": "Provide manpower necessary to achieve, evaluate, and sustain compliance with appropriate Federal, State, and local environmental laws, Executive Orders, DoD Directives, regulations, and overseas country-specific Final Governing Standards, in order to protect human health and safety and reduce total cost to the Army through environmental compliance, conservation, and pollution prevention. Enables installations to comply with legal environmental mandates and critical stewardship responsibilities that impact management and modernization of installations, while sustaining natural and cultural resources in a manner that provides continued access and long-term use of training lands to support the Army's installation missions.."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.114"
                                            },
                                            "Text": {
                                                "val": "Continue oversight and management of environmental workload."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.122"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.122"
                                            },
                                            "Text": {
                                                "val": "Continue oversight and management of environmental workload."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Cost change accommodates inflation and improved compliance."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW8"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Installation Services"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "115.031"
                        },
                        "CurrentYear": {
                            "val": "126.88"
                        },
                        "BudgetYearOne": {
                            "val": "124.961"
                        },
                        "BudgetYearOneBase": {
                            "val": "124.961"
                        },
                        "BudgetYearTwo": {
                            "val": "127.678"
                        },
                        "BudgetYearThree": {
                            "val": "130.497"
                        },
                        "BudgetYearFour": {
                            "val": "132.211"
                        },
                        "BudgetYearFive": {
                            "val": "134.797"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "892.055"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project resources Base Operations\/Installation Services Support for United States (U.S.) Army Kwajalein (USAKA) located in the Republic of the Marshall Islands, a remote, secure activity designated as a Major Range and Test Facility Base (MRTFB). Kwajalein is a government-managed\/contractor-operated site and is primarily dependent upon its associated support contracts for the daily operations and maintenance of Base Operations\/Installation Services Support. Installation Services Support consists of: Medical\/Dental Services; Education (K-12) Services; Food\/Grocery Services; Contracted Security Guards; Aviation\/Marine support; and logistical (fuel\/transportation) operations support requirements. Base Operations\/Installation Services Support resourcing is a critical enabler to ensure continuity of operations supporting Test and Evaluation and Space Operations of the Reagan Test Site in its role as an MRTFB Activity."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Base Operations Support"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY 2018, Base Operations Support activities have been itemized as separate Planned Programs in order to provide a detailed functional segmentation of installation management programs. Base Operations Support activities ensure the health, safety and welfare of Garrison, tenant personnel, and families. Functions supported include: Installation Management, Administrative and Civil Law, Criminal Law and Discipline, Client Services, Claims, Religious Support, Public Affairs, Equal Employment Opportunity (EEO), Internal Review, Installation Safety and Occupational Health, Administrative Services, Resource\/Financial Management, Unaccompanied Personnel Housing and Basic Officers Quarters Management, Family Housing Management, Army Substance Abuse Program, Army Community Services, Child and Youth Sports, Recreation, and Libraries, Business Operations, Schools, Fire and Emergency Response Services, Custodial Services, Refuse Removal, Grounds Maintenance, Electrical Services, Heating\/Cooling Services, Water Services, Waste Water Services, Other Utility Services, Compliance and Conservation Programs, Pollution Prevention Programs, Indoor and Outdoor Pest Management, Physical Security, Law Enforcement Services, Anti-Terrorism Services, Installation Security Program Management Support, Army Emergency Management Services, Military Personnel Services, Civilian Personnel Services, Continuing Education, Emergency Disaster Prep, Host Nation Services, and Protocol Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "56.512"
                                            },
                                            "Text": {
                                                "val": "Provides for Base Operations to ensure the health, safety and welfare of garrison, tenant personnel, and families. Functions supported: Installation Management, Administrative and Civil Law, Criminal Law and Discipline, Client Services, Claims, Religious Support, Public Affairs, Equal Employment Opportunity (EEO), Internal Review, Installation Safety and Occupational Health, Administrative Services, Resource\/Financial Management, Unaccompanied Personnel Housing and Basic Officers Quarters Management, Family Housing Management, Army Substance Abuse Program, Army Community Services, Child and Youth Sports, Recreation, and Libraries, Business Operations, Schools, Fire and Emergency Response Services, Custodial Services, Refuse Removal, Grounds Maintenance, Electrical Services, Heating\/Cooling Services, Water Services, Waste Water Services, Other Utility Services, Compliance and Conservation Programs, Pollution Prevention Programs, Indoor and Outdoor Pest Management, Physical Security, Law Enforcement Services, Anti-Terrorism Services, Installation Security Program Management Support, Army Emergency Management Services, Military Personnel Services, Civilian Personnel Services, Continuing Education, Emergency Disaster Prep, Host Nation Services, and Protocol Services."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistical Support"
                                    },
                                    "Description": {
                                        "val": "Beginning FY 2018, logistical support has been itemized into functional activities to maximize transparency. This activity covered all logistic functions to include marine and air field operations along with transportation, supply, laundry, food service and maintenance. Transportation includes the operation of transportation motor pools, installation transportation offices, intra-installation rail equipment, and cost of leased vehicles; also includes storage and movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas). Excludes OSA and Watercraft. Supply provides for installation supply operations which include: Ammunition Supply Point services, operation of a central receiving point for goods delivered to the installation, management of Organizational Clothing and Individual Equipment (OCIE), management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials, secondary items and bulk petroleum for garrison and non-brigade tenant units. Procures petroleum, oils and lubricants (POL) of which approximately 90% of POL is for power generation and the remainder for intra atoll marine and aviation transportation, and for intra-island land transportation and heavy equipment. Laundry account funds Government Owned Contractor Operated (GOCO) and Contractor Owned Contractor Operated (COCO) facilities that provide laundry and dry cleaning service for OCIE items to units in accordance with (IAW) Army Regulation (AR) 210-130. Food account funds the operation of Active, Guard, and Reserve dining facilities and Troop Issue Subsistence Activities (TISA), including pay of government and contract employees, food service supplies, and replacement equipment. Maintenance includes DS\/GS support maintenance (Non-Tactical Support)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "51.828"
                                            },
                                            "Text": {
                                                "val": "Provides all logistic functions to include marine and air field operations along with transportation, supply, laundry, food service and maintenance. Transportation includes the operation of transportation motor pools, installation transportation offices, intra-installation rail equipment, and cost of leased vehicles; also includes storage and movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas). Excludes OSA and Watercraft. Supply provides for installation supply operations which include: Ammunition Supply Point services, operation of a central receiving point for goods delivered to the installation, management of Organizational Clothing and Individual Equipment (OCIE), management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials, secondary items and bulk petroleum for garrison and non-brigade tenant units. Procures petroleum, oils and lubricants (POL) of which approximately 90% of POL is for power generation and the remainder for intra atoll marine and aviation transportation, and for intra-island land transportation and heavy equipment. Laundry account funds Government Owned Contractor Operated (GOCO) and Contractor Owned Contractor Operated (COCO) facilities that provide laundry and dry cleaning service for OCIE items to units IAW AR 210-130. Food account funds the operation of Active, Guard, and Reserve dining facilities and Troop Issue Subsistence Activities (TISA), including pay of government and contract employees, food service supplies, and replacement equipment. Maintenance includes DS\/GS support maintenance (Non-Tactical Support)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medical\/Dental Support"
                                    },
                                    "Description": {
                                        "val": "Beginning FY 2018, medical \/ dental support has been itemized into functional activities to maximize transparency. This activity provided a fully operational community hospital, a secondary medical clinic, veterinarian services, physical therapy clinic and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, medical services management, and all medical functions to include inspections of medical facilities and calibration of equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.691"
                                            },
                                            "Text": {
                                                "val": "Support a fully operational community hospital, a secondary medical clinic, veterinarian services, physical therapy clinic and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, medical services management, and all medical functions to include inspections of medical facilities and calibration of equipment."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Family Housing (AFH) Operations"
                                    },
                                    "Description": {
                                        "val": "Description: Funds all costs associated with the operations of a residence to include management, services, furnishing and utilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.834"
                                            },
                                            "Text": {
                                                "val": "Continue to fund costs associated with the operations of Family Housing (FH) inventory consisting of 438 units, which includes 106 condemned units, and is comprised of three different types: Housing units constructed of concrete masonry and poured concrete Circa 1955 and 1994; units constructed of wood, metal studs and aluminum siding circa 1988, and modular housing- prefabricated, commonly referred to as trailers. The Billeting Section consists of 185 transient rooms; 3 Distinguished Visitor?s Quarters; and 6 multi-purpose\/recreational housing. Transient housing facilities are located on Kwajalein and Roi-Namur and consist of permanent buildings constructed of concrete masonry.  The Unaccompanied Personnel Housing (UPH) inventory consists of 833 units comprised of permanent buildings constructed of concrete masonry and poured concrete. UPH units are located on both Kwajalein and Roi-Namur."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.971"
                                            },
                                            "Text": {
                                                "val": "Continue to fund costs associated with the operations of FH inventory, consisting of 372 units, and is comprised of three different types: Housing units constructed of concrete masonry and poured concrete circa 1955 and 1994; units constructed of wood, metal studs and aluminum siding circa 1988, and modular housing- prefabricated, commonly referred to as domes. The Billeting Section consists of 147 transient rooms. Transient housing facilities are located on Kwajalein and Roi-Namur and consist of permanent buildings constructed of concrete masonry. The UPH inventory consists of 692 units comprised of permanent buildings constructed of concrete masonry and poured concrete. UPH units are located on both Kwajalein and Rooi-Namur."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Airfields (AAF) and Heliports (AHP)"
                                    },
                                    "Description": {
                                        "val": "Provides Resources Operations and Maintenance for Army Airfield and Aviation Fleet. Provides manpower, equipment acquisition, sustainment and maintenance in support of airfield operations, airfield management, aircraft services, air traffic services (ATS), air transport, airspace management and control, and air traffic control equipment maintenance. Includes airfield specific equipment, safety requirements, Hazardous Materials (HAZMAT) support, and airfield obstruction surveys. AAF\/AHP functions support Department of Defense (DoD) priorities for Army and joint force capabilities and inter-agency, intra-agency and multinational operations to meet current and future full spectrum requirements. Funds AAF\/AHP functions at the necessary state of readiness to support missions across 11 islands (2 fixed wing\/6 rotator wing) in addition to international aircraft traffic and reduces risk of major accidents\/incidents."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.722"
                                            },
                                            "Text": {
                                                "val": "Continue to provide services for all mission essential DoD, commercial, and transient aircraft. Operate 2 Airfields and 8 outer islands helipads. Operate and maintain 1 Air Traffic Control (ATC) tower with class D airspace, 2 separate airfield operations and integrated Standard Terminal Automation Replacement System (STARS) radar for aircraft separation and de-confliction. Support all intra atoll cargo and personnel movements with 2 fixed wing and 4 rotary wing aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.687"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.687"
                                            },
                                            "Text": {
                                                "val": "Provide services for all mission essential DoD, commercial, and transient aircraft. Operate 2 Airfields and 8 outer islands helipads. Operate and maintain 1 Air Traffic Control (ATC) tower with class D airspace, 2 separate airfield operations and integrated STARS radar for aircraft separation and de-confliction. Support all intra atoll cargo and personnel movements with 2 fixed wing and 4 rotary wing aircraft.  Support transient international flights."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Community Services (ACS)"
                                    },
                                    "Description": {
                                        "val": "Provides programs that prevent family violence\/fatalities through family advocacy programs and counseling; provide specialized assistance to provide prevention, education and family sustainment for military and civilian personnel and their families; and also provide critical financial, employment and relocation education and training to Soldiers, civilians, and their Families."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.267"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine Army Community Services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.274"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.274"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine Army Community Services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Child and Youth Services (CYS)"
                                    },
                                    "Description": {
                                        "val": "Provides child care, youth, and school services (CYSS) programs for children and youth. Provides child and youth spaces required to meet Army's child care and youth participation demand goals. Resources the following programs: 1) Child Development Centers; 2) Family Child Care; 3) School Age Care; 4) Youth Programs; 5) Youth Sports & Fitness; 6) School Support Services.  Resources staffing levels necessary to minimize risk of child abuse, and the oversight to achieve and maintain DoD Certification (State licensing equivalent) and National Accreditation per statutory requirement and DoD policy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.35"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to operate CYS programs on Kwajalein to include a Child Development Center, School Age Services programs, Supplemental Programs and Services (SPS), and Youth programs and services.  Establish and maintain developmentally and age-appropriate staff-child\/youth interactions, activities, activity schedules and plans, supplies and equipment, furnishings, and environment (both indoors and outdoors) that lead to the social, physical, cognitive, and emotional growth of children up to 18 years.  Ensure that youth programs include, at a minimum, seasonal  sports programs, 4-H Club programs, Boys and Girls Club of America programs, instructional programs, recreational programs, programs that promote leadership and citizenship, intervention services, and teen programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.422"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.422"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to operate CYS programs on Kwajalein to include a Child Development Center, School Age Services programs, Supplemental Programs and Services, and Youth programs and services. Establish and maintain developmentally and age-appropriate staff-child\/youth interactions, activities, activity schedules and plans, supplies and equipment, furnishings, and environment (both indoors and outdoors) that lead to the social, physical, cognitive, and emotional growth of children up to 18 years. Ensure that youth programs include, at a minimum, seasonal sports programs, 4-H Club programs, Boys and Girls Club of America programs, instructional programs, recreational programs, programs that promote leadership and citizenship, intervention services, and teen programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering Services"
                                    },
                                    "Description": {
                                        "val": "Provides (1) Facility Management and Administration and (2) Installation Engineering Services. Facility Management includes public works management costs, contract management, material procurement, facility data management; to include, Geographic Information System (GIS) and Sustainment Management Systems (SMS) suite implementation\/inspections, furnishings management costs, and real property and real estate management. Installation Engineering Services includes facility engineer service contracts, annual inspection of facilities, master planning, overhead of planning and design, and overhead of construction management and non-Sustainment and Restoration Modernization (SRM) service calls. Excludes: vehicle maintenance, in-house shop and contracted personnel who routinely perform facility sustainment activities; and design engineers or project managers or construction inspectors who manage and oversee facility sustainment and construction projects."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.601"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine engineering services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.312"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.312"
                                            },
                                            "Text": {
                                                "val": "Continue to provide necessary\/routine engineering services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Recreation and Community Support"
                                    },
                                    "Description": {
                                        "val": "Provides the development and delivery of Soldier Programs, Community Recreation, and Direct Common Family and Morale, Welfare and Recreation (FMWR) Support Services that sustain the Total Army, in accordance with (IAW) the Army Campaign Plan and the Chief of Staff of the Army (CSA)'s Strategic Priorities. Programs funded include sports, fitness and aquatics, recreation centers, libraries, outdoor recreation, skill development, bowling (16 lanes or less); Direct Common FMWR Support Services (essential command and control and risk management programs for property, funds and personnel); and as designated by Congress, Category C FMWR activities at remote and isolated sites. These programs resource readiness and resiliency and build upon physical, emotional, social and psychological coping skills; funds opportunities for Soldiers, civilians and Families to foster self-reliance, morale and a sense of belonging by offering positive discretionary time choices, mitigating aberrant behaviors through individual skill development and team participation."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.522"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources necessary to perform selected retail and base food service operations at RTS typical of those found in an American community.to meet the needs of USAKA\/RTS residents, tenants, satellite activities, range users, and other authorized organizations\/personnel on Kwajalein Island, Roi-Namur Island, Meck Island, and on other USAKA\/RTS outer islands. Operate a Small Boat Marinas at Kwajalein and Roi-Namur offering watercraft-licensing to include water safety and boating instructions for all classes of available rental boats on a reimbursable basis. Provide postal services to meet the needs of USAKA\/RTS residents, tenants, satellite activities, range users, and other authorized organizations\/personnel on Kwajalein and Roi-Namur Islands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.241"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.241"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources necessary to sustain Soldier Recreation and Community Support for a community population of 1400 and meet the needs of USAKA\/RTS residents, tenants, satellite activities, range users, and other authorized organizations\/personnel on Kwajalein Island, Roi-Namur Island, Meck Island, and on other USAKA\/RTS outer islands."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fire and Emergency Services (FES)"
                                    },
                                    "Description": {
                                        "val": "Provides for fire and emergency services for the installation, including preparation for and response and mitigation of aircraft and structural firefighting and rescue, technical rescue, Hazardous Materials and Weapons of mass destruction\/Chemical, Biological, Radiological, Nuclear, and Explosives (CBRNE) responses, and out of control wildfire mitigation in an all-hazard response environment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.677"
                                            },
                                            "Text": {
                                                "val": "Continue to provide Fire and Emergency Services are performed in association with the Base Support\/Logistics contractor. Provide fire protection services for all USAG-KA and RTS assets, to include facilities, structural, aircraft, shipboard and small watercraft, and wild land fires. Services provide protection for the fire hazards associated with operations and community at USAG-KA and RTS. Provide Fire Protection on Kwajalein and Roi-Namur 24 hours.  Provide fire Protection and Emergency Services on Meck during duty hours, mission periods, and hazardous operations. Provide ambulance service on Kwajalein, Meck, and Roi-Namur Islands. Provide fire safety education and activities for the schools and day-care centers and for adult residents of USAG-KA and RTS. Train personnel normally assigned to work on Illeginni, Ennylabegan, Gagan, and Legan islands as their normal and permanent work sites in first aid, Cardiopulmonary Resuscitation (CPR), and operation of fire extinguishers and fire alarm and suppression equipment peculiar to the island.  Provide rescue and emergency medical personnel available for immediate dispatch to aircraft or vessel crash site, entry into the ocean or lagoon, and be provisioned for immediate rescue and emergency medical assistance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.717"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.717"
                                            },
                                            "Text": {
                                                "val": "Continue to provide fire and Emergency Services which are performed in association with the Base Support\/Logistics contractor. Provide fire protection services for all USAG-KA and RTS assets, to include facilities, structural, aircraft, shipboard and small watercraft, and wild land fires. Services provide protection for the fire hazards associated with operations and community at USAG-KA and RTS. Provide Fire Protection on Kwajalein and Roi-Namur 24 hours Provided Fire Protection and Emergency Services on Meck during duty hours, mission periods, and hazardous operations. Provide ambulance service on Kwajalein, Meck, and Roi-Namur Islands. Provide fire safety education and activities for the schools and child development center and for adult residents of USAG-KA. Train personnel normally assigned to work on the remote islands of Illeginni, Ennylabegan, Gagan, and Legan in first aid, Cardiopulmonary Resuscitation (CPR), and operation of fire extinguishers and fire alarm and suppression equipment peculiar to the island. Provide rescue and emergency medical personnel available for immediate dispatch to aircraft or vessel crash site, entry into the ocean or lagoon, and be provisioned for immediate rescue and emergency medical assistance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Financial Management (FM) Activities"
                                    },
                                    "Description": {
                                        "val": "Provides Directorate of Resource Management (DRM) and DRM base support for Army tenants resident on or receiving support from the Army installation. Functions of the DRM include program, budget, manpower, documentation, Memorandum of Understanding (MOU)\/Memorandum of Agreement (MOA)\/Support Agreement management, finance and accounting."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.768"
                                            },
                                            "Text": {
                                                "val": "Continue to provide program\/budget support and budget execution, financial advisory service and accounting liaison services. Support Audit Readiness through Statement of Budgetary Resource samples. Continue to establish  a Inter-service Support Agreements(ISSA). Provide management analysis on manpower requirements and organizational structure analysis. Provide Contracting Officer Representative oversight for the Program Management functions for the base-support contract. Provide resource management support for the development of the new base-support contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.787"
                                            },
                                            "Text": {
                                                "val": "Continue to provide program\/budget support and budget execution, financial advisory service and accounting liaison services. Support Audit Readiness through Statement of Budgetary Resource samples. Continue to establish Inter-service Support Agreements(ISSA). Provide management analysis on manpower requirements and organizational structure analysis. Provide Contracting Officer Representative oversight for the Program Management functions for the base-support contract."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Food Services"
                                    },
                                    "Description": {
                                        "val": "Provides for the operation of dining facilities including contract employees, food service supplies, and equipment life-cycle replacement."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.385"
                                            },
                                            "Text": {
                                                "val": "Continue to provide services for DoD, contractor, host nation, interagency and intra-agency organizations with multiple facilities on three different islands to include 3 cafeterias, bakery, grocery store, dry\/cold warehousing, Army and Air Force Exchange Service (AAFES) retail stores, AAFES food court, catering services and private organizations. Monitored and approved food purchases and preparation. Conduct food service inspections."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.653"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.653"
                                            },
                                            "Text": {
                                                "val": "Continue to provide services for DoD, contractor, host nation, interagency and intra-agency organizations with multiple facilities on three different islands to include 3 cafeterias, bakery, grocery store, dry\/cold warehousing, AAFES retail stores, AAFES food court, and catering services and private organizations. Monitor and approve food purchases and preparation. Conduct food service inspections."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unaccompanied Housing"
                                    },
                                    "Description": {
                                        "val": "Provides for Government-owned Unaccompanied Housing including appropriated funded Army lodging, lifecycle replacement furnishings, and other associated costs. Includes Manpower purchase, control, moving, management and handling of lifecycle replacement and repair for all unaccompanied housing furnishings. Includes all costs of authorized replacement furnishings in existing inventory."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.543"
                                            },
                                            "Text": {
                                                "val": "Continue to provide contractor management, oversight, maintenance and repair (M&R), and control of all USAGKA and RTS 833 Housing\/Billeting Facilities Utilized best commercial residential business practices to ensure quality of life standards are achieved and enhanced, and are in compliance with adequacy and life and safety standards  comparable to those found in commercial properties. Provide Master Key control services. Provide and implement a sound furnishings and appliances program that addresses acquisition, replacement, M&R, and refurbishing. Provide Hospitality Kits consisting of the minimum essential items to operate a household until permanent party personnel's Household Goods (HHG) arrive and from HHG shipment until departure. Provide Change of Occupancy Maintenance (COOM) on all FH facilities prior to reassignment to in-coming resident."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.581"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.581"
                                            },
                                            "Text": {
                                                "val": "Continue to provide contractor management, oversight, M&R, and control of all USAG-KA Housing\/ Billeting Facilities Utilize best commercial residential business practices to ensure basic quality of life standards are achieved and are in compliance with life and safety standards. Provide Master Key control services. Provide and implement a sound furnishings and appliances program that addresses acquisition, replacement, M&R, and refurbishing. Provide Hospitality Kits consisting of the minimum essential items to operate a household until permanent party personnel's HHG arrive and from HHG shipment until departure. Provide COOM on all facilities prior to reassignment to in-coming resident."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Law Enforcement"
                                    },
                                    "Description": {
                                        "val": "Provides Law Enforcement (LE) activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. This effort covers, but is not limited to: all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles, training and management for LE response forces (Department of the Army Civilian Police (DACP) and military police (MP)). Funds the conduct of motor vehicle traffic supervision, and liaison with civilian LE agencies. Funds LE work load derived from historical responses to calls for service (i.e. Crimes against Persons, Drug Crimes, Traffic Crimes, Absent Without Leave (AWOL), Sex Crimes, and Crimes against Property, Environmental Violations, Fraud Crimes, Alarm Response and Public Service Calls), investigation of non-felony level offenses, preparation and distribution of MP reports and related documents, and collection and analyses of crime statistics."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.905"
                                            },
                                            "Text": {
                                                "val": "Will provide LE activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. Will cover, but not limited to, all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles leases, training and management for LE response forces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.71"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.71"
                                            },
                                            "Text": {
                                                "val": "Continue to provide LE activities\/services for the protection of people and property, enforcement of laws, and maintenance of order. Will cover, but not limited to, all personnel and operating costs associated with LE operations, salaries, overtime, benefits, material and supplies, equipment, vehicles, training and management for LE response forces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materiel Maintenance"
                                    },
                                    "Description": {
                                        "val": "Provide for Automotive, Construction, General Equipment, and Armament Maintenance. Also provides Field and Sustainment level maintenance services to Army activities in accordance with AR 750-1; provides maintenance technical assistance to supported units and activities, and provides material maintenance on base operations support equipment."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.129"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the maintenance of all 6 aircraft, 14 marine vessels, heavy equipment, non-tactical and tactical equipment, construction equipment; base operations equipment and marine navigational aides. Provide government estimates for repair\/replacement of damaged, lost or lifecycle replacement equipment. Provide resources for On Condition Cyclic Maintenance (OCCM) for marine vessels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.822"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.822"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the maintenance of all 6 aircraft, 17 marine vessels, heavy equipment, non-tactical and tactical equipment, construction equipment; base operations equipment and marine navigational aides. Provide government estimates for repair\/ replacement of damaged, lost or lifecycle replacement equipment. Provide resources for OCCM for marine vessels."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Municipal Services"
                                    },
                                    "Description": {
                                        "val": "Provides for municipal services including grounds maintenance, custodial, pest management, solid waste or refuse handling operations, pavement clearance through the removal of snow\/ice\/sand and street sweeping, and homeless shelter support."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.949"
                                            },
                                            "Text": {
                                                "val": "Provide necessary\/routine municipal services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.842"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.842"
                                            },
                                            "Text": {
                                                "val": "Provide necessary\/routine municipal services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Installation Command and Management"
                                    },
                                    "Description": {
                                        "val": "Provides for a K-12 school system, medical\/dental services, and Base Support Contract overhead fees. Additionally, supports offices of the Commander, Staff Judge Advocate (SJA), Chaplain, Public Affairs (PA), and Safety Office. Supports civilian pay and benefits, training, duty travel, Permanent Change of Station (PCS) costs, equipment, and contractual services for installation command and management activities. Kwajalein Medical\/Dental services provide family practice and emergency services at Kwajalein (2-5 days for MEDEVAC support to Honolulu), a secondary clinic on Rio-Namur, and a dental clinic. Support includes but is not limited to medical lab and imaging services, pharmacy services, basic dental services, and all medical functions including inspections of medical facilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.282"
                                            },
                                            "Text": {
                                                "val": "Continue to provide base support operations, through the Base Operations Support (BOS) contractor, supporting the strategically important RTS which includes 11 defense sites. USAG-KA support to the U.S. Embassy advancing the relationship with the Republic of the Marshall Islands. Provide installation management functions for a diverse population of 288 Department of the Army Civilians and active duty military personnel & 1100  contractor's their respective dependents. Provide necessary\/routine Installation Command and Management services to the Installation. Plan, organize, staff, direct, and control the USAKA Medical and Dental programs including management and administration of total health care at USAKA. Provide routine and emergency inpatient and outpatient medical and dental services to USAKA residents, designated indigenous personnel, and official visitors at USAKA. Perform diagnosis, treatment, and preventative health services and administer the Medical and Dental programs efficiently, using standards of care similar to small stateside community hospitals. Provide a full range of Educational services on USAKA to include kindergarten, elementary, junior high, senior high, and adult education."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "32.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "32.997"
                                            },
                                            "Text": {
                                                "val": "Provide Installation Command and Management across 11 islands\/defense sites to a population of over 100 Active Duty Military and Department of the Army civilians & 1100 contractors and their family members. Plan, organize, staff, direct, and control all aspects of installation and command management."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Physical Security Matters"
                                    },
                                    "Description": {
                                        "val": "Provides resources for physical security programs and equipment to support Army installations and facilities requirements. Procures, installs, maintains and\/or leases physical security equipment to include, but not limited to barriers; blast mitigation devices; communication systems; explosive detection devices; intrusion detection systems and devices; sensors; site improvements; management\/planning; and security forces and technicians. Funds contract security guards including military working dog management and equipping the installation with explosive and drug detection dog capabilities."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.293"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary physical security procedures and materials to ensure USAG-KA maintains all proper security measures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.423"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.423"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary physical security procedures and materials to ensure USAG-KA maintains all proper security measures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment and incremental (net zero) adjustment to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Security Programs"
                                    },
                                    "Description": {
                                        "val": "Funds Army Command security activities supporting: Information Security, Personnel Security, Industrial Security, Communications Security (COMSEC) Policy, Security Education, Training and Awareness (SETA), Special Access Program (SAP) Security, Sensitive Compartmented Information (SCI) Security, Foreign Disclosure, and Technology Protection."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.114"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary security procedures and materials to ensure USAGKA maintains all proper security measures to ensure successful missions continue on USAGKA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "Continue to provide the necessary security procedures and materials to ensure USAGKA maintains all proper security measures to ensure successful missions continue on USAGKA."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Supply Logistics"
                                    },
                                    "Description": {
                                        "val": "Provides supply operations which support: ammunition supply point services, bulk petroleum operations, marine and aviation assets, Army tenants, operation of a central receiving point and\/or Installation Supply Support Activity (SSA) for goods delivered to the installation, management of non-deployable installation property, and receipt, storage, issue, reutilization and tracking of hazardous materials."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.911"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources for property accountability of all Government Furnished Equipment\/Contractor Acquired Property (GFE\/CAP), reutilization items, Military Standard Requisitioning and Use Procedures (MILSTRIP) ordering, hazardous items, bulk fuel ordering and delivery to multiple outer islands. Provided Quality Assurance Evaluator (QAE) services for Defense Logistics Agency - Europe 9 (DLA-E) fuel farm; disposition of obsolete items to the host nation government;"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.059"
                                            },
                                            "Text": {
                                                "val": "Continue to provided resources for property accountability of all GFE\/CAP, reutilization items, Military Standard Requisitioning and Use Procedures ordering and delivery to multiple outer islands. Dispose of obsolete items in accordance with Army equipment disposition procedures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Transportation Services"
                                    },
                                    "Description": {
                                        "val": "Provides the operation of installation transportation offices, transportation motor pools, and cost of rolling stock; also includes movement of privately-owned household goods of military personnel (and civilian personnel in overseas areas) in connection with assignment, reassignment, or termination of government-furnished family housing."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.577"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the operation of all transportation services to include 6 aircraft, 14 marine vessels, and over 200 pieces of rolling stock. Operated a centralized motor pool. Fund operations for movement of all international and intra atoll air and surface cargo to include government and contractor household goods, HAZMAT, United States Postal Service (USPS) mail and food items. Safely ferry over 48,000 passengers per month within the atoll on various USAGKA marine assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "21.493"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "21.493"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources for the operation of all transportation services to include 6 aircraft, 17 marine vessels, and over 200 pieces of rolling stock. Operate a centralized motor pool. Fund operations for movement of all international and intra atoll air and surface cargo to include mission critical equipment and supplies, household goods, HAZMAT, United States Postal Service (USPS) mail, medical, and food items. Safely ferry over 48,000 mission critical employees per month within the atoll on various USAGKA marine assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment and incremental (net zero) adjustment to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Utilities"
                                    },
                                    "Description": {
                                        "val": "Provide utility services - production and distribution of utilities including expenses for electricity, steam, hot water, fuels and other utilities, and operation of electrical, air conditioning, refrigeration, water distribution, and wastewater collection and treatment plants and systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "35.888"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources to operate and maintain seven Power generation and distribution systems on Kwajalein; nine on Roi, five on Meck, and eleven total on the outer islands of Carlos, Gagan, Illeginni, and Legan, distributing over 7.5 Million kilowatt hours \/ month. Operate, maintain, and repair all prime power plants, distribution systems, and ancillary equipment and related systems, including fixed and portable auxiliary generators.  Provide reliable power during mission windows. Develop and implement a maintenance plan which includes operator maintenance, predictive maintenance, Program Management (PM), cyclical, and recurring maintenance, as well as periodic equipment and systems overhauls for all power production systems. Provide appropriate staff to operate power plants 24 hours a day. Operate and maintain potable and non-potable water production & distribution systems. Operate and maintain wastewater treatment plant water systems and storage including equipment. Distribute water to a population of approximately 1400 people consuming over 5.3 million gallons of water per month. Operate all wastewater treatment plants and equipment, collection and distribution systems, and all ancillary equipment and other related systems, including septic tanks. Develop, implement, and manage a waste management program including collection, incineration, landfill, compost, and recycling facilities. Provide preventative, cyclical and recurring, and unscheduled maintenance and repair of the Incinerator and all ancillary equipment and systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.474"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.474"
                                            },
                                            "Text": {
                                                "val": "Continue to provide resources including fuel to operate and maintain seven Power generation and distribution systems on Kwajalein; nine on Roi, five on Meck, and eleven total on the outer islands of Carlos, Gagan, Illeginni, and Legan, distributing over 7.5 Million kilowatt hours \/ month. Operate, maintain, and repair all prime power plants, distribution systems, and ancillary equipment and related systems, including fixed and portable auxiliary generators. Provide reliable power during mission windows. Develop and implement a maintenance plan which includes operator maintenance, predictive maintenance, Program Management (PM), cyclical, and recurring maintenance, as well as periodic equipment and systems overhauls for all power production systems. Provide appropriate staff to operate power plants 24 hours a day. Operate and maintain potable and non-potable water production & distribution systems. Operate and maintain wastewater treatment plant water systems and storage including equipment. Distribute water to a population of approximately 1400 people consuming over 5.3 million gallons of water per month. Operate all wastewater treatment plants and equipment, collection and distribution systems, and all ancillary equipment and other related systems, including septic tanks. Develop, implement, and manage a waste management program including collection, incineration, landfill, compost, and recycling facilities. Provide preventative, cyclical and recurring, and unscheduled maintenance and repair of the Incinerator and all ancillary equipment and systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Quality"
                                    },
                                    "Description": {
                                        "val": "Provides manpower and funding necessary to achieve, evaluate, and sustain compliance with appropriate Compact of Free Association, national, and USAKA Environmental Standards, Executive Orders, DoD Directives, regulations, and overseas country-specific. Final Governing Standards, in order to protect human health and safety and reduce total cost to the Army through environmental compliance, conservation, and pollution prevention. Enables installations to comply with legal environmental mandates and critical stewardship responsibilities that impact management and modernization of installations, while sustaining natural and cultural resources in a manner that provides continued access and long-term use of training lands to support the Army's installation missions. Also includes costs associated with Range Military Construction (MILCON) to address one-time mitigation actions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.114"
                                            },
                                            "Text": {
                                                "val": "Provide necessary\/routine environmental quality services to the Installation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.049"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.049"
                                            },
                                            "Text": {
                                                "val": "Provide necessary\/routine environmental quality services to the Installation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease represents inflation adjustment and incremental (net zero) adjustment to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Terrorism (AT)"
                                    },
                                    "Description": {
                                        "val": "Funds the Army Antiterrorism program, a defensive program to protect against Terrorism. Supports the following: Antiterrorism installation and mission requirements: Combatant Commands (COCOM) Antiterrorism requirements (Army as Executive Agent (EA)), Antiterrorism Program Management, Antiterrorism Training and Awareness efforts (Area of Responsibility (AOR) specific, Level I Antiterrorism Awareness Training, Level II Antiterrorism Officers Training, Level III Pre-command training, and Level IV Antiterrorism Executive Seminar), protection of High Risk Personnel (HRP) to include support requirements (equipment), execution of Antiterrorism Assessments (Terrorism Vulnerability Assessments, Special Event Assessments, Pre-deployment Vulnerability Assessments, and Comprehensive Antiterrorism Reviews) designed to identify and fix protection vulnerabilities that will protect personnel and facilities from terrorist acts, intelligence support to Army Antiterrorism, conduct annual Antiterrorism Exercises designed to execute Antiterrorism plans, and the implementation of the Random Antiterrorism Measures Program (RAMP) and the Force Protection Condition (FPCON) system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.049"
                                            },
                                            "Text": {
                                                "val": "Provide antiterrorism programs. Provide personnel with the necessary training and identify high risk individuals when appropriate. Continue to work with our resident military intelligence organization to keep abreast of new developments and trends within terrorist organizations which may effect our installation. Continue to identify and update vulnerabilities to our facilities and emplace protective measures to reduce risks to mission."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.205"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.205"
                                            },
                                            "Text": {
                                                "val": "Provide antiterrorism programs. Provide personnel with the necessary training and identify high risk individuals when appropriate. Continue to identify and update vulnerabilities to our facilities and emplace protective measures to reduce risks to mission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase represents inflation adjustment and incremental (net zero) adjustment to DW8 line to better align funding and execution."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Personnel Services Delivery"
                                    },
                                    "Description": {
                                        "val": "Provides a human resource specialist responsible for providing all aspects of human resource management, administrative, and counsel to the Garrison Staff."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.121"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.121"
                                            },
                                            "Text": {
                                                "val": "Continue to provide human resource support to the Garrison Staff."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New line for FY19 - Realigned from existing programs.  Increase reflects Net Zero change to DW8 line to better align funding and execution."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW9"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Atoll Restoration And Modernization"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.793"
                        },
                        "CurrentYear": {
                            "val": "66.987"
                        },
                        "BudgetYearOne": {
                            "val": "66.271"
                        },
                        "BudgetYearOneBase": {
                            "val": "66.271"
                        },
                        "BudgetYearTwo": {
                            "val": "57.887"
                        },
                        "BudgetYearThree": {
                            "val": "49.359"
                        },
                        "BudgetYearFour": {
                            "val": "47.04"
                        },
                        "BudgetYearFive": {
                            "val": "47.968"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "359.305"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds the restoration and modernization of United States Army Kwajalein Atoll degraded infrastructure (real property\/facilities) to working condition and upgrades facilities to meet current standards. Restoration consists of repair and replacement work to fix facilities degraded due to the effects of aging and inadequate sustainment funding for a number of years. Modernization supports upgrade of facilities to meet current codes, accommodate new functions, and\/or replace building components that exceed the overall service life of the facilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Recapitalization Deficit R&M"
                                    },
                                    "Description": {
                                        "val": "Provides facility restoration for facilities not specifically aligned to specified Facility Investment Strategy focus areas. Funds facilities quality improvement required to achieve elimination of Q4\/Q3 Installation Status Report (ISR) rated facilities. In addition to major renovation costs, facility costs include project tails in accordance with AR 420-1 for: National Environmental Policy Act (NEPA) compliance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.793"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide for additional updates and\/or replacement of infrastructure critical to the mission and well being of the island tenants. Will continue to restore facilities currently at risk to the health and safety of the civilians, military, and families stationed on the island due to inadequate sustainment in past years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "66.987"
                                            },
                                            "Text": {
                                                "val": "Provide year one of the Headquarters, Department of the Army (HQDA) approved 15-Year Investment Plan. FY18 resource increase supported Bucholz Airfield repavement project; a 3-year phased project supporting both Airfields on Kwajalein and Roi Namur. This project will remove and reconstruct failed pavement and replace with new asphalt concrete and portland cement concrete to restore the airfield to condition requirements of Army Regulation 420-72 and the structural requirements of current and projected mission traffic. Supporting facilities include airfield lighting, pavement marking, radio beacon and shelter, two backup generators, and site preparation work."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "66.271"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "66.271"
                                            },
                                            "Text": {
                                                "val": "Continue to provide (2nd year) resources against the HQDA-approved 15 year investment plan and focuses on Phase II of the Bucholz Army Airfield runway. Efforts will include repairing 1000 feet on both ends of the runway down to subgrade, resurface center section of runway, repair aged and deteriorating airfield pavements to include airfield lighting and back up generator."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Change accommodates varying annual workloads and associated costs."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DX2"
                    },
                    "ProjectTitle": {
                        "val": "Army Kwajalein Test Ranges and Mission Support"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "64.512"
                        },
                        "CurrentYear": {
                            "val": "10.891"
                        },
                        "BudgetYearOne": {
                            "val": "10.676"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.676"
                        },
                        "BudgetYearTwo": {
                            "val": "10.903"
                        },
                        "BudgetYearThree": {
                            "val": "11.552"
                        },
                        "BudgetYearFour": {
                            "val": "11.732"
                        },
                        "BudgetYearFive": {
                            "val": "11.888"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "132.154"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Beginning in FY 2018, funds for Operations and Mission Support functions at Ronald Reagan Ballistic Missile Defense Test Site are realigned from Project DX2 to PE 0606002A (Ronald Reagan Ballistic Missile Defense Test Site) \/ Project XW9 (Reagan Test Site)."
                        },
                        "ProjectMissionDescription": {
                            "val": "Beginning in FY 2018, this Project funds Network Enterprise Technology Command (NETCOM) installation management-related Command, Control, Communications, Computers, and Information Management (C4IM) services at Army Kwajalein Test Ranges. Funds for operational and mission support functions at Ronald Reagan Ballistic Missile Defense Test Site are realigned to PE 0606002A (Ronald Reagan Ballistic Missile Defense Test Site) \/ Project XW9 (Reagan Test Site). \n\nNETCOM utilizes this Project to provide civilian pay, manpower service contracts, supporting Information technology (IT) equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management at Army Kwajalein Test Ranges. Project provides C4IM services in accordance with the Department of Army Pamphlet (DA PAM) PAM 25-1-1 and the Army C4IM Services List. Provides Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Includes the delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provides infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provides Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provides Application and Web-hosting including operation and management services required to support web and application hosting. Provides Desktop Management Support including management and support for end-user hardware and software services and tools. Includes Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay (RTS)"
                                    },
                                    "Description": {
                                        "val": "Funding covers civilians to perform management oversight of Army and DoD Missile Test programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.318"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide government personnel support (salaries, training, and travel, and Government Purchase Card (GPC) requirements) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Temporary Duty (TDY)\/Training\/Supplies - Military and Civilian"
                                    },
                                    "Description": {
                                        "val": "Funding will provide for travel and training for civilians and military to assist in the testing of the Army and DoD Missile system Programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide government personnel support (training, and travel, GPC) to enable the management of the test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outside Obligations\/Other Government Agencies"
                                    },
                                    "Description": {
                                        "val": "Funding provided to other Government Agencies for reimbursable-type work efforts"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.592"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support to test and evaluation of major Army and DoD missile systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fiber Optic Cable provides lease cost for Fiber Optic Cable between Kwajalein and Guam"
                                    },
                                    "Description": {
                                        "val": "Fiber Optic Cable is Provides lease cost for Fiber Optic Cable between Kwajalein and Guam."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.599"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide funding for lease of the KCS fiber optic cable between Kwajalein Island and Guam, and for backup satellite."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RTS Contractor Prime Pay (KRS)"
                                    },
                                    "Description": {
                                        "val": "Provide funding for Prime contractor to perform technical Operation and Maintenance support to support test and space missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.983"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide technical O&M support (test planning, instrumentation operations and maintenance, systems engineering, flight safety, and launch ordnance) to assure the capability of the Range to support test and space missions."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Material"
                                    },
                                    "Description": {
                                        "val": "Provide for materials to maintain range capabilities and support test operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.685"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide critical non-labor materials to maintain critical range capabilities and prevent obsolescence in support of test operations."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Federally Funded Research and Development Centers (FFRDC) Contractor Pay (MIT\/LL)"
                                    },
                                    "Description": {
                                        "val": "Provide for technical expertise to RTS leadership for the overall performance of Range Operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.775"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide technical advice to RTS leadership in support of Range operations, strategic planning, and technical execution of critical technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Contractor Pay Meteorological"
                                    },
                                    "Description": {
                                        "val": "Provide capability for weather sensing capability which allows for test planning and execution of the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.895"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide support for sustained weather sensing capabilities, including weather reporting via radar data.  This capability provides critical data to test planning and execution."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Transportation"
                                    },
                                    "Description": {
                                        "val": "Provide transportation of material and passenger between Kwajalein and CONUS."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.446"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide mission specific material and passenger transportation via air (Air Mobility Command) and sea (SDDC) between Kwajalein Atoll and CONUS."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mission Specific Environmental"
                                    },
                                    "Description": {
                                        "val": "Ensures Range Readiness and all regulatory environmental requirements are compliant with range and test requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.591"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide the capability to assess and maintain the Range readiness and compliance with environmental requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Enterprise Technology Command (NETCOM) C4IM"
                                    },
                                    "Description": {
                                        "val": "Provides Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.38"
                                            },
                                            "Text": {
                                                "val": "NETCOM - The Network Enterprise Technology Command (NETCOM) will fund Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management.  Will provide Command, Control, Communications, Computers, and Information Management (C4IM) services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List.  Will provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700).  Will include delivery of services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services.  Will provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Will  provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information.  Will provide Application and Web-hosting including operation and management services required to support web and application hosting.  Will provide Desktop Management Support including management and support for end-user hardware and software services and tools.  To include Service Desk Support, Continuity of Operations, and Disaster Recovery support. Justification:  Each of the baseline services to be provided with this funding are priority zero, must fund, IT utility requirements.  Not funding or reducing the programmed funding will directly impact communications and mission command at all levels on Kwajalein Atoll."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.891"
                                            },
                                            "Text": {
                                                "val": "Provide Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management. Provide Command, C4IM services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List. Provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Delivery services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provide Application and Web-hosting including operation and management services required to support web and application hosting. Provide Desktop Management Support including management and support for end-user hardware and software services and tools, to include Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.676"
                                            },
                                            "Text": {
                                                "val": "Provide Department of Army civilian pay, manpower service contracts, supporting IT equipment, and associated costs specifically identified and measurable to plan, manage, coordinate, and execute Information Technology Services Management. Provide Command, C4IM services in accordance with the DA PAM 25-1-1 and the Army C4IM Services List. Provide Base Communications Support (Service 701), Visual Information (Service 702), Information Assurance (Service 703), and Automation (Service 700). Delivery services consisting of secure and non-secure fixed voice communications, wireless voice, data and video connectivity services, and studio video conferencing services. Provide infrastructure support, including the design, installation, and maintenance of special circuits\/systems in support of life safety\/security systems and monitoring\/control systems. Provide Collaboration and Messaging Services including services and tools for workforce to communicate and share information. Provide Application and Web-hosting including operation and management services required to support web and application hosting. Provide Desktop Management Support including management and support for end-user hardware and software services and tools, to include Service Desk Support, Continuity of Operations, and Disaster Recovery support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Inflation rate adjustment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Contracting Command (ACC) Support"
                                    },
                                    "Description": {
                                        "val": "Contracting support to administer contract vehicle for NETCOM responsibilities at Army Kwajalein Test Ranges."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.382"
                                            },
                                            "Text": {
                                                "val": "Will provide contracting support (salaries, training, travel, etc) to test and evaluation of major Army and DoD Missile System."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}