{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-26",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603781D8Z"
        },
        "ProgramElementTitle": {
            "val": "Software Engineering Institute (SEI)"
        },
        "R1LineNumber": {
            "val": "60"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.726"
            },
            "CurrentYear": {
                "val": "15.047"
            },
            "BudgetYearOne": {
                "val": "15.050"
            },
            "BudgetYearOneBase": {
                "val": "15.050"
            },
            "BudgetYearTwo": {
                "val": "15.154"
            },
            "BudgetYearThree": {
                "val": "15.285"
            },
            "BudgetYearFour": {
                "val": "15.449"
            },
            "BudgetYearFive": {
                "val": "15.741"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "Software is more pervasive than ever, and computer programs are growing in size and complexity.  Designing, managing, and securing integrated, complex, and large-scale mission-critical systems are abilities that the DoD and the Defense Industrial Base (DIB) have not yet mastered.  Reliance on software-intensive mobile and net-based products and systems has increased (e.g., Joint Tactical Radio System, USS ZUMWALT (DDG-1000), Joint Strike Fighter, F-22, and Army Modernization).  As stated in the January 2017 Defense Science Board Report, “Defense Research Enterprise Assessment,” software, autonomy, and cyber are today’s core challenges.  With growing global parity in software engineering, the DoD must maintain leadership to ensure a competitive advantage.  \n\nThe Software Engineering Institute (SEI) Federally Funded Research and Development Center (FFRDC) was established in 1984 as an integral part of the DoD’s initiative to identify, evaluate, and transition software engineering technologies and practices.  The mission of the SEI is to provide the DoD with technical leadership and innovation through research and development to advance the practice of software engineering and technology.  The SEI works across government, industry, and academia to improve the state of software engineering from the technical, acquisition, and management perspectives.  The SEI engages in research and development of critical software technologies and tools and collaborates with the larger software engineering research community.  It facilitates rapid transition of software engineering technologies into practice and evaluates emerging software engineering technologies to determine their potential for improving software-intensive DoD systems.  Since its inception, the SEI has helped to transform the fields of software engineering and acquisition, network security, real-time systems, software architectures, and software-engineering process management. \n\nThe SEI Program Element (PE) addresses the critical need to research, develop, and rapidly transition state-of-the-art software technology, tools, development environments, and best practices to improve the engineering, management, fielding, evolution, acquisition, and sustainment of software-intensive DoD systems.  The research conducted by this PE directly benefits the technical domains such as Command, Control, Communications, Computers, and Intelligence (C4I), Autonomy, Cyber, and Engineered Resilient Systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.264"
                },
                "CurrentYear": {
                    "val": "15.047"
                },
                "BudgetYearOne": {
                    "val": "15.156"
                },
                "BudgetYearOneBase": {
                    "val": "15.156"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.726"
                },
                "CurrentYear": {
                    "val": "15.047"
                },
                "BudgetYearOne": {
                    "val": "15.050"
                },
                "BudgetYearOneBase": {
                    "val": "15.050"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.538"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.106"
                },
                "BudgetYearOneBase": {
                    "val": "-0.106"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.520"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.016"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.002"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.005"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.005"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.101"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.101"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "781"
                    },
                    "ProjectTitle": {
                        "val": "Software Engineering Institute (SEI)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.726"
                        },
                        "CurrentYear": {
                            "val": "15.047"
                        },
                        "BudgetYearOne": {
                            "val": "14.050"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.050"
                        },
                        "BudgetYearTwo": {
                            "val": "14.154"
                        },
                        "BudgetYearThree": {
                            "val": "14.285"
                        },
                        "BudgetYearFour": {
                            "val": "14.449"
                        },
                        "BudgetYearFive": {
                            "val": "14.741"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This program has two main research thrusts with known military applications: 1) Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance) and 2) Information Assurance.\n\nSEI research focuses on the most significant and pervasive software challenges within the DoD, such as the scalability and reliability of software assurance, supply chain risk management, validation of and trust in autonomous systems, human-computer and human-technology teaming and interaction, computing and communication at the tactical edge, and efficiency and performance of acquisition strategies and software development appropriate for a contested cyber environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute Advanced Technology Development in the Area of Software Engineering, Systems Verification and Validation, and Mission Assurance (formerly Mission Assurance)"
                                    },
                                    "Description": {
                                        "val": "This research seeks to mature and rapidly prototype techniques to verify methods for identifying requirements, systems of systems architectures, and virtual integration of components.  Furthermore, research in this area will pursue rapid prototyping and transitioning of capabilities that verify requirements for software assurance, analysis\/control of unverified code and automated repair of damaged code. Software production and code analysis methods developed through this program will also improve the ability to predict how complex software systems will behave in untested environments.  Increasingly, large numbers of lines of code will require a commensurate increase in sophisticated verification and validation mechanisms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.104"
                                            },
                                            "Text": {
                                                "val": "• Develop automatic tools and techniques to generate intelligible explanations of software-driven autonomous\/robotic behaviors that will help to establish trust with human operators in critical situations. \n• Develop and demonstrate principles, tools, and techniques to improve efficiency of and accuracy in software-based cloud infrastructures. \n• Develop techniques and algorithms to efficiently balance workloads between the human operator and the software’s machine-learning-based capabilities.\n• Develop and pilot a game theory approach to optimize acquisition behaviors."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.802"
                                            },
                                            "Text": {
                                                "val": "• Integrate technologies from verification, human prediction, and human-robot understanding to enhance military-grade, scalable, and secure autonomous systems. \n• Reduce risk for DoD systems by integrating commercial off-the-shelf (COTS) technology, legacy, and custom software into current software architecture common control systems.\n• Enhance decision making by developing new algorithms and technologies that relate multiple patterns from all source data to provide quantified courses of action in tactical timeframes.\n• Facilitate better sustainment decisions for managing software-intensive systems.\n• Research, develop, and pilot quantitative software acquisition decision support tools, focused on cost-effectiveness, for DoD acquisition teams."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.750"
                                            },
                                            "Text": {
                                                "val": "• Mature, deploy, and test tools that provide runtime assurance (RA) for automated complex and safety–critical mission systems.\n• Develop and test assurance frameworks and methodologies for Internet of Thing (IoT) devices, control nodes, and other intermediaries in DoD mission systems.\n• Develop and prototype full software cost models using causal learning algorithms of DoD software cost.\n• Develop, test, and prototype automated video summarization and detection against research and military datasets. The prototypes will use unsupervised machine learning (ML) approaches that incorporate minimal, opportunistic analyst feedback."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in budget from FY 2018 to FY 2019 reflects additional resources required for prototype development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Software Engineering Institute Advanced Technology Development in the Area of Information Assurance"
                                    },
                                    "Description": {
                                        "val": "Powerful machine learning algorithms can be subverted by malicious manipulation or falsification of data collected through normal channels.  Algorithms must be trusted and effective in the presence of adversaries.  This thrust seeks to defend against and minimize the impacts of information falsification attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.622"
                                            },
                                            "Text": {
                                                "val": "• Create tools and techniques for automated assurance in mission-critical systems. Collect and analyze defect data to identify potential security issues early and to achieve cost reductions. \n• Perform vulnerability analysis to identify vulnerabilities in industrial control systems (ICS) and locate network cross-connections allowing cyber-attackers to move laterally through network domains from less protected non-critical systems to operationally critical systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.245"
                                            },
                                            "Text": {
                                                "val": "• Mature tools and techniques for model-based engineering of software-reliant systems and generating assurance evidence.  These tools and techniques will include support for automatic generation of secure code, automated code vulnerability discovery, and synthesis of assurance cases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.300"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.300"
                                            },
                                            "Text": {
                                                "val": "• Develop and test augmented and virtual reality technologies for cyber mission application, training, and workforce development.\n• Develop and prototype dynamic, self-modification enabling software to increase the resiliency in machine learning systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in budget from FY 2018 to FY 2019 reflects the release of resources going from development phases into test phases."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "BA 2, PE # 0602751D8Z, P278"
                                    },
                                    "Title": {
                                        "val": "Software Engineering Institute Applied Research"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "8.105"
                                        },
                                        "CurrentYear": {
                                            "val": "8.955"
                                        },
                                        "BudgetYearOne": {
                                            "val": "9.362"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "9.362"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.680"
                                        },
                                        "BudgetYearThree": {
                                            "val": "9.764"
                                        },
                                        "BudgetYearFour": {
                                            "val": "9.868"
                                        },
                                        "BudgetYearFive": {
                                            "val": "9.927"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "• Transition of tools and practices for use in DoD programs of record to the DIB, and to a number of agencies and organizations sponsoring work.\n• Number of publications in refereed journals and peer reviewed reports.\n• Number of external research collaborations and interactions with the broader software engineering research community.\n• Adoption of coding standards and process techniques by standards bodies, working groups, and software\/systems engineering organizations"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "816"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.000"
                        },
                        "BudgetYearThree": {
                            "val": "1.000"
                        },
                        "BudgetYearFour": {
                            "val": "1.000"
                        },
                        "BudgetYearFive": {
                            "val": "1.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "SEI research focuses on the most significant and pervasive cybersecurity challenges within the DoD, such as the scalability and reliability of software assurance, supply chain risk management, validation of and trust in autonomous systems, human-computer and human-technology teaming and interaction, computing and communication at the tactical edge, and efficiency and performance of acquisition strategies and software development appropriate for a contested cyber environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security"
                                    },
                                    "Description": {
                                        "val": "This thrust seeks to increase the security of network-centric autonomous systems. These systems are currently developed with a focus on function rather than security, which makes them particularly vulnerable to cyber-attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, this program will develop technologies and techniques for integrating automated code self-repair into existing systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no notable change in the Cyber investment between FY 2018 and FY 2019.  Note the Cyber effort was funded in Project P781 in FY 2018."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "• Transition of tools and practices for use in DoD programs of record to the DIB, and to a number of agencies and organizations sponsoring work.\n• Number of publications in refereed journals and peer reviewed reports.\n• Number of external research collaborations and interactions with the broader software engineering research community.\n• Adoption of coding standards and process techniques by standards bodies, working groups, and software\/systems engineering organizations"
                        }
                    }
                }
            ]
        }
    }
}