{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-20",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602783A"
        },
        "ProgramElementTitle": {
            "val": "Computer and Software Technology"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "13.452"
            },
            "CurrentYear": {
                "val": "14.041"
            },
            "BudgetYearOne": {
                "val": "14.958"
            },
            "BudgetYearOneBase": {
                "val": "14.958"
            },
            "BudgetYearTwo": {
                "val": "15.235"
            },
            "BudgetYearThree": {
                "val": "15.521"
            },
            "BudgetYearFour": {
                "val": "15.822"
            },
            "BudgetYearFive": {
                "val": "16.138"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "105.167"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) develops and characterizes information and communications processing software that automates the delivery of information used in planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures, software, and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, and computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in the mobile, dispersed, highly networked environment envisioned for the future force.\n\nWork in this PE is fully coordinated with PE 0603008A (Command, Control, Communications Advanced Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603008A (Command, Control, Communications Advanced Technology), and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThis PE supports Army Science and Technology efforts in the Command, Control, Communications, and Intelligence portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research Development and Engineering Command (RDECOM)"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "13.811"
                },
                "CurrentYear": {
                    "val": "14.041"
                },
                "BudgetYearOne": {
                    "val": "10.074"
                },
                "BudgetYearOneBase": {
                    "val": "10.074"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "13.452"
                },
                "CurrentYear": {
                    "val": "14.041"
                },
                "BudgetYearOne": {
                    "val": "14.958"
                },
                "BudgetYearOneBase": {
                    "val": "14.958"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.359"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "4.884"
                },
                "BudgetYearOneBase": {
                    "val": "4.884"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.354"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.884"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.884"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In FY 2019, this effort was increased from realigned funds to support the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army to support artificial intelligence."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "Y10"
                    },
                    "ProjectTitle": {
                        "val": "Computer\/Info Sci Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.452"
                        },
                        "CurrentYear": {
                            "val": "14.041"
                        },
                        "BudgetYearOne": {
                            "val": "14.958"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.958"
                        },
                        "BudgetYearTwo": {
                            "val": "15.235"
                        },
                        "BudgetYearThree": {
                            "val": "15.521"
                        },
                        "BudgetYearFour": {
                            "val": "15.822"
                        },
                        "BudgetYearFive": {
                            "val": "16.138"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "105.167"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops and characterizes information and communications processing software to automate the delivery of information for planning, rehearsal, and execution by ground commanders. Efforts develop communication\/network architectures, software, and the information fusion software necessary to simplify the understanding and interactions from humans to humans, humans to computers, and computers to humans.  Research enables enhanced understanding of many information sources and accelerates the decision cycle time for commanders and leaders operating in the mobile, dispersed, highly networked environment envisioned for the future force.\n\nWork in this Project is fully coordinated with Program Element (PE) 0603008A (Command, Control, Communications Advanced Technology), PE 0603772A (Advanced Tactical Computer Science and Sensor Technology), PE 0603008A (Command, Control, Communications Advanced Technology), and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThis Project supports Army Science and Technology efforts in the Command, Control, Communications, and Intelligence portfolio.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Media Information Processing and Exploration"
                                    },
                                    "Description": {
                                        "val": "This effort develops and characterizes fusion software to improve the completeness and timeliness of decision-making for Mission Command.  The goal of this effort is to develop software applicable to the Distributed Common Ground Station ? Army (DCGS-A) architecture (an integrated architecture of all ground\/surface systems) and for next generation analytic capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.762"
                                            },
                                            "Text": {
                                                "val": "Will investigate extension of social media analysis techniques to predict adversarial behaviors; and address the issues of incorporating prediction tools into a tactical local cloud computing cluster and the potential to execute these prediction tools within a tactical environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.888"
                                            },
                                            "Text": {
                                                "val": "Design and develop methods to extract information from multi-source data, predict adversarial intent, and provide indications and warnings of adversarial action for use in intelligence analysis and tactical operations; investigate collective-intelligence techniques to enhance Soldier understanding of political, military, economic and social conditions in tactical environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.906"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.906"
                                            },
                                            "Text": {
                                                "val": "Will investigate theoretically grounded approaches for uncertainty quantification and propagation in multi-scale, multi-source data and models; will develop methods for computational learning and reasoning that operate on shorter time scales and\/or where there may be few or no guarantees of convergence and are amenable to adaptive learning and optimization; and will develop self-organizing, self-managing, self-adapting, self-maintaining, self-protecting properties in heterogeneous complex-systems that facilitate interoperability, just-in-time human interactions, and the implementation of local-adaptation functionality in self-organizing, complex human and agent systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase to support evaluation of multi-scale, multi-source data and models"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security & Information Assurance"
                                    },
                                    "Description": {
                                        "val": "This effort designs and characterizes software for the protection of information and networks in wireless tactical environments. The goal is to develop software algorithms that detect and defeat malicious activities of adversaries in bandwidth-constrained tactical networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.873"
                                            },
                                            "Text": {
                                                "val": "Will design and characterize techniques of active cyber defense effects to disrupt adversarial command and control of heterogeneous networks while maintaining communication with key cyber terrain assets (i.e., elements of the domain that enable mission essential warfighting functions); explore and validate novel big data analytical approaches to identify and manage risks posed by emerging vulnerabilities; and develop proof-of-concept detection capabilities to identify malicious or anomalous events in a complex, interconnected information environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.05"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop network-based trust models and metrics for the control and evolution of network behavior to enable more secure tactical networks and prevent adversarial disruption; explore and implement techniques for providing covert authentication of wireless communications links at the physical layer. Explore the capacity of Extremely Lightweight Intrusion Detection system-constructed weight vectors with respect to the number of signatures they can contain. Create intelligent agents that reflect actual behaviors and model them on a test-bed for human-in-the-loop experimentation, and create methods to disrupt and degrade the effectiveness of adversaries operating within a computer network."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.925"
                                            },
                                            "Text": {
                                                "val": "Will explore and implement network and physical layer based approaches for evolving network behavior to improve network resilience in the presence of adversarial disruption based on mission and information requirements; will investigate methods for machine learning (ML) with incomplete information and ambiguous guidance and applications to detect and thwart adversarial ML; will investigate generation after next applications for intrusion detection and active defense; investigate applications in threat intelligence as well as attribution of malicious code; will investigate identification of malicious activity via network sessions attributes; and will investigate techniques to secure cyber physical systems that do not have integrated security built-in."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased investments in cyber security to improve network resilience"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Context-Based Information Exchange"
                                    },
                                    "Description": {
                                        "val": "This effort investigates techniques that integrate local and external information sources, and it applies text and video analytic approaches to support automated intelligence analysis and decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Text": {
                                                "val": "Will develop quantitative models of trust and quality; explore approaches to applying user context (e.g. mission, cognitive state, trust, and quality) in networked military and social information delivery; and develop text and video analytics from research in PE 0601104A Project H50 (Network Sciences Collaborative Technology Alliance) and Project J15 (Network and Information Sciences International Technology Alliance) along with new internal ARL research and explore its effect on intelligence products."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.334"
                                            },
                                            "Text": {
                                                "val": "Extend user context models to incorporate continuous learning to improve performance and fit of models of individual solders over time; based on context models, investigate algorithms to foresee mission-related information requirements prior to manual requests in anticipation of soldier situational awareness gaps; develop algorithms to generate computable descriptions of location imagery captured by battlefield visual sensors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.342"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.342"
                                            },
                                            "Text": {
                                                "val": "Will develop approaches for adversarial learning that is resilient to continuous learning threats and maximizes Soldier and agent situational awareness; will develop methods and models for complex event processing, with compact representations, efficient pattern evaluation, and mission-centric focus to accelerate reasoning and decision making; and will conduct experiments to determine methods that support diverse, nonlinear, and emergent system behaviors or tractable optimization strategies in non-stationary systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase to support development of approaches for adversarial learning"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Lingual Computing"
                                    },
                                    "Description": {
                                        "val": "This effort develops and assesses computational multilingual algorithms and software frameworks to enable commanders and troops to bridge language barriers in order to counter adversaries and collaborate with allies. In Fiscal Year (FY) 2019, funds from this effort are realigned to support the Army science and technology (S&T) Modernization priorities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.576"
                                            },
                                            "Text": {
                                                "val": "Will explore the use of linguistic analysis to refine the automated interpretation of cultural concepts within multi-lingual information sources; and develop and assess techniques for rapid linguistic analysis and translation of documents written in low-density languages that lack a large body of relevant previously translated texts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.597"
                                            },
                                            "Text": {
                                                "val": "Develop semi-supervised analysis and deep learning methods for automated information extraction from multilingual sources; develop generalized methods for the automatic processing of document images containing multilingual handwritten and printed text; and assess human-in-the-loop methods for leveraging semantic representations of domain data to achieve high quality translations to and from low-resource languages."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was zeroed to support development of machine learning with constrained resources."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Theories and Models"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs theory based software models to characterize and validate emerging network protocols and structures.  The goal of this effort is to develop software algorithms that maintain effective communications in networks in spite of disruptive effects such as task reorganization, mobility of friendly forces, and adversarial attacks on friendly networks. In FY 2019, funds from this effort are realigned to support the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army (shifted to Machine Learning with Constrained Resources)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.345"
                                            },
                                            "Text": {
                                                "val": "Will implement techniques for adapting communications components at the physical, media access control (MAC), and networking layers to enable robust wireless communications; develop tools for content and software based networking that enable discovery of, access to, and processing of information sources in highly dynamic and contested environments; and explore and create methodologies and approaches to increase the validity of network science experimentation results across contexts, at the appropriate network scale, and with the appropriate fidelity."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.453"
                                            },
                                            "Text": {
                                                "val": "Develop techniques for the distributed management & control of cognitive radio networks; implement the adaptive algorithms for robust and efficient tactical communications using cognitive and dynamic spectrum access techniques investigated and created in PE 0601102A Project H48 \/ Battlespace Info & Comm Rsc; and explore and implement models for influencing the evolution of communication networks in spite of mobility and adversarial attacks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was zeroed to support development of machine learning with constrained resources"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Heterogeneous Computing and Computational Sciences"
                                    },
                                    "Description": {
                                        "val": "This effort researches and develops software algorithms to allow information processing across different computing hardware platforms. The goal of this research is to provide high performance computing (HPC) \/ processing capabilities to the Soldier on the battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.68"
                                            },
                                            "Text": {
                                                "val": "Will implement auto-tuning approach to balance performance models on next generation hybrid cores where low-level instruction scheduling is a problem; validate mathematical algorithm to address placement of mobile HPC in dynamic battlefield along with other HPC systems; investigate methods for mitigating bandwidth allocation issues by utilizing emerging memory hierarchies and storage; and create algorithms to quantify resiliency for tactical HPC systems and associated programming models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.719"
                                            },
                                            "Text": {
                                                "val": "Design algorithm development and programming methodologies to fully utilize domain-specific processor\/processing architectures (custom-engineered for size, weight and power based on task); implement middleware that enables reuse of existing code to take advantage of next generation processing capabilities; and determine scalability toward exascale (billion, billion calculations per second) capability of low-power next generation processing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.726"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.726"
                                            },
                                            "Text": {
                                                "val": "Will investigate computational capabilities and new enabling applications for domain-specific, coupled, and heterogeneous architectures; will advance computing capabilities amid fundamental limitations in exponential growth of Moore?s law via algorithmic innovations; and will develop methods to address planning, reasoning, and uncertainty at the tactical edge enhanced with heterogeneous computing resources."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase to address planning, reasoning, and uncertainty at the tactical edge enhanced with heterogeneous computing resources."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Machine Learning with Constrained Resources"
                                    },
                                    "Description": {
                                        "val": "This effort will research new machine learning data sets and reinforcement learning methods to address issues of statistically mismatched and incomplete information which must be annotated, collected, classified and used for rapid decisions by autonomous intelligent agent (IA) and joint IA-Human teams. In addition, multi-modal communication approaches will be investigated to ensure effective communications and understanding of intent. The goal of this research is enable joint human-intelligent agent decision making, optimizing the strengths of each in the decision process and creating an adaptive, agile team. This work applies research conducted in 61102\/H48\/16. In FY19, this effort was developed from realigned funds in support of the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.059"
                                            },
                                            "Text": {
                                                "val": "Will develop methods for system-self-awareness of space, time and power characteristics and their relation to requirements of active\/pending system missions, with additional ability to degrade or self-destruct gracefully; will design approaches that balance the trade-off between accuracy of computation required to answer queries of users, security concerns and mission criticality\/relevance; will investigate the use of reinforcement learning to develop resilient behaviors and learn effective strategies for accomplishing Soldier relevant mission tasks in complex environments; and will develop approaches that learn from human input develop a scalable technique for performing machine learning online, in complex Army environments, and at operational tempo."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort begins in FY19"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}