{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-10",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603125A"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism - Technology Development"
        },
        "R1LineNumber": {
            "val": "40"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "33.553"
            },
            "CurrentYear": {
                "val": "26.903"
            },
            "BudgetYearOne": {
                "val": "3.762"
            },
            "BudgetYearOneBase": {
                "val": "3.762"
            },
            "BudgetYearTwo": {
                "val": "2.741"
            },
            "BudgetYearThree": {
                "val": "2.796"
            },
            "BudgetYearFour": {
                "val": "2.856"
            },
            "BudgetYearFive": {
                "val": "2.913"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "75.524"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include: hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States (U.S.) Department of Energy to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations and red teaming activities to stress and assess emerging technologies earlier in the systems development life-cycle, thus reducing potential vulnerabilities and providing an improved understanding of employment risks against potential threats.\n\nWork in this PE is complementary to and is fully coordinated with PE 0602618A\/Project H80 (Ballistics Technology\/Survivability and Lethality Technology),  PE 0602601A (Combat Vehicle and Automotive Technology), and 0603005A (Combat Vehicle and Automotive Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.686"
                },
                "CurrentYear": {
                    "val": "26.903"
                },
                "BudgetYearOne": {
                    "val": "21.268"
                },
                "BudgetYearOneBase": {
                    "val": "21.268"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "33.553"
                },
                "CurrentYear": {
                    "val": "26.903"
                },
                "BudgetYearOne": {
                    "val": "3.762"
                },
                "BudgetYearOneBase": {
                    "val": "3.762"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "5.867"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-17.506"
                },
                "BudgetYearOneBase": {
                    "val": "-17.506"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "8"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-1.068"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.052"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-17.506"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-17.506"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.013"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increase in project DW4 Energy Technologies.  FY19 decreases to project DF5 reflect changes to support Army Modernization Priorities resulting in conclusion of Red Teaming efforts in FY18 and reductions to the Ground Vehicle Power and Energy effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "DF5"
                    },
                    "ProjectTitle": {
                        "val": "Agile Integration & Demonstration"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "25.553"
                        },
                        "CurrentYear": {
                            "val": "26.903"
                        },
                        "BudgetYearOne": {
                            "val": "3.762"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.762"
                        },
                        "BudgetYearTwo": {
                            "val": "2.741"
                        },
                        "BudgetYearThree": {
                            "val": "2.796"
                        },
                        "BudgetYearFour": {
                            "val": "2.856"
                        },
                        "BudgetYearFive": {
                            "val": "2.913"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "67.524"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "In FY19, the investment under Project DF5 is realigned in support of the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project demonstrates and evaluates emerging technologies and systems with high payoff potential to address current technology shortfalls or future capability gaps. Efforts include hybrid electric power technologies to reduce use of fossil fuel in tactical generators; collaboration with the United States (U.S.) Department of Energy (DOE) to demonstrate technologies that provide significant gains in ground vehicle energy efficiency; demonstration of ground platform power management, generation, and distribution technologies that increase energy efficiencies and support the integration of advanced future capabilities; and field demonstrations and red teaming activities to stress and assess emerging technologies earlier in the systems development life-cycle, thus reducing potential vulnerabilities and providing an improved understanding of employment risks against potential threats.\n\nWork in this Project is complementary to and is fully coordinated with Program Element (PE) 0602618A\/Project H80 (Ballistics Technology\/Survivability and Lethality Technology), PE 0602601A (Combat Vehicle and Automotive Technology), and PE 0603005A (Combat Vehicle and Automotive Advanced Technology),.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Platform Subsystem Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort contributes to the Army's ground platform risk reduction efforts which seek to address technical and integration challenges in the areas of mobility, survivability, vehicle architecture, and systems integration. Specifically, this effort focuses on maturing and demonstrating integrated vehicle power management, generation and distribution technologies to increase ground vehicle energy efficiencies and ensure ground platforms have enough power to enable future capabilities such as electromagnetic armor, active protection systems, improvised explosive device (IED) detect and defeat technologies, advanced situational awareness and future network integration technologies. This effort is coordinated with PE 0603005A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.508"
                                            },
                                            "Text": {
                                                "val": "Will model and develop a powertrain controls architecture and algorithm to improve powertrain efficiencies and minimize parasitic losses. Will mature and demonstrate the feasibility of realizing a high voltage power electronics architecture to save Size, Weight, and Power (SWaP) and enhance interoperability among system of systems architecture. Will optimize thermal properties of power components leveraging the Vehicle Electronics & Architecture (VEA) Mobile Demonstrator (VMD) effort in coordination with PE 0603005A. Will continue to optimize the performance specification requirements for the next generation power architecture as it applies to combat vehicles and future tactical vehicle modernization efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Mature the VEA Mobile Demonstrator (VMD) technology by optimizing subsystem performance during hardware integration onto vehicle platform, and begin demonstrations of VMD capabilities to validate system performance against future power and data requirements. Mature and validate powertrain controls architecture and algorithm to improve powertrain efficiencies and minimize parasitic losses through component modeling and simulation. Mature and validate integrated starter generator, advanced thermal management system, and advanced modular lithium ion battery technologies to improve subsystem fuel efficiency and increase electrical power generation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.073"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.073"
                                            },
                                            "Text": {
                                                "val": "Will complete optimization of VEA Mobile Demonstrator (VMD) performance during hardware integration onto vehicle platform, and will validate system performance against future power and data requirements. Will complete validation of powertrain controls architecture and algorithms, improving powertrain efficiencies and minimizing parasitic losses. Will complete validation of integrated starter generator, advanced thermal management system, and advanced modular lithium ion battery technologies to improve subsystem fuel efficiency and increase electrical power generation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to higher Army Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Power and Energy"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced technologies that enable military ground vehicles to become significantly more energy efficient. It collaborates with the DOE to demonstrate technologies in: advanced combustion engines and transmissions; lightweight structures and materials; energy recovery and thermal management; alternative fuels and lubricants; hybrid propulsion systems; batteries and energy storage; and analytical tools (e.g., modeling and simulation). This effort is coordinated with PE 0602601A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.747"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Will provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Will mature, and demonstrate friction and wear reduction technologies to increase powertrain and vehicle efficiencies. Will provide tire efficiency optimization to improve vehicle fuel efficiency. Will exploit autonomy-enabled technologies and vehicle electrification to leverage dual use technology maturation.Will continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Will provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Will mature, and demonstrate friction and wear reduction technologies to increase powertrain and vehicle efficiencies. Will provide tire efficiency optimization to improve vehicle fuel efficiency. Will exploit autonomy-enabled technologies and vehicle electrification to leverage dual use technology maturation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.34"
                                            },
                                            "Text": {
                                                "val": "Continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Continue to provide the capability to model and simulate advanced chemistry batteries and batteries in extreme temperature conditions to improve characterizing battery life cycle estimations. Improve tire modeling and simulation capabilities based on dynamic property data from advanced tire testing. Improve corrosion prevention capabilities through results from investigation of corrosion mechanisms and effects on dissimilar material joints which identified materials and processes to inhibit corrosion."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.689"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.689"
                                            },
                                            "Text": {
                                                "val": "Will continue to support the AVPTA with the DOE to mature and demonstrate technologies within the alliance technology focus areas. Will develop methodology and software for optimal sizing of fuel cells and battery packs for military vehicles. Will develop advanced electrolytes to increase Lithium Metal Battery energy density, performance and life. Will develop and test Thermal Barrier Coatings to reduce heat loss\/improve fuel economy of combustion engines. Will develop and evaluate next-generation, light-weight materials, manufacturing and related processes. Will support the AVPTA project portfolio via \"Extended Enterprise\" efforts such as Improving the Fuel Efficiency of the Current Ground Tactical Fleet; JP-8 Fuel Cell Power; and other activities that will enhance Operational Energy efficiency and reduce energy consumption."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding realigned to higher Army Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Field Demonstration"
                                    },
                                    "Description": {
                                        "val": "This effort conducts field demonstrations to stress emerging technologies in realistic environments and scenarios, using warfighters and adaptive adversaries. Field demonstration activities seek to place emerging technologies in the hands of Warfighters early in the development cycle to leverage their feedback and to uncover potential vulnerabilities in future systems, allowing identification of design fixes and improvements while mitigations are less expensive. Red Teaming Field Demonstration activities are coordinated with PE 0602618."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.041"
                                            },
                                            "Text": {
                                                "val": "Will conduct a series of live\/virtual\/hybrid, multi-day, operationally relevant field demonstrations shaped by threat-informed challenges and areas of overmatch concern (e.g., unmanned aerial systems, jamming environments); stress the performance limits of selected emerging systems integrated into increasingly complex scenarios and provide feedback to developers through structured Red, Blue, and White Cell assessments that provide options to reduce or mitigate vulnerabilities; potential technical areas of interest include human performance, advanced weapons, autonomous systems, and electronic warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.282"
                                            },
                                            "Text": {
                                                "val": "Conduct a series of live field demonstrations where warfighters utilize technologies and systems in operationally relevant scenarios to address a set of priority, threat-informed challenges and areas of overmatch concern. Technical areas of interest include interoperability, internet of things, autonomous systems, and electronic warfare. Demonstrations are structured to stress the technologies\/systems and uncover vulnerabilities through their employment in complex mission scenarios with friendly and opposing forces, including emulated threat probes for electronic warfare vulnerabilities. Provide feedback to developers through structured assessments to facilitate reduction or mitigation of vulnerabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort concludes in FY18 due to a change in the priority of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Systems Intensive Analysis"
                                    },
                                    "Description": {
                                        "val": "This effort conducts in-depth analysis (from concepts to employment to interoperability) of selected high priority emerging technology sub-systems and systems with planned transitions to future programs of record. The intent is assess technologies using virtual and laboratory experiments across a broad range of potential threat vectors, environments, and use cases to identify and mitigate any identified vulnerabilities as early as possible..  These venues allow for detailed analysis in areas that would be too dangerous or too expensive to assess during a live, field demonstration."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.91"
                                            },
                                            "Text": {
                                                "val": "Will conduct intensive analysis for several key emerging systems and concepts based on intelligence, requirements, acquisition, and science and technology community stakeholder input for individual, intensive assessment and feedback to uncover vulnerabilities and potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments; potential technical areas of interest include human performance, advanced weapons, autonomous systems, and electronic warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.369"
                                            },
                                            "Text": {
                                                "val": "Conduct the first phase of intensive analysis for key emerging systems and concepts identified from intelligence, requirements, acquisition, and science and technology community stakeholder strategy events; and continue to the next phase of ongoing intensive analysis for select key emerging systems and\/or concepts to uncover vulnerabilities and potential risks pertaining to systems integration, interoperability, adaptability, user technology acceptance, and performance in contested environments. Potential technical areas of interest will include operations in subterranean and urban interior environments, indicators of military activity through social media, unmanned medivac and resupply, and electronic warfare."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort concludes in FY18 due to a change in the priority of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Red Teaming Vulnerability Exercises"
                                    },
                                    "Description": {
                                        "val": "This effort conducts tabletop exercises for in-depth assessments of emerging threats and technologies to anticipate future challenges in contested and congested environments, inform threat concepts, adapt system development practices, and maintain overmatch capability.  Outputs of these exercises influence technologies and scenarios chosen for Systems Analysis and Field Demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.347"
                                            },
                                            "Text": {
                                                "val": "Will explore alternatives in plans, concepts, operations, and organizations in the context of the operational environment and from the perspective of partners and adversaries; expand hierarchical task analysis methodologies, virtual discovery experiment approach, and implement identified adaptability metrics into structured assessments; tailor or extend assessment frameworks to capture data for analysis and feedback, and provide means to mitigate findings with the goal of informing current or future acquisition programs early in the development lifecycle; potential technical areas of interest include human performance, advanced weapons, autonomous systems, and electronic warfare."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.912"
                                            },
                                            "Text": {
                                                "val": "Design and conduct a series of virtual scenario-based exercises, rooted in stakeholder input on emerging threats and areas of overmatch concern, with participants from government, academia, and industry who represent red (threat), blue (US forces), and green (influence base, neutrals) perspectives in order to expose assumptions, characterize needed capabilities, and identify current and future critical vulnerabilities.  Exercises cover broader time and space conditions than are possible in live field experiments. Implement team challenge experiments to identify potential vulnerabilities and risks for developing concepts or systems; and, based on previous year evaluations, modify analysis methodologies, structured assessments, and frameworks to improve data captured for analysis and feedback, with the goal of providing insight and data to enable risk mitigation, informing current or future acquisition programs early in the development lifecycle. Potential technical areas of interest will include force protection, interoperability, internet of things, autonomous systems, and electronic warfare."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort concludes in FY18 due to a change in the priority of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Teaming Technology Assessment"
                                    },
                                    "Description": {
                                        "val": "This effort provides an assessment of technology components and enablers required to establish a manned-unmanned teaming capability for enhanced combat power in complex and contested environments. The assessment will consider Soldiers, unmanned ground vehicles, unmanned air vehicles, command and control, communications, and lethality technologies."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Identify components, technologies and enablers required to establish a manned unmanned teaming capability to provide enhanced combat power in complex and contested environments.  Determine component priority by assessing unmanned capabilities in support of realistic mission scenarios.  Primary components of the assessment include: Soldiers, unmanned ground vehicles, unmanned air vehicles, command and control, communications and lethality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort concludes in FY18; planned progression of effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "DW4"
                    },
                    "ProjectTitle": {
                        "val": "Energy Technologies (Congressional Adds (CAs))"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project contains Congressional add funding."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Force Protection Radar Development"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}