{
    "id": "2019-AirForce-PB-3600-MJBOOK-2-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-8",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0606018F"
        },
        "ProgramElementTitle": {
            "val": "NC3 Integration"
        },
        "R1LineNumber": {
            "val": "171"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "12.636"
            },
            "BudgetYearOne": {
                "val": "26.112"
            },
            "BudgetYearOneBase": {
                "val": "26.112"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "25.917"
            },
            "BudgetYearThree": {
                "val": "26.404"
            },
            "BudgetYearFour": {
                "val": "26.973"
            },
            "BudgetYearFive": {
                "val": "27.464"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "12.636"
                },
                "BudgetYearOne": {
                    "val": "19.308"
                },
                "BudgetYearOneBase": {
                    "val": "19.308"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "12.636"
                },
                "BudgetYearOne": {
                    "val": "26.112"
                },
                "BudgetYearOneBase": {
                    "val": "26.112"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "6.804"
                },
                "BudgetYearOneBase": {
                    "val": "6.804"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "6.804"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.804"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 PB Funding increase to meet NC3 Integration requirements (+$6.804M)"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "674877"
                    },
                    "ProjectTitle": {
                        "val": "NC3 Integration, Assessment, and Improvement"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "12.636"
                        },
                        "BudgetYearOne": {
                            "val": "26.112"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.112"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "25.917"
                        },
                        "BudgetYearThree": {
                            "val": "26.404"
                        },
                        "BudgetYearFour": {
                            "val": "26.973"
                        },
                        "BudgetYearFive": {
                            "val": "27.464"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "In FY 2018, Program 0303131F, Minimum Essential Emergency Communications Network (MEECN), Project 672832 MEECN System Improvements (MSI) efforts were transferred to Program 0606018F, Nuclear Command, Control, and Communications (NC3) Integration, Project 674877, NC3 Integration, Assessment, and Improvement in order to provide greater transparency."
                        },
                        "ProjectMissionDescription": {
                            "val": "Nuclear Deterrence Operations (NDO) is an Air Force Core Function. Within this core function, Nuclear Command and Control (NC2) is the exercise of authority and direction by the President, as Commander in Chief, through established command lines, over nuclear weapon operations of military forces. The President's authority and direction are exercised through the Nuclear Command and Control System (NCCS). The NCCS is the designated combination of flexible and enduring elements including facilities, equipment, communications, procedures, personnel, and the structure in which these elements are integrated, all of which are essential for planning, directing, and controlling nuclear weapon operations. These functions are accomplished through the NC3 system of systems.\n\nThe NC3 system of systems provides connectivity from the President or Secretary of Defense through the National Military Command System (NMCS) to nuclear execution forces worldwide. To enhance NC3 mission success, the AF formalized AF NC3 elements as a specified AF Weapon System (WS), AN\/USQ-225.  Activities funded in this Program integrate legacy systems, ongoing NC3 programs, and future capabilities for the overall AF NC3 WS.  \n\nThe AF Nuclear Weapon Center NC3 Integration Directorate (AFNWC\/NC) will ensure current, new, and future NC3 capabilities are fully integrated as part of the Air Force's overall effort to sustain, modernize, and recapitalize the nuclear enterprise.  AFNWC\/NC will be responsible for integrating NC3 materiel management across Air Force Materiel Command (AFMC) to include authority and responsibility for weapon system architecture, weapon system configuration management, weapon system state-of-health reporting, risk management, supply chain management, overall integration, system test, verification, and certification.  AFNWC\/NC is responsible for defining, building, and sustaining current and future NC3 WS system of systems configuration baselines, and marshaling necessary Supporting Centers in AFMC and other units\/agencies in the Air Force and the Department of Defense (DoD) to support and\/or accomplish these tasks.  AFNWC\/NC will collaborate with AFMC Supporting Centers to champion the full spectrum of doctrine, organization, training, materiel, leadership and education, personnel, facilities, and policy (DOTMLPF-P) efforts, in support of Air Force Global Strike Command as the Lead Command championing NDO requirements for all Combatant Commands. \n\nThis program funds activities for integrating AF NC3 WS materiel, authority, and responsibility for the AF NC3 WS architecture, configuration management, weapon system state-of-health reporting, supply chain management, and overall AF NC3 WS integration, system test, verification, and certification.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver nuclear weapon support capabilities.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, 0605898F, and 0605833F.\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal years."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "NC3 Integration, Assessment, and Improvement"
                                    },
                                    "Description": {
                                        "val": "To include but not limited to:  Modeling and simulation of the NC3 WS current and future capabilities, conducting capability gap analysis, and establishing NC3 capability recapitalization and modernization plans.  Developing and conducting the NC3 WS test and certification program as well as expanding existing High Frequency (HF) testbed utilizing a phased approach.  Conducting NC3 system component verification.  Implementing and employing program and material management controls for the NC3 WS including configuration management, risk management, supply chain management, maintenance data reporting capabilities and NC3 WS health monitoring solutions, issue tracking and resolution, assessments and analysis, and governance.  Providing data-driven system of system solutions, and shaping NC3 component program acquisition strategies for AF NC3 sustainment and performance capability improvements.  Initiating and implementing new capability programs\/systems and changes to existing programs to align with NC3 WS requirements, test and certification, and future capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Funded in PE 0303131F:\n- Continue planning and initiate integration, analysis, and testing activities for NC3 WS\n- Continue assessment of NC3 WS\n- Develop AF NC3 WS test plans"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.636"
                                            },
                                            "Text": {
                                                "val": "NC3 weapon system integration efforts including, but not limited to:\n- Continue to implement test and evaluation certification program for NC3 WS and expand existing HF testbed utilizing a phased approach\n- Continue to perform NC3 physics, communication and networking analysis\n- Continue to develop and evolve technical framework of the NC3 WS to meet mission threats of 2030 and beyond\n- Continue to conduct WS analysis, develop WS capability model, plan WS updates, and implement WS updates\n- Continue to evaluate options for pacing system-of-system performance improvements within constraints of WS\n- Continue to analyze, model, and prototype emerging NC3 technologies\n- Continue to develop and implement NC3 WS program and materiel management control processes including risk management, configuration control, integrated scheduling, budgeting and cost controls, etc.  \n- Continue to conduct NC3 WS health assessments, reporting, and issue resolution\n- Continue to map out the NC3 WS supply chain and develop supply chain monitoring capability, supply chain supportability and supply chain risk management\n- Continue to develop layered architecture to measure and report capability impacts\n- Continue to develop and coordinate Operational Performance Capability Document (OPCD) to support weapon system configuration element specs, test and evaluation, and assessment of weapon capabilities and limitations"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26.112"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26.112"
                                            },
                                            "Text": {
                                                "val": "NC3 weapon system integration efforts including, but not limited to:\n- Continue to implement test and evaluation certification program for NC3 WS\n- Expand existing communication spectrum and cyber assessment test bed utilizing a phased approach\n- Continue to perform NC3 physics, communication and networking analysis\n- Continue to develop and evolve technical framework of the NC3 WS to meet mission threats of 2030 and beyond\n- Continue to conduct WS analysis, develop WS capability model, plan WS updates, and implement WS updates\n- Continue to evaluate options for system-of-system performance improvements within constraints of NC3 WS strategic vision and roadmap\n- Continue to analyze, model, and prototype emerging NC3 technologies\n- Continue to develop and implement NC3 WS program and materiel management control processes including risk management, configuration management, supply chain management, maintenance data reporting and NC3 WS health assessment application, integrated scheduling, budgeting and cost controls, etc.  \n- Continue to conduct NC3 WS health assessments, reporting, and issue resolution\n- Continue to map out the NC3 WS supply chain and develop supply chain monitoring capability, supply chain supportability and supply chain risk management\n- Continue to develop layered architecture to measure and report capability impacts\n- Continue to develop and coordinate OPCD to support weapon system configuration element specs, test and evaluation, and assessment of weapon capabilities and limitations\n- Establish authoritative intelligence community analysis for high-altitude electromagnetic pulse (HEMP)\n- Improve integration and interoperability of the NC3 WS"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase to ramp up activities after stand up of Directorate."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The NC3 Integration acquisition strategy applies WS acquisition lifecycle principles across the system of systems AF NC3 WS. Key elements include configuration management, supply chain management, maintenance data risk management, integration, test, verification, and certification, as well as modeling, simulation, gap analysis, and architecture development for capabilities in sustainment, development, and for future capabilities. To conduct these essential activities a combination of competitively awarded contracts, as well as sole source contracts, will be used to augment AF organic capabilities with technical skill sets from Federally Funded Research and Development Centers (FFRDCs), University Affiliated Research Centers (UARCs), and industry Advisory and Assistance Services (A&AS) providers."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "DMS FFRDC\/UARC\/A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "23.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "23.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Integration Studies \/Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.036"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA (Eng\/Acq Spt\/Travel\/Supplies)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.612"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.612"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "NC3 WS Integration"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NC3 WS Test and Certification Program"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "NC3 Health Assessment and Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Enhance Target Architecture through Development of NC3 Technologies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Implement NC3 WS Program and Materiel Management Control Process"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Generate NC3 Mission - Space Resiliency"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}