{
    "id": "2019-Army-PB-2040-JBOOK-3be08eef265cbf3fa6ee9f25bc102fc8e7dd36b72efeeb78b5538ece49603c5b-15",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605031A"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Network (JTN)"
        },
        "R1LineNumber": {
            "val": "124"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "16.430"
            },
            "CurrentYear": {
                "val": "44.15"
            },
            "BudgetYearOne": {
                "val": "41.972"
            },
            "BudgetYearOneBase": {
                "val": "41.972"
            },
            "BudgetYearTwo": {
                "val": "29.954"
            },
            "BudgetYearThree": {
                "val": "26.754"
            },
            "BudgetYearFour": {
                "val": "28.449"
            },
            "BudgetYearFive": {
                "val": "26.813"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "214.522"
            }
        },
        "ProgramElementNote": {
            "val": "In FY 2013, Joint Tactical Networks (JTN) was funded in the Navy Program Element (PE) 0604280N (Joint Tactical Radio System (JTRS)), Project No.3076 (formally known as JTRS Network Enterprise Domain (JNED)). JNED was renamed JTN and the Joint Executive Program Office (JPEO) JTRS transitioned to the JTNC in FY 2013, in accordance with the Acquisition Decision Memorandum (ADM) dated 11 July 2012. FY 2013 and FY 2014 JTNC funding was provided by the JTN Program via PE 0604280N and PE 0605030A, respectively.\n\nAs per the JTNC ADM dated 20 January 2014, JTN and JTNC became separate entities and PE 0605031A (Project Code EF5) was created for JTN.  The 2014 ADM also directed that the waveform development and sustainment responsibilities transition to the Services in 4QFY15.  PdM Waveforms transitioned to PM TR; PdM Joint Enterprise Network Manager (JENM) transitioned to PEO C3T PM Warfighter Information Network-Tactical (WIN-T) PdM Tactical Cyber and Network Operations (TCNO); and Mobile User Objective System (MUOS) and Link16 transitioned to the Navy.  For FY 2015 and out, the Army PE 0605031 contains only the JTN (Waveforms & JENM) RDT&E funding.  \n\nAs part of the joint program budget strategy for JENM, each Military Department (MILDEP) budgets for approximately one-third of the total program RDT&E funds for joint efforts.  Joint funding is held at the Navy PE 0605030N and Air Force PE 0605030F.  Prior to the year of execution, the funding is consolidated in the Army PE (0605031A) for execution."
        },
        "ProgramElementMissionDescription": {
            "val": "Joint Tactical Networks (JTN) efforts are executed by PdM Waveforms and JENM . They are responsible for the portable, interoperable, mobile ad hoc networking waveforms and network enterprise services to enhance tactical warfighting capabilities. PdM Waveforms and JENM applications are: (1) Interoperable - among all Services, capable of operating in a variety of hardware items, for both Program of Record and commercial Non-Developmental Item (NDI) radios; (2) Secure - meet all DoD and US Government information assurance requirements; (3) Operationally relevant - quickly and effectively meet evolving network mission requirements of Combatant Commanders and the Services; (4) Affordable - drive down procurement and support costs via a robust, competitive Non-Developmental Item (NDI) market which adheres to open government standards.\n\nIn accordance with the Joint Tactical Networking Center (JTNC) Acquisition Decision Memorandum (ADM) and Charter dated 20 January, 2014, the JTN active efforts include Waveforms and JENM. Due to PdM Waveforms extensive knowledge and expertise, PdM Waveforms will continue to enhance, update, and sustain the following Legacy Waveforms on a reimbursable basis: the High Frequency (HF) waveform, the merged HAVE QUICK II (HQII) and Very High Frequency (VHF)\/Ultra High Frequency (UHF) Line of Sight (VULOS) waveforms, the Joint Tactical Radio System (JTRS) Bowman waveform (JBW), the Single Channel Ground and Airborne Radio System (SINCGARS) waveform and the UHF Satellite Communications (SATCOM) waveform.\n\nEF5 project: The Joint Enterprise Network Manager (JENM) software provides the ability to plan, monitor, configure and control the Army's Software Defined Radio (SDR) communication networks. JENM configures numerous SDR radios such as the Manpack and Rifleman, enabling them to utilize the Mobile Ad Hoc Networking (MANET) waveforms such as the Soldier Radio Waveform (SRW), Wideband Networking Waveform (WNW), Mobile User Objective System (MUOS), Satellite Communications (SATCOM) Demand Assigned Multiple Access (DAMA), Integrated Waveform (IW), and Single Channel Ground and Airborne Radio System (SINCGARS) waveforms. Furthermore, JENM provides the Commander the ability to quickly reconfigure critical networks using its' Over the Air Management (OTAM) functionality. JENM enhances the S6's ability to conduct Course of Action (COA) Analysis and the Military Decision Making Process (MDMP) providing commanders critical information regarding their ability to effectively communicate.\n\nEX6 project: Beginning in FY 2018, based on the results of the FY 2017 Army Network Analysis, the EX6 project will refocus efforts to improve waveforms for lower and mid-tier networks.  The effort will focus on development to achieve improved performance, network simplification, improved spectrum efficiency and improved Electronic Warfare (EW)\/Cyber resistance.  The planned waveforms may include changes to a mid-tier waveform, SRW 2.0\/Narrow Band, and SINCGARS upgrades.  This new capability must be completed by FY20 -21 to support future tactical radio procurements.  \n\nFY 2019 Base RDTE dollars in the amount of $41.972 million supports the continued development of the Waveforms and JENM, testing support and the program management office."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.014"
                },
                "CurrentYear": {
                    "val": "44.15"
                },
                "BudgetYearOne": {
                    "val": "41.175"
                },
                "BudgetYearOneBase": {
                    "val": "41.175"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.43"
                },
                "CurrentYear": {
                    "val": "44.15"
                },
                "BudgetYearOne": {
                    "val": "41.972"
                },
                "BudgetYearOneBase": {
                    "val": "41.972"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.416"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0.797"
                },
                "BudgetYearOneBase": {
                    "val": "0.797"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "1.008"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.592"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments 1 - Waveforms"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "2.362"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.362"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments 2 - JENM"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.565"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.565"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "$.592 million of FY 2017 reduction for SBIR \/ STTR Transfer. \n$2.362 million of  FY 2019 RDTE funds were identified to support SRW Narrowband Transition and integration efforts.  This funding will provide support for the Narrowband capability to be transitioned from CERDEC to PdM Waveforms and integrated into the current waveform portfolio.\n(-$2.435) million of  FY 2019 RDTE funds were reduced for JENM development IAW tactical radio requirement updates.\n\nIn accordance with the signed JTNC ADM and Charter dated 20 January 2014, Program Element (PE) 0605031A was established to execute JTN requirements in PB2015. FY 2015 was the first year funds were aligned to that PE. The Army has aligned their Service share of JENM and Waveform funding fully within the JTN PE for PB 2016. The Navy and Air Force funding for the JENM joint requirements remains in Navy PE 0605030N (shared) and Air Force PE 0605030F (shared). As part of the joint program budget strategy, each Military Department (MILDEP) budgets for approximately one-third of the total program RDT&E funds for joint efforts. Prior to the year of execution, the funding is consolidated in the Army PE for execution."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EF5"
                    },
                    "ProjectTitle": {
                        "val": "Joint Tactical Network  (JTN)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.676"
                        },
                        "CurrentYear": {
                            "val": "14.21"
                        },
                        "BudgetYearOne": {
                            "val": "11.156"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.156"
                        },
                        "BudgetYearTwo": {
                            "val": "4.466"
                        },
                        "BudgetYearThree": {
                            "val": "3.558"
                        },
                        "BudgetYearFour": {
                            "val": "3.324"
                        },
                        "BudgetYearFive": {
                            "val": "5.565"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "51.955"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "For FY 2018 and out, the continuing JTN efforts are funded in Army PE 0605031A (JTN), Navy PE 0605031N (shared), Air Force PE 0605031F (shared) and USMC (Marine Corps Communications Systems - MCPC: 112107).  As part of the JENM joint program budget strategy, the Air Force and Army budget for approximately one-third each of the total program funds for JENM efforts.  The Navy and USMC funding combined equal the other third of the JENM program funding.  Prior to the year of execution, Navy and Air Force funding is consolidated in the Army PE (0605031A) and software sustainment funds are realigned from RDT&E to O&M,A PE (4326750A) to support the joint program acquisition strategy.  USMC funding will be provided on an annual basis via Military Interdepartmental Purchase Request (MIPR).  USMC funding projections are as follows: FY18 - $1.407M; FY19 - $1.118M; FY20 - $1.121M; FY21 - $1.139M and FY22 - $1.392M."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Joint Enterprise Network Manager (JENM) software provides the ability to plan, monitor, configure and control the Army's Software Defined Radio (SDR) communication networks. JENM configures numerous SDR radios such as the Manpack and Rifleman, enabling them to utilize the Mobile Ad Hoc Networking (MANET) waveforms such as the Soldier Radio Waveform (SRW), Wideband Networking Waveform (WNW), Mobile User Objective System (MUOS), Satellite Communications (SATCOM) Demand Assigned Multiple Access (DAMA), Integrated Waveform (IW), and Single Channel Ground and Airborne Radio System (SINCGARS) waveforms. Furthermore, JENM provides the Commander the ability to quickly reconfigure critical networks using its' Over the Air Management (OTAM) functionality. JENM enhances the S6's ability to conduct Course of Action (COA) Analysis and the Military Decision Making Process (MDMP) providing commanders critical information regarding their ability to effectively communicate.\n\nIn accordance with the JTNC ADM and Charter dated 20 January 2014, the JTN active efforts include the SRW, the WNW and the JENM.\n\nFY 2019 Base RDTE dollars supports the continued development of the JENM software, testing support, and the program management office."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JENM Program Office Support"
                                    },
                                    "Description": {
                                        "val": "Program Management Office support in the development of the JENM system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.551"
                                            },
                                            "Text": {
                                                "val": "Funding will provide for JENM program office support to develop the JENM system as well as Dynamic Network Connectivity, a STARNET objective."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.534"
                                            },
                                            "Text": {
                                                "val": "Program Office funding will support JENM design, engineering, integration and test of mid and lower tier planning and management application for the Software Defined Radio (SDR) network.  To align with the emerging Integrated Network Operations (INO) vision, JENM will lower and mid-tier Network Management with that of WIN-T to enable Soldiers the ability to manage the entire, consolidated, tactical network.  JENM will also work to extend our Over-The-Air-Management (OTAM) capabilities to the mounted environment through our participation with Dynamic Network Connectivity development.  Program Office Support funding will also support US Navy Digital Modular Radio (DMR) enhancements, ARC 210\/231 development, USMC and USAF 117G MUOS deployment, full-rate production HMS Radios, AMF airborne radio, and the integration of USMC terrestrial based waveform planning and management capability.JENM will also manage the completion of deferred program requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.596"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.596"
                                            },
                                            "Text": {
                                                "val": "Program Office funding will support JENM design, engineering, integration and test of mid and lower tier planning and management application for the Software Defined Radio (SDR) network.  To align with the Unified Network Operations (UNO) vision, JENM will lower and mid-tier Network Management with that of PM TN to enable Soldiers the ability to manage the entire, consolidated, tactical network.  JENM will also work to extend our Over-The-Air-Management (OTAM) capabilities to the mounted\/ tablet based environment through our participation with Dynamic Network Connectivity development.  Program Office Support funding will also support completion of MUOS support for US Navy Digital Modular Radio (DMR) enhancements, ARC 210\/231, USMC and USAF 117G MUOS, as well as full threshold requirement support for HMS Manpack and Leader Radios. Begin development in support of the AMF airborne radio, and the integration of USMC terrestrial based waveform planning and management capability. JENM will also manage the completion of deferred Army program requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Office Support costs slightly up in FY19 to support completion of deferred requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JENM Development"
                                    },
                                    "Description": {
                                        "val": "JENM provides consolidated communications planning, network configuration, network activation, position reporting, fault management, security management, and network health and status reporting needed to establish and maintain a mobile wireless network comprised of JTN network waveforms. JENM can interface with other external network managers, mission planning systems, network planning systems, key management systems, and spectrum planning systems. JENM is considered a mission essential system. JENM is also considered a critical element within the J-TNT configuration management tool kit."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.125"
                                            },
                                            "Text": {
                                                "val": "JENM will develop software products for Capability Set Fielding Team and support systems engineering for Navy Digital Modular Radio (DMR) for the MUOS system to include the Airborne Radio Communication (ARC) 210, and the Army\/Navy Portable Radio Communications (PRC) 117G. JENM will initiate development of Dynamic Network Connectivity as part of the STARNET objective.\nJENM continues to provide software support to PdM HMS for Manpack and Rifleman Radio's full and open competition."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.946"
                                            },
                                            "Text": {
                                                "val": "JENM will support systems design, engineering, and integration of mid and lower tier radio planning and management application for the SDR network. JENM will provide support to the Unit Task Reorganization (UTR) systems integration effort to enable the S-6 to quickly transform the tactical network based upon the Commander?s intent and associated mission analysis.  JENM will support US Navy Digital Modular Radio (DMR) enhancements, ARC 210\/231 development, full-rate production HMS Radios, Aviation Small Tactical Terminal (STT), and Small Airborne Networking Radio (SANR) and the integration of USMC terrestrial based waveform planning and management capability.  JENM will continue to support modifications to the SRW, WNW, SINCGARS, SATCOM, and Integrated Waveforms.  JENM will also incorporate enhanced over the air management (OTAM) capabilities for U.S. Army mid and lower tier waveforms along with continued integration of JENM capability within the WIN-T Network Management System (NMS) including automating critical interface for planning and configuring crypto solutions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.984"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.984"
                                            },
                                            "Text": {
                                                "val": "JENM will support systems design, engineering, and integration of mid and lower tier radio planning and management application for the SDR network. JENM will provide support to the Unit Task Reorganization (UTR) systems integration effort to enable the S-6 to quickly transform the tactical network based upon the Commander?s intent and associated mission analysis.  JENM will also work to extend our Over-The-Air-Management (OTAM) capabilities to the mounted\/ tablet based environment through our participation with Dynamic Network Connectivity development.  JENM will support completion of MUOS support for US Navy Digital Modular Radio (DMR) enhancements, ARC 210\/231, USMC and USAF 117G MUOS, as well as full threshold requirement support for HMS Manpack and Leader Radios. Begin development in support of the AMF airborne radio, and the integration of USMC terrestrial based waveform planning and management capability. JENM will continue to support modifications to the SRW, WNW, MUOS, SINCGARS, SATCOM, and Integrated Waveforms.  JENM will also manage the completion of deferred program requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 development costs decreased due to development level of effort tasks consistent with tactical radio requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Test and Evaluation of JENM"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.73"
                                            },
                                            "Text": {
                                                "val": "JENM will provide direct support to the FY18 Developmental and Operational Test (DT\/OT) of the PdM HMS Full and Open Competition (FOC) for the next generation HMS Manpack radio. JENM will execute a Functional Qualification Test (FQT) \/ Developmental Test (DT) and applicable cyber security testing leading into the planned Network Integration Exercise (NIE) 18.2 event, of which JENM will also undergo an Operational Test (OT) assessment to ensure it continues to meet the needs of today?s Soldiers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.576"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.576"
                                            },
                                            "Text": {
                                                "val": "JENM will provide direct support to the FY19 Developmental and Operational Test (DT\/OT) of the PdM HMS Leader radio. JENM will undergo an Operational Test (OT) assessment to ensure it continues to meet the needs of today?s Soldiers. JENM will also support the planned MUOS OT in FY19."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Schedule updates for the Rifleman\/Leader radio test requirements have resulted in decreased JENM test requirements for FY19"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "0605031N"
                                    },
                                    "Title": {
                                        "val": "0605031N; JTN, RDTE,N"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "2.8"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2.617"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2.617"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2.677"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2.705"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.747"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "0605031F"
                                    },
                                    "Title": {
                                        "val": "0605031F; JTNC, RDTE,F"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.427"
                                        },
                                        "CurrentYear": {
                                            "val": "4.691"
                                        },
                                        "BudgetYearOne": {
                                            "val": "3.735"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "3.735"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "3.798"
                                        },
                                        "BudgetYearThree": {
                                            "val": "3.844"
                                        },
                                        "BudgetYearFour": {
                                            "val": "3.91"
                                        },
                                        "BudgetYearFive": {
                                            "val": "3.979"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "PE 0605031A contains only the JTN (PdM Waveforms and PdM TCNO (JENM)) RDTE funding.\n\nIn accordance with the Acquisition Decision Memorandum (ADM) dated 11 July 2012, the Joint Tactical Radio System (JTRS) Program of Records (PORs) transitioned to Military Department (MILDEP) managed programs. As per the ADM dated 20 January 2014, JTN and JTNC became separate entities. FY 2015 and out, Army PE 0605031 contains only the JTN RDT&E funding.  For FY2018 and out, the continuing JTN efforts are funded in Army PE 0605031A (JTN), Navy PE 0605031N (shared), Air Force PE 0605031F (shared) and USMC (Marine Corps Communications Systems - MCPC: 112107).  As part of the joint program budget strategy, the Air Force and Army budget for approximately one-third each of the total program funds for JENM efforts.  The Navy and USMC funding combined equal the other third of the JENM program funding.  Prior to the year of execution, Navy and Air Force funding is consolidated in the Army PE (0605031A) and software sustainment funds are realigned from RDT&E to O&M,A PE (4326750A) to support the joint program acquisition strategy.  USMC funding will be provided on an annual basis via Military Interdepartmental Purchase Request (MIPR).  USMC funding projections are as follows: FY18 - $1.407M; FY19 - $1.118M; FY20 - $1.121M; FY21 - $1.139M and FY22 - $1.392M.\nIn FY 2017 and out Waveform funding is on the Army PE 0605031A, Project Code EX6.  JENM funding is under Army PE 0605031A Project Code EF5."
                        },
                        "AcquisitionStrategy": {
                            "val": "Joint Tactical Network Center (JTNC) Acquisition Decision Memorandum (ADM) (July 2012) (JENM Supporting Role). Per the December 2014 Joint Tactical Network (JTN) Select Acquisition Report (SAR), JTN was 90% expended and changed to inactive. Defense Acquisition Management Information Retrieval (DAMIR) reflected the inactive status on 3 June 2015 JTN APB (13 October 2015) (JENM Supporting Role)."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JENM Program Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2 Software Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.809"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.636"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.65"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.65"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.095"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM Program Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Pending Contract Award"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.348"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.348"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "USAASC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.116"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PACIFIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.238"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.898"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.946"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.946"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.082"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.673"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.673"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.673"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2 Software Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.683"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.683"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.683"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JENM NMRIL Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2 Software Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.992"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.992"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM NMRIL Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Pending Contract Award"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.875"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.875"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM NMRIL Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PACIFIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.741"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.946"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.984"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.984"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post Formal Qualification Testing-JENM"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Boeing"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Huntington Beach, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.139"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.139"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.991"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post Formal Qualification Testing-WNW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "General Dynamics"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Scottsdale, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.757"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.757"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.976"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post Formal Qualification Testing-SRW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Harris"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rochester, NY"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.554"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.554"
                                                    },
                                                    "TargetValue": {
                                                        "val": "2.554"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Communications Architecture (SCA) Compliance"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NSA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Meade, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.953"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.953"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.953"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post FQT\/Software Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PAC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.478"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.478"
                                                    },
                                                    "TargetValue": {
                                                        "val": "7.604"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post FQT\/Software Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.611"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.611"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.611"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post FQT\/Software Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC LANT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "5.229"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.229"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.229"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post Formal Qualification Testing-MUOS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Sunnyvale, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.66"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.660"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.660"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Post Formal Qualification Testing-Link 16"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "BAE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Wayne, NJ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.332"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.332"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.332"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JENM v3 Software Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2 Software Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.35"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.350"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM v3 Software Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Pending Contract Award"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.537"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM v3 Software Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PACIFIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.582"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Development\/Engineering\/Technical Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.855"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.343"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.198"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.985"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "JENM v3 System Engineering and Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC PACIFIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.104"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.193"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.013"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.013"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JENM v3 System Engineering and Test"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NM RIL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.641"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.537"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.563"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.563"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.741"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JTN Test and Evaluation Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.862"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.862"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.406"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JTN Test and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "FFRDC"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.661"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.661"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.205"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "JTN Test and Evaluation Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "G2 Software Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.648"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.648"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.192"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_EF5.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "FY2018 JENM Software Development and Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JENM FQT FY18"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY2020 JENM Software Development and Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JENM FQT FY20"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "FY2022 JENM Software Development and Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "JENM FQT FY22"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "EX6"
                    },
                    "ProjectTitle": {
                        "val": "Waveforms"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.754"
                        },
                        "CurrentYear": {
                            "val": "29.94"
                        },
                        "BudgetYearOne": {
                            "val": "30.816"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.816"
                        },
                        "BudgetYearTwo": {
                            "val": "25.488"
                        },
                        "BudgetYearThree": {
                            "val": "23.196"
                        },
                        "BudgetYearFour": {
                            "val": "25.125"
                        },
                        "BudgetYearFive": {
                            "val": "21.248"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "162.567"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "PdM Waveforms delivers, maintains, and upgrades portable, interoperable, mobile ad hoc networking waveforms and network enterprise services to enhance tactical warfighting capabilities. PdM Waveforms provides the Lower Tactical Internet with a suite of waveforms and network services that are: (1) Interoperable - used by all Services; (2) Capable of operating on a variety of hardware platforms, both Program of Record and non-developmental commercial radios; (3) Secure - meet all Department of Defense and US Government information assurance requirements; (4) Operationally relevant - quickly and effectively meet evolving network mission requirements of Combatant Commanders and the Services; and (5) Affordable - drive down procurement and support costs via a robust, competitive market which adheres to open government standards.  \n\nPdM Waveforms will remain agile to accommodate emerging warfighter needs by refocusing effort strategies to address the following:\n\n  - Engage industry to assess options for Low Probability of Interception\/Low Probability of Detection (LPI\/LPD) waveforms to reduce the signature of the tactical network\n  - Pursue alternative waveforms to reduce the complexity of MANET waveforms\n  - Improve spectral efficiency\n  - Seek Electronic Counter-Counter Measure (ECCM) improvements for operations in contested environment\n  - Implement improvements that allow the tactical radios to be operated in a radio silence mode.\n\nFY 2019 Base RDTE dollars in the amount of $30.816 million supports the continued development of the waveforms, testing support, and the program management office."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management Office Support"
                                    },
                                    "Description": {
                                        "val": "Provides Program Management Office (PMO) support for Waveforms enhancements.\n\nAs a result of the Waveforms strategy moving forward, Waveforms will not be participating in the RMD process and will not utilize O&M funding aside from Core labor costs. \n\nFor FY18, PMO costs include Core, Matrix, and SETA Contract labor.  For FY19, PMO costs include Matrix and SETA Contract Labor only, as Core labor will be paid out of O&M funds."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.793"
                                            },
                                            "Text": {
                                                "val": "Continues the program management support for PdM Waveforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.772"
                                            },
                                            "Text": {
                                                "val": "Continue program management support for PdM Waveforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.383"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.383"
                                            },
                                            "Text": {
                                                "val": "Continue program management support for PdM Waveforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding Decrease -  staff reduction due to reorganization"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wideband Networking Waveform (WNW) Development"
                                    },
                                    "Description": {
                                        "val": "WNW is a high data rate Mobile Adhoc Networking (MANET) waveform application that provides the Army?s mid-tier tactical Internet backbone (transit network) and connects tactical forces during Unified Land Operations, particularly in Denied, Degraded, Disrupted, Space Operational Environment (D3SOE). WNW provides high throughput, dynamically adaptable connectivity for the secure exchange of IP based voice, data, and video traffic. WNW has two signals-in-space (SiS), whichare the Orthogonal Frequency Division Multiplexing (OFDM) and Anti-Jam (AJ), each with multiple bandwidths. WNW supports network nodes on mobile, airborne, and maritime platforms. WNW includes Type 1 Encryption, networking services, High Assurance IP Equipment (HAIPE) capabilities, red\/black switching, and internal routing of other WNW signals. WNW is currently ported on 7 radio platforms with 5 different vendors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.422"
                                            },
                                            "Text": {
                                                "val": "Continue to develop, evolve and enhance SRW to provide improved performance. Maintain test facility to conduct SRW test and evaluation. Release of v2.0 will provide Enhanced Electronic Protection (EEP), network performance and scalability improvements, and address SRW Narrowband requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Radio Waveform (SRW)"
                                    },
                                    "Description": {
                                        "val": "Soldier Radio Waveform (SRW) will operate on tactical radio sets to provide a networked battlefield communications capability for users engaged in land combat operations and will support voice, data, and video communications on the immediate battlefield. These forces include vehicles, rotary wing aircraft, dismounted Soldiers, and unmanned aerial vehicles (UAV).  Functional software applications will use SRW radio enabled sets over Internet Protocol (IP) capable networks and sub-networks. SRW will be interoperable with higher throughput, IP based network waveforms, such as Wideband Networking Waveform (WNW). As applicable, these IP-based networking waveforms will enable information exchanges through the Global Information Grid (GIG) to the Soldier and provide entirely new capabilities for battlefield communications and information sharing. SRW is currently ported on 21 different radio platforms with 9 different vendors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.531"
                                            },
                                            "Text": {
                                                "val": "Integrate HAIPE 4.2 interoperable core and designated extensions in collaboration with Joint Enterprise Net Manager (JENM) and Warfighter Information Network-Tactical (WIN-T) high efficiency routing deployments and enhanced electronic protection requirements assessments. Develop capability for expanded scale and high mobility subnets, continued electronic protection enhancements as well as Disruption Tolerant and Virtualized Networking functionality for WNW. Develop, test, and deploy a security enhanced, non-proprietary development environment.  Evolve an expanded test bed for validation of performance and interoperability of waveform applications and radio platform services to support to Mid-tier Networking Vehicular Radio (MNVR) and Small Airborne Networking Radio (SANR) milestones.  Support WNW evaluation as part of the MNVR Analysis of Alternatives (AoA)."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Waveforms Software Development"
                                    },
                                    "Description": {
                                        "val": "Software Development efforts within PdM Waveforms are focused on the following:\n\n1.\tCyber Electro-magnetic Activities (CEMA)\nCEMA activities focus on impact the adversary?s ability to communicate through voice and data communications.  This also includes protecting and hardening Army capabilities and systems to prevent the adversary from doing the same.  CEMA is not limited to voice and data communications, but also includes tactics such as deception and adversary communication extraction.\nCEMA consist of:\n\n     - Cyberspace and Cybersecurity Operations\n          * Focused on IP traffic (data)\n          * Intrusion Detection and Intrusion Prevention of Army networks within Tactical Radio platforms (HMS, AMF, MNVR)\n     - Electronic Warfare (EW) \n          * Focused on Radio Frequency (RF\/voice)\n          * Electronic Attack (EA)\n          * Electronic Protection (EP)\n          * Includes Anti-jam protection and deployment\n     - Spectrum Management Operations (SMO).\n          * Development of capabilities for the warfighter to maintain communication in spectrum denied environments.\n\n2.\tSINCGARS\nDevelopment of a Frequency Hopping (FH3) mode, which will address the adversary's EA capabilities.\nDevelopment of transmission security protocols.\n\n3.\tSRW & SRW Narrowband Integration\nDevelopment of SRW Narrowband and the integration of Narrowband Code into the SRW baseline support the following warfighter capability gaps:\n\n     - Availability of adequate spectrum to deploy a full Brigade Combat Team of subnets is increasingly becoming a problem in combat environments.\n     - Maintaining longer distances between communication nodes \n     - Maintaining communication capabilities in foliage-heavy environments.\n     - Operation in VHF and UHF bands with narrower bandwidths."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.008"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.986"
                                            },
                                            "Text": {
                                                "val": "- Transition SINCGARS Reference Implementation Laboratory (RIL) to CERDEC Ultra Lab\n- Complete trade studies addressing CEMA threats\n- Mitigate CEMA threats\n- Mitigate interference affects & coordinated EW and communications threats\n- Develop EW Enabled cyber capabilities"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.266"
                                            },
                                            "Text": {
                                                "val": "- Mitigate CEMA threats\n- Mitigate interference affects & coordinated EW and communications threats\n- Develop EW Enabled cyber capabilities"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to SRW Narrowband requirements"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Waveforms Software Support & Syatems Engineering"
                                    },
                                    "Description": {
                                        "val": "Beginning in FY18, due to a refocused product strategy, Waveforms will eliminate annual engineering releases and efforts will no longer be categorized and organized by product.  Future work will be separated into Systems Engineering, Software Development, and Test and Evaluation categories.\n\nPdM Waveforms software support and systems engineering for waveforms and network manager applications provide the following:\n     - Identification and documentation of development requirements to meet warfighter capability gaps.\n     - Documentation of code development.\n     - Provides current status of open defects and necessary code baseline fixes by severity.\n     - Maintain an integrated master schedule (IMS), including significant reviews, events, and required product delivery dates.\n     - Risk Management execution through the Risk Review Board (RRB)   \n          * Risk identification and assessment\n          * Risk mitigation planning and execution\n          * Risk documentation\n     - Configuration Management of waveform product baselines and changes via the Engineering Review Board (ERB) and two Configuration Control Board (CCBs). \n     - Technical interface to pertinent stakeholders across PM TR and PEO C3T.\n     - Provide necessary assistance and oversight to Waveforms product specific engineering."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.691"
                                            },
                                            "Text": {
                                                "val": "Continue software support and systems engineering efforts as described above in support of PdM Waveforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.524"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.524"
                                            },
                                            "Text": {
                                                "val": "Continue software support and systems engineering efforts as described above in support of PdM Waveforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to reduction in Software support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Waveforms Testing & Evalution"
                                    },
                                    "Description": {
                                        "val": "Waveforms Testing and Evaluation insures the following:\n     - compatibility with current components\n     - integrations with appropriate subsystems\n     - validation of waveform performance\n     - compliance with current security verification requirements\n         * NSA and JTeL IA certifications\n     - compliance with current military standard documentation\n     - interoperability with joint systems"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.491"
                                            },
                                            "Text": {
                                                "val": "Continue testing and evaluation procedures for waveforms code development and defect fixes to insure tactical waveforms meet warfighter requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.643"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.643"
                                            },
                                            "Text": {
                                                "val": "Continue testing and evaluation procedures for waveforms code development and defect fixes to insure tactical waveforms meet warfighter requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to additional waveform testing requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "4326750A"
                                    },
                                    "Title": {
                                        "val": "4326750A: JTN, O&M, A"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.278"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "10.278"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "For FY 2017 and prior, PdM Waveforms utilized OMA funding to support annual maintenance releases.  Beginning in FY 2018, PdM Waveforms' refocused strategy assumes major upgrades to accommodate emerging warfighter needs.  This strategy will eliminate the need for OMA funding.  Therefore, RDTE funding increases."
                        },
                        "AcquisitionStrategy": {
                            "val": "PdM Waveforms is responsible for common core activities including developing and updating legacy and networking waveforms that operate on multiple radios sets and in all operational environments that support network-centric operational warfare.  Waveform developments (upgrading, developing, and maintaining) will generally be procured through full and open contract competitions.\n\nBeginning in FY 2018, based on the results of the FY 2017 Army Network Analysis, PdM Waveforms will refocus efforts to improve waveforms for lower and mid-tier networks.  The effort will focus on development to achieve improved performance, network simplification, improved spectrum efficiency and improved EW\/Cyber resistance.  The planned waveforms may include changes to a mid-tier waveform, SRW 2.0\/Narrow Band, and SINCGARS upgrades.  This  new capability must be completed by FY 2020-2021 to support future tactical radio procurements."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support - CORE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CORE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.455"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.455"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support - Matrix"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.232"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.529"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.539"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.539"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support - MITRE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Aberdeen, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.561"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.561"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support - SETA"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Riverside, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.788"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.513"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.513"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Development- SRW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Harris"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rochester, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.997"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.997"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development- SRW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various\/TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.92"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.920"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development - WNW"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC Atlantic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.567"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.567"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development - CERDEC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.008"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.116"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.489"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.489"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development - Technical\/Coding (MA-IDIQ)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MA - IDIQ"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various Locations"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.618"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "14.449"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "14.449"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Development - SSC LANT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC LANT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.253"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.329"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.329"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Software Support - SRW"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.194"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.194"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Support - SRW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Harris"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rochester, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.306"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.306"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Support - WNW"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC LANT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.614"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.614"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Software Support - WNW"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various\/TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.862"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.862"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering - MITRE"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "MITRE"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.212"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.286"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.286"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Systems Engineering - SSC LANT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC LANT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.479"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.569"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.569"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation Support (SRW RIL)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.146"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.146"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation Support (WNW RIL)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC Atlantic"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.347"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.347"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation - CERDEC"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CERDEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.052"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.177"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.177"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Test and Evaluation - SSC LANT"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SSC LANT"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Charleston, SC"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.438"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.465"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.465"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_EX6.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Trade Studies Begin"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Trade Studies"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MA - IDIQ RFP Release"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Trade Studies Complete"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MA - IDIQ Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Soldier Radio Waveform Narrowband Transition"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Soldier Radio Waveform 2.0"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Future Waveform Delivery"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Due to MNVR AoA and changing requirements regarding the Army Tactical Network, PdM Waveforms has eliminated annual engineering software releases into the IR."
                        }
                    }
                }
            ]
        }
    }
}