{
    "id": "2019-Army-PB-2040-JBOOK-d3d3f82921b489871a1a4e67a87dc7ea6efd7f320a6682df27ed06f0007d5b08-43",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA7-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305208A"
        },
        "ProgramElementTitle": {
            "val": "Distributed Common Ground\/Surface Systems"
        },
        "R1LineNumber": {
            "val": "227"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "32.284"
            },
            "CurrentYear": {
                "val": "24.7"
            },
            "BudgetYearOne": {
                "val": "38.667"
            },
            "BudgetYearOneBase": {
                "val": "38.667"
            },
            "BudgetYearTwo": {
                "val": "57.481"
            },
            "BudgetYearThree": {
                "val": "57.621"
            },
            "BudgetYearFour": {
                "val": "38.802"
            },
            "BudgetYearFive": {
                "val": "2.567"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "252.122"
            }
        },
        "ProgramElementNote": {
            "val": "The Distributed Common Ground Systems - Army (DCGS-A) was formerly designated a Major Automation Information System (MAIS) program."
        },
        "ProgramElementMissionDescription": {
            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration. The core functions of DCGS-A are: the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities. DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, all Warfighting Functions, and the Defense Information & Intelligence Enterprise (DI2E) and Intelligence Community Information Technology Enterprise (IC ITE). DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint. As new software capability drops are integrated and tested, a continuing series of modifications will be integrated and fielded to units IAW the Army Resourcing Priority List (ARPL) process.\n\nDCGS-A is designated as a Program of Record (PoR) within the Command Post Computing Environment (CP CE) of the Common Operating Environment (COE).  DCGS-A provides the Single and Shareable Geospatial Foundation (SSGF) Cross Cutting Capability (CCC), and is defining the DCGS-A architecture to fit within the COE as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.  This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements and enhancements under one COE and one vision leveraging intelligence community investments. PM DCGS-A continues to work with PM Mission Command (PM MC) to converge on CP CE Tactical Server Infrastructure (TSI) for FY 2019 fielding.\n\nDCGS-A software is tailored by echelon and scalable to each unit's mission. DCGS-A provides commanders and staffs the ability to maintain an accurate and up to date understanding of the operational environment. The DCGS-A contribution to commanders' visualization and situational awareness, rapid planning, and the synchronization of all warfighting functions, enable Army units to operate within the enemy's decision cycle. This capability enhances tactical and operational maneuver and the conduct of full spectrum operations across the range of military operations from Humanitarian Assistance and Disaster Relief (HADR) to major combat operations and campaigns through all phases of the Joint Continuum of Military Operations.\n\nThe DCGS-A configurations range from laptops to systems integrated in tactical shelters and mounted on tactical vehicles to large commodity servers operating in a sanctuary based data center processing environments. The fundamental intent and tenet of this approach is to reduce forward deployed equipment\/footprint by co-locating the advanced analytics capabilities within the DCGS-A baseline with the regional data centers, where the data is stored. This infrastructure consolidation simultaneously reduces processor and communications requirements in tactical units by limiting the number of large data files transported across tactical communications systems. Following a successful operational assessment and Milestone C in 2QFY12\/Full Deployment Decision in 1QFY13, Follow-on Test & Evaluation in 3QFY15, the program is deploying DCGS-A Increment 1 Software Baseline throughout the Army.\n\nFY 2019 has no funding for Project 956.\n\nFY 2019 Base funding in the amount of $38.667 million for D07, DCGS-A, will be used for modification, testing and integration of commercially available technologies to support multi-source intelligence processing at the tactical levels, as directed in the FY 2017 National Defense Authorization Act (NOAA), Section 113 and Section 220 that will increase the Processing, Exploitation, and Dissemination capability our Army requires. DCGS-A will continue critical updates to the Army's ISR PED and multi-intelligence planning, analysis, and production capabilities through the exploitation of Cloud Computing and advanced analytics capabilities. This approach will achieve Information Technology efficiencies through alignment with the Intelligence Community Information Technology Environment (IC ITE), while providing iterative software updates required to remain current."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "32.284"
                },
                "CurrentYear": {
                    "val": "24.7"
                },
                "BudgetYearOne": {
                    "val": "46.4"
                },
                "BudgetYearOneBase": {
                    "val": "46.4"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.284"
                },
                "CurrentYear": {
                    "val": "24.7"
                },
                "BudgetYearOne": {
                    "val": "38.667"
                },
                "BudgetYearOneBase": {
                    "val": "38.667"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-7.733"
                },
                "BudgetYearOneBase": {
                    "val": "-7.733"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-7.733"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-7.733"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 decrease of $7.733M to project D07 supports re-phasing of funds to support program restructure."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "D07"
                    },
                    "ProjectTitle": {
                        "val": "DCGS-A Common Modules (MIP)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "32.284"
                        },
                        "CurrentYear": {
                            "val": "24.7"
                        },
                        "BudgetYearOne": {
                            "val": "38.667"
                        },
                        "BudgetYearOneBase": {
                            "val": "38.667"
                        },
                        "BudgetYearTwo": {
                            "val": "57.481"
                        },
                        "BudgetYearThree": {
                            "val": "57.621"
                        },
                        "BudgetYearFour": {
                            "val": "38.802"
                        },
                        "BudgetYearFive": {
                            "val": "2.567"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "252.122"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Note: The Distributed Common Ground System - Army was formerly designated a Major Automation Information System (MAIS) program."
                        },
                        "ProjectMissionDescription": {
                            "val": "Distributed Common Ground System - Army (DCGS-A) is the Intelligence, Surveillance and Reconnaissance (ISR) System of Systems (SoS) for Joint, Interagency, Allied, Coalition, and National data analysis, sharing and collaboration.  The core functions of DCGS-A are:  the vertical and horizontal synchronization of ISR Processing, Exploitation and Dissemination (PED) efforts; operations in a networked environment at multiple security levels; the control of select Army and joint sensor systems; the fusion of all acquired data and information, and distribution of relevant red (threat), gray (non-aligned), and environmental (weather and terrain) information; and providing the Warfighters' early warning, targeting, and sensor ground station capabilities.  DCGS-A provides a single integrated ISR ground processing system composed of common components that are interoperable with sensors, other information sources, all Warfighting Functions, compliant with standards providing the Defense Information & Intelligence Enterprise (DI2E) and Intelligence Community Information Technology Enterprise (IC ITE).  DCGS-A is fielded in Fixed, Mobile, and embedded configurations emphasizing the use of reach and split based operations by improving accessibility of data in order to reduce forward deployed footprint.  As enhanced commercial capabilities are integrated and tested, a continuing series of software capability drop releases will be provided into Army Common\/commodity hardware and fielded to units IAW the Army Resourcing Priority List (ARPL) process.\n\nDCGS-A is designated as a Program of Record (PoR) within the Command Post Computing Environment (CP CE) of the Common Operating Environment (COE).  DCGS-A provides the Single and Shareable Geospatial Foundation (SSGF) Cross Cutting Capability (CCC), and is defining the DCGS-A architecture to fit within the COE as described by the Assistant Secretary of the Army (Acquisition, Logistics, and Technology) (ASA(ALT)) COE Implementation Plan.   This is in accordance with the G-3\/5\/7 priority to align all Army networks, procurements and enhancements under one COE and one vision leveraging intelligence community investments. PM DCGS-A continues to work with PM Mission Command (PM MC) to converge on CP CE Tactical Server Infrastructure (TSI).  \n\nDCGS-A provides technologically advanced Processing, Exploitation, and Dissemination (PED) capabilities through iterative software releases delivered in tailored and scalable mobile, fixed, and embedded configurations in all maneuver and maneuver support units from Company Intelligence Support Team to Army Service Component Command, and in select maneuver sustainment units battalion and above.  \n\nFY 2019 Base funding in the amount of $38.667 million for D07, DCGS-A, will be used for modification, testing and integration of commercially available technologies to support multi-source intelligence processing at the tactical levels, as directed in the FY 2017 National Defense Authorization Act (NOAA), Section 113 and Section 220 that will increase the Processing, Exploitation, and Dissemination capability our Army requires. DCGS-A will continue critical updates to the Army's ISR PED and multi-intelligence planning, analysis, and production capabilities through the exploitation of Cloud Computing and advanced analytics capabilities. This approach will achieve Information Technology efficiencies through alignment with the Intelligence Community Information Technology Environment (IC ITE), while providing iterative software updates required to remain current."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Integrate and Test DCGS-A Software"
                                    },
                                    "Description": {
                                        "val": "Continue efforts to integrate and test DCGS-A software. DCGS-A will continue to expand on the capabilities provided by DCGS-A Increment 1 by leveraging commercial items at the Army and below echelons while providing new, enhanced, and leap-ahead Intelligence, Surveillance, and Reconnaissance (ISR) and Standard and Shareable Geospatial Foundation (SSGF) enterprise capabilities to align with the Intelligence Community (IC) and Army's Common Operating Environment (COE) and transformation objectives. DCGS-A and beyond will leverage the investment made in previous DCGS-A increments and include emerging technologies related to: Tasking of sensors; controlling select Army sensor systems; Processing, fusing, and Exploiting data and information; supporting knowledge generation; providing ground station capabilities; automated support to intelligence product generation; Disseminating information and intelligence about the threat, weather, and terrain at all echelons; automating intelligence synchronization, including ISR planning, reconnaissance and surveillance integration and assessment; supporting situation understanding; supporting targeting and effects; providing the Standard and Sharable Geospatial Foundation (SSGF) to COE Computing Environments (CEs). These requirements will be defined in the DCGS-A Capability Drops (CDs) as necessary to ensure DCGS-A provides the data, information, intelligence, situation awareness, and interoperability needed to support the Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.791"
                                            },
                                            "Text": {
                                                "val": "Will continue to integrate and test DCGS-A software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.01"
                                            },
                                            "Text": {
                                                "val": "Will continue to integrate and test DCGS-A Software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.126"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.126"
                                            },
                                            "Text": {
                                                "val": "Will continue to integrate and test DCGS-A Software."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Testing requirements increased from one Capability Drop to multiple Capability Drops."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Matrix Support Government for Software Integration"
                                    },
                                    "Description": {
                                        "val": "Matrix Support Government for software integration to the target platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.131"
                                            },
                                            "Text": {
                                                "val": "Will continue Matrix Support Government for software integration to the target platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.899"
                                            },
                                            "Text": {
                                                "val": "Will continue Government Matrix Support for software integration to the target platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.787"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.787"
                                            },
                                            "Text": {
                                                "val": "Will continue Government Matrix Support for software integration to the target platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased Government matrix support to accommodate software integration requirements for additional Capability Drops."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Project Management"
                                    },
                                    "Description": {
                                        "val": "Project Management support to manage the cost, schedule, and performance metrics for the program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.641"
                                            },
                                            "Text": {
                                                "val": "Will continue Project Management support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.118"
                                            },
                                            "Text": {
                                                "val": "The program will prepare Acquisition Requirements Packages for solicitations to satisfy multiple capability drops."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.997"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.997"
                                            },
                                            "Text": {
                                                "val": "Continue acquisition document preparation and support for multiple capability drops."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Similar level of effort in FY18 and FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army and Joint Interoperability Testing\/Developmental Testing\/Operational Testing"
                                    },
                                    "Description": {
                                        "val": "Testing of DCGS-A"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.09"
                                            },
                                            "Text": {
                                                "val": "Testing of DCGS-A."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.568"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.568"
                                            },
                                            "Text": {
                                                "val": "Continue to support testing requirements for DCGS software."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Testing requirements increased from one Capability Drop to multiple Capability Drops."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Support"
                                    },
                                    "Description": {
                                        "val": "Training support - embedded computer based training (CBT) for the DCGS-A software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.316"
                                            },
                                            "Text": {
                                                "val": "Will initiate training support - embedded computer based training (CBT) for the DCGS-A software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.203"
                                            },
                                            "Text": {
                                                "val": "Continue training support - embedded computer based training (CBT) for the DCGS-A software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.851"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.851"
                                            },
                                            "Text": {
                                                "val": "Continue training support - embedded computer based training (CBT) for the DCGS-A software."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Similar level of effort in FY18 and FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Logistics Documentation"
                                    },
                                    "Description": {
                                        "val": "Logistics activities including maintenance task analysis, level of repair analysis, user manual, training support package, and MANPRINT activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.405"
                                            },
                                            "Text": {
                                                "val": "Will initiate logistics activities including task maintenance task analysis, level of repair analysis, user manual, training support package, and MANPRINT activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.38"
                                            },
                                            "Text": {
                                                "val": "Continue logistics activities including task maintenance task analysis, level of repair analysis, user manual, training support package, and MANPRINT activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.338"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.338"
                                            },
                                            "Text": {
                                                "val": "Continue logistics activities including task maintenance task analysis, level of repair analysis, user manual, training support package, and MANPRINT activities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Similar level of effort in FY18 and FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "B01001"
                                    },
                                    "Title": {
                                        "val": "DCGS-A (MIP)"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "67.615"
                                        },
                                        "BudgetYearThree": {
                                            "val": "301.252"
                                        },
                                        "BudgetYearFour": {
                                            "val": "276.387"
                                        },
                                        "BudgetYearFive": {
                                            "val": "294.885"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Note: The Distributed Common Ground System - Army is designated a Major Automation Information System (MAIS) program."
                        },
                        "AcquisitionStrategy": {
                            "val": "DCGS-A is a former ACAT IAM, Major Automated Information System (MAIS) program. The DCGS-A program will consist of multiple capability drops structured to meet DCGS-A User requirements.  The DCGS-A program will follow the Information Technology (IT) Box concept for an agile acquisition strategy to iteratively provide and field Intelligence, Surveillance, and Reconnaissance (ISR) capabilities, hosted on Commercial off the Shelf (COTS) equipment\/hardware, providing low risk, efficient, time- phased releases of capability to satisfy the Army's operational needs.\n\nThe DCGS-A capabilities under Increment 1 will be leveraged to the maximum extent where applicable to meet the future DCGS-A requirements set. The DCGS-A will also leverage the Increment 1 configuration platforms fielded across the Army.\n\nDCGS-A is a collection of software packages (COTS, and GOTS products) selected to provide each Army echelon (from Battalion up to Echelon Above Corps (EAC)) the capability to synthesize and exploit intelligence data. DCGS-A delivers these software packages on COTS and GOTS hardware components, tailored to meet each Army Echelon's intelligence mission requirements. DCGS-A is the Army's ISR Foundation Layer for Tasking, Processing, Exploitation, Dissemination (TPED) and development of situation understanding using intelligence information about the threat, weather, and terrain at all Army Echelons.  DCGS-A provides the capabilities necessary for Commanders to access information, task organic sensors, and synchronize non-organic sensor assets with their organic assets. DCGS-A will continuously acquire and synthesize data and information from Joint, Interagency, Intergovernmental, and Multi-national (JIIM) sources to maintain an updated and accurate understanding of the operational environment to inform critical and time sensitive command decisions.\n\nThe DCGS-A software baseline will be updated and iteratively deployed to address emerging and prioritized operational requirements. PM DCGS-A, in coordination with the operational user community, will align releases with the technological readiness of targeted enhancements, and to support low-risk integration and test cycle times. As capability drop requirements are approved, DCGS-A will leverage commercially available solutions and non-developmental items to meet user needs. The DCGS-A software will be hardware agnostic so that the software can be deployed in any processing hardware equipment. This allows the DCGS-A software to be scalable and deployable in different hardware system configurations, as required by the Army at different echelons. The implementation of the latest COTS hardware procurement through the Army Common Hardware System (CHS) program with the established post-deployment hardware sparing, sustainment, and maintenance provisions, will result in significant cost efficiencies."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Allot"
                                                },
                                                "PerformingActivity": {
                                                    "val": "DCGS-A"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "APG, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.19"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.641"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.118"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.997"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.997"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Milestone preparation; Activities; Trade Space Analysis (TSA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.318"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.318"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Integrate & Test software"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "11.921"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "27.791"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-06"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.01"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-12"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "24.126"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "24.126"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "System reconfiguration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4.02"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Matrix Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.805"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.131"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.899"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.787"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.787"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Training Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.316"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.203"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.851"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.851"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Logistics Documentation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.405"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.38"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.338"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.338"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Test & Integration Lab"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1"
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.09"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.568"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.568"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260716_D07.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Capability Drop 1"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Drop 1 IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Drop 2"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Capability Drop 2 IOC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Continuous Capability Drop Modifications"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}