{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-3aa5750205815470029d4902e3ab7fe43a356ab3f6d3326908075a172dae75b4-11",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603760E"
        },
        "ProgramElementTitle": {
            "val": "COMMAND, CONTROL AND COMMUNICATIONS SYSTEMS"
        },
        "R1LineNumber": {
            "val": "56"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "123.934"
            },
            "CurrentYear": {
                "val": "106.787"
            },
            "BudgetYearOne": {
                "val": "185.984"
            },
            "BudgetYearOneBase": {
                "val": "185.984"
            },
            "BudgetYearTwo": {
                "val": "158.245"
            },
            "BudgetYearThree": {
                "val": "160.092"
            },
            "BudgetYearFour": {
                "val": "224.084"
            },
            "BudgetYearFive": {
                "val": "222.153"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Command, Control and Communications Systems program element is budgeted in the Advanced Technology Development Budget Activity because its purpose is to demonstrate and evaluate advanced information systems research and development concepts.\n\nThe success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon. While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users. The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces. Approaches to this goal include developing technologies in these areas:\n- High-Capacity Links technologies - enables greater back-haul capability.\n- Advanced Networking technologies - supports resilience, adaptability, and scalability.\n- Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in very high-threat environments.\n- Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "155.081"
                },
                "CurrentYear": {
                    "val": "106.787"
                },
                "BudgetYearOne": {
                    "val": "137.904"
                },
                "BudgetYearOneBase": {
                    "val": "137.904"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "123.934"
                },
                "CurrentYear": {
                    "val": "106.787"
                },
                "BudgetYearOne": {
                    "val": "185.984"
                },
                "BudgetYearOneBase": {
                    "val": "185.984"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-31.147"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "48.080"
                },
                "BudgetYearOneBase": {
                    "val": "48.080"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-9.375"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-8.905"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-12.867"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "48.080"
                                },
                                "BudgetYearOneBase": {
                                    "val": "48.080"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects Congressional reduction, reprogrammings and the SBIR\/STTR transfer. \nFY 2018:  N\/A\nFY 2019:  Increase reflects initiation of the Network Universal Persistence, Protected Forward Communications programs, and classified program expansion."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CCC-02"
                    },
                    "ProjectTitle": {
                        "val": "INFORMATION INTEGRATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "62.677"
                        },
                        "CurrentYear": {
                            "val": "55.928"
                        },
                        "BudgetYearOne": {
                            "val": "106.316"
                        },
                        "BudgetYearOneBase": {
                            "val": "106.316"
                        },
                        "BudgetYearTwo": {
                            "val": "89.675"
                        },
                        "BudgetYearThree": {
                            "val": "108.092"
                        },
                        "BudgetYearFour": {
                            "val": "188.584"
                        },
                        "BudgetYearFive": {
                            "val": "214.153"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The success of military operations depends on timely, reliable, secure, and synchronized dissemination of command and control and relevant situational awareness information to every military echelon.  While wired communications and networks are fairly well developed, providing assured high-bandwidth mobile wireless capabilities that match or exceed commercial wired infrastructure is needed to meet the demands of military users.  The goal of the Information Integration Systems project is to develop and demonstrate technologies that will provide effective communications to U.S. forces.  Approaches to this goal include developing technologies in these areas:\n-  High-Capacity Links technologies - enables greater back-haul capability.\n-  Advanced Networking technologies - supports resilience, adaptability, and scalability.\n-  Low Probability of Detection and Anti-Jam (LPD\/AJ) technologies - provides assured communications in very high-threat environments.\n-  Novel Radio Frequency and Spectral Sensing (RF\/SS) - supports efficient spectrum management in congested environments and detection of electromagnetic threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE)"
                                    },
                                    "Description": {
                                        "val": "The goal of the Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) program is to develop innovative networking and information sharing approaches that enable U.S. and coalition forces to effectively and efficiently coordinate tactical operations by eliminating today's prohibitive cost and security barriers.  Building upon the Spectrum Efficiency and Access program, which is budgeted in this PE\/Project, and research into the use of commercial systems and infrastructure to support military operations, SHARE provides new opportunities for U.S. and coalition forces to gain and maintain a tactical advantage on the battlefield.  Coordination includes providing all the information required to enable the command and control necessary to plan and execute operations in all phases of warfare.  Technology from this program will be made available to the Services and DoD Agencies that work with coalition partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed the network architecture for secure and resilient sharing of information within coalition partners.\n-  Defined the security environment and overall system security architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.042"
                                            },
                                            "Text": {
                                                "val": "-  Perform laboratory experiments and evaluations of the network software for secure and resilient sharing.\n-  Develop software for commercial handheld devices to support sharing and fusion of information from various data sources at multiple security levels.\n-  Develop the architecture and software for automated configuration of multiple security levels across coalition networks.\n-  Develop software to enable integration of commercial large data systems with military infrastructure.\n-  Develop technologies allowing future military networks to work with badly degraded radio links."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.996"
                                            },
                                            "Text": {
                                                "val": "-  Integrate and test multi-level, handheld software and new networking architecture supporting the sharing of information at multiple security levels.\n-  Conduct controlled, limited field experimentation on handheld devices demonstrating multi-level secure information sharing and network security.\n-  Develop and update as required, based on laboratory testing and experimentation, automated network configuration software ensuring compatibility with handheld and network approach.\n-  Conduct system security assessment and compliance with overall program sharing and security objectives."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects additional requirements to integrate, test, and demonstrate handheld and networking software."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamic Network Adaptation for Mission Optimization (DyNAMO)"
                                    },
                                    "Description": {
                                        "val": "Wireless networks have evolved into complex systems having many configurable parameters\/features, including link data rates, power settings, inter-network gateways, and security associations.  The optimal settings for these features vary greatly depending on the mission for which the network is deployed and the environment in which it is operating.  Currently, the majority of these features are optimized off-line for specific scenarios and assumptions and are pre-set before use in a mission.  There is no capability for the settings to adapt if the actual mission or environment differs from the original assumptions used to configure the network.  The problem is exacerbated in scenarios in which intelligent adversaries can affect the topology and operation of the network unpredictably and on short timescales.  Furthermore, future operations will include multiple, different radios interconnected on the same platform, and those existing networks lack a common standard for interoperability.  The Dynamic Network Adaptation for Mission Optimization (DyNAMO) program will develop software that addresses the incompatibilities preventing information sharing across independent airborne networks and develop new approaches to configure and control networks and networks of networks for operation in dynamic and contested environments.  The program will address optimization within legacy and future military networks, interactions between networks, and availability of necessary network services to support mission success.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.154"
                                            },
                                            "Text": {
                                                "val": "-  Continued development of near-real-time optimization algorithms.\n-  Developed and integrated inter-network coordination and decentralized network services.\n-  Continued development and integration of mission-based network architecture control and information delivery mechanisms.\n-  Conducted testing of individual technology developments in an emulation environment.\n-  Conducted system-level emulation test of system with initial instantiation of inter-network coordination and mission-based control."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.698"
                                            },
                                            "Text": {
                                                "val": "-  Continue development and integrate initial instantiation of real-time optimization algorithms in radio hardware.\n-  Continue development and integration of mission-based network architecture control and information delivery mechanisms.\n-  Conduct hardware-in-the-loop test of integrated system with instantiations of inter-network coordination, mission-based control, and real-time optimization.\n-  Conduct system-level emulation test of advanced network infrastructure with final instantiation of inter-network coordination, mission-based control, and real-time optimization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.965"
                                            },
                                            "Text": {
                                                "val": "-  Integrate final instantiation of inter-network coordination, mission-based control, and real-time optimization algorithms in radio hardware.\n-  Conduct ground test of integrated system.\n-  Conduct field test of integrated system with instantiations of inter-network coordination, mission-based control, and real-time optimization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Spectrum Efficiency and Access"
                                    },
                                    "Description": {
                                        "val": "The Federal Government is working to transition large swaths of spectrum (up to 500 MHz) from Federal (DoD is the primary contributor) to civilian use for broadband telecommunications.  The DoD will need more highly integrated and networked data\/sensor capacity over the next decades and will therefore need new technology that requires less spectrum to operate.  The objective of the Spectrum Efficiency and Access program is to investigate improvements in spectral reuse, such as spectrum sharing of sensor\/radar bands.  The program will leverage technical trends in cooperative sharing to exploit radar anti-jam and interference mitigation technologies that could enable spectrum sharing by allowing overlay of communications within the same spectral footprint.  The approach will include exploring real-time control data links between radars and communications systems, and developing the advanced waveforms and components to enable radars and communication networks to operate in close proximity.  The ultimate goal is to turn the DoD spectrum loss into a net gain of up to hundreds of MHz in capacity.  Technology from this program will be made available to the Navy, Army, and Missile Defense Agency (MDA)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.500"
                                            },
                                            "Text": {
                                                "val": "-  Developed improved version of the Command and Control (C2) system to manage spectrum sharing and coordination mechanisms between U.S. and coalition military systems.\n-  Integrated hardware and software necessary to support system C2, sharing and coordination mechanisms, software application needs, security level requirements, and best electronic protections technologies and techniques.\n-  Conducted field demonstrations with candidate systems that incorporate multiple spectrum sharing and coordination mechanisms.\n-  Developed transition plan and continued engagement with Navy, Army, MDA stakeholders."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.589"
                                            },
                                            "Text": {
                                                "val": "-  Develop advanced radio frequency (RF) waveform and associated signal processing technology.\n-  Implement transition plans with identified Navy, Army, and MDA stakeholders."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.987"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.987"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate spectrum maneuver command and control concepts.\n-  Commence design of a system capable of dynamically controlling radio frequency signatures while maintaining high accuracy target tracking."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "100 Gb\/s RF Backbone"
                                    },
                                    "Description": {
                                        "val": "The proliferation of video, voice, chat, and other important data-streams on the battlefield is driving a need for higher capacity, reliable, assured, and all-weather communications that are deployable on a wide range of air, ground, and maritime platforms.  The goal of this High-Capacity Links technologies program is to demonstrate a 100 Gigabit-per-second (Gb\/s) radio frequency (RF) backbone that will meet the anticipated mid-term (within 3-10 years) wireless networking requirements of deployed military forces.  DARPA's hybrid Free Space Optical RF Communications Adjunct (ORCA) system has broken the 10 Gb\/s wireless network boundary using free-space optical links, but all-weather Ku band components are currently limited to much less than 1Gb\/s capacity.  Furthermore, the hybrid optical\/RF system exhibits size, weight, and power (SWaP) consumption characteristics that preclude deployment on many SWaP-limited platforms.  Moving to a millimeter-wave (mmW) solution will provide high capacity and all-weather resiliency, but presents technical challenges that include the generation of higher-order waveforms (beyond common data link), efficient power transmission, high-speed routing, and low-noise receivers.  This program seeks to develop the constituent subsystems (waveform generation, efficient power amplifiers, and receivers) and spatial multiplexing architectures to construct an all-weather mmW 100 Gb\/s backbone at half the SWaP consumption of the current ORCA system.  The 100 Gb\/s RF Backbone program is intended for transition to multiple Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.342"
                                            },
                                            "Text": {
                                                "val": "-  Refined software and firmware of constituent technologies based on results of initial testing.\n-  Completed end-to-end laboratory system validation.\n-  Conducted multiple field tests of the prototype hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.718"
                                            },
                                            "Text": {
                                                "val": "-  Integrate prototype onto test aircraft and conduct air-to-ground testing.\n-  Complete air-to-ground testing and conduct flight demonstration to Services.\n-  Make technologies from the 100 Gb\/s RF Backbone system available for transition to the Services, and specifically to the Air Force Common Data Link project.\n-  Develop applications of advanced modulation and spatial multiplexing to make data links more resilient to threats in addition to providing high data rate."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.287"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.287"
                                            },
                                            "Text": {
                                                "val": "-  Conduct joint flight demonstrations with Services.\n-  Engage in targeted design activity for specific applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects initiation of activity in support of Service transition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Cloud Analytics (GCA)"
                                    },
                                    "Description": {
                                        "val": "The Geospatial Cloud Analytics (GCA) program will develop technology to access and analyze global scale, multimodal geospatial data and pilot an analytics-as-a-service business model.  Exploiting multiple sources and modalities at a global scale requires the development of technologies and systems that provide common access points to commercial data, computational power to preprocess data and make it exploitable by analytical tools, and new models supporting sensing and analytics as services including sharing of tools and results between individuals and consortiums.  GCA creates a capability for near real time monitoring of global events and change detection across various environments and warfighting domains, building upon the Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) coalition warfighter information sharing program, also in this Program Element.  By exploiting the vast amounts of geospatial information from new commercial satellite constellations and other sources, GCA will create the technology foundations needed to provide global awareness of gray-zone activities.  It will do so by augmenting commercial capabilities with defense assets, not vice versa, and thereby improve speed, agility, and scalability.  Technology from this program will transition to the Services and DoD Agencies to meet their needs for global situational awareness."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.722"
                                            },
                                            "Text": {
                                                "val": "-  Analyze and evaluate potential platforms and algorithms.\n-  Design, prototype, and experiment with software infrastructure to use as a tool to exploit multiple sources and modalities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.993"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.993"
                                            },
                                            "Text": {
                                                "val": "-  Analyze computational architectures and frameworks for GCA analytics services at global scale. \n-  Demonstrate the ability of the software infrastructure to support global scale analytics on relevant problem sets.\n-  Demonstrate gray-zone indicators and warnings for high-impact global events such as droughts, crop failures, and illegal fishing.\n-  Experiment with approaches for offering analytics services for use by DoD users and others."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects scale up and demonstration of the GCA infrastructure and analytics."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Network Universal Persistence (Network UP)"
                                    },
                                    "Description": {
                                        "val": "Current radios send network control information and data using the same wireless link.  This produces a common failure mode when that wireless link degrades.  In many of today's military wireless networks, even brief wireless link outages create a loss of network connectivity that can take more than two minutes to recover once the wireless link is re-established.  During these network outages, data transmission is not possible.  Building on technologies explored in the Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) program, also in this PE, the Network UP program will develop and demonstrate radio technology that maintains network reliability through periods of frequent signal degradation that routinely occur in military operational environments.  Isolation of critical control channel information in a separate, robust wireless link will allow creation of a protected control channel that can maintain network reliability even when the data channel is lost.  The Network UP program will develop technology and a prototype system that enables military wireless networks to send data over dynamic, unstable wireless links.  The program will develop approaches to separate the control and data planes across different wireless links and design and implement mechanisms to maintain synchronization across those separate links.  Technologies developed under this program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.495"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.495"
                                            },
                                            "Text": {
                                                "val": "-  Initiate design of a radio architecture and supporting technology that implement separate control and data channels.\n-  Initiate design of network architectures and technologies that enable creation of a network with physically separated control and data links."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Protected Forward Communications (PFC)"
                                    },
                                    "Description": {
                                        "val": "The collaborative application of combat power in ground tactical operations demands reliable exchange of rich information and precise coordination of actions across various echelons.  These operations take place over three critical conversations: (1) to coordinate the actions of a local group, (2) to coordinate group and airborne assets, and (3) to interact with rear echelon command.  The communication links over which these three conversations take place are at risk from jamming and geolocation operations conducted with increasingly sophisticated exploitation and denial technology employed by our adversaries.  This problem is compounded by demands for ever-increasing capacity of these links.  The Protected Forward Communications (PFC) program will build on technical advances in resilient, efficient, and aware communications technology to design a single communication system to protect all three conversations from jamming and geolocation.  PFC builds on technology developed in the Secure Handhelds on Assured Resilient networks at the tactical Edge (SHARE) program, also in this Program Element.  PFC is generally applicable to small unit operations and is particularly relevant to the close air support (CAS) function typically executed by the Joint Terminal Attack Controller (JTAC) or Forward Air Controller (FAC).  The PFC program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.593"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.593"
                                            },
                                            "Text": {
                                                "val": "-  Initiate PFC conceptual development.\n-  Start algorithm design for implementation and control of all three communication techniques.\n-  Begin concept validation through modeling and simulation.\n-  Establish readiness of constituent link technologies for all three communication techniques.\n-  Conduct simulation and modeling of systems in representative operating environments to assess resistance to geolocation and jamming."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Communication in Contested Environments (C2E)"
                                    },
                                    "Description": {
                                        "val": "The Communication in Contested Environments (C2E) program will seek to address communications problems anticipated in networked airborne systems in the mid-21st century. Expected growth in sensor systems, unmanned systems, and internetworked weapons systems will strain the size of networks that our current communications technology can support in the contested environment.  As adversary capabilities advance, the DoD will need new techniques to quickly and efficiently accommodate better networking and improved communications capabilities, specifically communications systems with higher capacity, lower latency, greater jamming resistance, and reduced detectability.  As part of Advanced Networking technologies efforts, the C2E program addresses these needs with a three-pronged approach: first, to develop heterogeneous networking capabilities and advanced communication technology for airborne systems.  Low Probability of Detection (LPD), Anti-Jam (AJ), low latency, and high capacity communication protocols will be developed.  Second, to create a government controlled and maintained reference architecture for communications systems that draws from commercial communication architectures.  The defense contractor community can build specific communications systems based upon this reference architecture.  Finally, C2E will create a government controlled development environment to allow rapid refresh of communications technology and allow third party native application and waveform developers to contribute their own communications technologies.  Technologies from this program are planned to transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.463"
                                            },
                                            "Text": {
                                                "val": "-  Continued verification testing and system integration of the C2E Common-modem Hardware Integrated Library (CHIL).\n-  Continued development and integration of the C2E CHIL on the Ruggedized Flight System radios.\n-  Initiated development and testing of the Ruggedized Flight System radio with airborne tactical waveforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.159"
                                            },
                                            "Text": {
                                                "val": "-  Complete integration and testing of the Ruggedized Flight System radio.\n-  Demonstrate airborne tactical network waveform interoperability on the C2E Ruggedized Flight System radio."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced RF Mapping"
                                    },
                                    "Description": {
                                        "val": "One of the key advantages on the battlefield is the ability to actively sense and manipulate the radio frequency (RF) environment, enabling reliable and assured communications, as well as effectively mapping and manipulating the adversary's communications in ways that defy their situational awareness, understanding, or response.  Current approaches are emitter-based, with the signal processing techniques focused on array and time-based processing for each emitter.  As the RF environment becomes more complex and cluttered, the number of collection assets and the required level of signal processing inhibits our capability to pervasively sense and manipulate at the precision (time, frequency, and space) required for effective action.  To address these Radio Frequency and Spectral Sensing (RF\/SS) challenges, the Advanced RF Mapping program developed and demonstrated new concepts for sensing and manipulating the RF environment based on distributed rather than centralized collection.  This approach took advantage of the proliferation of RF devices, such as radios and cell phones, on the battlefield.  To leverage these existing devices effectively, the program developed new algorithms that map the RF environment with minimal communication load between devices.  The Advanced RF Mapping program also developed approaches to exploit our precise knowledge of the RF environment and the distributed proximity of RF devices to provide reliable and assured communications for our warfighter as well as to infiltrate or negate our adversaries' communications networks.  The Advanced RF Mapping program enabled both offensive and defensive operations in complex RF environments.  Advanced RF Mapping technology transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.218"
                                            },
                                            "Text": {
                                                "val": "-  Enhanced the baseline sensor management and RF Mapping user interfaces for the Services.\n-  Developed final Command and Control (C2) software configurations to integrate RF Mapping sensors into existing Service architectures, to enhance RF sensing capacity.\n-  Integrated additional third party sensors, such as U.S. Marine Corps and Special Operations Command (SOCOM) Counter Remotely Controlled Improvised Explosive Device Electronic Warfare (CREW) into the RF Mapping architecture."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wireless Network Defense"
                                    },
                                    "Description": {
                                        "val": "A highly networked and enabled force increases efficiency, effectiveness, and safety by making relevant information available when it is needed and at the appropriate location (person\/platform\/system).  Accomplishing this depends on providing reliable wireless communications to all U.S. forces, platforms, and devices in all phases of conflict.  As part of the Advanced Networks technologies effort, the Wireless Network Defense program increased wireless network capacity and reliability for tactical users, with the ultimate vision of making high quality data services pervasive throughout the DoD.  The primary focus was mitigation of advanced threats particular to the security of wireless networks.  The program leveraged the capabilities of the dynamic network to identify sources of misinformation, whether malicious or due to poor configuration, across the functional components of the complex system, and mitigated the corresponding effects.  Technologies developed under this program transitioned to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "-  Performed field testing of the radios and the radio network, using Wireless Network Defense to detect and mitigate network attacks against the radios.\n-  Performed final test of the mixture of hardware and emulated radios, demonstrating the ability of Wireless Network Defense to detect and mitigate network attacks in large, heterogeneous networks of tactically relevant radios to facilitate transition to the Army and Marine Corps."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CCC-06"
                    },
                    "ProjectTitle": {
                        "val": "COMMAND, CONTROL AND COMMUNICATION SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "61.257"
                        },
                        "CurrentYear": {
                            "val": "50.859"
                        },
                        "BudgetYearOne": {
                            "val": "79.668"
                        },
                        "BudgetYearOneBase": {
                            "val": "79.668"
                        },
                        "BudgetYearTwo": {
                            "val": "68.570"
                        },
                        "BudgetYearThree": {
                            "val": "52.000"
                        },
                        "BudgetYearFour": {
                            "val": "35.500"
                        },
                        "BudgetYearFive": {
                            "val": "8.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "61.257"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.859"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "79.668"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "79.668"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}