{
    "id": "2019-AirForce-PB-3600-MJBOOK-1-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-102",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V3B-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0604759F"
        },
        "ProgramElementTitle": {
            "val": "Major T&E Investment"
        },
        "R1LineNumber": {
            "val": "132"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "64.538"
            },
            "CurrentYear": {
                "val": "82.874"
            },
            "BudgetYearOne": {
                "val": "91.844"
            },
            "BudgetYearOneBase": {
                "val": "91.844"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "181.663"
            },
            "BudgetYearThree": {
                "val": "164.005"
            },
            "BudgetYearFour": {
                "val": "142.090"
            },
            "BudgetYearFive": {
                "val": "82.003"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "71.385"
                },
                "CurrentYear": {
                    "val": "82.874"
                },
                "BudgetYearOne": {
                    "val": "79.536"
                },
                "BudgetYearOneBase": {
                    "val": "79.536"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.538"
                },
                "CurrentYear": {
                    "val": "82.874"
                },
                "BudgetYearOne": {
                    "val": "91.844"
                },
                "BudgetYearOneBase": {
                    "val": "91.844"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-6.847"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "12.308"
                },
                "BudgetYearOneBase": {
                    "val": "12.308"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-6.847"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "12.308"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.308"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17  $6.847 million decrease:  $5.0 million decrease for cyber test infrastructure associated with the hardware-in-the-loop capability (FY 2017 Request for Additional Appropriations (RAA)) and $1.847 million decrease for Small Business Innovation Research (SBIR) tax.\n\nFY19  $12.308 million increase:  $3.0 million to fund Joint Simulation Environment (JSE), $10.0 million to fund cyber activities and $0.692 million decrease for inflation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "664597"
                    },
                    "ProjectTitle": {
                        "val": "Air Force Test Investments"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "64.538"
                        },
                        "CurrentYear": {
                            "val": "82.874"
                        },
                        "BudgetYearOne": {
                            "val": "91.844"
                        },
                        "BudgetYearOneBase": {
                            "val": "91.844"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "181.663"
                        },
                        "BudgetYearThree": {
                            "val": "164.005"
                        },
                        "BudgetYearFour": {
                            "val": "142.090"
                        },
                        "BudgetYearFive": {
                            "val": "82.003"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This PE provides planning, improvements, and modernization for test capabilities at four Air Force Test Center (AFTC) organizations: 96 Test Wing at Eglin AFB FL, 704 Test Group at Holloman AFB NM (and operating locations at Wright-Patterson AFB OH), Arnold Engineering Development Complex (AEDC) at Arnold AFB TN, and the 412 Test Wing at Edwards AFB CA.  The purpose is to help test organizations improve and develop their test infrastructure and capabilities to keep pace with improvements in weapon system technologies.  \n\nThe improvement and modernization (I&M) requirements are defined through the AF Test Investment Planning & Programming (TIPP) Process.  All projects have been reviewed through the Tri-Service Reliance process (to communicate AF efforts to the other Services and avoid unwarranted duplication of effort) and are documented in the Technology Development Acquisition Program (TDAP) database.  Each project has its own planning, development, equipment acquisition, equipment installation, and checkout phases which often require significant differences in funding from one year to the next.  As such, the changes in category funding from year to year do not necessarily indicate program growth, but rather a planned phasing of improvement and modernization efforts.  The test capabilities at these locations enable testing through all phases of weapon system acquisition, from system concept exploration through component and full-scale integrated weapon system testing to operational testing.  These test organizations are a part of the Major Range and Test Facility Base (MRTFB), operated and maintained by the Air Force for DoD Test and Evaluation (T&E).  These national test assets are available to others requiring their unique capabilities.\n\nThe 96 TW, at Eglin AFB FL, conducts and supports developmental test and evaluation (DT&E) of non-nuclear air armaments; Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR) systems; target acquisition and weapon delivery systems; navigation systems; provides a climatic simulation capability; determines target\/test item spectral signatures; and provides Cyber testing capabilities as part of the Joint Information Operations (IO) Range.\n\nAEDC, at Arnold AFB TN, provides pre-flight and reliability ground environmental test support for DoD aeropropulsion, flight systems, and space and missile programs.  The center has 53 test facilities providing: aerodynamic testing of scale model aircraft, missiles, and space systems; testing of large and full-scale satellites, sensors, and space vehicles in a simulated space environment; altitude environmental testing for aircraft, missile, and spacecraft propulsion systems; testing of large-scale models such as space boosters together with their propulsion systems and it provides a climatic simulation capability.  The 704 TG at Holloman AFB, NM provides independent test and evaluation of inertial navigation systems, Global Positioning System (GPS) and integrated systems used for aircraft navigation and missile guidance systems, including vulnerability to electronic interference; provides the liaison function for coordinating and scheduling all US Air Force test operations at White Sands Missile Range; provides subsonic through hypersonic ground testing of aircraft and missiles in a flight-representative environment under highly instrumented conditions; and executes flight test and test support for advanced avionics and weapons development of joint, international and commercial test programs.  The 704 TG, OL-AC at Wright-Patterson AFB, OH provides independent T&E in support of aircraft survivability and full-scale aircraft landing gear T&E.  These T&E activities include the development, T&E of aircraft landing gear components supporting engineering acquisition, design, safety, and performance evaluations.  In addition, they provide an independent T&E capability for component qualification.\n\nThe 412th Test Wing, at Edwards AFB CA, conducts and supports DT&E and Operational Test and Evaluation (OT&E) of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery\/systems, and cargo handling systems.\n\nI&M efforts within this PE are identified in four mission area categories:  Airframe\/Propulsion\/Avionics (APA); Armament\/Munitions (A\/M); Command, Control, Communications, Computers, Intelligence, Surveillance, Reconnaissance (C4ISR)\/Cyber; and Space.  These categories describe general types of effort that will be conducted in this PE.  APA provides planning, improvements, and modernization needed for test capabilities to conduct and support DT&E and OT&E of aircraft and aircraft systems, aerospace research vehicles, unmanned aerial vehicles, cruise missiles, parachute delivery\/recovery systems, cargo handling systems, and turbine engines.  APA focuses on evaluation of the vehicle airframe, propulsion system, and avionics systems, as well as overall systems integration testing.  It encompasses both ground test facilities, on-board test aircraft systems, and open-air range infrastructure, including instrumentation and data processing.  A\/M provides planning, improvements, and modernization to conduct DT&E of air-to-ground and air-to-air armaments and munitions, which include gun, chaff and flare systems, as well as aerial decoy and target systems.  The A\/M category encompasses the full range of DT&E from digital modeling and simulation, to precision measurement testing, to hardware-in-the-loop and installed systems testing, to open-air range testing.  Elements of A\/M DT&E include environmental, warhead effectiveness, arena blast\/fragmentation, guidance navigation and control, aerodynamics, propulsion, electromagnetic interference and compatibility, mass properties, seeker and signature measurement, survivability, lethality, integration, reliability, net-centric and terminal effects testing.  A\/M also involves the design and development of systems needed to support A\/M DT&E including the design and development of high speed sleds, targets, range support systems and various instrumentation and measurement systems.  C4ISR provides planning, improvements and modernization to conduct DT&E of systems that support Command and Control (C2) functions which range from air campaign planning at the theater level to wing level C2 operations, to planning individual missions, to putting weapons on target using concepts such as machine to machine targeting.  C4ISR includes ground and flight performance testing of airborne C2 networks and tactical data links, air operation centers, mission planning systems, multi-level security systems, radio and communication systems, ISR systems, information assurance systems, and radar systems such as those used by Joint Surveillance Target Attack Radar Systems (JSTARS) and air traffic control systems.  C4ISR conducts DT&E on a full range of systems covering the sensor (detection) to the shooter (weapon), including functional and environmental testing of these systems.  C4ISR\/Cyber also includes DT&E for offensive and defensive Cyber capabilities.  Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs.  Test capabilities include launch vehicle, satellite, missile, sensor, thermal protection system, signature, hardness, and interface testing.  The capabilities reside at Vandenberg, Kirtland, Arnold, Patrick, Schriever, Peterson, Holloman Air Force Bases and others.  Infrastructure includes launch sites, mobile control units, thermal vacuum chambers, sled tracks, arc heated wind tunnels, ballistic test ranges, signature collection, and the requisite personnel.\n\nThis program is in Budget Activity 6, RDT&E Management Support, because this budget activity includes research, development, test and evaluation efforts and funds to sustain and\/or modernize the installations or operations required for general research, development, test and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Airframe\/Propulsion\/Avionics T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Airframe\/Propulsion\/Avionics (APA)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "50.052"
                                            },
                                            "Text": {
                                                "val": "ALMEC will complete upgrades for the ETF controls project and restoral of the C Plant H1 Heater.\n\nIMTTC will continue to install and integrate hardware and software enhancements for TCC and 16T TACS. \n\nTIDSC will complete the C2 facility upgrade.\n\nCRIIS production will continue Lot 1 procurement and fielding of CTEIP developed CRIIS TSPI increment 2 pods, aircraft internal mounts and ground test support infrastructure.\n\nThe LGTF Modernization Program will explore options to begin contract actions.\n\nCommon Airborne Networked Instrumentation System (CANIS) will continue supporting and complementing the CTEIP-funded iNET Program by implementing the airborne solutions. FY17 activity will include completing the implementation of spirals 0, 1, and 2 of the CANIS acquisition approach. Spiral 0 modifies Air Force Test Center (AFTC) telemetry policies and procedures and makes use of tier 1 waveforms; Spiral 1 implements multi-band and C-Band transmitter and transceiver conversions; and Spiral 2 establishes a test asset networked data gathering package.\n\nNGTETC will continue upgrades to exhaust coolers, compressor inbleed, power and thermal management systems.\n\nIMTPC will restore the capabilities of the main drive motors (rewind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor sub-systems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary Propulsion Wind Tunnel (PWT) facility main drive electrical utilities) to original specifications.\n\nMMCRU will continue to support the hardware integration (spiral 1), situational awareness integration (spiral 2), and applications migration of the MMCRU implementation.\n \nThe VCSU program will complete requirements definition and take receipt of initial test lab equipment. \n\nThe T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "55.184"
                                            },
                                            "Text": {
                                                "val": "Advanced Large Military Engine Capability (ALMEC) will complete upgrades for the ETF controls and restoration of the C Plant H1 heater.\n\nImproved Transonic Test Capability (IMTTC) will continue to install and integrate hardware and software enhancements for TCC and 16T TACS.\n\nThe Voice Communications Systems Upgrade (VCSU) program will begin procurement of equipment for the mission control room (MCR). \n\nCommon Range Integrated Instrumental System (CRIIS) Production will continue Lot 1 procurement of OSD Central Test Enhancement Investment Program (CTEIP) developed CRIIS Time Space Position Information (TSPI) Increment two pods, aircraft internal mounts, and ground support infrastructure. Purchase and delivery of initial CRIIS equipment will focus on Eglin AFB IOC.\n\nThe Landing Gear Test Facility (LGTF) Modernization Program will continue design and fabrication (Phase II) efforts, and system integration (Phase III).\n\nThe Integrated Networked Enhanced Telemetry (iNET) Systems Integration and Support (ISIS) Program will begin in FY18. The program will begin to define design requirements to integrate and implement the telemetry technologies developed under the CTEIP-funded iNET Program.\n\nCommon Airborne Network Instrumentation Solutions (CANIS) will continue supporting and complementing the CTEIP-funded iNET Program by implementing the airborne solutions. FY17 activity will include completing the implementation of spirals 0, 1, and 2 of the CANIS acquisition approach. Spiral 0 modifies AFTC telemetry policies and procedures and makes use of tier 1 waveforms; Spiral 1 implements multi-band and C-Band transmitter and transceiver conversions; and Spiral 2 establishes a test asset networked data gathering package.\n\nNext Generation Turbine Engine Test Capability (NGTETC) will continue upgrades to exhaust coolers, compressor inbleed, power and thermal management systems.\n\nImproved Plant Reliability and Efficiency\/Transonic Propulsion Test Capability (IMTPC) will continue to restore the capabilities of the main drive motors (rewind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor sub-systems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary PWT facility main drive electrical utilities) to original specifications.\n\nMobile Mission Control Room Upgrade (MMCRU) will continue to support the situational awareness integration (spiral 2) and begin development IO at each range (spiral 3), and applications migration of the MMCRU implementation.\n\nThe VSCU Program will continue to take receipt of MCR equipment and begin installation and integration activities.\n\nThe T&E Board of Directors will continue to lead tri-service investment planning and joint T&E Reliance efforts as directed by the Service Secretaries."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.911"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.911"
                                            },
                                            "Text": {
                                                "val": "IMTTC will continue to install and integrate hardware and software enhancements for TCC and 16T Test Article Control System (TACS).\n\nVCSU Program will continue to migrate voice systems for multiple mission control rooms.\n\nCRIIS Production will complete Lot 2 and start Lot 3 procurement of OSD CTEIP developed CRIIS TSPI increment two pods, aircraft internal mounts and ground support infrastructure.\n\nLanding Gear Test Facility - Large Dynamometer Replacement (LGTF-LDRP) will begin study and design efforts for dynamometer replacement at the LGTF.\n\nIntegrated Networked Enhanced Telemetry Systems integration support program will initialize and procure the first aircraft to be migrated to the iNET System.\n\nCANIS will continue supporting and complementing the CTEIP funded iNET Program by implementing the airborne solutions. FY19 activity will include completing the implementation of spirals 0, 1, and 2 of the CANIS acquisition approach.\n\nNGTETC will continue upgrades to exhaust coolers, compressor inbleed, power and thermal management systems.\n\nIMTPC will continue to restore the capabilities of the main drive motors (rewind main drive motors M1 and M4), C1 compressor (replace both C1 compressor rotor blades and spacers), main drive motor sub-systems (refurbish\/replace), C1 compressor sub-systems (refurbish\/replace), and the electrical support systems (refurbish\/replace primary Propulsion Wind Tunnel (PWT) facility main drive electrical utilities) to original specifications.\n\nMMCRU will continue software development and roll out and integration of control room displays across multiple control rooms.\n\nWind Tunnel 16S Reactivation efforts will begin to bring the wind tunnel back online to support future test efforts.\n\nAdvanced Small Military High Speed Engine Capability (AMSC) will begin Phase II procurement and integration to accommodate future test efforts.\n\nPre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts.\n\nThe Joint Simulation Environment (JSE) program will begin planning and study efforts to create a USAF high fidelity simulation capability accreditable for test as a supplement to open air environments. As part of the effort, two MILCON facilities will be built for developmental and operational test use.  Planning and design will begin in FY19. (In accordance with Public Law 114-92, November 25, 2015-National Defense Authorization Act for Fiscal Year 2016 Sec. 2803b, Congressional authorization is required prior to the start of planning and design work. 1391s attached.)"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$1.273 million decrease from FY 2018 to FY 2019 due to the reduced funding of CRIIS, IMTTC, IMTPC and inflation adjustment; completion of ALMEC and LGTF Upgrade in FY18; and increased funding for the reactivation of Wind Tunnel 16s, ALMEC Phase II, iNET Systems Integration and Support and various smaller efforts. The JSE program received $3.0 million for a FY 2019 start."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament\/Munitions T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate Armament\/Munitions (A\/M)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.361"
                                            },
                                            "Text": {
                                                "val": "CHSHR EO\/IR Imaging will complete implementation of autonomous designs to B-70 and C-72; acquire and modernize mobile optical tracking systems; complete evaluation of ultra-high speed camera options for hypersonic speed testing on the high-speed test track.\n\nNGMTE will continue to upgrade aging gun and munitions test infrastructure, develop and procure common data instrumentation and acquisition systems, and replace environmental test chambers\/facilities supporting gun and arena test capabilities.\n\nHHSST Gantry Crane project will complete the delivery and integration of the new gantry crane."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.280"
                                            },
                                            "Text": {
                                                "val": "NGMTE will complete upgrades to aging gun and munitions test infrastructure, development and procurement of common data instrumentation and acquisition systems, and replacement of environmental test chambers\/facilities supporting gun and arena test capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.581"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.581"
                                            },
                                            "Text": {
                                                "val": "NGMTE will complete upgrades to aging gun and munitions test infrastructure, development and procurement of common data instrumentation and acquisition systems, and replacement of environmental test chambers\/facilities supporting gun and arena test capabilities.\n\nGulf Range Enhancement (GRE) begins measured implementation to extend TSPI capabilities south into the Gulf Range for expanded use of the airspace for increased throughput of flight test efforts as well as to support future hypersonic, swarming autonomous vehicles, and LRSO test efforts.\n\nPre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$3.301 million increase from FY 2018 to FY 2019 due to: decreased funding of NGMTE ($2.68 million) and $0.039 million decrease for inflation adjustment; and increased funding to GRE ($5.17 million) and Advanced Multi-Spectral Development (AMD) ($0.85 million)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "C4ISR T&E I&M"
                                    },
                                    "Description": {
                                        "val": "Improvement and modernization of the AF capability to test and evaluate C4ISR"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.125"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will continue C4ISR test network upgrades to C4ISR system hardware and software, and replace outdated network infrastructure.\n \nThe CDTC project will complete the study to develop a detailed implementation methodology for the DoD cybersecurity T&E process, and identify manpower requirements and develop a test investment roadmap."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.410"
                                            },
                                            "Text": {
                                                "val": "Improved Command and Control Test Operations Center (I-C2TOC) will continue development of secure network infrastructure and initiate procurement of software and hardware servers and workstations needed to enhance net-centric C2 battle management operations and test control capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities supporting C4ISR end-to-end weapon system testing at Eglin AFB.\n\nThe Cyber Defense Test Capability (CDTC) project will continue in FY18. During this phase, implementation of the plan for acquiring and training the workforce necessary for executing the cyber T&E process will begin.\n\nThe Weapon System Cyber Resiliency (WSCR) team will begin requirements definitization and development of acquisition strategies.  In addition, it will conduct advance planning for a future cyber test facility and possibly planning and design of if MILCON funds are identified.\n\nThe Cyber DT\/OT Range (CDORG) will begin with requirements definitization and development of acquisition strategies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.064"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.064"
                                            },
                                            "Text": {
                                                "val": "I-C2TOC will continue development of secure network infrastructure and initiate procurement of software and hardware servers and workstations needed to enhance net-centric C2 battle management operations and test control capabilities, improve communication interfaces and data collection, handling, analysis and display capabilities supporting C4ISR end-to-end weapon system testing at Eglin AFB. \n\nCDTC will continue in FY19. During this phase the plan for acquiring and training the workforce necessary for cybersecurity test and evaluation will continue.\n\nThe planning and design phase for the new cyber test facility will begin. (In accordance with Public Law 114-92, November 25, 2015, National Defense Authorization Act for Fiscal Year 2016, Sec. 2803b, Congressional authorization is required prior to the start of planning and design work. 1391 attached.)\n\nCybersecurity DT\/OT Range (CDORG) will continue defining requirements and development of acquisition strategies necessary to support cybersecurity range efforts.\n\nImproved Data Links (IDL) will begin studies and pre-acquisition work for test solutions for Fourth Gen aircraft systems.\n\nAdvanced Multi-Spectral Development (AMD) will begin initial planning for hardware in the loop test system for the Guided Weapons Facility.\n\nPre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$5.654 million increase from FY 2018 to FY 2019 due to: decreased funding of CDTC ($1.50 million) WSCS ($3.50 million) and inflation adjustment ($0.178 million); and increased funding to CDORG ($0.08 million), IDL ($0.90 million) and cyber-related projects ($9.852 million)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space"
                                    },
                                    "Description": {
                                        "val": "Space provides planning, improvements, and modernization needed for test capabilities to perform developmental and operational testing for space and launch acquisition and sustainment programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Not applicable; effort starts in FY 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.288"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.288"
                                            },
                                            "Text": {
                                                "val": "Pre-Milestone A Studies and Proof of Concepts will be implemented as required to improve future I&M acquisition efforts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$1.288 million increase due to initial need to perform studies for space test requirements and decrease due to inflation adjustment."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0604256F"
                                    },
                                    "Title": {
                                        "val": "Threat Simulator Development"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "21.377"
                                        },
                                        "CurrentYear": {
                                            "val": "35.405"
                                        },
                                        "BudgetYearOne": {
                                            "val": "34.256"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "34.256"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.393"
                                        },
                                        "BudgetYearThree": {
                                            "val": "42.925"
                                        },
                                        "BudgetYearFour": {
                                            "val": "29.444"
                                        },
                                        "BudgetYearFive": {
                                            "val": "29.977"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605807F"
                                    },
                                    "Title": {
                                        "val": "Test and Evaluation Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "676.417"
                                        },
                                        "CurrentYear": {
                                            "val": "678.289"
                                        },
                                        "BudgetYearOne": {
                                            "val": "692.784"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "692.784"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "719.900"
                                        },
                                        "BudgetYearThree": {
                                            "val": "726.015"
                                        },
                                        "BudgetYearFour": {
                                            "val": "760.319"
                                        },
                                        "BudgetYearFive": {
                                            "val": "737.765"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605976F"
                                    },
                                    "Title": {
                                        "val": "Facility Restoration & Modernization - T&E"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "134.111"
                                        },
                                        "CurrentYear": {
                                            "val": "135.507"
                                        },
                                        "BudgetYearOne": {
                                            "val": "162.216"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "162.216"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "88.445"
                                        },
                                        "BudgetYearThree": {
                                            "val": "69.293"
                                        },
                                        "BudgetYearFour": {
                                            "val": "70.730"
                                        },
                                        "BudgetYearFive": {
                                            "val": "72.019"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 06 PE 0605978F"
                                    },
                                    "Title": {
                                        "val": "Facility Sustainment - T&E Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "28.091"
                                        },
                                        "CurrentYear": {
                                            "val": "28.720"
                                        },
                                        "BudgetYearOne": {
                                            "val": "28.888"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "28.888"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "29.424"
                                        },
                                        "BudgetYearThree": {
                                            "val": "29.935"
                                        },
                                        "BudgetYearFour": {
                                            "val": "30.555"
                                        },
                                        "BudgetYearFive": {
                                            "val": "31.112"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}