{
    "id": "2019-AirForce-PB-3600-MJBOOK-0-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-20",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603270F"
        },
        "ProgramElementTitle": {
            "val": "Electronic Combat Technology"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "64.591"
            },
            "CurrentYear": {
                "val": "60.551"
            },
            "BudgetYearOne": {
                "val": "55.319"
            },
            "BudgetYearOneBase": {
                "val": "55.319"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "57.501"
            },
            "BudgetYearThree": {
                "val": "58.359"
            },
            "BudgetYearFour": {
                "val": "58.123"
            },
            "BudgetYearFive": {
                "val": "58.580"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates technologies to support Air Force electronic combat warfighting capabilities. The program focuses on developing components, subsystems, and technologies with potential aerospace combat, special operations, and airlift electronic combat applications. It develops and demonstrates technologies for integrating electronic combat sensors and systems into a fused and seamless whole. It integrates and focuses research efforts in electronic warfare and cyber warfare to rapidly demonstrate a capability for rapid fielding. It develops and demonstrates technologies for navigation and timing in radio frequency (RF)\ncontested and denied environments. It develops and demonstrates advanced technologies for RF electronic combat suites and advanced warning and countermeasure technologies to defeat electro-optical, infrared, and laser threats to aerospace platforms. It also develops and demonstrates technologies that identify and mitigate avionics system cyber vulnerabilities as well as protects avionics and other critical technologies. This program has been coordinated through the Department of Defense (DoD) Science and Technology (S&T) Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F,  and 0602298F.\"\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.250"
                },
                "CurrentYear": {
                    "val": "60.551"
                },
                "BudgetYearOne": {
                    "val": "61.945"
                },
                "BudgetYearOneBase": {
                    "val": "61.945"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "64.591"
                },
                "CurrentYear": {
                    "val": "60.551"
                },
                "BudgetYearOne": {
                    "val": "55.319"
                },
                "BudgetYearOneBase": {
                    "val": "55.319"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "6.341"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-6.626"
                },
                "BudgetYearOneBase": {
                    "val": "-6.626"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "7.900"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.559"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-6.626"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.626"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 due to realignment of Electronic Combat Technology Science and Technology (S&T) Advanced Technology Development activities to Aerospace Sensors S&T Applied Research."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "633720"
                    },
                    "ProjectTitle": {
                        "val": "EW Quick Reaction Capabilities"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "36.742"
                        },
                        "CurrentYear": {
                            "val": "31.254"
                        },
                        "BudgetYearOne": {
                            "val": "30.821"
                        },
                        "BudgetYearOneBase": {
                            "val": "30.821"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "34.444"
                        },
                        "BudgetYearThree": {
                            "val": "36.392"
                        },
                        "BudgetYearFour": {
                            "val": "33.652"
                        },
                        "BudgetYearFive": {
                            "val": "33.854"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project establishes a capability to rapidly assess, develop and demonstrate new electronic warfare concepts, techniques, and capabilities as well as the required position navigation and timing (PNT) technologies and capabilities in the context of systemic electronic warfare (EW) effects (EW-threat interactions) in a congested\/contested electromagnetic spectrum, system-of-systems (SoS) environment of the future. It develops disruptive EW and countermeasures concepts specifically selected for high-impact, game-changing effects; evaluates them in high fidelity virtual and hardware evaluation settings; and demonstrates them in an operationally relevant environment.  It establishes and maintains an all-source, physics-based, threat-to-countermeasures EW systems engineering methodology. It develops a core analytic function, supported by simulation-based wargaming and interactive engineering modeling capabilities to evaluate advanced countermeasures concepts."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Radio Frequency Electronic Warfare"
                                    },
                                    "Description": {
                                        "val": "Develop Electronic Warfare focused knowledge databases, engineering models, mission simulations, analysis tools and assessment environments which enable the development of multi-domain electronic warfare technologies.  The primary focus is on emulating complex battlespace radio frequency environments, electronic attack effects against emerging, networked weapon systems, and assessing flexible, software-defined electronic warfare systems with non-deterministic performance (for example, utilizing cognitive algorithms).\n\nThis effort is being renamed from Disruptive Electronic Warfare and Countermeasure Technologies to better align project and thrusts with functional areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.055"
                                            },
                                            "Text": {
                                                "val": "Continue to develop capability to use RF electronic attack (EA) techniques to deliver cyber effects. Continue supporting the cyber efforts in Project 634335, Cyber Concepts, to model cyber effects on an integrated\nair defense system and simulate their utility. Continue to develop, integrate and demonstrate required navigation and timing technologies required for distributed EA concepts. Continue to develop and evaluate\ncountermeasures to adversary use of satellite navigation. Continue to integrate RF\/IR sensors to improve situational awareness and self protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.943"
                                            },
                                            "Text": {
                                                "val": "Conduct sense, learn, and adapt demonstrations illustrating advancements in electromagnetic spectrum awareness, reasoning, and collaborative effects. Demonstrate advanced counter satellite position, navigation and timing techniques in an operational environment. Begin the development and demonstration efforts to prove the concepts for \"full spectrum” countermeasures capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.600"
                                            },
                                            "Text": {
                                                "val": "Continue expansion of simulations to accommodate advanced electronic warfare systems, and to emulate the radio frequency threats and signal environments for which they're designed.  Develop higher fidelity threat system and signal propagation models.  Continue developing the tools, methods and demonstrations to assess both the performance of future electronic warfare systems as well as their effectiveness.  Continue the development and demonstration efforts to prove the concepts for \"full spectrum” countermeasures capabilities.  In select situations, develop threat seeker surrogates with which to test emerging electronic warfare technologies.  Expand software-in-the-loop and hardware-in-the-loop environments to achieve closed-loop system performance.\n\nPrevious to FY 2019, Position, navigation and timing technology development was performed in Project 633720, Electronic Warfare Capabilities, Position, Navigation and Timing for Contested\/Denied Environments Effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $4.343 million.  Justification for the decrease is due to realignment of Electronic Combat Technology Science and Technology (S&T) Advanced Technology Development to Aerospace Sensors S&T Applied Research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Position, Navigation and Timing for Contested\/Denied Environments"
                                    },
                                    "Description": {
                                        "val": "Develop and transition robust Global Navigation Satellite System capabilities; resilient complementary position, navigation and timing techniques; precise position, navigation and timing technologies for distributed sensing; position, navigation and timing technology to provide position, navigation and timing electronic warfare situational awareness and training; and position, navigation and timing architectures to enable resiliency against the rapidly evolving threat. Efforts will include prototypes and relevant Open Architecture standards where applicable to enable timely technology transition.\n \nThis effort is being renamed from Threat-to-Countermeasure SoS Methods to better align project and thrusts with functional areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.052"
                                            },
                                            "Text": {
                                                "val": "Continue to use system engineering analysis techniques to identify the requirements for SoS operations in anti-access\/area-denial (A2\/AD) environments. Specifically work toward showing how EW techniques and\ncapabilities can be modeled and show support of mission operations (such as Intelligence Surveillance Reconnaissance (IRS) or strike) in A2\/AD scenarios. Continue to develop, integrate and demonstrate required navigation technologies required for SoS operations in\nA2\/AD environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.089"
                                            },
                                            "Text": {
                                                "val": "Demonstrate robust distributed time transfer in a Global Positioning System jamming environment. Develop \/ evolve position, navigation and timing open architecture standards to enable resiliency to position, navigation and timing threats. Demonstrate effects of a coordinated electronic attack capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.425"
                                            },
                                            "Text": {
                                                "val": "Research techniques to securely certify Global Navigation Satellite System software defined radio technology and methods to trust Global Navigation Satellite System. Develop complementary position, navigation and timing techniques which increase the availability of the position, navigation and timing solution as well as increase the precision for radio frequency coherent sensing and electronic warfare. Evolve open architecture standards to allow for integration of Global Navigation Satellite System and complementary position, navigation and timing into future systems.  Demonstrate integration of Global Navigation Satellite System position, navigation and timing and datalink-based complementary position, navigation and timing into an resilient embedded Global Positioning System inertial government reference architecture.\n\nPrevious to FY 2019, some of this work was performed in Project 633720, Electronic Warfare Capability, efforts Radio Frequency Electronic Warfare and Electro-Optical and Infrared (EO\/IR) Threat Warning and Countermeasures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $8.336 million.  Justification for the increase is due to realignment of work from Radio Frequency Electronic Warfare and Electro-Optical and Infrared (EO\/IR) Threat Warning and Countermeasures efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electro-Optical\/Infrared Threat Warning and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "Develop next generation countermeasure techniques to address the complete range of multispectral (for example, dual band infrared) threats including advanced techniques versus advanced man portable air defense system and air-to-air threats with multimode capabilities.  Develop capabilities for situational awareness and countermeasure to integrated air defense systems and associated multispectral threats.\n\nThis effort is being renamed from Evaluation of Advanced Countermeasure Concepts to better align project and thrusts with funding in functional areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.635"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the navigation work in this effort was performed in Program 0603203F, Advanced Aerospace Sensors, Project 63655A, Advanced Aerospace Sensors Technology, under the effort Integrated Navigation Technologies.\nFor FY2017 and beyond, the advanced cyber technology work accomplished under this effort will be reported in Project 634335, Cyber Concepts, under the efforts, Avionics Cyber Vulnerabilities and Avionics Cyber\nProtections. Continue development, integration and demonstration of required navigation technologies required for operations in contested and denied environments. Develop adaptable threat emulation capability to simulate modern and expected threats for future conflicts. Use these simulations to assess blue force hardware against these future red force systems. Conduct flight tests of the MISA system. Analyze the data and refine the requirements for AFSOC scenarios. Begin the data collection and analysis of the advanced defeat concepts for imaging sensors. Refine requirements for lasers required to defeat this threat class."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.222"
                                            },
                                            "Text": {
                                                "val": "Continue data collection on advanced imaging sensor defeat mechanisms and conduct requirements trades for system transition architectures. Continue the development of advanced missile warning technologies for long-range detection. Demonstrate adaptable threat emulation capability to simulate modern and expected future electronic warfare threats. Demonstrate trusted use of foreign satellite position, navigation and timing signals through signal authentication techniques, constellation signal monitoring and data dissemination, and jamming countermeasure techniques. Address size, weight and power requirements for application to the whole range of Air Force platforms. Begin the incorporation of the proactive situational awareness and countermeasures capabilities into engagement models."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.796"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.796"
                                            },
                                            "Text": {
                                                "val": "Continue test planning and field and flight tests of a proactive infrared countermeasure capability to detect ground based electro-optical\/infrared threats. Continue the integration of joint radio frequency and electro-optical\/infrared engagement modeling and simulation capabilities to support countering multispectrum (for example, radio frequency and electro-optical\/infrared combined) threats.  Continue designs and begin field test demonstration of capabilities against multispectral threats.  Refine the countermeasure techniques and sources for countermeasures against advanced imaging multispectral sensors to include tower testing against surrogates and representative threats hardware.\n\nPrevious to FY 2019, Position, navigation and timing technology development was performed in Project 633720, EW Capabilities, Position, Navigation and Timing for Contested\/Denied Environments Effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $4.426 million. Justification for the decrease is due to realignment of Electronic Combat Technology Science and Technology (S&T) Advanced Technology Development activities to Aerospace Sensors S&T Applied Research."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63431G"
                    },
                    "ProjectTitle": {
                        "val": "RF Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.671"
                        },
                        "CurrentYear": {
                            "val": "18.284"
                        },
                        "BudgetYearOne": {
                            "val": "14.441"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.441"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.568"
                        },
                        "BudgetYearThree": {
                            "val": "12.255"
                        },
                        "BudgetYearFour": {
                            "val": "12.648"
                        },
                        "BudgetYearFive": {
                            "val": "12.730"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates advanced technologies for radio frequency electronic combat suites, including the required navigation technologies and capabilities, to enhance the survivability of aerospace vehicles and to provide crew situational awareness. The research addresses technologies for missile\/threat warning, radio frequency receivers, electronic combat pre-processors, advanced sorting\/pre-processing algorithms, and expert software for applications on existing and future electronic combat systems. The research also focuses on the development and demonstration of subsystems and components for generating on-board\/off-board radio frequency countermeasure techniques. This includes the development of electronic countermeasures techniques, as well as advanced electronic countermeasures technologies such as antennas, power amplifiers, and preamplifiers."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Attack"
                                    },
                                    "Description": {
                                        "val": "Develop aerospace platform jamming concepts, technologies and techniques to counter advanced radio frequency threats associated with current and future aerospace weapon systems. Provide position, navigation and system resilience via open architecture solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.671"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the navigation work in this effort originally was performed in Program 0603203F, Advanced Aerospace Sensors, Project 63655A, Advanced Aerospace Sensors Technology, under the effort Integrated Navigation Technologies. Continue to collect and analyze high fidelity RF data representative of airborne high threat engagements. Continue to develop\nconcepts\/techniques and advanced EA methods (techniques and employment) against modern threats to close the loop allowing a more optimized EA effectiveness. Perform demonstrations and assessments in cognitive machine learning from Air Force,DARPA and industry that measure improved abilities to autonomously identify modern adaptive programmable threats. Develop algorithms for vision aiding the navigation solution in a targeting pod. Initiate an external industry-led project in advanced EW receiver algorithms and architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.284"
                                            },
                                            "Text": {
                                                "val": "Continue efforts in advanced electronic warfare receiver algorithms and architectures, as well as machine learning (\"cognitive”) algorithms. Continue research into innovative electronic attack concepts\/techniques including use of closed loop, cooperatively controlled, distributed unmanned aerial vehicles and their performance against integrated air defense networks and adaptable techniques for use against any threats. Fabricate and demonstrate an advanced capability electronic attack pod against emerging, high priority threats. Develop, integrate and demonstrate distributed electronic attack concepts and their required position, navigation, timing and datalink technologies. Demonstrate integration of position, navigation and timing signals of opportunity and vision aiding into a resilient embedded Global Positioning System inertial system prototype."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.441"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.441"
                                            },
                                            "Text": {
                                                "val": "Continue research into radio frequency receiver technologies that will better detect threats, measure more radio frequency features with greater accuracy, identify or classify signals more reliably, track and predict signals, and use reasoning algorithms to reduce ambiguities and errors, and deduce greater knowledge from the radio frequency spectrum.  Continue development of countermeasures toward explicit, underserviced threat weapon systems, with an emphasis on chamber and field testing for validation.  Continue research and development of novel multi-domain electronic attack methods and tactics to include distributed operations.  Initiate the study, research and\/or development of merged autonomy and electronic warfare technologies.  Continue expansion of modeling, simulation and laboratory assessment environments commensurate with technologies being researched, developed and tested."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $3.843 million.  Justification for the decrease is due to realignment of Electronic Combat Technology Science and Technology (S&T) Advanced Technology Development activities to Aerospace Sensors S&T Applied Research."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "634335"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Concepts"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.095"
                        },
                        "CurrentYear": {
                            "val": "6.087"
                        },
                        "BudgetYearOne": {
                            "val": "5.832"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.832"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.129"
                        },
                        "BudgetYearThree": {
                            "val": "5.261"
                        },
                        "BudgetYearFour": {
                            "val": "7.236"
                        },
                        "BudgetYearFive": {
                            "val": "7.382"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates methods to discover cyber susceptibilities, assess avionics systems, formulate mitigation strategies, and investigate use of tools and technologies to automate this process. It is designed to apply developed vulnerability discovery, vulnerability mitigation, and cyber protection technology to avionics systems and components and embedded systems. This involves technologies for trusted sensors and trusted systems that deter exploitation of our critical hardware and software. This project aims to develop cyber resilience and protect systems through adaptation of the system to the threat.  It demonstrates these technologies in open and adaptable architectures for system integration in field demonstrations and proves out the technologies through rapid integration of sensors and architectures for technology transition. It integrates research efforts in electronic and cyber warfare to rapidly demonstrate a capability for rapid fielding."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Vulnerabilities"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate methods, techniques, and technical tools to enable, assist, and improve the vulnerability discovery processes. Use developed tools and techniques to assess avionics boxes, systems, busses, and components. Investigate techniques to mitigate discovered vulnerabilities.  Develop and demonstrate mitigation and protection technologies on future concept platforms for adaptability and resilience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.275"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort originally was performed in Project 633720, EW Quick Reaction Capabilities, under the effort Evaluation of Advanced Countermeasure Concepts.\n\nPrototype and demonstrate a series of cyber testing tools that assess vulnerabilities related to deficiencies in traditional testing (i.e. positive testing) that does not consider cyber effects.  Assess USAF platforms (manned, unmanned aircraft) and weapon systems for specific cyber vulnerabilities and develop avionics enhancements to increase security and resiliency."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.382"
                                            },
                                            "Text": {
                                                "val": "Continue vulnerability investigations with the intent to provide a standardized methodology for discovery and set of tools for performing a thorough cyber vulnerability assessment of a weapon system. Transition assessment tools to Department of Defense test communities. Continue to develop and transition mitigation technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.241"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Complete transition of assessment tools and continue to develop and transition mitigation technologies.  Investigate and advance architectural concepts that enable cost-effective and rapid integration of revolutionary sensor capabilities.  This allows system flexibility required for future operations. Architecture includes features to make it cyber secure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.141 million.  Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Avionics Cyber Protections"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced automated analysis tools and protection techniques to prevent exploitation of cyber susceptibilities in avionics systems.  This strategy would include discovery and mitigation of likely attack vectors, remediation of susceptibilities, and safeguards to assure the integrity of embedded software."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.820"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort originally was performed in Project 633720, EW Quick Reaction Capabilities, under the effort Evaluation of Advanced Countermeasure Concepts.\n\nPrototype and demonstrate a suite of protection tools composed of application, operating system kernel, hypervisor and hardware-assisted technologies to provide defense-in-depth of avionics, sensors, and weapon systems. This demonstration will focus on protections for a representative intelligence surveillance and reconnaissance (ISR) platform.  Develop a patterns database that detects and classifies benign and malicious behaviors, and validate proof-of-concept for x86 computer architectures.  Create other architecture specific translators (e.g. PowerPC) to further validate concept."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.705"
                                            },
                                            "Text": {
                                                "val": "Continue to extend research on a suite of protection tools with focus on their application to unmanned aircraft system platforms. Prototype and demonstrate a platform independent malware feature selection capability. Investigate automation and optimization of malware detection and classification work using machine learning techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.591"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.591"
                                            },
                                            "Text": {
                                                "val": "Continue to extend research on a suite of protection tools with focus on their application to unmanned aircraft system platforms. Continue to investigate automation and optimization of malware detection and classification work using machine learning techniques.  Develop a patterns database that detects and classifies benign and malicious behaviors, and validate proof-of-concept for x86 computer architectures. Investigate and create architecture specific translators to provide input to behaviors database to further validate the concept."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.114 million.  Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63691X"
                    },
                    "ProjectTitle": {
                        "val": "EO\/IR Warning & Countermeasures Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.083"
                        },
                        "CurrentYear": {
                            "val": "4.926"
                        },
                        "BudgetYearOne": {
                            "val": "4.225"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.225"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "4.360"
                        },
                        "BudgetYearThree": {
                            "val": "4.451"
                        },
                        "BudgetYearFour": {
                            "val": "4.587"
                        },
                        "BudgetYearFive": {
                            "val": "4.614"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops and demonstrates the advanced warning and countermeasure technologies required to negate electro-optical\/infrared and laser threats to aerospace platforms.  Develops off-board (decoys and expendables) and on-board countermeasure technologies for aircraft self-protection to provide robust, affordable solutions for protection against infrared missiles with autonomous seekers, multi-spectral threats, laser-guided weapons, and electro-optical\/infrared tracking systems used to direct electro-optical\/infrared and radar-guided missiles."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electro-Optical\/Infrared Warning and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "Analyze the vulnerabilities of current infrared missile systems and future imaging infrared sensors. Develop advanced countermeasure system techniques to exploit vulnerabilities for use against infrared and electro-optical guided missile threats. Develop advanced optical and infrared sensor systems for airborne and space situational awareness and threat warning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.083"
                                            },
                                            "Text": {
                                                "val": "Develop advanced capability to defeat imaging optical sensors across the EO spectrum from ultra-violet (UV) to long-wave infrared wavelengths. Investigate low size, weight, power, and cost systems for smaller\/expendable platforms to enhance their survivability in active threat areas using the modeling and HWIL simulation capability established through this funding area.  Perform verification and validation activities utilizing the MOdeling System for Advanced Investigation of Countermeasures (MOSAIC), infrared countermeasure (IRCM) engagement model and correlate results with the Guided Weapon Evaluation Facility and the US Navy laboratories at China Lake."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.926"
                                            },
                                            "Text": {
                                                "val": "Continue characterization and exploitation of newly acquired advanced threats. Standup new lab space to perform characterization and countermeasure development of these new threats. Refine the imaging threat surrogates based on data collected from countermeasures flight tests and update the Modeling System for Advanced Investigation of Countermeasures engagement model with new surrogate information. Continue working with the Guided Weapons Evaluation Facility to develop high fidelity jam codes and to correlate the modeling and simulation with hardware-in-the-loop and live fire results.  Finalize the Modeling System for Advanced Investigation of Countermeasures verification, validation, & accreditation activities to support programs of record.  Begin to insert proactive capabilities into Modeling System for Advanced Investigation of Countermeasures. Continue the fabrication of the low cost missile system and plan for flight and live fire test.  Begin analysis on options for next generation long range missile warning sensor for future capabilities. Conduct an analysis of alternatives for laser warning for air and space platforms and plan for field and flight tests. Continue to refine the tower proactive testbed by evaluating additional high sensitivity focal plane array options.  Begin plans for proactive critical field tests that incorporates information from mid-infrared situational awareness and the tower testbed. Begin planning for a multifunction proactive countermeasure critical experiment"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.225"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.225"
                                            },
                                            "Text": {
                                                "val": "Continue countermeasure development and field testing of new threats to include new jam codes and countermeasure techniques.  Continue to incorporate proactive infrared countermeasures capabilities into Modeling System for Advanced Investigation of Countermeasures.  Flight test the low cost missile warning capabilities and refine design alternative and conduct critical experiments for long range missile warning.  Stand up the High altitude threat warning capabilities and begin characterization testing for advanced laser warning options.  Start design and tradeoff phase for the proactive critical experiment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.701 million.  Justification for the decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}