{
    "id": "2019-AirForce-PB-3600-MJBOOK-1-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-67",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605221F"
        },
        "ProgramElementTitle": {
            "val": "KC-46"
        },
        "R1LineNumber": {
            "val": "97"
        },
        "MdapCode": {
            "val": "387"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "5380.881"
            },
            "PriorYear": {
                "val": "211.509"
            },
            "CurrentYear": {
                "val": "93.845"
            },
            "BudgetYearOne": {
                "val": "88.170"
            },
            "BudgetYearOneBase": {
                "val": "88.170"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "79.722"
            },
            "BudgetYearThree": {
                "val": "20.660"
            },
            "BudgetYearFour": {
                "val": "13.419"
            },
            "BudgetYearFive": {
                "val": "13.662"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "5901.868"
            }
        },
        "ProgramElementNote": {
            "val": "This program, BA 5, PE 0605221F, project 651120, Avionics Enhancements, is a new start."
        },
        "ProgramElementMissionDescription": {
            "val": "Replacement of the legacy tanker fleet will take place in several stages.  The initial tanker replacement increment of KC-46s will replace roughly a third of the current capability.  Future programs will ultimately recapitalize the entire tanker fleet over a period of more than 30 years.  The Air Force completed an Analysis of Alternatives (AoA) in Apr 2006 to determine the most appropriate strategy to recapitalize the aging fleet of aerial refueling aircraft.  Based on this analysis, the Air Force concluded a strategy of full and open competition to select a commercial derivative replacement tanker aircraft would result in a best value tanker contract.  To initiate the first phase of the tanker replacement, the KC-46 program released a final Request for Proposal (RFP) on 24 Feb 2010, and entered source selection on 9 Jul 2010.  The KC-46 program held a Milestone B (MS B) Defense Acquisition Board (DAB) on 23 Feb 2011, received approval to enter Engineering and Manufacturing Development (EMD) from the Undersecretary of Defense (Acquisition, Technology and Logistics) (USD(AT&L)) on 24 Feb 2011, and awarded the KC-46 EMD contract to Boeing on 24 Feb 2011 to develop and procure 179 KC-46 aircraft.  The program is procuring four RDT&E aircraft for integration and demonstration of capability which will ultimately be operationally fielded.  During production, the program plans to procure 175 aircraft throughout 13 lots.  The KC-46 program held a MS C DAB on 12 Aug 2016 and received approval to enter Low Rate Initial Production (LRIP).  The program awarded LRIP Lots 1 and 2 on 18 Aug 2016 and LRIP Lot 3 on 27 Jan 2017, totaling 34 aircraft.  KC-46 funding also supports Training Systems, Direct Mission Support, Program Management Administration (PMA) activities, government developmental and operational test support, mission planning capability development, various studies and analyses, engineering changes, and future tanker replacement planning activities.\n\nThe KC-46 will provide the capability to fuel joint and coalition receivers via a boom or drogue system on every mission and will also augment the airlift fleet with cargo, passenger, and aeromedical evacuation capabilities.  The KC-46 will operate in day\/night and adverse weather conditions to enable deployment, employment, sustainment, and redeployment of U.S. joint, allied, and coalition forces.  The KC-46 will have communication, navigation, and surveillance equipment for worldwide operations; the capability to perform missions in chemical and biological environments; the ability to operate in up to medium threat environments with self-defense\/protection (both active and passive) capabilities; and the necessary battlespace awareness to mitigate survivability threats.\n\nThe Aircrew Training System (ATS) and the Maintenance Training System (MTS) are being developed and procured using KC-46 funding.  The ATS contract was awarded on 1 May 2013 to FlightSafety Services Corporation.  The ATS contract will provide Aircrew Training Devices (ATDs), to include Weapon System Trainers (WSTs), Boom Operator Trainers (BOTs), Fuselage Trainers (FuTs), and Part-Task Trainers (PTTs) at each Main Operating Base (MOB) and the Formal Training Unit (FTU).  The ATS contract will also support Distributed Mission Operations (DMO), provide aircrew instruction, develop courseware, provide logistics support, acquire a technical data package to support future competition efforts, and manage training device concurrency with the aircraft.  \n\nThe MTS contract was awarded 6 Jul 2016 to The Boeing Company.  The MTS acquisition focuses on designing, developing, testing, producing, and fielding an optimized training system for KC-46 maintainers by integrating various forms of training media and Maintenance Training Devices (MTDs) into a \"blended\" solution.  This blended solution includes the appropriate mix of hardware and software, \"high-fidelity\" Augmented Hardware Training Devices (AHTDs), PTTs, Interactive Multimedia Instruction (IMI), and emerging technologies to meet validated Air Mobility Command (AMC) maintenance training requirements.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver KC-46 weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, and 0605898F.\n\nThis program is in Budget Activity 05, System Development and Demonstration (SDD), because it passed MS C approval and is conducting engineering and manufacturing development tasks aimed at meeting validated requirements prior to full-rate production."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "261.724"
                },
                "CurrentYear": {
                    "val": "93.845"
                },
                "BudgetYearOne": {
                    "val": "47.740"
                },
                "BudgetYearOneBase": {
                    "val": "47.740"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "211.509"
                },
                "CurrentYear": {
                    "val": "93.845"
                },
                "BudgetYearOne": {
                    "val": "88.170"
                },
                "BudgetYearOneBase": {
                    "val": "88.170"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-50.215"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "40.430"
                },
                "BudgetYearOneBase": {
                    "val": "40.430"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "-31.800"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-10.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-8.415"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "40.430"
                                },
                                "BudgetYearOneBase": {
                                    "val": "40.430"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 budget authority reflects a Congressional rescission of $31.8M, Reprogramming actions of $10.0M, and Small Business Innovation Research (SBIR) amount of $8.4M.\n\nThe FY 2019 budget authority reflects $41.1M Zero Balance Transfer (ZBT) from KC-46 Procurement and -$0.5M non-pay\/non-fuel inflation adjustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "651120"
                    },
                    "ProjectTitle": {
                        "val": "Pegasus Capability Improvements"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.503"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.503"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "15.074"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.577"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "This program, BA 5, PE 0605221F, project 651120, Avionics Enhancements, is a new start."
                        },
                        "ProjectMissionDescription": {
                            "val": "The KC-46 will provide the capability to fuel joint and coalition receivers via a boom or drogue system on every mission and will also augment the airlift fleet with cargo, passenger, and aeromedical evacuation capabilities.  The KC-46 will operate in day\/night and adverse weather conditions to enable deployment, employment, sustainment, and redeployment of U.S. joint, allied, and coalition forces.  The KC-46 will have communication, navigation, and surveillance equipment for worldwide operations; the capability to perform missions in chemical and biological environments; the ability to operate in up to medium threat environments with self-defense\/protection (both active and passive) capabilities; and the necessary battlespace awareness to mitigate survivability threats.\n\nThe dynamics and mission urgency of the post-production environment requires the program to maintain flexible and responsive posture to support a broad range of mission support needs.  The KC-46 will continue to identify, design, develop, integrate, verify, certify, produce, install, field, and sustain a comprehensive range of non-recurring and recurring post-production, air vehicle enhancements and field support needs.  These needs may originate from programmed Mobility Air Force (MAF) requirements, Combatant Commander Joint or Urgent Operational Needs (JUON\/UON), non-programmed Federal Aviation Administration (FAA) directives, requirements identified and supported by HHQ Enterprise Capability Collaboration Teams (i.e. High Value Airborne Asset [HVAA], Air Superiority 2030, and Multi-Domain Command and Control [MDC2]), or correction of deficiency reports.\n\nThe KC-46 will continue to develop, field, and sustain warfighter capabilities to meet evolving threats and mission support requirements through Block or discrete modification or modernization programs depending on mission urgency, available funding, and programmatic and technical risks.  Post-production requirements can include, but will not be limited to, avionics and structural systems\/ architecture and subsystem updates, general mission equipment updates and procurement, general sustainment support, studies and analyses, and correction of field deficiencies. \n\nPublic Law 111-383 (7 JAN 2011) and CJCSI 6130.01E states no funds maybe be obligated or expended to purchase user equipment for the Global Position System during the fiscal years after fiscal year 2017 unless the equipment is capable of receiving military code from the Global Positioning System.  To comply, KC-46 plans to replace the current GPS receiver to provide M-Code capability. \n\nProject 651120 funding will also support Program Management Administration (PMA) activities, test support, mission planning capability development and various studies and analyses."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Avionics Enhancements"
                                    },
                                    "Description": {
                                        "val": "Advanced Communication Enhancements"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.403"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.403"
                                            },
                                            "Text": {
                                                "val": "Upgrades to communication avionics capabilities to include but not limited to Multifunctional Information Distribution Systems (MIDS), Beyond Line-of Sight (BLOS\/LOS) enabled through MUOS and SATURN ARC-210 capabilities, and Communications Gateway Enhancements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY19 PB is the first year of funding for Pegasus Capability Improvements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Support"
                                    },
                                    "Description": {
                                        "val": "Studies and analysis to support planning activities for future initiatives for upgrades and miscellaneous Program Office support and planning.  Also includes requirements such as travel and training."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.100"
                                            },
                                            "Text": {
                                                "val": "Program Office Support and Planning."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY19 PB is the first year of funding for Pegasus Capability Improvements."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 05 41221F\/KC046A"
                                    },
                                    "Title": {
                                        "val": "KC-46A Tanker"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "6.213"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.547"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.547"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "39.394"
                                        },
                                        "BudgetYearThree": {
                                            "val": "71.694"
                                        },
                                        "BudgetYearFour": {
                                            "val": "85.541"
                                        },
                                        "BudgetYearFive": {
                                            "val": "88.749"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The KC-46 Post-Production Change Management (PPCM) construct is comprised of processes and tools, specifically tailored to a broad spectrum of post-production requirements.  PPCM is designed to leverage competition as applicable, and emphasize configuration management and discrete cost accounting methodologies.  KC-46 PPCM oversight will promote competition throughout the life cycle of the KC-46A fleet.  All KC-46 post-production requirements and associated acquisition strategies will be carefully managed, reviewed, and approved at the appropriate levels by the KC-46 Division and\/or Tanker Directorate senior functional leaders.  PPCM requirements will employ multiple contract-types, tailored to the requirement and documented in discrete Acquisition Strategy Panel briefings, to minimize cost, technical, and schedule execution risks and ensure on-time deliverables.  In addition, all ACAT-level programs, deriving from the PPCM process, will follow Department of Defense (DoD) Directive 5000.01 and DoD Instruction 5000.02 guidelines and directives, as applicable, to ensure management controls--commensurate with the scope and cost of the supported requirement."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Capability Upgrades (to include modification and modernization)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.403"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.403"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-06"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Administration - Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Pegasus Capability Improvements"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Avionics Enhancements Contract Award"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "655271"
                    },
                    "ProjectTitle": {
                        "val": "KC-46 RDT&E"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "5380.881"
                        },
                        "PriorYear": {
                            "val": "211.509"
                        },
                        "CurrentYear": {
                            "val": "93.845"
                        },
                        "BudgetYearOne": {
                            "val": "74.667"
                        },
                        "BudgetYearOneBase": {
                            "val": "74.667"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "64.648"
                        },
                        "BudgetYearThree": {
                            "val": "20.660"
                        },
                        "BudgetYearFour": {
                            "val": "13.419"
                        },
                        "BudgetYearFive": {
                            "val": "13.662"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "5873.291"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "4"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Replacement of the legacy tanker fleet will take place in several stages.  The initial tanker replacement increment of KC-46s will replace roughly a third of the current capability.  Future programs will ultimately recapitalize the entire tanker fleet over a period of more than 30 years.  The Air Force completed an Analysis of Alternatives (AoA) in Apr 2006 to determine the most appropriate strategy to recapitalize the aging fleet of aerial refueling aircraft.  Based on this analysis, the Air Force concluded a strategy of full and open competition to select a commercial derivative replacement tanker aircraft would result in a best value tanker contract.  To initiate the first phase of the tanker replacement, the KC-46 program released a final Request for Proposal (RFP) on 24 Feb 2010, and entered source selection on 9 Jul 2010.  The KC-46 program held a Milestone B (MS B) Defense Acquisition Board (DAB) on 23 Feb 2011, received approval to enter Engineering and Manufacturing Development (EMD) from the Undersecretary of Defense (Acquisition, Technology and Logistics) (USD(AT&L)) on 24 Feb 2011, and awarded the KC-46 EMD contract to Boeing on 24 Feb 2011 to develop and procure 179 KC-46 aircraft.  The program is procuring four RDT&E aircraft for integration and demonstration of capability which will ultimately be operationally fielded.  During production, the program plans to procure 175 aircraft throughout 13 lots.  The KC-46 program held a MS C DAB on 12 Aug 2016 and received approval to enter Low Rate Initial Production (LRIP).  The program awarded LRIP Lots 1 and 2 on 18 Aug 2016 and LRIP Lot 3 on 27 Jan 2017, totaling 34 aircraft.  KC-46 funding also supports Training Systems, Direct Mission Support, Program Management Administration (PMA) activities, government developmental and operational test support, mission planning capability development, various studies and analyses, engineering changes, and future tanker replacement planning activities.\n\nThe KC-46 will provide the capability to fuel joint and coalition receivers via a boom or drogue system on every mission and will also augment the airlift fleet with cargo, passenger, and aeromedical evacuation capabilities.  The KC-46 will operate in day\/night and adverse weather conditions to enable deployment, employment, sustainment, and redeployment of U.S. joint, allied, and coalition forces.  The KC-46 will have communication, navigation, and surveillance equipment for worldwide operations; the capability to perform missions in chemical and biological environments; the ability to operate in up to medium threat environments with self-defense\/protection (both active and passive) capabilities; and the necessary battlespace awareness to mitigate survivability threats.\n\nThe Aircrew Training System (ATS) and the Maintenance Training System (MTS) are being developed and procured using KC-46 funding.  The ATS contract was awarded on 1 May 2013 to FlightSafety Services Corporation.  The ATS contract will provide Aircrew Training Devices (ATDs), to include Weapon System Trainers (WSTs), Boom Operator Trainers (BOTs), Fuselage Trainers (FuTs), and Part-Task Trainers (PTTs) at each Main Operating Base (MOB) and the Formal Training Unit (FTU).  The ATS contract will also support Distributed Mission Operations (DMO), provide aircrew instruction, develop courseware, provide logistics support, acquire a technical data package to support future competition efforts, and manage training device concurrency with the aircraft.  \n\nThe MTS contract was awarded 6 Jul 2016 to The Boeing Company.  The MTS acquisition focuses on designing, developing, testing, producing, and fielding an optimized training system for KC-46 maintainers by integrating various forms of training media and Maintenance Training Devices (MTDs) into a \"blended\" solution.  This blended solution includes the appropriate mix of hardware and software, \"high-fidelity\" Augmented Hardware Training Devices (AHTDs), PTTs, Interactive Multimedia Instruction (IMI), and emerging technologies to meet validated Air Mobility Command (AMC) maintenance training requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "KC-46 Aircraft Product Development"
                                    },
                                    "Description": {
                                        "val": "EMD activities will be conducted to include the following types of activities: develop a commercial 767-2C aircraft upon which the KC-46 is based; develop the KC-46 military capability and integrate it into the aircraft; build four EMD aircraft; procure live fire assets; procure required Government Furnished Equipment (GFE); procure simulator and maintenance data; develop technical manuals and Type 1 training; and conduct development and operational testing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.994"
                                            },
                                            "Text": {
                                                "val": "Continue certification\/qualification ground and flight testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "21.866"
                                            },
                                            "Text": {
                                                "val": "Support start of Initial Operational Test and Evaluation (IOT&E). Complete certification\/qualification ground and flight testing and IOT&E."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.461"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.461"
                                            },
                                            "Text": {
                                                "val": "Complete certification\/qualification ground and flight testing and IOT&E."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to completion of various contract studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "KC-46 Trainer Product Development - Aircrew Training System (ATS)"
                                    },
                                    "Description": {
                                        "val": "Trainer development activities will be conducted to include the following types of activities: development and procurement of ATDs, courseware, and associated support equipment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.362"
                                            },
                                            "Text": {
                                                "val": "Begin delivery of courseware and first article ATDs to conduct System Level Formative Evaluation (SLFE). Complete in-plant and on-site testing of ATDs. Conduct simulator validation of ATDs at Altus and McConnell AFBs. Begin Small Group Try-Outs (SGTOs) and SLFE."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Achieve Ready for Training (RFT) at Altus and McConnell Air Force Bases (AFBs). Complete final system level CDR for Increment 2. Complete software integration of all appropriate ATDs. Complete Increment 2 CBT\/IBT courseware development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "The FY18 PB approved budget position for ATS increased slightly to fund contract to ceiling and associated test support in the FY19 PB."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "KC-46 Support"
                                    },
                                    "Description": {
                                        "val": "Development, integration, and demonstration of the KC-46 mission planning capability. In addition, studies and analysis to support planning activities for future efficiency initiatives, business case analyses, future tanker replacement planning, and miscellaneous Program Office support and planning. Also includes requirements such as travel, office supplies, training courses, and service contracts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "43.283"
                                            },
                                            "Text": {
                                                "val": "Complete Phase III option MPE in support of IOT&E start. Award new Avionics, Weapons, and Equipment (AWE) maintenance contract to bridge MPE support through IOT&E. Complete Phase IV MPE option in support of IOT&E. Continue program support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.555"
                                            },
                                            "Text": {
                                                "val": "Complete Mission Planning Environment (MPE) maintenance and updates through IOT&E. Continue program support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.624"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.624"
                                            },
                                            "Text": {
                                                "val": "Continue Program Office Support and Planning."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased due to program office support transitioning to Production."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "KC-46 Test & Evaluation"
                                    },
                                    "Description": {
                                        "val": "Test & Evaluation (T&E) activities will be conducted to include the following types of activities: Development Test & Evaluation, Operational Test & Evaluation, Tanker Qualification, Receiver Certifications, Live Fire Test & Evaluation (LFT&E), Federal Aviation Administration (FAA) support, and other test planning and organizational support."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.069"
                                            },
                                            "Text": {
                                                "val": "Continue T&E planning activities, including preparing for IOT&E. The KC-46 Program plans to utilize a combination of EMD, pre-delivery production, and LRIP aircraft for Developmental Test and IOT&E. Start aerial refueling (AR) tanker-receiver certification. Provide final Live Fire Test and Evaluation report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "47.424"
                                            },
                                            "Text": {
                                                "val": "Continue T&E activities using EMD, pre-delivery production, and\/or LRIP aircraft to support airworthiness certification, specification compliance, and military utility evaluations. Complete planning and preparations for IOT&E. Continue AR tanker-receiver certification testing and begin IOT&E."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.582"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.582"
                                            },
                                            "Text": {
                                                "val": "Continue using EMD, pre-delivery production, and\/or LRIP aircraft to support AR tanker-receiver certification testing, initial Aerial Refueling Simulator Qualifications data collection, and other T&E activities for the KC-46. Complete IOT&E in support of the Full Rate Production decision."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased due to schedule changes and extending Government test support."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adjustments not yet reflected in FY19 PB"
                                    },
                                    "Description": {
                                        "val": "$85.0M of program Budget Authority withdrawn pending rescission in the FY 2018 Appropriation. In addition, the Program Office has identified a $4.801M source for a AF reprogramming action."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "89.801"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 02 Line Item KC046A"
                                    },
                                    "Title": {
                                        "val": "KC-46A Tanker"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2567.191"
                                        },
                                        "CurrentYear": {
                                            "val": "2545.674"
                                        },
                                        "BudgetYearOne": {
                                            "val": "2559.911"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "2559.911"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "2855.685"
                                        },
                                        "BudgetYearThree": {
                                            "val": "2946.218"
                                        },
                                        "BudgetYearFour": {
                                            "val": "2794.926"
                                        },
                                        "BudgetYearFive": {
                                            "val": "2829.095"
                                        },
                                        "CostToComplete": {
                                            "val": "9519.362"
                                        },
                                        "TotalCost": {
                                            "val": "28618.062"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 06 Line Item 000999"
                                    },
                                    "Title": {
                                        "val": "Initial Spares"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "322.383"
                                        },
                                        "CurrentYear": {
                                            "val": "413.373"
                                        },
                                        "BudgetYearOne": {
                                            "val": "365.028"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "365.028"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "240.623"
                                        },
                                        "BudgetYearThree": {
                                            "val": "128.421"
                                        },
                                        "BudgetYearFour": {
                                            "val": "216.556"
                                        },
                                        "BudgetYearFive": {
                                            "val": "252.178"
                                        },
                                        "CostToComplete": {
                                            "val": "858.284"
                                        },
                                        "TotalCost": {
                                            "val": "2796.846"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The KC-46 Program acquisition strategy is to procure an existing commercial, FAA certified aircraft modified to meet USAF requirements. The KC-46 program released a final RFP on 24 Feb 2010, and entered source selection on 9 Jul 2010. The KC-46 program held a MS B DAB on 23 Feb 2011, received approval to enter EMD from the USD(AT&L) on 24 Feb 2011, and awarded the KC-46 contract to Boeing on 24 Feb 2011 to develop and procure 179 KC-46 aircraft. The KC-46 contract procurement was conducted via a full and open competition per Federal Acquisition Regulation (FAR) Part 15, and resulted in a FY 2011 EMD Fixed Price Incentive Firm (FPIF) contract. The EMD phase will develop, build, and test four KC-46 aircraft, and will qualify the KC-46 as a tanker and certify pairings with receiver aircraft.\n\nThe MS B acquisition strategy planned for two LRIP lots followed by 11 Full Rate Production (FRP) lots for a total aircraft procurement of 175 production aircraft. An update to the acquisition strategy occurred in support of Milestone C (MS C) that increased LRIP from two to five lots and the remaining eight to be FRP lots with the total aircraft buy remaining at 175 Production aircraft (+4 EMD aircraft, with a grand total of 179 aircraft).\n\nLRIP began with two Firm Fixed Price (FFP) and two FFP Not to Exceed (NTE) options (LRIP-1 Qty 7, LRIP-2 Qty 12, LRIP-3 Qty 15, and LRIP-4 Qty 15) followed by nine FFP FRP options [via NTE values + Economic Price Adjustment (EPA)]. LRIP Lots 1 and 2 were awarded on 18 Aug 2016 and LRIP Lot 3 was awarded on 27 Jan 2017.  The FRP options will be exercised following successful completion of IOT&E.\n\nThe ATS acquisition strategy is to provide ATDs, and associated support structure, to each MOB and the FTU. The ATS contract was awarded on 1 May 2013 to FlightSafety Services Corporation. The ATS contract procurement was conducted via a full and open competition per FAR Part 15, and resulted in an FY 2013 EMD FPIF contract. The ATS EMD phase will develop and procure ATDs; and will be supported with courseware, Training System Support Center, the technical data package, and support equipment to ensure system availability and concurrency with the aircraft. The ATS initial production options were exercised in Aug 2015. \n\nThe MTS acquisition strategy is to acquire MTDs, and associated support structure, for two AMC active duty Regional Maintenance Training Facilities.  The MTS contract was awarded 6 Jul 2016 to The Boeing Company. The MTS procurement was conducted via a full and open competition per FAR Part 15, and resulted in an FY 2016 EMD FFP contract. The MTS EMD phase will develop and procure MTDs; and will be supported with courseware, Training System Support Center, the technical data package, and support equipment to ensure system availability and concurrency with the aircraft.\n\nThe KC-46 Program is responsible for the development, testing, and production of a drogue-equipped, wing-mounted refueling system to meet Capability Development Document (CDD) thresholds and objectives for simultaneous refueling of two probe-equipped receivers. The system can be installed or removed from the KC-46 as mission needs dictate.\n\nThe long-term support concept for the KC-46 is organic two-level maintenance (2LM): organization level (O-level) and depot level (D-level). For the purposes of this program, all maintenance other than O-level shall be referred to as D-level. The product support strategy will initially employ Interim Contractor Support (ICS) before transitioning to a 100% organically-managed maintenance and supply support capability. Performance Based Logistics (PBL) solutions will be evaluated during EMD as viable approaches to facilitate the transition."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The KC-46 EMD contract was awarded 24 Feb 2011.  The contract ceiling price of $4.9B is the government's maximum financial liability on the prime contract.  The \"Total Cost\" value represents the MS C Service Cost Position (SCP), which accounts for the ceiling price of the contract plus the financial and schedule risk of potential design changes for the KC-46 aircraft.\n\nFINANCIAL PERFORMANCE: The KC-46 is evaluated against traditional Research and Development (R&D) program expenditure benchmarks.  Unlike many traditional R&D programs, the KC-46 EMD contract is a FPIF contract with progress payments.  Twenty percent of incurred costs are withheld until the end of the contract, when they are liquidated.  Mandatory funding obligations and progress payment withholds will cause the program to lag traditional expenditure benchmarks, painting an inaccurate portrait of overall program health."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "KC-46A aircraft non-recurring development, integration, and testing; 4 RDT&E tanker aircraft; and support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Boeing Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Seattle, WA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "4954.069"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "55.994"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "21.866"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "13.460"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "13.460"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "56.031"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5101.420"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5046.892"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "KC-46A Aircrew Training System"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "FlightSafety Services Corp."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Centennial, CO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "86.049"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.362"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "87.411"
                                                    },
                                                    "TargetValue": {
                                                        "val": "87.411"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "KC-46A Maintenance Training System"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "The Boeing Company"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "St. Louis, MO"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "45.840"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "45.840"
                                                    },
                                                    "TargetValue": {
                                                        "val": "45.840"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "These contracts are on an as needed basis, with various contract types and performing activities."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "KC-46A studies and analysis associated with the development, integration, and demonstration of KC-46 capability & future planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "58.569"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "23.130"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "13.871"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.638"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.638"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.036"
                                                    },
                                                    "TotalCost": {
                                                        "val": "101.244"
                                                    },
                                                    "TargetValue": {
                                                        "val": "112.636"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Integrated testing and planning activities are performed by government organizations, with some contractor technical subject matter experts and teaming with the prime contractor."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "KC-46A testing and planning support of development & operational test, FAA & military certification, and aircraft qualification activities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "141.958"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "21.069"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "47.424"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "55.582"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "55.582"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "40.328"
                                                    },
                                                    "TotalCost": {
                                                        "val": "306.361"
                                                    },
                                                    "TargetValue": {
                                                        "val": "308.047"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Two Advisory and Assistance (A&AS) contracts over $1M.  Other PMA funding includes, but is not limited to, travel, supplies, and training."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "KC-46A Program Management Administration - Program A&AS Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "FFP"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Falcon"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "52.477"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "10.518"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.019"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "66.014"
                                                    },
                                                    "TargetValue": {
                                                        "val": "82.650"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "KC-46A Program Management Administration - Trainer A&AS Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "HX5"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Walton Beach, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.103"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "3.242"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-08"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "12.345"
                                                    },
                                                    "TargetValue": {
                                                        "val": "12.345"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "KC-46A Program Management Administration - Other"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "KC-46 Program Office"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, W-P AFB, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "32.816"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.393"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.665"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.987"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.987"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.332"
                                                    },
                                                    "TotalCost": {
                                                        "val": "49.193"
                                                    },
                                                    "TargetValue": {
                                                        "val": "59.639"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Adjustments not reflected in the FY19 PB ABIDES"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Not specified."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "89.801"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "89.801"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "KC-46"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "EMD: KC-46 Aircraft"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Automated Performance Tool (APT) Phase II"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Developmental Test & Evaluation to support aircraft delivery"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Receiver Certification"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Initial Operational Test & Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Supply Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Depot Maintenance Inter-servicing (DMI), Source of Repair Assignment Process (SORAP), Activation Planning, & FAA Certifications"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Aircrew Training System Development & Updates"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Maintenance Training System Development & Updates"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}