{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-3aa5750205815470029d4902e3ab7fe43a356ab3f6d3326908075a172dae75b4-9",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603287E"
        },
        "ProgramElementTitle": {
            "val": "SPACE PROGRAMS AND TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "35"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "162.643"
            },
            "CurrentYear": {
                "val": "247.435"
            },
            "BudgetYearOne": {
                "val": "254.671"
            },
            "BudgetYearOneBase": {
                "val": "254.671"
            },
            "BudgetYearTwo": {
                "val": "190.606"
            },
            "BudgetYearThree": {
                "val": "187.726"
            },
            "BudgetYearFour": {
                "val": "210.726"
            },
            "BudgetYearFive": {
                "val": "237.726"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "175.240"
                },
                "CurrentYear": {
                    "val": "247.435"
                },
                "BudgetYearOne": {
                    "val": "271.971"
                },
                "BudgetYearOneBase": {
                    "val": "271.971"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "162.643"
                },
                "CurrentYear": {
                    "val": "247.435"
                },
                "BudgetYearOne": {
                    "val": "254.671"
                },
                "BudgetYearOneBase": {
                    "val": "254.671"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-12.597"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-17.300"
                },
                "BudgetYearOneBase": {
                    "val": "-17.300"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-15.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.403"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-17.300"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-17.300"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects Congressional reduction offset by reprogrammings.  \nFY 2018:  N\/A\nFY 2019:  Decrease reflects completion of the Large In-Situ Manufactured Apertures (LIMA) program in FY 2018 and rephasing of the Hallmark program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SPC-01"
                    },
                    "ProjectTitle": {
                        "val": "SPACE PROGRAMS AND TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "162.643"
                        },
                        "CurrentYear": {
                            "val": "247.435"
                        },
                        "BudgetYearOne": {
                            "val": "254.671"
                        },
                        "BudgetYearOneBase": {
                            "val": "254.671"
                        },
                        "BudgetYearTwo": {
                            "val": "190.606"
                        },
                        "BudgetYearThree": {
                            "val": "187.726"
                        },
                        "BudgetYearFour": {
                            "val": "210.726"
                        },
                        "BudgetYearFive": {
                            "val": "237.726"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Space Programs and Technology program element is budgeted in the Advanced Technology Development budget activity because it addresses high payoff opportunities to dramatically reduce costs associated with advanced space systems and provides revolutionary new system capabilities for satisfying current and projected military missions.\n\nA space force structure that is robust against attack represents a stabilizing deterrent against adversary attacks on space assets.  The keys to a secure space environment are situational awareness to detect and characterize potential threats, a proliferation of assets to provide robustness against attack, ready access to space, and a flexible infrastructure for maintaining the capabilities of on-orbit assets.  Ready access to space requires the delivery of capabilities, replenishment of supplies into orbit, and rapid manufacturing of affordable space capabilities.  Developing space access and spacecraft servicing technologies will lead to reduced ownership costs of space systems and new opportunities for introducing technologies for the exploitation of space.\n\nSystems development is also required to increase the interactivity of space systems, space-derived information and services with terrestrial users.  Studies under this project include technologies and systems that will enable satellites and microsatellites to operate more effectively by increasing maneuverability, survivability, and situational awareness; unique manufacturing or assembly processes, and precision control of multi-payload systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Experimental Spaceplane One (XSP)"
                                    },
                                    "Description": {
                                        "val": "The goal of the XSP program is to develop and flight demonstrate a prototype booster and expendable upper stage with responsive aircraft-like operations.  Past efforts have identified and demonstrated critical enabling technologies including composite or lightweight structures, propellant tanks, thermal protection systems, rocket propulsion and advanced avionics\/software.  A critically important technology gap is integration into a flight demonstration able to deliver aircraft-like operability.  The program will validate key technologies on the ground, and then fabricate an X-Plane to demonstrate: 1) 10 flights in 10 days, 2) design the objective system for >3000-lb payload at a reduced cost, 3) fly the demonstration system one time with an orbital payload of 900-lbs, and 4) fly to a high staging speed (Mach 3-10).  The anticipated transition partners are the Air Force, Navy and commercial sector."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "42.500"
                                            },
                                            "Text": {
                                                "val": "-  Completed remaining demonstration, testing, and validation tasks including subsonic and subscale vertical takeoff and landing into a ground-fixed landing cradle in lieu of onboard landing gear, and additional tip-fin aeroelasticity modeling\/correlation to establish reliable design practice based on computational methods.\n-  Initiated detailed design program for fabrication and flight testing.\n-  Completed cryogenic tank representative panel testing, and incorporated results in the final tank designs.\n-  Initiated design for launch facilities\/modifications and mature range planning including ground and flight test operations, and submittal of range documentation supporting operational requirements.\n-  Coordinated with the FAA, DoD ranges and commercial spaceports.\n-  Began procurement of long lead flight and ground system hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "61.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform detailed wind tunnel studies of final or near-final aerodynamic design across multiple regimes including subsonic, supersonic, and hypersonic.\n-  Validate computational analyses to support the finalization of the aerodynamic database used for Guidance, Navigation and Control (GN&C).\n-  Begin propulsion system integration and preparation for ten engine firings in ten days ground test.\n-  Mature the XSP concept through tailored Critical Design Review including complete configuration, aerodynamics and aeroheating, six degree of freedom trajectory calculations with flight software in the loop, mass properties and associated ground systems.\n-  Conduct Critical Design Review to approve XSP vehicle design for component acquisition, fabrication, assembly, and integration.\n-  Complete propulsion qualification and acceptance testing.\n-  Complete ten engine firings in ten days ground test."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "62.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "62.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete designs for ground infrastructure.\n-  Mature range, ground and flight test operations planning.\n-  Submit commercial spaceport and\/or DoD range documentation.\n-  Begin fabrication of all major subsystems.\n-  Initiate acceptance test planning.\n-  Begin integration and test of major subassemblies, flight and ground systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radar Net"
                                    },
                                    "Description": {
                                        "val": "The Radar Net program will develop lightweight, low power, wideband capability for radio frequency (RF) communications and remote sensing for a space based platform.  The enabling technologies of interest are extremely lightweight and space capable deployable antenna structures.  Current deployable antenna options have not been sufficiently developed to be dependable on small payload launches, leaving current capabilities trending to large and more costly satellite systems.  These satellite systems are expected to have long operational lifetimes, which can leave them behind the pace of state-of-the-art technical developments.  The technologies developed under Radar Net will enable small, low-cost sensor payloads on short timescales with rapid technology refresh capabilities.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.500"
                                            },
                                            "Text": {
                                                "val": "-  Completed risk reduction deployable antenna proof-of-concept (POC) deployment demonstration.\n-  Completed risk reduction deployable antenna pathfinder Critical Design Review (CDR).\n-  Completed risk reduction deployable antenna prototype Preliminary Design Review (PDR).\n-  Completed risk reduction Software-Defined Radio (SDR) prototype PDR.\n-  Completed risk reduction SDR prototype CDR.\n-  Conducted additional risk reduction deployable antenna POC laboratory testing.\n-  Conducted risk reduction of demonstration system ground tests.\n-  Conducted risk reduction SDR airborne tests.\n-  Completed demonstration System Requirements Review (SRR).\n-  Completed demonstration system Conceptual Design Review (CoDR)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "59.000"
                                            },
                                            "Text": {
                                                "val": "-  Conduct risk reduction deployable antenna CDR.\n-  Conduct risk reduction demonstration of multiple deployable antenna technologies.\n-  Demonstrate software-defined radio (SDR) RF capability in relevant environments.\n-  Perform risk reduction signal processing demonstration.\n-  Perform deployable pathfinder demonstration in a relevant environment.\n-  Integrate results from applications study and demonstration\/risk reduction into prototype design.\n-  Complete demonstration system Preliminary Design Review (PDR).\n-  Complete demonstration system Critical Design Review (CDR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete demonstration system Manufacturing Readiness Review (MRRs).\n-  Manufacture and assemble demonstration system.\n-  Complete demonstration system Test Readiness Reviews (TRRs).\n-  Integrate and test demonstration system.\n-  Complete demonstration system Pre-Ship Review (PSR)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of pathfinder system and demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hallmark"
                                    },
                                    "Description": {
                                        "val": "The Hallmark program seeks to demonstrate a space Battle Management Command and Control (BMC2) capability to provide U.S. senior leadership the tools needed to effectively manage space assets in real time.  The program will develop command and control decision support tools for full-spectrum space operations, management, and control from peace to potential conflict.  Hallmark will demonstrate the ability to increase space threat awareness via use of multi-data fusion and timely sensor tasking.  The program will also improve the ability to protect against threats by using modeling and simulation tools to develop courses of action for both natural events and adversary actions.  The program will employ comprehension and visualization techniques to increase commander and operator awareness thereby transforming information to knowledge and effectively communicating and facilitating time-critical decision making.  The anticipated transition partner is the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed sensor data fusion algorithms.\n-  Defined course of action data scheme.\n-  Developed a research and development test bed to facilitate the rapid injection of new technologies into the Joint Space Operations Center (JSpOC), Joint Interagency Coalition Space Operations Center (JICSpOC), and other space operations centers.\n-  Completed preliminary system design.\n-  Developed intuitive applications and adaptive understanding capabilities for the next-generation space information fusion center.\n-  Defined integration of space BMC2 interactive simulation environment with tools, fusion algorithms, and data schemes.\n-  Performed existing tool integration.\n-  Developed modeling and simulation infrastructure.\n-  Completed algorithm prototypes.\n-  Commenced integration of existing space situational awareness, indications and warning, course of action, and decision support tools."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "29.000"
                                            },
                                            "Text": {
                                                "val": "-  Integrate cognitive evaluations into tool development.\n-  Standardize evaluation methodology.\n-  Demonstrate and document integrated tools, algorithms, and data schemes.\n-  Evaluate integrated tools to show effectiveness with respect to enhanced decision timeliness and quality.\n-  Allocate tool development for Phase II.\n-  Conduct quarterly integration cycles with complete feedback loop of cognitive evaluations.\n-  Release ontology for community feedback."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Release Hallmark software development kit including Hallmark in-a-box for remote development environment.\n-  Transition activity for sustainment of ontology and data model continuous evolution, and for sustainment of BMC2 tool development environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion and transition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotic Servicing of Geosynchronous Satellites (RSGS)"
                                    },
                                    "Description": {
                                        "val": "A large number of national security and commercial space systems operate at geosynchronous earth orbit (GEO), providing persistence and enabling ground station antennas to point in a fixed direction.  Technologies for servicing of GEO spacecraft would involve a mix of highly automated and remotely operated (from Earth) robotic systems.  The Robotic Servicing of Geosynchronous Satellites (RSGS) program seeks to establish the capability to acquire robotic services in GEO suitable for a variety of potential servicing tasks, in full collaboration and cooperation with existing satellite owners and national security space operators, and with sufficient propellant for several years of follow-on capability.  Key RSGS challenges include robotic tool\/end effector requirements, efficient orbital maneuvering of a servicing vehicle, robotic arm systems, automation of certain spacecraft operations, and development of the infrastructure for coordinated control between the servicer and client spacecraft operations teams.  The anticipated transition is to a commercial partner who will provide the satellite to carry the robotic payload and who will operate the robotic servicer.  To support the development of a broadly accepted satellite servicing capability, DARPA is using the consortium for execution of rendezvous and servicing operations (CONFERS) approach to bring together experts from the private sector and Government to develop and publish non-binding, consensus-based standards for safe operational approaches."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "53.643"
                                            },
                                            "Text": {
                                                "val": "-  Selected commercial partner as provider of satellite to carry robotic payload, and owner\/operator of system on orbit.\n-  Developed interface definition between robotic payload and satellite.\n-  Began flight software coding.\n-  Began development of operator workstations.\n-  Began procurement of long-life space hardware for robotic payload and instrumentation.\n-  Developed comprehensive test plan for robotics and for integrated system.\n-  Completed structural analysis of robotic arms and tool changer, prepare detailed designs, and begin fabrication.\n-  Designed, acquire and test payload electronic systems.\n-  Selected a Secretariat to stand up CONFERS and begin standards development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "79.250"
                                            },
                                            "Text": {
                                                "val": "-  Begin ground segment specification.\n-  Continue development of comprehensive test plan for robotics and for integrated system.\n-  Complete build and test of first flight robotic arm and tool changer.\n-  Complete development of algorithms for automated on-orbit operations.\n-  Complete final design of servicer satellite with commercial partner and provide technical assistance during fabrication.\n-  Continue flight software coding and testing.\n-  Continue development of operator workstations.\n-  Conduct CONFERS first general assembly and open forum.\n-  Publish first draft of consensus on-orbit safety standards through a qualified standards development organization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "108.671"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "108.671"
                                            },
                                            "Text": {
                                                "val": "-  Begin integration of robotic payload.\n-  Complete build and test of second robotic arm and tool changer.\n-  Fabricate robotic operations test bed.\n-  Complete build of flight units of robotic tools and tool holders.\n-  Begin preparations for launch with Air Force Space Test Program.\n-  Complete build of rendezvous and proximity operations sensors.\n-  Complete payload structures fabrication.\n-  Test final build of flight software.\n-  Convene CONFERS second general assembly and open forum.\n-  Publish revised on-orbit safety standards inclusive of lessons learned from on-going commercial and government activity."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects integration of robotic payload and fabrication of multiple items including robotic arm and tool changer, testbed, flight ready tools and tool holders, sensors, payload structures, and flight software."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blackjack*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Blue Check\n\nThe Blackjack program will develop space technologies demonstrating a proliferated smallsat constellation capability in Low Earth Orbit (LEO).  Capabilities demonstrated will provide constant custody of very large numbers of concurrent targets; target identification, tracking, and characterization; architectural resilience via massive proliferation; and rapid on-orbit technology refresh and experimentation.  Blackjack will leverage commercial industry plans to build constellations in LEO to provide global commercial broadband internet service.  Key efforts include low size, weight, power, and cost (SWaP-C) multi-modality smallsat sensor payloads, algorithms for autonomous payload and architecture command and control, algorithms for satellite on-board processing and data fusion, and advanced manufacturing for military payload mass production.  The anticipated transition partner is the Air Force."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify government operations, mission, and transition partners.\n-  Conduct system architecture and trade studies.\n-  Develop design reference missions and determine architecture level requirements.\n-  Identify high technical risks areas and develop risk reduction plans.\n-  Develop satellite bus and payload interface definition documents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete demonstration system Conceptual Design Review (CoDR).\n-  Complete Preliminary Design Review (PDR) for risk reduction efforts.\n-  Begin development of commoditized satellite bus.\n-  Begin development of demonstration sensor payloads.\n-  Begin ground and on-orbit experimentation with commercial industry satellite constellations for risk reduction efforts.\n-  Begin development of autonomous control element."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects transition from initial studies to risk reduction, payload development, and initial experimentation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Space Technology Concepts"
                                    },
                                    "Description": {
                                        "val": "Studies conducted under this program will examine and evaluate emerging technologies and concepts with the potential to provide substantial improvement in efficiency and effectiveness of operations in space.  This includes the degree and scope of potential impact and improvements to military operations, mission utility, and warfighter capability.  Studies are also conducted to analyze emerging threats along with possible methods and technologies to counter them.  The feasibility of achieving potential improvements, in terms of resources, schedule, and technological risk, is also evaluated.  The results from these studies are used, in part, to formulate future programs or refocus ongoing work.  Topics of consideration include advanced or novel propulsion systems, novel sensors, advanced lightweight structures, advanced miniature radio frequency (RF) technology, navigation technologies, avionics, structures, advanced communications and on-orbit software environments."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate studies of new technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "-  Perform studies to evaluate employment of new systems and architectures."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Planar Imager"
                                    },
                                    "Description": {
                                        "val": "The Planar Imager program will develop a low size, weight, and power (SWaP) electro-optical (EO) imager using photonic integrated circuits (PICs) and other novel approaches to replace conventional telescopes for high altitude, long endurance Unmanned Aerial Vehicle (UAV) persistent platforms and space-based EO sensors for Intelligence, Surveillance, and Reconnaissance (ISR).  In order to increase resolution, conventional telescopes have to grow in size and weight.  The Planar Imager program will eliminate this constraint by using computational interferometric techniques to replace conventional optics with digital processing, providing dramatic improvements in weight and enabling novel form factors for military imaging systems."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Develop scaled-up system design of PIC unit.\n-  Integrate detectors directly into PIC design.\n-  Complete program System Requirements Review (SRR).\n-  Begin development of breadboard planar imager laboratory demonstrator."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Responsive Access for Space Resilience (RASR): DARPA Launch Challenge"
                                    },
                                    "Description": {
                                        "val": "Advances in technology, including networking and computing, have significantly increased the utility of small (<300kg) spacecraft that would previously have been of limited military value. For the simultaneous purposes of responsiveness and resiliency, these spacecraft are envisioned to be built on dramatically faster timelines (weeks instead of years) than are executed today. The current practice for space launch generally favors large launch vehicles with complex, one-of-a-kind infrastructure. This architecture has been matched to the large, heavy spacecraft, which compose most of DoD's space architecture today. Small spacecraft, which offer large potential value for resiliency and tactical employment, are typically required to rideshare for access to space which requires programmatic, technical, and schedule entanglement with other programs. The U.S. commercial sector has promising developments for small launch vehicles that are designed for launch on rapid timescales with minimal fixed infrastructure. To incentivize industry to deliver capability that can meet emerging DoD needs for rapid, responsive launch of small payloads, the DARPA Launch Challenge will reward competitors who can demonstrate the ability to launch a payload to orbit with minimal notification time and unknown pre-conditions regarding the payload configuration, required orbit, and launch site. The U.S. Government can make future use of commercial contracting mechanisms for rapid space launch with successful performers. The anticipated transition partners are the Air Force and NASA."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Investigation of commercial partnerships for space payloads.\n-  Assess launch site feasibility and facility technical accommodations.\n-  Develop and test multi-launch site compatible downrange telemetry return capabilities.\n-  Create scalable commercial payload packages to support range of launch capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Large In-Situ Manufactured Apertures (LIMA)"
                                    },
                                    "Description": {
                                        "val": "The Large In-Situ Manufactured Apertures (LIMA) program seeks to study the structural fabrication of a high-performance optical telescopes and radio frequency (RF) antennas attached to a microsatellite.  Larger, more powerful and directional than any comparable aperture that could be deployed from a microsatellite platform, LIMA would deliver high-performance imagery, communication and data services to the dismounted warfighter at significantly lower cost while enabling intelligence capability.  The program seeks to achieve greater than 50% savings in individual imagery and communications satellite system launch costs and a corresponding increase in launch opportunities due to ride sharing relative to the preferred state of the art solution."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.185"
                                            },
                                            "Text": {
                                                "val": "-  Study in-space fabrication process technologies in ground-based trials, including validation of key process elements in flight-like environments.\n-  Prove by analysis that the hosted payload is accommodated without an increase in constellation total launch cost compared to the constellation without the augmented microsatellites."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Space Surveillance Telescope (SST)"
                                    },
                                    "Description": {
                                        "val": "The Space Surveillance Telescope (SST) program has developed and demonstrated an advanced ground-based optical system to enable detection and tracking of faint objects in space, while providing rapid, wide-area search capability.  A major goal of the SST program, to develop the technology for large curved focal surface array sensors to enable an innovative telescope design combining high detection sensitivity, short focal length, wide field of view, and rapid step-and-settle to provide orders of magnitude improvements in space surveillance has been achieved.  This capability enables ground-based detection of un-cued objects in deep space for purposes such as asteroid detection and space defense missions.  The SST Australia effort developed advanced algorithms, equipment, and concepts of operation to achieve comparable telescope performance in the more challenging Australian atmosphere.  This enhanced capability was demonstrated at White Sands Missile Range, allowing estimates of the performance in Australia to be validated.  This program addressed technical challenges which arise from an Australian site, including adaptations to a different telescope environment.  The system, algorithms, and concepts of operation transitioned to Air Force Space Command (AFSPC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "-  Completed demonstration of WFC #2 performance improvement at White Sands Missile Range (WSMR) site.\n-  Supported Joint Space Operations Center (JSpOC) data delivery.\n-  Completed transition to AFSPC."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}