{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c6d4730c5f45a9998742a765fe5a52840fa01fae9e79d847b7e2f989ef6d2407-27",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_A-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603826D8Z"
        },
        "ProgramElementTitle": {
            "val": "Quick Reaction Special Projects (QRSP)"
        },
        "R1LineNumber": {
            "val": "61"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "327.810"
            },
            "PriorYear": {
                "val": "77.354"
            },
            "CurrentYear": {
                "val": "69.203"
            },
            "BudgetYearOne": {
                "val": "69.626"
            },
            "BudgetYearOneBase": {
                "val": "69.626"
            },
            "BudgetYearTwo": {
                "val": "71.393"
            },
            "BudgetYearThree": {
                "val": "73.945"
            },
            "BudgetYearFour": {
                "val": "75.131"
            },
            "BudgetYearFive": {
                "val": "75.744"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The Quick Reaction Special Projects (QRSP) Program Element develops risk-reducing prototypes and conducts experiments designed to develop capabilities in anticipation of emerging adversary threats, while addressing immediate needs of the Combatant Commands (CCMD).  QRSP efforts support the Department’s goal to provide a hedge against technical uncertainty by leveraging commercial technologies and acting as an incubator for potentially game-changing capabilities.  This Program Element also supports the Department of Defense’s (DoD) strategy to address future threats in a more competitive environment with resurgence of near-peer competitors and adversaries who have studied and worked to counter U.S. technological capabilities.  QRSP provides an agile mechanism to affordably counter emerging technological threats, inform the requirements process, and help maintain DoD’s technical superiority, while fostering collaboration among other government agencies, DoD laboratories, academia, and the commercial sector.  Funding in this Program Element enables the new Under Secretary of Defense for Research and Engineering (USD(R&E)) to anticipate and respond to emergent DoD issues and time-sensitive threats by selecting projects within the year of execution.  Due to the relatively low average cost of projects, QRSP is able to explore higher-risk opportunities with potentially higher reward.  Project selection is guided by Department-level strategies and priorities, such as the Chairman’s Gap Assessment, USD(R&E) strategic guidance, and CCMD Integrated Priority Lists (IPLs).    \n\nThe QRSP Program supports four major project codes that expedite development and transition of new capabilities to the warfighter.  These project codes are:  1) Quick Reaction Fund (QRF), 2) Rapid Reaction Fund (RRF), 3) Joint Rapid Acquisition Cell (JRAC) support, and 4) Strategic Multi-Layered Assessment (SMA) Cell support.  Focus areas within these project codes align to DoD science and technology priorities, including counter anti-access\/area denial; counter weapons of mass destruction; target identification and tracking; intelligence, surveillance, and reconnaissance; low-cost precision engagement; counter-electronic warfare; technical risk assessments through wargaming; and, autonomous systems.\n\nThe QRF objectives are to develop prototypes in response to emergent conventional warfare needs that take advantage of breakthroughs in rapidly evolving technologies and accelerate these capabilities to the warfighter.  The QRF program initiates prototyping projects during the execution year to mature technologies critically needed for the CCMDs.  QRF focus areas include anti-access and area denial, broad electronic warfare, and autonomous learning systems for processing and analyzing intelligence streams.  \n \nThe RRF objectives are to develop proof-of-concept prototypes to counter emerging irregular warfare threats, anticipate adversaries’ exploitation of new technologies, and expedite delivery of effective, affordable, and critically needed capabilities to the warfighter.  RRF initiatives support the DoD Research and Engineering Enterprise mission to develop, demonstrate, assess, and rapidly field innovative and affordable concepts and technologies that meet time-sensitive operational needs as identified by CCMDs, military Service organizations, other Defense organizations, and interagency partners.  RRF leverages emerging capabilities, such as advanced algorithms and software intelligence, to enable conceptual prototyping with agile technology insertion.  The program also leverages existing capabilities in our traditional industrial bases and non-traditional suppliers in the commercial sector, academia, international arenas, and small businesses.      \n\nThe JRAC focus is on responding, in timeframes acceptable to the CCMDs, to Joint Urgent Operational Needs (JUONS) and Joint Emerging Operational Needs (JEONS) that are submitted by CCMDs and validated by the Joint Staff.  To meet these objectives, JRAC leverages contingency and other rapid acquisition authorities.\n\nThe SMA Cell's objective is to support CCMDs, Joint Force Commanders, and other government agencies by assessing complex operational and technical challenges, which require collaborative multi-agency and multi-disciplinary approaches.  With input from across the U.S. Government, academia, and the private sector, the SMA Cell develops options to Joint Staff and CCMD-generated challenging problems to inform senior leadership.  Each assessment is initiated at the request of CCMD senior leadership.  Priorities for SMA Cell programs are set by the Joint Staff Deputy for Operations.  SMA products are typically generated within six months and directly contribute to the decision-making process of the Joint Staff and CCMD senior leadership."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "74.943"
                },
                "CurrentYear": {
                    "val": "69.203"
                },
                "BudgetYearOne": {
                    "val": "72.985"
                },
                "BudgetYearOneBase": {
                    "val": "72.985"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "77.354"
                },
                "CurrentYear": {
                    "val": "69.203"
                },
                "BudgetYearOne": {
                    "val": "69.626"
                },
                "BudgetYearOneBase": {
                    "val": "69.626"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.411"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.359"
                },
                "BudgetYearOneBase": {
                    "val": "-3.359"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-5.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.489"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Hardware\/Software (HW\/SW) transfer"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.089"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Baseline Adjustment for DoD priorities"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.011"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.838"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.838"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.521"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.521"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2017 increase is the net of congressional adjustments and other required execution year adjustments. \n\nIn FY 2019, the baseline decrease is the net of a $2.000 million transfer out of the Hardware\/Software (HW\/SW) Assurance and Integrity Analysis project to Program Element 0604294D8Z (Trusted and Assured Microelectronics), and adjustments applied to fund other DoD requirements and priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "826"
                    },
                    "ProjectTitle": {
                        "val": "Quick Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "102.134"
                        },
                        "PriorYear": {
                            "val": "24.360"
                        },
                        "CurrentYear": {
                            "val": "21.828"
                        },
                        "BudgetYearOne": {
                            "val": "21.876"
                        },
                        "BudgetYearOneBase": {
                            "val": "21.876"
                        },
                        "BudgetYearTwo": {
                            "val": "22.452"
                        },
                        "BudgetYearThree": {
                            "val": "23.289"
                        },
                        "BudgetYearFour": {
                            "val": "23.671"
                        },
                        "BudgetYearFive": {
                            "val": "23.862"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Quick Reaction Fund (QRF) provides the Services, Combatant Commands (CCMDs), and force providers opportunities to capitalize on relatively mature technologies to rapidly develop and field-test promising new conceptual prototypes that can have immediate impact on time-sensitive operational needs.  QRF focuses on projects that have the potential to address conventional, disruptive, and asymmetric warfare needs.  QRF initiatives typically deliver a prototype application within 12 months of being funded.\n\nIn FY 2018 and FY 2019, QRF will continue to identify and fund prototypes and technology demonstrations that respond to critical operational needs and emerging threats.  Investments respond to Department, CCMD, Service, and other government organization identified threats and opportunities, including the following interest areas: counter anti-access and area denial; electromagnetic bandwidth and spectrum enhancement; persistent intelligence, surveillance, and reconnaissance; novel human identification technologies; human-machine collaborative decision making; and, counter-electronic warfare technologies. \n\nRecent success stories and significant transitions of note include:\n•  Robust Automatic Transcription of Speech: This project successfully developed a speech triage capability to determine if and when there is speech in a captured radio frequency signal.  Once speech has been detected, the prototype can identify speakers, languages, and keywords in real time across multiple channels.  In 2017, this project transitioned to the Naval Air Systems Command Maritime Patrol and Reconnaissance Aircraft Program Office (PMA-290) for deployment and follow-on integration on Navy signals intelligence platforms.   \n•  Robust Tactical Data Link Modernization: This project developed new Link 16 improvements for increased anti-jam communication performance.  The project also designed a real-time processor that fits into existing radio circuit card slots to increase adoption of the new technology.  Details of this project are classified.  Robust Tactical Data Link Modernization transitioned to the Multifunctional Information Distribution System (MIDS) radio program for integration into the Link 16 baseline system.\n•  CyberPhantom: This project developed fully customizable cyber tools for open network exploitation.  The solution leveraged best practices of the cyber workforce and expanded cyber space capabilities with a unique blend of commercial-off-the-shelf (COTS) software integrated with new customized tools.  Details are classified.  In January of 2017, CyberPhantom transitioned to a classified operation user."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hammerhead"
                                    },
                                    "Description": {
                                        "val": "The Office of the Under Secretary of Defense, Acquisition, Technology, and Logistics is responding to the need for more available courses of action (COAs) in the event of certain space systems contingencies.  Initial funding in FY 2017 identified potential COAs and defined scope necessary for testing in FY 2018.  Transition to the end user is expected in FY 2018.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.800"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Hardware\/Software (HW\/SW) Assurance and Integrity Analysis"
                                    },
                                    "Description": {
                                        "val": "The Department of Defense (DoD) has developed a trusted systems strategy including focusing efforts on mission assurance, comprehensive protection planning, industry standards, and advancing DoD's capability to identify and mitigate HW\/SW vulnerabilities through science and technology (S&T).  These HW\/SW Assurance projects directly support all elements in the 2014 National Defense Authorization Act (NDAA) Section 937.  This program established the Joint Federated Assurance Center (JFAC) that federates hardware and software assurance expertise and capabilities throughout DoD and makes the capabilities directly available to programs.  \n\nThe JFAC provides tools, services, best practices, contract language, and other help to programs that detect, assess, prioritize, and mitigate mission critical vulnerabilities to malicious software attacks and supply chain exploitation vulnerabilities.  The collaboration helps mitigate existing and emerging critical threats and vulnerabilities in both SW and HW and yields secure architecture and design patterns available to all DoD programs.  Trusted and Assured Microelectronics Program Elements 0604294D8Z BA4 and 0605294D8Z BA5 demonstrate these capabilities and augment the hardware assurance capabilities of the JFAC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Continue to maintain infrastructure services and staff for the JFAC Coordination Center (CC), enabling the centralized assurance repository, assurance contract language, metrics, the JFAC ticketing system for software assurance (SwA) tool license distribution, help-desk, and hard problem analysis.  Incorporate Defense Advanced Research Projects Agency (DARPA) and Defense Acquisition University (DAU) products into the JFAC website.  Develop and publish a SwA users and program manager's guidebook to aid implementation of SwA practices in DoD programs.  Expand access to the existing assessment knowledge base to programs throughout the software development lifecycle."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This project will transition to Program Element 0604294D8Z Trusted and Assured Microelectronics in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CyberPhantom Phase II"
                                    },
                                    "Description": {
                                        "val": "CyberPhantom focused on the development of fully customizable cyber tools for open network exploitation.  The solution leveraged best practices of the U.S. Government’s cyber workforce and expanded the capability of the DoD to operate in cyber space with a unique blend of commercial-off-the-shelf (COTS) software integrated with new customized tools.  Phase II of this effort provided a scalable architecture for capability deployment, command and control, and operational analysis.  CyberPhantom Phase II built on the previously deployed capability sets and transitioned to U.S. Cyber Command.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.400"
                                            },
                                            "Text": {
                                                "val": "This project will continue development efforts and support multiple demonstrations.  Details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Isosceles"
                                    },
                                    "Description": {
                                        "val": "Isosceles developed a classified high fidelity systems test-bed that emulates real world strategic systems.  Isosceles replaces current dissimilar surrogates for testing, which vary in performance and increase uncertainty and risk for tested systems.  With Isosceles, capability developers reduce cost and increase confidence that employed systems will work as expected.  Isosceles was demonstrated through a systems effectiveness test in December of 2017 and transitioned to a program of record currently supporting the Services.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.660"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "XTreme Limits"
                                    },
                                    "Description": {
                                        "val": "XTreme Limits developed a capability to support 24x7, worldwide relay of command and control messages to a fielded user device (providing a “paging” like capability) and user-to-ops data return.  The XTreme Limits capability supports a number of military units and other government organizations conducting high-priority mission operations.  This project also provided sensor data relay for designated sensor systems.  XTreme Limits paging architecture will be tested in Spring 2018 before transitioning to a classified mission partner.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "Achieve plan for JFAC full operational capability (FOC) by conducting the Department-wide assurance capability and capacity gap analyses for software, hardware, and firmware assurance; update the JFAC SOPs to support programs; serve assurance needs of programs; expand upon and maintain software, hardware, and firmware assurance capability maps; survey software and hardware assurance needs of programs and other organizations; coordinate, automate, and implement enterprise licensing for DoD-wide automated distribution and management of SwA engineering tools; and implement outreach to programs and organizations for assurance planning, training, contracting, best practices, and vulnerability and defect remediation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Talon Archer"
                                    },
                                    "Description": {
                                        "val": "Talon Archer developed and deployed a set of sensors demonstrating an approach to meeting a North American Aerospace Defense Command\/U.S. Northern Command (NORAD\/USNORTHCOM) need for long-range sensing of strategic assets.  The sensors successfully provided alerts and actionable information to the Department of Defense (DoD) and partners.  Success of the sensors led to adoption at four additional locations.  Further details of this project are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.260"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blockdata"
                                    },
                                    "Description": {
                                        "val": "Blockdata conducted an assessment of various blockchain technologies to support data integrity for distributed sensors.  Blockchain technologies serve as the basis for the increasingly popular digital currency systems such as Bitcoin and Ether.  The features of blockchain’s underlying technology can be used to ensure data integrity for sensors and their processed data sets.  The Blockdata project assessed different blockchain technologies being developed in the commercial sector, and explored applicability, performance, and adaptability for joint warfighter applications.  The project identified initial application areas and transitioned to a classified DoD agency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.600"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Sidecast"
                                    },
                                    "Description": {
                                        "val": "Sidecast focused on the development and deployment of fully customizable cyber tools for open network exploitation or computer network exploitation (CNE) for a fraction of the cost of existing programs.  The solution leverages best practices of the U.S. Government cyber workforce and expands the capability of the DoD to operate in cyber space with government-off-the-shelf software tools.  Sidecast is designed to enhance the Combatant Commands’ (CCMD) capability to operate and exploit cyber information in near real-time.  The project enables the CCMDs’ ability to conduct advanced open network exploitation or CNE within cyber space to support emerging mission requirements.  The effort developed and delivered two customer defined operational tools to a classified user.  The Sidecast capability transitioned to multiple CCMDs and agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Patton"
                                    },
                                    "Description": {
                                        "val": "This project enables greater visibility into threat indications and warnings (I&W) through the integration of existing data sources and advanced data science techniques.  Patton developed enhanced I&W visualization tools for the warfighter, addressing shortfalls in the ability to provide accurate and timely I&W to Combatant Commands (CCMD).  Patton uses a holistic approach to identify critical threat precursors as highlighted by warfighters.  In addition, a team of analysts developed a baseline of data feeds that integrated with a set of enhanced visualization tools to help communicate I&W.  As a result, operators have the information required to analyze adversary threat behaviors.  In FY 2017, the project developed, demonstrated, and transitioned the visualization tools to CCMD customers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.840"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dead Center"
                                    },
                                    "Description": {
                                        "val": "Dead Center developed and demonstrated advanced, highly tailorable algorithms to meet critical warfighter mission needs in multiple domains, culminating in a user demonstration of the advanced algorithms designed to enhance warfighter effectiveness.  The project integrated these algorithms to demonstrate a flexible, multi-platform functionality in a low size, weight, and power (SWaP) form factor to meet specific, highly tailored mission critical needs.  Project residuals (prototypes and documentation) transitioned to classified DoD partner."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vintage Racer"
                                    },
                                    "Description": {
                                        "val": "Vintage Racer matured an advanced capability to prosecute targets of interest.  This project validated the aerodynamic design with wind tunnel testing.  Vintage Racer also developed and integrated a guidance subsystem for targeted kinetic effects.  Following subsystem integration, FY 2017 funding supports a flight demonstration in FY 2018.  The project will transition documentation and prototype technologies to the U.S. Army for any additional development and follow-on acquisition activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Anti-Access\/Area Denial Focus Area"
                                    },
                                    "Description": {
                                        "val": "This Quick Reaction Fund (QRF) focus area will support projects to develop capabilities and countermeasures for emerging needs to monitor and, as needed, gain access to geographical areas that have been strategically denied by adversarial forces and technologies.  Potential capabilities could include sensors; position, navigation, and timing systems; autonomous platforms; and other technologies that extend battlespace awareness and force projection.  This project seeks to leverage existing capabilities and ensure QRF efforts are not duplicative with other work within the DoD or with outside agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.882"
                                            },
                                            "Text": {
                                                "val": "Anti-access\/area denial investment decisions during the budget year will respond to priorities to address increasing capabilities of near-peer adversaries as identified by the Department, Combatant Commands (CCMD), Services, and other government organizations.  Through coordination with the DoD, Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry, and academia, this focus area will help identify critical areas to address the dual challenges of getting into theater (the anti-access challenge) and operating under guided munitions threat (the area denial problem).  QRF anticipates funding two to three prototypes in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.556"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.556"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, QRF will continue efforts to identify and invest in capabilities that address anti-access\/area denial challenges.  These investments will be conducted to support and coordinate with the DoD, CCMDs, Services, and other government organizations.  QRF anticipates funding three to four prototypes in FY 2018."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Emerging Electronic Warfare (EW) Technologies Focus Area"
                                    },
                                    "Description": {
                                        "val": "Operating in complex EW environments is critical to mission success.  This focus area provides the agility to select projects in the year of execution to mature conceptual prototype countermeasures against electronic warfare (EW) components and systems.  These countermeasures protect forces and help achieve electromagnetic spectrum agility.  The QRSP program will ensure QRF efforts are not duplicative with other counter-electronic warfare efforts and will seek to leverage related efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.297"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in counter-electronic warfare technologies during the budget year will respond to Department, CCMD, Service, and other government organization priorities as new opportunities and new threats emerge.  Planned investments will help local communication and coordination to increase weapon systems’ and forces’ effectiveness in contested environments.  There will be coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia to help identify critical areas to counter emerging electronic warfare threats.  QRF anticipates funding three to four projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.904"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.904"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, QRF will continue efforts to identify and invest in counter-electronic warfare technologies that respond to DoD, CCMD, Service, and other government organization priorities as new threats emerge or new opportunities are presented.  QRF anticipates funding three to four projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advance Indications and Warning through Human-Machine Collaborative Decision Making Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area for FY 2018 and FY 2019, in anticipation of emerging needs, will develop and advance rapidly deployable, conceptual prototype technologies that focus on improving the indications and warning (I&W) for a variety of mission areas to include weapons of mass destruction and theater ballistic missiles.  Through the use of intelligent learning systems and human-machine collaborative decision making, I&W can improve response time and open additional options to counter emerging threats.  Projects may include techniques and methodologies that improve detection sensitivities, data-to-decision tools, and global situational awareness.  The project will seek to leverage related efforts."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Anti-access\/area denial investment decisions during the budget year will respond to Department, Combatant Command (CCMD), Service, and other government organization priorities to address increasing capabilities of near peer adversaries.  Through coordination with the Department of Defense (DoD), Federally Funded Research and Development Centers (FFRDCs), other government agencies, industry, and academia, this focus area will help identify critical areas to address the dual challenges of getting into theater (the anti-access challenge) and operating under guided munitions threat (or the area-denial problem).  QRF anticipates funding two to three prototypes in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.971"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in human-machine collaborative decision making efforts during the budget year will respond to DoD, CCMD, Service, and other government organization priorities.  To help identify areas critical to human-machine collaborative decision making, the project will leverage research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia.  QRF anticipates funding two to three projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.336"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.336"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, QRF will continue efforts to identify and invest in human-machine collaborative decision making technologies that respond to DoD, CCMD, Service, and other government organization priorities as new threats emerge or new opportunities are presented.  QRF anticipates funding two to three projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Persistent Intelligence, Surveillance, and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area helps address emerging needs for persistent ISR capabilities to improve ground, air, sea, and space situational awareness.  Projects will address needs identified in 2018 and 2019 through development of prototypes that explore new or improved methods for surveillance sensors to persistently operate within denied areas.  This focus area also explores more effective and agile ISR architectures for rapidly processing, exploiting, and disseminating intelligence.  QRF will leverage existing efforts and ensure projects are not duplicative with ongoing persistent ISR work within the DoD or with outside agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in counter-electronic warfare technologies during the budget year will respond to Department, CCMD, Service, and other government organizations' priorities as new opportunities and new threats emerge.  Planned investments will help local communication and coordination to increase weapon systems’ and forces’ effectiveness in contested environments.  RRTO will coordinate with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia to help identify critical areas to counter emerging electronic warfare threats.  QRF anticipates funding three to four projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.178"
                                            },
                                            "Text": {
                                                "val": "Persistent ISR investment decisions during the budget year will respond to Department, CCMD, Service, and other government organization priorities.  Projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the government, industry, and academia will help identify areas critical to developing future ISR payloads.  QRF anticipates funding two to three projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.540"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.540"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, QRF will continue efforts to identify and invest in persistent ISR technologies that respond to DoD, CCMD, Service, and other government organization priorities as new threats emerge or new opportunities are presented.  QRF anticipates funding three to four projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-throughput Deoxyribonucleic Acid (DNA) Sequencing (HTS) Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "The High-throughput DNA Sequencing (HTS) Technology Focus Area will leverage technological advances in gene sequencing and bioinformatics to fundamentally change the way DNA is used to support military operations.  These projects will employ current hardware coupled with custom chemistries, data analysis algorithms, databases, and information transmission pipelines to enable more comprehensive analysis of trace, degraded, and mixed DNA samples.  This comprehensive data analysis allows for correlating individual activities and histories; the ability to determine biogeographical ancestry; increasing confidence in assigning extended kinship identifications; and, greater accuracy in predicting phenotypic attributes such as facial characteristics, eye colors, or skin tones and variations.  This focus area also includes support for HTS databases that are designed to ingest large DNA data flows efficiently, use processing power for searching and analyzing big data, and employ big data analytics to make predictive assessments that would otherwise go unnoticed.  This focus area will encourage collaboration on biometrics and forensics projects within the DoD, and with interagency, industry, academia, and international partners where applicable.  This collaboration will help maximize shared investment and prevent redundant research.  Deliverables are shared throughout the biometrics and forensics communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Investment decisions in human-machine collaborative decision making efforts during the budget year will respond to Department of Defense (DoD), CCMD, Service, and other government organization priorities.  RRTO will consider new projects as new threats emerge or new opportunities are presented.  To help identify areas critical to human-machine collaborative decision making, RRTO will leverage research and coordination with organizations throughout the DoD, FFRDCs, other government agencies, industry, and academia.  QRF anticipates funding two to three projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The HTS focus area will leverage its previous work to identify promising lines of HTS research that are feasible, cost effective, and meet the specific requirements of the end user.  Based on the outcomes of FY 2017, additional investments are expected in chemistry optimization, statistical refinement, and results interpretation.  Additionally, this project will include work in the analysis of highly degraded samples with smaller quantities of human DNA to support the familial matching performed at the Armed Forces DNA Identification Laboratory as part of the Personnel Accounting mission to identify and return the remains of missing personnel to their families.  As more research becomes available to the life science community, the HTS program will work to identify new avenues of exploration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Projects under this focus area are expected to be completed in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Face Identification at a Distance Focus Area"
                                    },
                                    "Description": {
                                        "val": "The ability to identify persons of interest from safe, concealed, and long distances is an emerging need across the Joint Force.  Face identification at a distance creates challenges that can only be addressed through improvements in technology including optics, video processing, and facial recognition algorithms.  Investments will address challenges associated with image resolution, stabilization, and atmospheric turbulence, as well as other factors associated with collecting images from non-cooperative individuals.  Associated technologies include rapid matching algorithms, storage of large facial databases, and secure dissemination within the DoD and our partners.  This project will leverage existing efforts and ensure projects are not duplicative with ongoing facial identification work within the DoD or with outside agencies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "Persistent ISR investment decisions during the budget year will respond to Department, CCMD, Service, and other government organization priorities.  Projects will be considered as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout the government, industry, and academia will help identify areas critical to developing future ISR payloads.  QRF anticipates funding two to three projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.540"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.540"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, QRF will initiate efforts for face identification at a distance that respond to DoD, CCMD, Service, and other government organization priorities as new threats emerge or new opportunities are presented.  QRF anticipates funding three to four projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Face Identification at a Distance is a new focus area for 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2019, performance metrics applicable to the Quick Reaction Fund (QRF) include the DoD Strategic Performance goal to transition 40 percent of completing demonstration programs per year.  Each QRF project typically has a period of performance of 12 months.  All QRF projects are monitored for schedule deviation, transition outcome, and deliverables such as test reports, components, and equipment.  For projects that were completed in FY 2017, the QRF achieved a transition rate of approximately 100 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "828"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Reaction Fund"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "209.202"
                        },
                        "PriorYear": {
                            "val": "49.203"
                        },
                        "CurrentYear": {
                            "val": "43.418"
                        },
                        "BudgetYearOne": {
                            "val": "43.753"
                        },
                        "BudgetYearOneBase": {
                            "val": "43.753"
                        },
                        "BudgetYearTwo": {
                            "val": "44.905"
                        },
                        "BudgetYearThree": {
                            "val": "46.579"
                        },
                        "BudgetYearFour": {
                            "val": "47.342"
                        },
                        "BudgetYearFive": {
                            "val": "47.723"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Rapid Reaction Fund (RRF) project accelerates the development and transition of high-potential science and technology (S&T) projects through operationally useful conceptual prototypes.  It achieves this by anticipating adversaries' exploitation of technology, including available and emerging commercial capabilities, and rapidly responding to new threats and opportunities.  Needs are identified and prototype projects are funded within the year of execution to demonstrate the feasibility of new technologies, enable integration into larger systems, and increase ‘speed to market’ by providing cost effective capabilities faster than typical acquisition cycles.\n\nIn prior years, RRF supported the development of alternate power sources for sensors and systems; provided low-cost capabilities for small-footprint operations; expanded human, social, and cultural knowledge relevant to military decision making; increased small unit situational awareness; advanced the interface between law enforcement and military operations; developed advanced biometrics and forensics capabilities; performed strategic multi-layer assessments; and, established a prototyping through non-traditional pathways outreach effort that facilitates better interactions with small, non-traditional companies developing innovative technologies.   \n\nIn FY 2018 and FY 2019, RRF will continue to provide a hedge against technology risk by identifying and developing near-term capabilities to support irregular warfare operations.  RRF projects support goals from the new Under Secretary of Defense (Research and Engineering).  The RRF’s current focus areas include: open source data analysis; autonomous systems and behaviors; urban characterization; prototypes for intelligence, surveillance, and reconnaissance; additive manufacturing to rapidly field prototypes; maritime technologies; and, novel applications of repurposed commercial-off-the-shelf (COTS) and government-off-the-shelf (GOTS) technologies.  Typical RRF projects address these focus areas through a conceptual prototype within 6 to 18 months and for less than $1.000 million.  \n\nRecent success stories and significant transitions of note include:\n•  Advanced File Carver: This project developed a completely new tool that allows the rapid extraction and recovery of files from large data stores such as hard drives.  The Advanced File Carver significantly increased the functionality available to users over comparable GOTS\/COTS competitors while simultaneously increasing performance speed ten-fold.  Additionally, this tool provides capabilities previously unavailable, including the reconstruction of partially overwritten files, and the recovery of digital images whose headers were deleted.  As a GOTS solution, the Department of Defense (DoD) has made this technology available across the Department and to over 15 federal agencies.\n•  Ingres Tactical WiFi: The airborne Ingres system uses active WiFi signals and advanced processing algorithms to provide an accurate geolocation of target devices in dense, electromagnetically congested, urban environments.  Ingres can identify WiFi transmitters, such as a target's phone or laptop, with better than ten meter accuracy from standoff distances.  Ingres is transitioning to the U.S. Army Special Operations Command to perform evaluations in operationally relevant environments.   \n•  Aluminum Start System: This project developed an electric plasma start system for aluminum combustors to replace the standard hydrogen-oxygen pilot-flame ignition system.  Aluminum combustors are an effective alternative to fossil fuel engines that can use sea water instead of air for oxidizer; however, current systems require pressurized hydrogen and oxygen to initiate combustion.  The prototype microwave-powered steam-plasma torch eliminates hydrogen-oxygen start systems and their associated risk.  This effort transitioned to the U.S. Navy for follow-on development and integration into the aluminum combustion power system for large displacement unmanned underwater vehicles.\n•  Bloom: Responding to an emerging operational need, Project Bloom developed a moored buoy capable of long duration surface measurement operations.  The system provides a platform for radio frequency (RF), magnetic, optical, radiological, and chemical sensing on a standardized and easy to deploy buoy.  The Bloom buoy includes an internal winch capable of submerging it for \"sleep\" periods and to avoid approaching craft.  The operational prototype was deployed to the U.S. Central Command area of responsibility and transitioned."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Innovative Projects (Projects less than one million dollars each)"
                                    },
                                    "Description": {
                                        "val": "Typical Rapid Reaction Fund (RRF) projects are completed with a single year of funding and at a cost less than $1.000 million to deliver conceptual prototypes for evaluation or assessment by warfighters and interagency users.  In FY 2017, RRF selected, executed, and transitioned multiple low cost projects: \n\n•  Vital Infrared Sensor Technology Acceleration (VISTA) Focal Plane Array (FPA): This project integrated a novel FPA sensor with a cryogenic cooler and electronics to provide significant performance improvements in detection ability, while also reducing size, weight, and power demands.  This capability transitioned to the U.S. Army.   \n•  Soldier Borne Sensor - Autonomy in Complex Environments (SBS-ACE): The project developed autonomy algorithms for extremely small Unmanned Aerial Vehicles.  The technology transitioned to the Army’s SBS program of record. \n•  Eminent Shroud: This project explored combining targeted electronic warfare (EW) effects to increase impact on adversaries without affecting U.S. and partner forces.  This capability transitioned to the U.S. Air Force and U.S. Navy.   \n•  Extending Communication beyond LOS: This project integrated an unmanned parafoil system with an unmanned surface vessel to extend digital communications and sensor connectivity beyond current line-of-site limitations.  This capability transitioned to the U.S. Navy.  \n•  Denali: This project used non-traditional methods of adaptive filtering to mitigate the effects of electro-magnetic interference (EMI) on military satellite communications.  Adaptive signal processing enabled the use of otherwise unusable or degraded channels, thereby increasing satellite effective capacity.  Denali transitioned to the Mobile User Objective System (MUOS) program of record.\n•  Prototype Dynamic Beamforming Elements (PDBE): PDBE developed an advanced communications technology capable of being deployed on multiple platforms.  This technology transitioned to the U.S. Air Force and U.S. Navy. \n•  Tactical Arterial Compression System Development: This project developed a personal, wearable solution to control difficult to treat junctional and extremity bleeding.  The capability transitioned to Naval Medical Research Unit-San Antonio for further assessment before an operational evaluation by elements from the U.S. Army Rangers and the Air National Guard. \n•  Black Ink: The project developed a classified submarine warfare enabling technology.  The technology transitioned to the U.S. Navy for implementation in submarine sensor systems.\n•  Enhanced Bugeyes: This project enhanced the Bugeyes 360-degree filming and immersive training kit with customized software to support team participation in 360-degree video playback.  Enhanced Bugeyes enables oversight by an instructor for fully immersive, classroom training of complex environments and dangerous missions.  The capability transitioned to Expeditionary Warfare Training Group Pacific.\n•  Optical System Protection: This project developed a prototype optical system that uses a custom-designed phase mask to protect imaging sensors from damage by high intensity lasers.  A field unit was built and successfully tested to demonstrate the optical system’s capabilities at visible wavelengths.  This project transitioned to the Dahlgren Naval Surface Warfare Center High Energy Lasers department.\n•  Passive Foliage Penetration (FOPEN): Passive FOPEN developed a capability to image targets under foliage using common passive sensors on airborne platforms.  After a successful operational demonstration, the real-time hardware and software was integrated and deployed as an operational prototype in the U.S. Southern Command area of responsibility.\n•  Unmanned Aerial Vehicle (UAV) Payload Dispenser: This project enhanced the multi-purpose small UAV “Quick Strike” system to address Joint Special Operations Command requirements for delivery of specialized payloads from a small UAV to remote or otherwise difficult to reach environments.  The capability was provided as an operational prototype to U.S. Special Operations Command.\n•  Eminent Tower: This project leveraged advances in mobile cognitive radar frequency (RF) technologies to port existing electronic warfare capabilities from large fixed-site facilities to mobile systems.  Eminent Tower transitioned to the Joint Counter Radio-Controlled Improvised Explosive Device (IED) Electronic Warfare (JCREW) program.\n•  Automation for Strategic Target Deployability: This project enables the automated and timely mapping of key infrastructure at scale using commercial imagery.  Further details of this project are classified.\n•  Joint Advanced Video Activity Analytics (AVAA) Workflows: This project developed a capability for the rapid exploitation of video imagery, enabling analysts to rapidly assemble automated analysis workflows using custom computer vision algorithms as building blocks.  Developed building blocks include automated video enhancement (stabilization, de-hazing, etc.), scene classification, automatic object identification, and object and anomaly tracking.  The capability deployed as an operational prototype in the U.S. Africa Command area of responsibility.\n•  Directed Laser Focus: The project applied optical phase conjugation via digital holography to tailor a laser beam’s spatial energy distribution and optimize overall system performance when transmitting long distances through the atmosphere.  This capability was provided as an operational prototype to U.S. Special Operations Command.\n•  Swift Vision: The project developed a computer-vision-enabled unmanned aerial system that supports a classified maritime mission.  The capability deployed as an operational prototype in the U.S. Pacific Command area of responsibility.\n•  Silent Saber: This project developed a laser system used by explosive ordnance disposal (EOD) technicians for the neutralization of improvised explosive devices (IEDs) and unexploded ordnance (UXO) from greater range.  The capability transitioned to Joint Service Explosive Ordnance Disposal (JSEOD).\n•  Scalable Effects Anti-Personnel (SEAP): This project developed expeditionary kinetic payloads capable of engaging enemy combatants while also minimizing collateral damage.  The capability transitioned to Naval Special Warfare Command.\n•  Solid State Pulsed X-Ray Generator: This effort developed a compact solid-state pulsed X-ray generator prototype for use by explosive ordnance disposal (EOD).  The prototype images the interior of IEDs while significantly improving accuracy and speed.  The prototype transitioned to Joint Service Explosive Ordnance Disposal (JSEOD).\n•  Machete LADAR Enhanced Onboard Processing: This project developed improved real-time onboard processing algorithms for an airborne LADAR system, reducing the time necessary to generate actionable data products.  The capability deployed as an operational prototype in the U.S. Southern Command area of responsibility.\n•  Gradient Virgo: Gradient Virgo integrated precision measuring matrix (PMM) software into the V-Space Tactical voice recognition system.  The PMM integration allows for improved speaker correlation and recognition with a decreased error rate.  This capability was provided as an operational prototype to U.S. Special Operations Command.\n•  Multi-Intelligence Tactical Edge Analytics: This effort developed optimized methods for partial processing of intelligence data at the collection source.  This reduces required bandwidth for transmitting intelligence and results in actionable data products faster.  The resulting capability transitioned to a classified DoD operation. \n•  Universal Language TRAnslator (ULTRA): This project developed an Android application that enables the remote warfighter to translate uncommon languages without the need for internet connectivity.  The application included an expanded lexicon of military-specific terms that are not normally contained in commercial translation tools.  The prototype also includes a toolset that allows users to build additional language modules, which can be downloaded onto an Android phone to be used remotely.  This technology deployed as an operational prototype in the U.S. Africa Command area of responsibility.\n•  Midwave Infrared (MWIR) Halo Beacon: This project developed a rugged, waterproof beacon for signaling friendly forces while preventing detection from overhead surveillance.  The resulting prototype transitioned to Naval Special Warfare Command. \n•  Flexible Buoyant Body Armor: The project developed a flexible and buoyant body armor system.  Within this effort multiple experiments were conducted to achieve National Institute of Justice ballistic protection levels three and four.  This capability transitioned to the Air Force Research Laboratory.\n•  High Accuracy Video Object Classification (HAVOC): HAVOC developed an inexpensive, customizable, and highly accurate real-time automatic target recognition (ATR) system for rapid exploitation of full motion video (FMV).  This technology transitioned to multiple Special Operations Forces (SOF) components.\n•  Hive Final Mile: This project demonstrated a revolutionary enterprise resource planning tool for distributed logistics in a decentralized battle space.  Hive provides warfighters with faster and more accurate resupply by enabling individual warfighters to request supplies through an Android interface.  The system aggregates and routes requests, prioritizes shipments, and tracks delivery of supplies to enable automated distribution logistics.  Hive transitioned to the U.S. Marine Corps and separately for evaluation in the U.S. European Command area of responsibility.        \n•  SOF Combat Diver Communications: The project developed and demonstrated an underwater non-detectable communications system for integration into multiple platforms.  This technology transitioned to the Naval Special Warfare Command.\n•  Orthos: The project developed customizable, concealable field-sets that communicate position, brief messages, or code words to multiple, multi-purpose cross-connected receiver platforms in challenging threat or degraded communications environments.  Orthos transitioned to Special Operations Forces (SOF) warfighters from multiple components.\n•  Jungle and Urban Non-Global Positioning System Orientation (JUNO): The project incorporated bionic power leg brace sensors into dead reckoning algorithms developed for navigation in Global Positioning System denied and degraded environments.  The prototype transitioned to the Space and Naval Warfare (SPAWAR) Systems Center Pacific (SSC Pacific) for integration into the Pacific’s Battlefield Objective Navigation Display (BOND) application for dismounted infantry. \n•  Computational Reconfigurable Image Spectrometer (CRISP): CRISP developed a small form factor, enhanced-sensitivity hyperspectral imagery (HSI) sensor capable of operation without active cooling.  The capability was provided as an operational prototype to U.S. Special Operations Command.\n•  Advanced Persistent Malware Threat Intrusion Projection Tool: This project developed a prototype computer network intrusion protection system (IPS) to detect, quarantine, and report attacks on DoD and defense industrial base computer networks.  This capability transitioned to a DoD Crime Center.  \n•  Shortstop: This project developed enhanced network security capabilities and automated security workflows.  Shortstop allows operators to respond to attacks in relevant timeframes.  The technology deployed as an operational prototype in the U.S. Pacific Command area of responsibility. \n•  Whistler: This project developed an ability to detect unmanned aerial systems (UAS) and alert dismounted soldiers of their presence.  The technology was provided as an operational prototype to U.S. Special Operations Command.\n•  Dancer: This project enabled joint warfighters to send and receive encrypted messages with a low probability of being detected or intercepted.  The capability was provided as an operational prototype to U.S. Special Operations Command. \n•  Spatially Selective Electronic Attack: This project developed a capability to target electronic warfare (EW) effects to a small geographical region, and reduce impact on neutral or partner forces.  This capability transitioned to a classified customer.\n•  Distributed Detection and Tracking: This project developed technology to identify and track moving people or vehicles across several disparate overhead video feeds collected by a distributed “swarm” of UAVs.  The capability was provided as an operational prototype to U.S. Special Operations Command.\n•  Tactical Application Security: This effort enhanced current network security capabilities by providing a method to virtually contain and dynamically encrypt computer processes.  This technology transitioned to the U.S. Army.  \n•  Millimeter Wave (MMW) Sensing for Autonomy Phase II: This project developed and evaluated a commercial automotive radar technology as a low-cost sensor for autonomous military applications.  The technology transitioned to the Air Force Research Laboratory for further development. \n•  Identity Operations (ID-OPS) for Open-source Intelligence (OSINT): This effort developed the techniques and software needed to discover potential threats by connecting individuals to other persons, places, events, or materials, and analyzing their patterns of life.  The capability was provided as an operational prototype to U.S. Special Operations Command and other government partners.\n•  Face Acquisition Recognition of Identities (FAR-ID): This project provided long range surveillance and near real-time identification capabilities to the warfighter by using advanced optics capable of detecting and matching faces from distances exceeding 500 meters.  This technology transitioned to Program Manager DoD Biometrics. \n•  Single Sweep: This project developed novel algorithms to process raw radar data differently in order to identify unmanned aerial vehicles in real time.  This technology transitioned to the Navy’s Fleet Forces Command. \n•  Model Enhanced Analysis, Design, & Execution (MEADE) Predictive Control System: MEADE successfully prototyped a software system and concept of operations that improves DoD’s ability to conduct analysis and planning at the operational level.  The effort was provided as an operational prototype to the Joint Special Operations Command and three Theater Special Operations Commands.\n•  Lite Saber: This project created a payload for unmanned aerial systems that extended the range and data transfer rate of ground force communications.  This capability was provided as an operational prototype to U.S. Special Operations Command for a military utility assessment.\n•  Autonomous Littoral Connector (ALC): This project developed the capability to autonomously move cargo from a maritime prepositioned force to the beach and to return without human intervention.  The capability transitioned to Office of Naval Research for incorporation in the Autonomous Continuous Trail Unmanned Vehicle."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.453"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER TEXT ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wide-area Infrared System for 360-degree Persistent Surveillance - Spiral-2 (WISP-2)"
                                    },
                                    "Description": {
                                        "val": "The WISP-2 system uses passive infrared imagery to detect and track moving air and ground targets within the sensor’s range and field-of-view.  WISP-2 was developed for Counter-Unmanned Aerial System (CUAS), but has broad applicability for use against other air and ground targets of interest.  WISP-2 technology is enabled by infrared digital-pixel focal plane array (DFPA) and real-time processing algorithms and software.  The advanced processing algorithms automatically adapt to the scene and detect the presence of moving objects in the surroundings.  WISP 2.0 was successfully demonstrated and operationally fielded in the U.S. Central Command’s area of responsibility as a solution to a Joint Urgent Operational Need."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to work with the Commander of the U.S. Central Command via the reach back cell to support ongoing operations in the region.  The SMA Cell will also continue to actively work with the CCMDs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership and may include areas such as:  counter terrorism, transnational criminal organizations, counter weapons of mass destruction (state and non-state), counter global or regional social and cultural assessments, regional stability assessments, and individual state or national level deterrence studies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Common Unmanned Aerial Vehicle System Simulation (CUAVSS)"
                                    },
                                    "Description": {
                                        "val": "The CUAVSS project developed and demonstrated a simulation environment for unmanned aerial vehicles (UAV) and sensor combinations, allowing operators to plan missions based on simulated performance in operationally realistic scenarios.  The simulation environment can be adapted to assess UAV performance throughout the UAV lifecycle including research and development, air vehicle and payload configuration, mission review, and failure analysis and mitigation.  Subsequent to an FY 2018 demonstration, CUAVSS will transition to users within Naval Systems Command and U.S. Special Operations Command.  This technology area is a congressional interest item and in FY 2017 additional resources were provided above the President’s budget request, exceeding typical limits for RRF funded projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.650"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ultra-Lightweight, High-Efficiency Solar Panels for HALE Aircraft"
                                    },
                                    "Description": {
                                        "val": "This project developed lightweight, efficient, and flexible solar panel sheets for integration onto High Altitude, Long Endurance (HALE) aircraft.  The high specific power of these advanced solar cells is 25 percent better than other commercial solar cells, and will enable unmanned aerial systems (UAS) to conduct long endurance missions with increased propulsion and payload power requirements.  The ultra-lightweight, high-efficiency solar panels will transition to users within U.S. Central Command and U.S. Pacific Command.  This technology area is a congressional interest item and in FY 2017 additional resources were provided above the President’s budget request, exceeding typical limits for RRF funded projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Cell"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell provides planning support to Combatant Commands (CCMDs) and U.S. Government agencies; and, provides actionable assessments of complex operational and technical challenges to help maintain our competitive advantage in an increasingly complex global environment.  The SMA reach-back cell was established by the Joint Staff Deputy Director for Global Operations (DDGO) at the request of the Commander, U.S. Central Command (USCENTCOM).  SMA efforts leverage multi-agency, multi-disciplinary approaches to address requirements that are not within the customer organization’s core competency.  SMA assessments are framed during the year of execution and are in response to specific tasking from senior leadership in the CCMDs.  The SMA Cell identifies options from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J-3 Operations and are executed by the Office of the Under Secretary of Defense, Research and Engineering.  The SMA Cell provides USCENTCOM with population-based and regional expertise in support of ongoing operations in the Iraq\/Syria region."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "This portfolio will complete and deliver three new capabilities in FY 2017.  The first capability will be a handheld, rapid, automatic explosive detector called ExploDisk.  This device will not only check for the presence of seven common explosives, its novel use of cellphone camera technology will mitigate human error in color determination; a common weakness with current technologies.  This capability can also support the identification of illegal drugs by using different disposable analysis ‘chips’.  The second capability is a novel DNA analysis protocol that will extend kinship analysis from the current limit of second generation (grandparents or siblings) to the fourth generation (great-great grandparents or cousins).  This capability is critical to support the identification of remains lost from World War II and Korea as their direct relations may die before the service members’ remains are located.  The final effort leverages FY 2016 funds to finish development and deliver an advanced file carving system.  This system will accelerate the extraction and categorization of files of interest from large data stores while simultaneously screening out useless junk files.  Depending on the file types, this carver will accelerate the process 25 percent to 80 percent over prior carving systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.100"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to work with USCENTCOM via the reach back cell to support ongoing operations in Iraq and Syria by responding to queries from senior leaders.  The SMA cell was asked by USCENTCOM Commander to continue to develop the reach back concept to provide a short term tool to assist his staff in understanding actor relationships and conducting if\/then analyses.  The SMA Cell will also continue to actively work with the CCMDs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership and may include areas such as: counter terrorism, transnational criminal organizations, counter weapons of mass destruction (state and non-state), counter global or regional social and cultural assessments, regional stability assessments, and individual state or national level deterrence studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to actively work with the CCMDs and the Joint Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Faster Short Tandem Repeat (FaSTR) Human Deoxyribonucleic Acid (DNA) Profiling System"
                                    },
                                    "Description": {
                                        "val": "Previous rapid DNA analysis systems have relied on pneumatics and mechanical valves for microfluidic movement.  Current systems are comprised of bulky hardware and DNA analysis times greater than 60 minutes.  The FaSTR DNA instrument exploits centrifugally-driven microfluidics to eliminate mechanical valves and pressure-driven flow, and allows commercial-off-the-shelf electronics to facilitate sample preparation, polymerase chain reaction, and assessment.  This paradigm shift to microfluidic technology radically reduces the form factor, analysis time, and cost of the system.  The FaSTR project will produce the first truly portable, rapid DNA analysis instrument capable of generating DNA profiles from “sample in” to “answer out” in less than 30 minutes and provide a match probability of 1 in 55 billion people."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways investment decisions are made during execution years in response to emerging needs from DoD, CCMDs, Service, and other government organizations, and opportunities presented by non-traditional commercial companies.  Innovative ideas are considered through the filter of Assistant Secretary of Defense for Research and Engineering’s (ASD(R&E)) focus areas and other DoD priorities.  In FY 2017, the program anticipates proposals to address challenges for autonomous learning systems, information flow and data analysis, virtual prototyping, exploitation of communications technologies, advanced electronic sensors, machine assisted human operations, capabilities to respond to future electric warfare threats, and other emerging technology areas.  RRTO will support three to four need-focused reviews and anticipates 10 to 15 subsequent evaluations with the potential for prototyping efforts.  These reviews will be executed with DoD users and interagency partners including DASD(EC&P), ASD(R&E) Cyber Strategy, Army Night Vision Sensors Directorate, and Defense Threat Reduction Agency’s Joint Improvised-Threat Defeat Organization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Leveraging FY 2017 accomplishments, the project will deliver three prototypes and 75 consumables for operational testing in theater.  The prototypes will weigh less than ten pounds and can compare a sample to a nine loci DNA profile in less than 30 minutes.  Test results, technical and training materials, and initial low rate production manufacturing technical specifications will be included in the deliverables."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This project will be completed in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biometrics and Forensics Science and Technology for Identity Dominance"
                                    },
                                    "Description": {
                                        "val": "Biometrics and Forensics Science and Technology projects field prototypes to address emerging technology gaps that limit our ability to quickly and accurately identify anonymous individuals who threaten our physical and virtual assets.  The overall goal of these projects is to reduce future operational risk to warfighters.  New technologies demonstrated through this program will allow warfighters to identify bad actors or counter adversaries’ attempts to mitigate our technologies.  These projects leverage techniques such as conceptual prototyping, increased use of small businesses, and increased competition between vendors.  Biometrics and forensics projects will mature emerging technologies that support identity operations and forensic capabilities required by commanders and warfighters in ongoing and future military activities.  These efforts encourage collaboration on biometrics and forensics projects within the DoD, and with interagency, industry, academia, and international partners where applicable.  This model will help maximize collaborative investment and prevent redundant research.  Deliverables are shared throughout the biometrics and forensics communities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "During FY 2017, the FaSTR project will continue the development of three FaSTR prototypes leading to operational testing in FY 2018.  The final prototypes will weigh less than 10 pounds, have a total size less than 600 cubic inches, and have a low rate production cost below $10,000 for the unit and $50 for per sample consumables.  These metrics represent substantial improvement over current rapid DNA technologies in terms size and weight (>90 percent reduction), analysis speed (67 percent reduction), and cost (>90 percent reduction)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.450"
                                            },
                                            "Text": {
                                                "val": "The biometrics and forensics science and technology portfolio will continue to mitigate gaps identified by commanders and operational users and improve capabilities in the areas of biometrics and forensics.  The portfolio will continue work on projects scheduled for FY 2018 delivery that include the Enhanced Access Control for Husbanding Operations using Biometrics project, a web-based enrollment application to enable private foreign agencies to submit personnel biometric and biographic data directly to DoD law enforcement agencies for vetting; the Advanced Persistent Threats Intrusion Protection System, a computer network intrusion protection system prototype to prevent nation states from gaining access to DoD, Joint Force, and defense industrial base information networks; and, the DoD Biometrics System Interoperability Lab (SIL) and Long Range Facial Identification Database, a repository of face imagery collected at various standoff distances and operational conditions with a related biometric SIL capability to conduct testing and assess the performance of face matching algorithms.  Additional projects for biometrics and forensics portfolios will be selected after coordination throughout DoD and across other U.S. Government departments and agencies to maximize collaborative investment and prevent unnecessary redundant research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for the biometric and forensic portfolio will be based on emerging threats and requirements identified by the CCMDs, institutional forensic laboratories, and other biometric and forensic stakeholders.  The portfolio will continue work on projects scheduled for FY 2019 delivery including The Autonomously Sharing Biometric Enabled Watchlist (BEWL), a capability that provides near real-time BEWL information to DoD Components.  New projects under consideration will be thoroughly coordinated across the biometric and forensic enterprises to minimize duplication, maximize cooperative funding, and identify the most promising projects with the strongest path for transitioning the technology.  RRF anticipates supporting six to eight projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Through Non-Traditional Pathways"
                                    },
                                    "Description": {
                                        "val": "Prototyping Through Non-Traditional Pathways leverages technology and emerging products developed by small, innovative businesses in the commercial sector.  Ideas from non-traditional emerging technology companies are matched against Department of Defense (DoD), Combatant Commands (CCMD), Service, and other government organization priorities.  Promising solutions are selected for further test and evaluation and, if successful, rapid prototyping or fielding to transition commercial ideas with military utility.  These efforts support the Department's objectives of promoting effective competition, increasing speed to market, implementing technological and organizational innovation, and fielding affordable capabilities through innovation from commercial research and development.  In FY 2017, Prototyping Through Non-Traditional Pathways conducted industry-wide engagements focused on the technology needs of the Department of Defense Sensors Community of Interest (COI), Electronic Warfare COI, Advanced Electronics COI, and the Joint Improvised-Threat Defeat Organization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for Open Source Data Analysis and Applications projects are made during the execution years in response to the Department of Defense (DoD), Combatant Commands (CCMDs), Service, and other government organizations' priorities.  RRF will support development of virtual prototypes and new open source data analysis tools and applications to provide a hedge against emerging, irregular, and asymmetric threats.  The program anticipates supporting eight to ten projects in FY 2017.  Deliverables will leverage emerging technologies, such as autonomous learning systems, to exploit open source information and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways anticipates three to five reviews in FY 2018, and 15 to 20 resulting evaluations with potential for future prototypes.  Each review focuses on identifying ideas in a specific topic area that can transition to meet joint operational needs through rapid prototyping.  These reviews will be executed with DoD users and interagency partners including the Office of the Under Secretary of Defense for Intelligence, Cyber Science and Technology (S&T) Community of Interest, U.S. Special Operations Command S&T, Defense Health Agency, and Department of Homeland Security S&T."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Prototyping Through Non-Traditional Pathways anticipates three to five reviews in FY 2019, and 15 to 20 resulting tests and evaluations with potential for future prototypes.  Topics areas will be informed by DoD users and interagency partners based on priorities identified in the execution year.  These reviews will be executed with DoD users and interagency partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Open Source Data Analysis and Applications Focus Area"
                                    },
                                    "Description": {
                                        "val": "Open Source Data Analysis and Applications projects include the development of capabilities, software, and tools to analyze open source information.  The data can be structured or unstructured and will include inputs from a broad spectrum of sources.  Where possible these projects will exploit advanced learning systems and commercial technologies to provide solutions to emerging challenges in tracking targets, big data analytics, and extracting indications and warnings.  Technologies developed within this focus area will reduce cost and analyst requirements to provide meaningful intelligence in support of the counter Islamic State of Iraq and the Levant (ISIL), counter weapons of mass destruction, and counter improvised explosive device missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "RRF investment decisions for Autonomous Systems and Behaviors are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities.  Selected projects will support development of components, payloads, and autonomous aerial, surface, and subsurface systems.  RRF anticipates supporting four to six projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.620"
                                            },
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  RRF will support development of conceptual prototypes and new open source data analysis tools and applications to provide a hedge against emerging, irregular, and asymmetric threats.  The program anticipates supporting six to eight projects in FY 2018.  Deliverables will leverage emerging technologies to exploit open source information and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.832"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.832"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions are made during the execution years in response to DoD, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  The program anticipates supporting six to eight projects in FY 2019.  Deliverables will leverage emerging technologies to exploit open source information and reduce analyst requirements to provide actionable intelligence."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems and Behaviors Focus Area"
                                    },
                                    "Description": {
                                        "val": "Autonomous Systems and Behaviors projects demonstrate capabilities to enhance joint forces, reduce the time to make critical decisions, and protect warfighters through increased use of autonomous and human-machine collaborative systems.  Example projects include power systems to facilitate increased performance of unmanned systems, enhanced capabilities for multiple autonomous systems to cooperatively interact, autonomous operation in complex terrain, development of sensors for integration aboard unmanned platforms, improvements to data ex-filtration from unmanned sensors, human-machine collaborative decision making, and experiments to counter emerging unmanned threats from potential adversaries.  These projects will also examine common software platforms to reduce development cost, increase collaboration among manned and unmanned vehicles, increase agility through rapid customization of autonomous systems’ architectures, and inform requirement decisions for the autonomy community of interest to design affordable systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The RRF investment decisions for urban characterization projects are made during the execution years in response to DoD, CCMDs, Service, and other government organizations' priorities.  As new threats emerge and new opportunities are presented RRF will select projects to demonstrate capabilities for Urban Characterization.  RRF anticipates supporting four to six projects in FY 2017.  Deliverables will include virtual prototypes, modeling, and simulations to support planning efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.429"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for Autonomous Systems and Behaviors are made during the execution years in response to DoD, CCMD, Service, and other government organization priorities.  Selected projects will support development of components, payloads, and autonomous aerial, surface, and subsurface systems.  RRF anticipates supporting six to seven projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.821"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.821"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for Autonomous Systems and Behaviors are made during the execution years in response to DoD, CCMD, Service, and other government organization priorities.  RRF anticipates supporting six to seven projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Urban Characterization Focus Areas"
                                    },
                                    "Description": {
                                        "val": "Future military operations will likely occur in a broad range of urban environments with complex radio frequency (RF), topological, situational awareness, and mobility challenges.  Urban Characterization Focus Area projects will identify, analyze, and describe typical urban areas for modeling, simulation, and planning purposes.  These efforts will inform and enable development of intelligence, surveillance, and reconnaissance (ISR); electronic warfare; kinetic and non-kinetic effects; and, other capabilities needed for future military operations in a wide range of urban areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "RRF investment decisions for ISR prototypes are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities.  RRF anticipates supporting five to seven projects in FY 2017.  Deliverables will include prototype systems and software for a variety of platforms, as well as analytical capabilities developed to reduce the analyst burden needed to process large sets of ISR data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.624"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Urban Characterization projects are made during the execution years in response to DoD, CCMD, Service, and other government organization priorities.  As new threats emerge and new opportunities are presented, RRF will select projects to demonstrate capabilities for Urban Characterization.  RRF anticipates supporting four to five projects in FY 2018.  Deliverables will include conceptual prototypes, modeling, and simulations to support planning efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.819"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.819"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Urban Characterization projects are made during the execution years in response to DoD, CCMD, Service, and other government organization priorities.  RRF anticipates supporting four to five projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Prototyping for Intelligence, Surveillance, and Reconnaissance (ISR) Focus Area"
                                    },
                                    "Description": {
                                        "val": "ISR sensors are critical for providing asymmetric compensation against larger, near-peer adversaries.  However, ISR systems span a wide range of sensing modalities and generally produce very large data sets that are difficult to analyze.  Efforts in this focus area will increase speed to market for better sensors and tools to more effectively analyze or visualize ISR data.  Projects include improved surveillance sensors; tools to facilitate analysis of large data sets; methods to harvest meaningful intelligence from open and classified sources; and, establishment of more effective processing, exploitation, and dissemination capabilities.  RRF sponsored prototypes will facilitate integration of advanced ISR capabilities into new and existing systems.  These prototypes will help increase the effectiveness of ISR architectures and reduce the human analyst requirement to produce actionable intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to Department, Combatant Commands (CCMDs), Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  For additive manufacturing projects this agility allows RRTO to leverage new capabilities developed by commercial industry.  Research and coordination with organizations throughout Department of Defense (DoD) and other government agencies will help identify needs that could be addressed by future capabilities within the additive manufacturing field.  RRF anticipates supporting six to eight projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.179"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for ISR prototypes are made during the execution years in response to Department, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  Research and coordination with organizations throughout DoD and other government agencies will help identify areas critical to developing future ISR capabilities.  RRF anticipates supporting five to seven projects in FY 2018.  Deliverables will include prototype systems, analytical capabilities, and software for a variety of platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.971"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.971"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions for ISR prototypes are made during the execution years in response to Department, CCMD, Service, and other government organization priorities.  RRF anticipates supporting five to seven projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area will develop the enabling capabilities and key technologies required to advance and secure additive manufacturing technology to meet specific warfighter needs.  Additive manufacturing projects are those that use processes in which successive layers of material are laid down under computer control to create functional three dimensional products.  Additive manufacturing allows for rapid prototyping and iterative innovation, removing barriers for technology insertion.  Due to increased speed from design to prototype, reduced cost, and reduced waste, additive manufacturing provides a unique supporting capability for maintaining a U.S. competitive advantage.  This focus area will leverage swiftly-developing commercial innovation and emerging capabilities of the Federally Funded Research and Development Centers (FFRDCs), government laboratories, and academia to develop conceptual prototypes focused on warfighter needs.  Projects include spare part replacement, jet engine repair, custom hardware enclosures, and three-dimensional (3-D) models.  Projects have the potential to significantly improve supply chain efficiencies by storing parts as software and manufacturing on demand, and by using rapid prototyping to reduce the time and cost of design.  Projects can also reduce amount of labor required to produce functioning prototypes.  Projects will also investigate security of additive manufacturing technologies and digital schematics.  Deliverables will inform enhancement decisions and concept of operations development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The RRF investment decisions for Maritime Dominance Technology focus area are made during the execution years in response to Department, CCMDs, Service, and other government organizations' priorities.  As new threats emerge or new opportunities are presented RRF will select projects to demonstrate new payloads, better sensors, and new undersea systems to enhance deterrence.  RRF anticipates supporting eight to ten projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.110"
                                            },
                                            "Text": {
                                                "val": "Rapid Reaction Fund (RRF) investment decisions are made during the execution years in response to Department, Combatant Commands (CCMD), Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  For additive manufacturing projects this agility supports leveraging new capabilities developed by commercial industry.  Research and coordination with organizations throughout Department of Defense (DoD) and other government agencies will help identify needs that could be addressed by future capabilities within the additive manufacturing field.  RRF anticipates supporting five to seven projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.810"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.810"
                                            },
                                            "Text": {
                                                "val": "RRF investment decisions are made during the execution years.  The selection of future additive manufacturing projects will be based on priorities throughout DoD and other government agencies, and new opportunities for additive manufacturing.  RRF anticipates supporting five to seven projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Maritime Dominance Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "This focus area will develop the enabling capabilities and key technologies required to maintain maritime dominance, drawing the Chairman’s Gap Assessment and strategic guidance from the new Under Secretary of Defense for Research and Engineering.  Major drivers in the maritime domain include the development of extra-large, large, and small families of multi-mission unmanned undersea vehicles (UUVs), and the rapid growth of commercial undersea activity.  The DoD is exploring emerging concepts for ubiquitous undersea communications, command and control, and large-scale UUV capabilities.  To enable these concepts, RRF will focus on developing capabilities and technologies such as undersea power production, storage, and distribution; enhanced signal processing; autonomy; undersea situational awareness and navigation; sensors; undersea communications; and advanced materials development and production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for wargaming are made during the execution years in response to Department, CCMD, Service, and other government organizations' priorities and as new threats emerge or new opportunities are presented.  Projects will include wargame efforts employing government laboratory scientists, subject matter experts, and students of science, technology, engineering, and math (STEM) disciplines to explore unconventional approaches to counter DoD technologies.  Deliverables will include recommendations on system operational employment, potential vulnerabilities, and likely countermeasures taken by the threat as well as potential counter-countermeasures to increase functionality or operational effectiveness of the system.  RRF anticipate supporting five to six projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.656"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Maritime Dominance Technology focus area are made during the execution years in response to Department, CCMD, Service, and other government organization priorities.  As new threats emerge or new opportunities are presented RRF will select projects to demonstrate new payloads, better sensors, and new undersea systems to enhance deterrence.  RRF anticipates supporting eight to nine projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.791"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.791"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for Maritime Dominance Technology focus area are made during the execution years in response to Department, CCMD, Service, and other government organization priorities.  RRF anticipates supporting eight to nine projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prototyping Through Novel Reuse of Commercial-Off-the–Shelf (COTS) Technologies Focus Area"
                                    },
                                    "Description": {
                                        "val": "This effort increases impact and responsiveness of prototyping efforts through the reuse and repurposing of existing commercial and governmental technologies.  Frequently, systems developed for a separate application provide a partial solution to new emerging challenges.  By building new prototypes around a core of proven technologies, this effort reduces development and adoption risk in addition to controlling cost.  This focus area provides RRF with agility by leveraging existing technologies to develop new prototypes and demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.150"
                                            },
                                            "Text": {
                                                "val": "The Rapid Reaction Fund (RRF) investment decisions for COTS-based prototypes are made during the execution years in response to Department, CCMD, Service, and other government organization priorities and as new threats emerge or new opportunities are presented.  Projects identified include efforts to repurpose commercial communication protocols into an electronic warfare capability, airport radar systems for bird alerts repurposed for counter-unmanned aircraft system (UAS), and commercial network security platforms.  RRF anticipates supporting two to three projects in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.209"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.209"
                                            },
                                            "Text": {
                                                "val": "The RRF investment decisions for COTS-based prototypes are made during the execution years in response to Department, CCMD, Service, and other government organization priorities.  RRF anticipates supporting two to three projects in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2017 and FY 2018 funding levels are lower than the baseline for this focus area, which is listed under FY 2019.  This is because once projects are selected and funded during the years of execution (FY 2017\/2018), the funds for these projects are reported elsewhere in this R-2.  Projects have not been selected for FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "In FY 2019, performance metrics applicable to the Rapid Reaction Fund (RRF) include the DoD Strategic Performance goal to transition 40 percent of completing demonstration programs per year.  In addition, project performance metrics are specific to each effort and include measures identified in individual project plans.  Project completions and successes are monitored against schedules and deliverables stated in the proposals and statements of work.  The metrics include items such as target milestone dates, specific performance measures, fielding dates, and demonstration goals.  For projects completed in FY 2017, the RRF achieved a transition rate of approximately 80 percent."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "831"
                    },
                    "ProjectTitle": {
                        "val": "Joint Rapid Acquisition Cell Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "7.978"
                        },
                        "PriorYear": {
                            "val": "1.583"
                        },
                        "CurrentYear": {
                            "val": "1.652"
                        },
                        "BudgetYearOne": {
                            "val": "1.669"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.669"
                        },
                        "BudgetYearTwo": {
                            "val": "1.685"
                        },
                        "BudgetYearThree": {
                            "val": "1.702"
                        },
                        "BudgetYearFour": {
                            "val": "1.719"
                        },
                        "BudgetYearFive": {
                            "val": "1.736"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This funding includes support for the Joint Rapid Acquisition Cell (JRAC) to enable management and tracking of Combatant Command (CCMD) identified and Joint Staff validated immediate warfighter needs.  The JRAC is responsible to: \n(1)  Coordinate review of validated Joint Urgent Operational Needs (JUON) and Joint Emergent Operational Needs (JEON) and assign responsibility to appropriate DoD Components for timely funding and resolution. \n(2)  Serve as the review and approval authority for the DoD Components’ strategy to fund and mitigate the identified JUON\/JEON capability gaps. \n(3)  Continually assess actions taken by the DoD Components to resolve JUONs\/JEONs and recommend to the Under Secretary of Defense for Research and Engineering any changes determined appropriate to improve their responsiveness to JUONs\/JEONs.\n(4)  Provide periodic reports to the Secretary of Defense on new and outstanding JUONs\/JEONs.   \n(5)  In coordination with Under Secretary of Defense Comptroller (USD(C)), manage the Rapid Acquisition Fund (RAF) to allocate resources to priority unfunded JUONs\/JEONs.\n(6)  In coordination with the Office of the Chairman of the Joint Chiefs of Staff and the USD(C), make programmatic, budget, and acquisition recommendations for JUONs and identify capability gaps to the Secretary of Defense."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Rapid Acquisition Cell (JRAC) Management Support"
                                    },
                                    "Description": {
                                        "val": "This funding is used to support the staff manning of the JRAC to enable management and tracking of CCMD identified and Joint Staff validated immediate warfighter needs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of CCMD initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.652"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of CCMD initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.669"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.669"
                                            },
                                            "Text": {
                                                "val": "Continue support for the JRAC management and tracking of CCMD initiatives.  Continue validation of the warfighter needs by the Joint Staff."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations and growth consistent with inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A – Capabilities acquired to fulfill Joint Urgent Operational Needs (JUON) and Joint Emergent Operational Needs (JEON) are provided by other DoD components."
                        },
                        "PerformanceMetrics": {
                            "val": "Joint Rapid Acquisition Cell performance metrics are specific to each JUON\/JEON and include measures identified in the management approach for each action.  In addition, JUON\/JEON completions and successes are monitored against schedules and deliverables stated in the management approach.  The metrics that JRAC support correlates to is the number of full time personnel identified in the JRAC support contract with associated pay rates and shall not exceed the specified amounts or hourly rates and\/or firm fixed price."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "833"
                    },
                    "ProjectTitle": {
                        "val": "Strategic Multi-Layered Assessment (SMA) Support"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "8.496"
                        },
                        "PriorYear": {
                            "val": "2.208"
                        },
                        "CurrentYear": {
                            "val": "2.305"
                        },
                        "BudgetYearOne": {
                            "val": "2.328"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.328"
                        },
                        "BudgetYearTwo": {
                            "val": "2.351"
                        },
                        "BudgetYearThree": {
                            "val": "2.375"
                        },
                        "BudgetYearFour": {
                            "val": "2.399"
                        },
                        "BudgetYearFive": {
                            "val": "2.423"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Strategic Multi-Layered Assessment (SMA) Cell supports all Combatant Commands (CCMDs), Joint Force Commanders, and other government agencies by assessing complex operational and technical challenges, which require collaborative multi-agency and multi-disciplinary approaches.  With input from across the U.S. Government, academia, and the private sector, the SMA Cell develops options to CCMD-generated challenging problems and informs the command's senior leadership.  Each SMA effort is initiated at the request of senior CCMD leadership and priorities for SMA problems are set by the Joint Staff Deputy Director for Global Operations.  Products are typically produced within six months and directly contribute to the decision making process of CCMD's senior leaders.  SMA is also supported by the Rapid Reaction Fund (RRF)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assessing ‘Gray Zone’ Conflicts for the U.S. Security Coordinator (USSC), U.S. European Command (USEUCOM), U.S. Special Operations Command (USSOCOM), and U.S. Strategic Command (USSTRATCOM)"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell started a strategic analysis effort at the request of the United States Security Coordinator for Israel and the Palestinian Authority.  The effort evaluated strategic risks and identified knowledge gaps to provide an increased understanding of potential security environments and their implications for Palestinian security sector reform.  USEUCOM subsequently asked SMA to apply the same methodology to identify emerging Russian threats and opportunities in Eurasia.  Building on these efforts, USSOCOM requested that the SMA cell assess how the U.S. Government can diagnose, identify, and assess indirect strategies, and develop response options against associated types of Gray Zone challenges.  SMA completed several actor and social media analyses including Virtual Think Tank Assessments (ViTTa) that provided summarized subject matter expert (SME) analyses to USSOCOM.  The assessing ‘Gray Zone’ support to USSOCOM concluded in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.595"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue its efforts to assess and respond to ‘Gray Zone’ conflicts in FY 2017 and transition the products to the USSOCOM Commander.  The cell will continue to actively collaborate with CCMD senior leadership and the Joint Staff leadership to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will help increase our understanding of ‘Gray Zone’ conflicts and identify potential responses.  USSOCOM is leveraging these efforts to support a senior leader forum on ‘Gray Zone’ indications and warnings and USEUCOM has established a Russian deterrence effort that benefits from SMA’s work.  Additional products will directly support other CCMDs and government agencies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Strategic Multi-Layered Assessment (SMA) Cell"
                                    },
                                    "Description": {
                                        "val": "The SMA Cell provides planning support to Combatant Commands (CCMDs) and U.S. Government agencies, along with actionable assessments for complex operational and technical challenges to help maintain our competitive advantage in an increasingly complex global environment.  Challenges addressed with SMA efforts require multi-agency, multi-disciplinary approaches that are not within the customer organization’s core competency.  The SMA Cell identifies options from across the U.S. Government, academia, and the private sector.  SMA efforts are facilitated by the Joint Chiefs of Staff\/J-3 Operations and are executed by the Office of the Under Secretary of Defense, Research and Engineering.  In FY 2017, the SMA Cell focused on questions and challenges posed by U.S. Central Command and U.S. European Command.  Specifically, SMA established a community of over 200 subject matter experts and responded to 53 separate U.S. Central Command priority questions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.613"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.305"
                                            },
                                            "Text": {
                                                "val": "With USSTRATCOM coordination the Air Force requested SMA initiate a multi-disciplinary, multi-agency portfolio of projects to assess and study contested space operations from a wide range of perspectives.  The purpose of this study is to examine how the U.S. Government can retain competitive advantage in the space domain and counter any intent to deny U.S. and partner freedom of action in the space domain."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.328"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.328"
                                            },
                                            "Text": {
                                                "val": "The SMA Cell will continue to actively work with the CCMDs and the Joint Chiefs of Staff to identify challenging problems that are not within the traditional areas of DoD expertise.  These problems will be in direct support of CCMD senior leadership and may include areas such as: counter terrorism, transnational criminal organizations, counter weapons of mass destruction (state and non-state), counter global or regional social and cultural assessments, regional stability assessments, and individual state or national level deterrence studies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Level of effort is consistent between FY 2018 and FY 2019.  Small changes reflect minor budget fluctuations and growth consistent with inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "SMA performance metrics are specific to each effort and include measures identified in the specific project plans.  In addition, project completions and successes are monitored against schedules and deliverables stated in the execution documents.  Each project’s results are reviewed by a senior review group that is comprised with representatives from the Office of the Secretary of Defense, the Joint Chiefs of Staff, the Combatant Commands, and outside subject matter experts.  The ultimate measure of success is adoption and transition of SMA products by the CCMD and supporting entities.  In FY 2017, SMA products were delivered to senior leadership and staff at U.S. Special Operations, U.S. Central Command, and U.S. European Command."
                        }
                    }
                }
            ]
        }
    }
}