{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-5",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "10"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "34.528"
            },
            "CurrentYear": {
                "val": "27.144"
            },
            "BudgetYearOne": {
                "val": "25.571"
            },
            "BudgetYearOneBase": {
                "val": "25.571"
            },
            "BudgetYearTwo": {
                "val": "26.008"
            },
            "BudgetYearThree": {
                "val": "26.451"
            },
            "BudgetYearFour": {
                "val": "26.868"
            },
            "BudgetYearFive": {
                "val": "27.415"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "193.985"
            }
        },
        "ProgramElementNote": {
            "val": "Project funding was realigned in FY19 from Project 906, Tactical Electronic Warfare Applied Research to Project CYB, Applied Offensive Cyber.  Funding was realigned in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) designs and validates electronic warfare (EW) components, both hardware and software, that deny, disrupt, or degrade the enemy's use of the electromagnetic spectrum for offensive or defensive operations. This is accomplished through the investigation of electronic support measures (ESM); countermeasures against communications systems and networks; the design and fabrication of sensors used to identify and locate threat forces in an asymmetric environment; and threat warning and electronic countermeasures (ECM) against munitions sensors, missile guidance systems, targeting systems, and explosive hazards. Project 906 supports protection of high-value ground platforms, aircraft and the Soldier from threat surveillance and tracking systems, imaging systems, and advanced radio frequency (RF)\/electro-optical (EO)\/infrared (IR) guided missiles, artillery, and smart munitions. Information fusion research addresses sensor correlation and fusion, relationship discovery, and management services through use of automated processing, as well as software that applies higher level reasoning techniques to support automated combat assessment. Project 906 also supports research and application of key EW sensors, direction finders and jammers to intercept, locate, and disrupt current and emerging communications and non-communications threat emitters to provide vital quality combat information directly to users in a timely and actionable manner. It focuses on detection of threat sensors and emitters associated with weapon systems, targeting systems and command, control, communications, computers, and intelligence systems and networks. Project CYB designs, creates, evaluates, and applies emerging cyber techniques and cyber situational awareness technologies to enhance Army capabilities and to mitigate risks and investigates cyber collection and mapping technologies to offer real time cyber situational awareness to enable interpretation of current threats and predict future enemy activities. .\n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0603270A (Electronic Warfare Technology), and PE 0603772A (Advanced Tactical Computer Science and Sensor Technology); and is coordinated with PE 0603710A (Night Vision Advanced Technology) and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Priorities.\n\nWork is performed by the Army Research, Development and Engineering Command, Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.466"
                },
                "CurrentYear": {
                    "val": "27.144"
                },
                "BudgetYearOne": {
                    "val": "26.575"
                },
                "BudgetYearOneBase": {
                    "val": "26.575"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.528"
                },
                "CurrentYear": {
                    "val": "27.144"
                },
                "BudgetYearOne": {
                    "val": "25.571"
                },
                "BudgetYearOneBase": {
                    "val": "25.571"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "9.062"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.004"
                },
                "BudgetYearOneBase": {
                    "val": "-1.004"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "10"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.926"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.004"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.004"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.012"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increase in 475 Electronic Warfare Component Technologies"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "475"
                    },
                    "ProjectTitle": {
                        "val": "ELECTRONIC WARFARE COMPONENT TECHNOLOGIES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "10.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronic Warfare technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "10"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "906"
                    },
                    "ProjectTitle": {
                        "val": "Tactical Electronic Warfare Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "24.528"
                        },
                        "CurrentYear": {
                            "val": "27.144"
                        },
                        "BudgetYearOne": {
                            "val": "20.203"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.203"
                        },
                        "BudgetYearTwo": {
                            "val": "21.063"
                        },
                        "BudgetYearThree": {
                            "val": "21.506"
                        },
                        "BudgetYearFour": {
                            "val": "21.824"
                        },
                        "BudgetYearFive": {
                            "val": "22.27"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "158.538"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project funding was realigned in FY19 from Project 906, Tactical Electronic Warfare Applied Research to Project CYB, Applied Offensive Cyber.  Funding was realigned in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, fabricates, evaluates, and applies key electronic warfare (EW)\/information operations technologies to enhance platform survivability (to include ground combat vehicles, aircraft, and the dismounted Soldier) and to intercept, track and locate current and emerging threat munitions, communications and non-communications threat emitters. This project applies recent advances in radio frequency (RF), infrared (IR), and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and jam threats (to include radar directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), top attack weapons, and electronically fuzed munitions). This project also pursues the ability to neutralize improvised explosive devices. This project designs information systems to provide vital, quality combat information directly to users in a timely, actionable manner in accordance with concepts for future force intelligence operations. This Project investigates RF collection and mapping technologies to offer real time emitter detection, location, and identification. In addition, this project enables a remote capability to disrupt, deny, or destroy threat communication signals and enables fusion (automated assimilation and synthesis) of battlefield intelligence data to enable interpretation of current threats and future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Intelligence Data Fusion and Targeting"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs and codes advanced automated exploitation and fusion analysis tools, applications, and software services for the creation of improved intelligence products, common information management and information dissemination systems to facilitate collaboration between intelligence and mission command functions. This will provide relevant and timely information in support of command decisions, such as high value identification and targeting in an asymmetric environment. Work being accomplished under Program Element (PE) 0603772A\/Project 243 complements this effort. In FY 2019, efforts are realigned to ?Data Analytics for Situational Awareness? to support the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.56"
                                            },
                                            "Text": {
                                                "val": "Assessed techniques for identifying necessary patterns and behaviors based on the types of data accessible from pertinent data sources accessed via the intelligence enterprise; designed and coded algorithms and software predictive analysis tools that support analysis of big data on the intel enterprise to determine patterns, anomalies, and behavior based upon data from various sources; evaluated the performance of tools against defined measures of effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.78"
                                            },
                                            "Text": {
                                                "val": "Mature predictive analyst tools to determine patterns, anomalies and behavior to correlate and exploit big data sources; develop techniques and software tools to correlate dark web with clear web organizational personas; develop cyber threat indicators and ratios for identification of group patterns, tactics, techniques and procedures; and apply stylometry and authorship principles to cyber content to identify and group adversarial cyber themes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2019, efforts are realigned to ?Data Analytics for Situational Awareness? to meet Army priority for Network\/C3I."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Analytics for Situational Awareness"
                                    },
                                    "Description": {
                                        "val": "This effort researches and designs spectrum sensing, electronic sensing and intelligence collection technologies and analytics to enhance overall situational understanding within a contested battlespace.\nEfforts focus on developing the analytics necessary to taking advantage of the expanding number of data sources available by leveraging existing tactical receivers and other tactical data feeds. Work being accomplished under Program Element (PE) 0603772A\/Project 243 complements this effort. In FY 2019, efforts are realigned to support the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.946"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.946"
                                            },
                                            "Text": {
                                                "val": "Will identify relevant tactical receiver data and emerging Internet of Things (IoT) data sources, to include publicly available information, enriching the existing cyber terrain and electromagnetic operations environment; will investigate potential correlation points with non-traditional datasets to identify cyber events; and will explore new data analytics, fusion algorithms and semi-automated analytical methods to process and exploit the extended datasets to support cyber situational understanding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New effort to meet Army priority for Network\/C3I."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates techniques for radio frequency (RF) network mapping, surgical disruption and unobtrusive operations in the presence of host nation networks. Electronic warfare capabilities include detection, location, classification, mapping and disruption of RF networks and providing data to a user. Work being accomplished under PE 0602270A\/Project CYB and PE 0603270A\/Projects CY3 and K15 complements this effort. In FY 2019 cyber work in this effort was moved to Project CYB per an Office of the Secretary of Defense directive to identify cyber investments in cyber unique Projects. In FY 2019, efforts are realigned to support the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.857"
                                            },
                                            "Text": {
                                                "val": "Investigated additional advanced techniques to perform various SIGINT missions against identified SOIs; began analysis of requirements for commander to perform command and control functions across security domains; analyzed data to determine necessary data models for the delivery of tactically collected cyber electromagnetic activities (CEMA) data to the intelligence enterprise; investigated analytic tools to enhance commander?s situational understanding by adding cyber data input; investigated next generation architecture requirements and research techniques to determine the current configuration state of the operational offensive cyber operations architecture to enable automated replication within a laboratory environment; conducted experiments to validate necessary hardware and software component fidelity within the future architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.984"
                                            },
                                            "Text": {
                                                "val": "Validate advanced, software techniques to perform various cyber\/EW functions against identified SOIs and devices of interest (DOIs); conclude requirements investigation and analysis of software architecture to allow the tactical commander to direct and control cyber functions from EW and SIGINT platforms across\/within security domains and battlespace domain resources; and incorporate the results of cyber laboratory experiments into the next generation architecture requirements and analysis of analytic tools that can inform the commander's situational understanding; and design and code the data models necessary for the delivery of CEMA data products to the intelligence enterprise."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.47"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.47"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging networks to identify shortfalls in capability to detect, identify and map network nodes; identify future analytic, sensor, and data research needs; and investigate techniques for surgical disruption and unobtrusive operation within native network infrastructures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease funding in Offensive Cyber Technologies to meet Army priority for Network\/C3I, and Offensive Cyber Technologies STO task ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Warning and Countermeasures, formerly Multispectral Threat Warning"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates software and warning sensor\/countermeasure components to increase probability to detect and defeat current and evolving small arms and man-portable air defense system (MANPADS) type threats for aviation platforms using modeling and simulation (M&S) and hardware in the loop (HWIL) simulations. Work being accomplished under PE 0603270A\/Project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.051"
                                            },
                                            "Text": {
                                                "val": "Continued to perform threat characterization and countermeasure development for relevant threat targets; performed feasibility study on application of high energy lasers with improved laser technology and material development as countermeasures to existing and emerging threats; incorporated higher fidelity flare simulations into the simulation environment; collected and updated data on advanced threats to update optical cross section database for use in simulation environment; incorporated threat characterization data into threat classifier software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.605"
                                            },
                                            "Text": {
                                                "val": "Investigate threat agnostic warning algorithms to increase probability of detection of threats and provide identification and position information to the countermeasure system for an increased probability of defeat; based upon feasibility study results, investigate novel techniques using lasers of higher energy than currently used to increase the probability of defeat of threats not previously encountered; use M&S to develop new threat scenarios and mature HWIL simulations that sense the electro-magnetic environment to assess existing countermeasure capabilities against previously unknown threats; investigate higher fidelity countermeasures and incorporate them into the simulation environment; investigate threat agnostic countermeasure techniques against previously unknown threats and investigate the effects of combined EO\/IR\/RF technologies to defeat both multiple and multi-spectral threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.935"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.935"
                                            },
                                            "Text": {
                                                "val": "Will investigate technologies to indiscriminately detect and defeat broad classes of threats; will conduct analysis of next-generation detect technologies with focus on machine learning algorithms to enable detection of unrecognized threat features; will conduct analysis of advanced defeat technologies focusing on new lasers and laser materials and build a breadboard laser to indiscriminately degrade electro-optical (EO) threat sensor performance; will investigate radio frequency (RF) digital hardware and software techniques that are adaptive to agile RF threats; will use M&S to iteratively train machine learning algorithms to perform threat classification and optimize laser countermeasure and RF technique development; and assess performance of technologies (e.g., machine learning, lasers, etc.) and techniques independently and incorporate them into a digital M&S platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase to assess performance of technologies and techniques independently and incorporate them into a digital modeling and simulation platform."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Function Intelligence, Surveillance and Reconnaissance Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and codes software algorithms and techniques to intelligently integrate tactical Intelligence, Surveillance, and Reconnaissance (ISR) sensors, improve their individual performance and increase the effectiveness of battlespace awareness\/intelligence data in an area of operations. Efforts focus on networking of sensors and open, scalable common radio frequency (RF) architectures for terrestrial and aerial sensors. Work being accomplished under PE 0603270A \/ Project K15 and PE 0603772A \/ Project 243, PE 0602709A\/project H95 and PE 0603701A \/ Project K70 complement this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.06"
                                            },
                                            "Text": {
                                                "val": "Completed overall architecture design, module and processing specs and interfaces for the multi-function (defensive\/offensive electronic attack, electronic support, SIGINT) RF front-end receiver; matured designs of the electronic modules including the low-band and mid-band input modules, pre-selector, N channel receiver, and master control\/computation\/communications\/power modules; investigated and designed the low band circular antenna array and mid band antenna array for terrestrial and aerial applications; began reference design and development of processing engines for basic direction finding set-on and scan applications; investigated operational and technical requirements to develop high frequency (HF) exploitation software solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.771"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments on reference design for multi-channel receiver architecture to assess baseline performance of commercial and Government off the shelf (COTS\/GOTS) receivers to determine optimal size, weight, and power and cost for a variety of electronic warfare (EW) and Signals Intelligence (SIGINT) missions, including direction finding and beamforming functions; continue to mature and validate Open RF Architecture interface specifications to support advanced interference mitigation between RF functionalities (e.g., communications, SIGINT and blue force jamming); mature interface specifications of intermediate processing functions to enable multi mission EW and SIGINT operations; standardize application interfaces across cyber, EW and SIGINT mission spaces to enable coordinated command and control (C2) of these capabilities to better address emerging threat signal classes; and begin investigation of Next Generation Radar architecture for compatibility with EW and SIGINT missions and architectures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.352"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.352"
                                            },
                                            "Text": {
                                                "val": "Will research enhanced next generation techniques for distributed sensing and single sensor geolocation to enable detection, and geolocation of advanced threats and inform requirements for future hardware designs; will investigate state of the art electronic situational awareness technique susceptibility to adversarial use of next generation RF deception and jamming; will investigate cyber hardening of sensor component technology for front-end sensors; investigate a best-of-breed low-cost HF software defined radio for use in an open multifunction ISR platform to be utilized in a hostile cyber environment; will explore trade space of shared multi-function next generation hardware for Radar, SIGINT and EW; perform tradeoff studies to understand the feasibility and impact of executing multi-function capabilities from a common RF array with consideration for advancing threat electronic protection capability; and will perform laboratory sensing data collections and analysis to address the applicability of a multi-function sensor."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to conclusion of work to mature interface specifications of intermediate processing functions to enable multi mission EW and SIGINT operations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Architectures and Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and evaluates the technical specifications of a family of threats to develop non-kinetic countermeasures. Work being accomplished under PE 0603270A\/Project K16 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Completed Open RF architecture interface vulnerability analysis; developed and matured robust information assurance vulnerability mitigation techniques for the Open RF architecture; began analysis to apply the Open RF architecture to RF capabilities on manned and unmanned airborne platforms; coordinated mitigation strategies and developed mitigation techniques for RF architecture vulnerabilities discovered for emerging SIGINT, EW and communications scheduling algorithms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi Function Electronic Warfare (MFEW) Technique Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops electronic warfare (EW) techniques critical to countering communications, such as networked command and control nodes or improvised explosive device threats, and radars, such as ground surveillance and counter-fire radars. The techniques developed are system agnostic and applicable to a wide variety of EW and electronic countermeasure applications, and they can be used to improve the performance and expand the functionality of both current and future EW system capabilities. Work being accomplished under PE 0603270A\/Project K16 complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Investigate and perform vulnerability analysis on emerging commercial communications capabilities and investigate\/develop EW techniques and methods (such as active, reactive, surgical and protocol based software) to defeat specific commercial communications systems while maximizing waveform jamming effectiveness, minimizing transmission time and reducing jamming power."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.5"
                                            },
                                            "Text": {
                                                "val": "Will investigate and perform vulnerability analysis on emerging threats (including, but not limited to, tactical communications, ground surveillance radar, and counter-fire radar systems) and mature EW techniques and methods (such as active, reactive, surgical, and protocol based software) with the goals of maximizing EW waveform jamming effectiveness, minimizing transmission time, and reducing jamming power to defeat Army relevant threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease effort in MFEW to meet Army priority for Network\/C3I."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "CYB"
                    },
                    "ProjectTitle": {
                        "val": "Applied Offensive Cyber"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "5.368"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.368"
                        },
                        "BudgetYearTwo": {
                            "val": "4.945"
                        },
                        "BudgetYearThree": {
                            "val": "4.945"
                        },
                        "BudgetYearFour": {
                            "val": "5.044"
                        },
                        "BudgetYearFive": {
                            "val": "5.145"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "25.447"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project funding was realigned in FY19 from Project 906, Tactical Electronic Warfare Applied Research to Project CYB, Applied Offensive Cyber.  Funding was realigned in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project designs, creates, evaluates, and applies emerging cyber techniques and cyber situational awareness technologies to enhance Army capabilities. This Project leverages behavioral Modeling and Simulation to mitigate risks and investigates cyber collection and mapping technologies to offer real time cyber situational awareness to enable interpretation of current threats and predict future enemy activities. This allows commanders to develop operational courses of action in time to act decisively and in a pre-emptive manner.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Information Operations Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort designs, codes and evaluates cyber architectures, software, tools and techniques that identify and capture data traversing targeted networks for the purpose of Cyber Electro Magnetic Activity (CEMA) or otherwise countering adversary communications. Cyber capabilities include detection, identification, exploitation, direction finding (DF), geolocation, and denial of service. Work being accomplished under PE 0603270A\/Projects CY3 and K15 and PE 0602270A\/Project 906 complements this effort. Project funding was realigned in FY19 from Project 906, Tactical Electronic Warfare Applied Research to Project CYB, Applied Offensive Cyber.  Funding was realigned in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects.."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.368"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.368"
                                            },
                                            "Text": {
                                                "val": "Will investigate utilizing Machine Learning for threat assessment, decision aid, and mission choreography; will determine algorithm design needs for recognition and Battle Damage Assessment for the purposes of survey, network topology understanding, and effect assessment; will refine CEMA interface definitions to include a mechanism for service\/capability discovery to address solidifying mission management across Unified Land Operations platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project funding was realigned in FY19 from Project 906, Tactical Electronic Warfare Applied Research to Project CYB, Applied Offensive Cyber.  Funding was realigned in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects.."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}