{
    "id": "2019-DefenseThreatReductionAgency-PB-0400-MJBOOK-0-8-32521504027ebdb13752e3b88d1670fe1a293063bafd6431aca8a5e28b29fb53-4",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-VOL5_ALL-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense-Wide_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604134BR"
        },
        "ProgramElementTitle": {
            "val": "Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing"
        },
        "R1LineNumber": {
            "val": "94"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "255.661"
            },
            "BudgetYearOneBase": {
                "val": "12.993"
            },
            "BudgetYearOneOCO": {
                "val": "242.668"
            },
            "BudgetYearTwo": {
                "val": "12.743"
            },
            "BudgetYearThree": {
                "val": "13.207"
            },
            "BudgetYearFour": {
                "val": "13.656"
            },
            "BudgetYearFive": {
                "val": "13.942"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "PE 0604134BR \/ Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing activities were previously authorized and appropriated under the Joint Improvised-Threat Defeat Fund (JIDF)."
        },
        "ProgramElementMissionDescription": {
            "val": "The Counter Improvised-Explosive Device (C-IED) Counter Improvised-Threat (Counter-IT) Technology Demonstration, Prototype Development, and Testing program element supports the development, demonstration, and testing of defeat technologies for advanced wireless signals, compatible electronic counter-measures for IED and IED-facilitation defeat\/neutralization, miniaturized and integrated sensors, hand-held detectors, and cutting edge Information Technology enabler capabilities. \n\nThis includes providing and enabling open, fully sharable information, and analytical software tools; situational understanding of the threat's tactics, techniques, and procedures (what is urgent and emerging); C-IED and related C-IT material solutions prototyping, experimentation, development, and delivery; and training integration support to ensure deploying and deployed forces' readiness is sustained as new equipment and methods are delivered.\n \nAssist Situational Understanding (JS) of threat-network activities. The IED and other disruptive improvised threats represent a continuing and irregular threat for deployed U.S. and coalition forces. In order to counter the threat, a deep understanding of IED and improvised threat use and facilitation is required. This DTRA capability is enabled by an advanced information technology infrastructure, analytical software tools, deployed and embedded DTRA operations integrators and intelligence analysts, and current and integrated operational data. Supported by CONUS-based reach-back linked to the intelligence community, the inter-agency, and coalition partners, analytics, when combined with production from the Defense Intelligence Enterprise, enables more complete threat awareness and understanding by deploying and deployed US forces to support their planning and targeting. This core function also informs research and development and threat-based rapid prototyping investment decisions, guides international and interagency coordination to enable counter threat-network support, and supplements U.S. Joint Force pre-deployment training to ensure the most recent threat is understood and new counter improvised threat systems can be properly utilized.\n\nEnable DoD Responses to Improvised Weapons (JR). DTRA builds counter-IED and improvised threat solutions in full collaboration with its partners. Through a robust communities of action approach, DTRA coordinates with the Combatant Commanders (CCDRs), the Joint Staff, the Military Departments\/Services, the interagency, coalition partners, industry, and academia to develop counter IED and improvised threat solutions that further enable the maneuverability and force protection of deployed U.S. Joint Forces. This methodology leverages the authorities, access, and capabilities of the entire U.S. Government and its partners to garner support for counter IED and improvised threat development and delivery.\n\nEnable Rapid Capability Delivery (JC). Understanding the threat drives a DTRA deliberate, structured, and proactive approach to identify and validate urgent or emergent capability gaps and requirements. DTRA's continuous embedded presence with deployed U.S. Joint Forces enables early identification and understanding of C-IED and C-IT gaps, vulnerabilities, and risks and the timely validation, resourcing, development, and delivery of C-IED and C-IT material and non-material solutions. DTRA technical integrators embedded with deployed forces further enables rapid adjustments to solutions as the threat’s adaptation evolves."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "255.661"
                },
                "BudgetYearOneBase": {
                    "val": "12.993"
                },
                "BudgetYearOneOCO": {
                    "val": "242.668"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "255.661"
                },
                "BudgetYearOneBase": {
                    "val": "12.993"
                },
                "BudgetYearOneOCO": {
                    "val": "242.668"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Establish RDT&E Appropriation"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "255.661"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.993"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "242.668"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The increase from FY 2018 to FY 2019 is due to the establishment of the 0604134BR \/ Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing program element in the RDT&E appropriation.  This reflects the realignment of the DTRA-JIDO research and development activities in accordance with Congressional intent to terminate the Joint Improvised-Threat Defeat Fund in section 9015 of the Chairman's recommendation to the Senate Appropriations Committee for the Department of Defense Appropriations Bill, 2018 (FY 2018 Baseline:  $0 million.)"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "JS"
                    },
                    "ProjectTitle": {
                        "val": "Assist Situational Understanding"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "13.141"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "13.141"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project enables DTRA to understand and analyze global threat information. It is an Information Technology (IT) Operations  quick-reaction capability supported by the rapid collection, fusion, and dissemination of operational-intelligence, and technology in order to enable the defeat of threat networks that employ disruptive technologies.\n\nThe JIDO advanced Mission Information Technology (MIT) capability, its software Systems Integration Lab (SIL), and embedded CCMD-direct support and reachback staff, continuously create capabilities to ingest, fuse, analyze, and present mission relevant data and information that provides immediate assistance to DoD and the whole of government. This capability, called Catapult, is a fully accredited SIPR and JWICS based analytical cloud architecture.  The Catapult architecture pulls from over more than 850 SIPR and more than 170 JWICS data sources and allows for simple and open data access, system stability, scalability, and advanced analytics.  In addition to Catapult, the MIT created another significant capability called Voltron.  Voltron provides analysts access to SIGINT data within a secure and IC-accredited software developer environment. Voltron, give analysts access to continuously new models in support of “Attack the Network” analysis and operations.  Voltron provides analysts access to methodologies involving multi-INT fusion in an easy to use interface. These methods are based on years of experience supporting tactical targeting environment and built in collaboration with other teams across the Intelligence Community.  There are currently more than 75 models in Voltron available to the user community.\n\nDTRA's authorities and mission have enabled a unique “Path-to-Production” (PTP) for mission-driven IT solutions.  This unique development environment includes an integrated Cyber Security Assessment and Authorization (A&A) process, an in-house collateral Authorizing Official (AO), a strong partnership between technologists and intelligence analysts working real-world problems, and a collaborative and innovative culture that launches practical software solutions rapidly."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JS: Assist Situational Understanding"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "13.141"
                                            },
                                            "Text": {
                                                "val": "- Effort to consolidate Web Visualizations for DTRA IED\/sUAS data. This will include the Common Intelligence Picture\/Common Operational Picture and technical data and will serve as the platform for creation of C-IED\/C-sUAS analytics.\n- Build a data science enabled module that will crawl through Catapult reporting and identify reports related to IED\/sUAS events. Through machine learning techniques and application of training data, the team will train this module to identify reports that normal queries may miss. These reports will serve as the base data set for the C-IED\/C-sUAS event table.\n- Prepare a list of vetted IED\/sUAS events pulled from Catapult reporting.  Events will be broken down into relevant categories with associated attributes.\n- Stand up a database of technical data associated with known IED\/sUAS. Library will be available for direct query and incorporated into other C-IED\/C-sUAS capabilities.\n- Integrate Virtual Management System processes and capabilities to build 3D models for various maritime vessels requested by external SOF customer.\n- Develop and test a software mapping tool and spatial data analytics technology web service capable of a providing user functionality to create basic geospatial analytic outputs (i.e., line of sight, route vulnerability, etc.).\n- Generate additional Data Science tables populated with entities extracted from Catapult using RipIt regex trees.   This will provide a “truth set” for future Natural Language Processing.\n- Develop and Test new tools allowing for the visualizing (and effects) of underwater explosions.\n- Develop a new application (Thor) as a “rules-based” approach to existing Avengers\/Phoenix models. Thor is planned to enhance sensitive site exploitation (SSE) data with a tool will provide comprehensive approach to SSE vetting.\n- Develop capability to visualize and derive trends for Air and Marine Operations Center non-commercial flight data.\n- Develop and test an Interactive interface which will provide access to the Avenger tool suite on selective networks.\n- Scope and Design the Data Science software and tool development environment as to create containerized tools which will provide a standard working image across the multiple networks.\n- Provide a methodology to leveraging contextual clues from reporting, provide additional information about individual person entities extracted from reports. (i.e., job title).\n- Develop and Test custom webpages that will provide “pre-vetted” data against analyst problem set. Automated workflow built for specific customer needs. \n- Develop and test a web-based Horizon version to act as a location intelligence discovery tool. The tool will provide geospatial querying within 2D maps to users as a light weight alternative to the smart-client version.\n- Develop and test a web-based C2IS2 tool that will provide OP\/INTEL users with the capability to capture and manage the processes, observables, and signatures associated with IED operations and use that data for training, analysis, collection planning, and exploitation.\n- Continued improvements to the JIDO DevOps Pipeline and maturing the approach to delivery using containers\n- Deploy a subset of the Attack the Network Tool Suite (ANTS) application on Non-Classified Local Area Network and an easy navigation directory.\n- Provide Integration and Test activities against a Battlefield Information Collection and Exploitation System (BICES) instance of Catapult. Upgrade and test all applications to work with Metrics across the ANTS Suite, upgrade the user account and authentication in relation to the F5\/Certificate Authentication System, and deploy Horizon Web.\n- Conduct System Integration of Catapult and all ANTS applications on the new HP Moonshot hardware.\n- Support proper deployment procedures and provide a test environment for the newly deployed Catapult and ANTS related applications on HP Moonshot hardware.\n- Test all Catapult and all ANTS applications at a COOP location."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 is due to the establishment of Project JS-Assist Situational Understanding in Program Element 0604134BR \/ Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing in the RDT&E appropriation.  This reflects the realignment of the DTRA-JIDO research and development activities in accordance with Congressional intent to terminate the Joint Improvised-Threat Defeat Fund in section 9015 of the Chairman's recommendation to the Senate Appropriations Committee for the Department of Defense Appropriations Bill, 2018 (FY 2018 Baseline:  $0 million.)"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer to provide contractual services to develop and operationalize requirements through the new Enterprise Acquisition Strategy Initiative (EASI) at the least risk, optimal cost and proven technically. Performer base selection includes research developers across DoD and other Government agency laboratories, academia, and industry."
                        },
                        "PerformanceMetrics": {
                            "val": "Performing contractors operate under a Cost Plus\\Award Fee contract measured by a number of mutually agreed Service Level Agreements (SLAs).  Measurement\\Awards is done semi-annually.  The contractor is required to provide Monthly status and progress against the SLAs.\n\nSystem metrics are measured by usage to include network, number of users, data, scope, integrations, and access."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Direct Operations Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.622"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.622"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Mission IT Capability Development (Automation and Data Science)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.695"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.695"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (OIR)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.391"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (RS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.391"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.391"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Direct Operations Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Mission IT Capability Development (Automation and Data Science)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.155"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (OIR)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (RS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Combatant Command C-IED Exercise Support Intergration Program (J7)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "N\/A"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.811"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.811"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Direct Operations Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.262"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.262"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Mission IT Capability Development (Automation and Data Science)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.541"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.541"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (OIR)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.080"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (RS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.081"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.081"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Direct Operations Support"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.361"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Attack the Network Suite (MIT) - Systems Integration Lab (SIL) - Mission IT Capability Development (Automation and Data Science)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (OIR)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Booz Allen Hamilton"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "QRC IT Network (RS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPAF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "QRC IT Network (RS)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Reston, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.309"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "JR"
                    },
                    "ProjectTitle": {
                        "val": "Enable DoD Responsiveness"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "7.725"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "7.725"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project enhances U.S. Joint Forces’ responsiveness to improvised weapons. DTRA builds counter-threat solutions in full collaboration with its partners. Through a robust communities of action approach, DTRA coordinates with the Combatant Commanders (CCDRs), the Joint Staff, the Military Departments\/Services, the interagency, coalition partners, industry, and academia to develop C-IED and C-IT solutions that further enable the maneuverability and force protection of deployed U.S. Joint Forces. This methodology leverages the authorities, access, and capabilities of the entire U.S. Government and its partners as counter-improvised threat solutions are developed and realized. \n\nDTRA responds to the following improvised threats: Home-Made Explosives (HME), Vehicle-Borne IED (VBIED), Unmanned Aerial Systems (UAS) Vehicle-Attached IED (VAIED), Anti-Armor IED (AIED) Buried IED, Radio Controlled IED (RCIED), Person-Borne IED (PBIED), Booby Trapped Structures (BTS), Improvised WMD, Water-Borne IED (WBIED), Tunnels, and emerging threats that are identified by the warfighter deployed forward."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JR:  Enable DoD Responsiveness"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.725"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "7.725"
                                            },
                                            "Text": {
                                                "val": "- Leverage capabilities and expertise primarily from Department of Defense University Affiliated Research Centers (UARCs) such as Georgia Tech Research Institute (GTRI) and Massachusetts Institute of Technology (MIT) Lincoln Labs.  \n- Delivers technical reports in response to RFIs submitted by JIDO Program\/System Integrators and JIDO Initiative Evaluation Team Members.\n- Conduct Joint Lab Board in support of rapid development and prototyping to counter improvised threats.\n- Conduct Hacking 4 Defense in support of rapid development and prototyping to counter improvised threats.\n- Develop Broad Area Announcement (BAA) solicitation in support of capabilities to counter improvised threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 is due to the establishment of Project JR-Enable DoD Responsiveness in Program Element 0604134BR \/ Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing in the RDT&E appropriation.  This reflects the realignment of the DTRA-JIDO research and development activities in accordance with Congressional intent to terminate the Joint Improvised-Threat Defeat Fund in section 9015 of the Chairman's recommendation to the Senate Appropriations Committee for the Department of Defense Appropriations Bill, 2018 (FY 2018 Baseline:  $0 million.)"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes research developers across DoD and other Government agency laboratories, academia, and industry."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed Counter Improvised-Threat Technology demonstration programs transitioning to Warfighter each year."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Outreach"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.425"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "7.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CERDEC Electro-Magnetice MS Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.300"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "JC"
                    },
                    "ProjectTitle": {
                        "val": "Enable Rapid Capability Delivery"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "234.795"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.993"
                        },
                        "BudgetYearOneOCO": {
                            "val": "221.802"
                        },
                        "BudgetYearTwo": {
                            "val": "12.743"
                        },
                        "BudgetYearThree": {
                            "val": "13.207"
                        },
                        "BudgetYearFour": {
                            "val": "13.656"
                        },
                        "BudgetYearFive": {
                            "val": "13.942"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project harnesses an in-depth understanding of the threat leading to identification and validation of urgent or emergent counter-threat requirements and Combatant Command capability gaps. In turn, DTRA-JIDO rapidly provides Counter - Improvised Explosive Device\/ Counter- small Unmanned Aerial Systems (C-IED\/C-sUAS) and C-IT solutions to prevent or mitigate battlefield operational surprise. DTRA’s continuous embedded presence with deployed U.S. Joint Forces and coordination with Military Service components enables full transparency of investment activities and provides for the early identification and understanding of C-IED and C-IT risks and vulnerabilities which enable the timely validation, development, and delivery of counter-threat material and non-material solutions.\n\nDTRA delivers counter-threat materiel solutions in support of US Joint Forces supporting contingency operations, effectively addressing changes to threat Tactics, Techniques, and Procedures (TT&P) affecting deployed forces.  Capability incorporates an embedded tactical presence to understand a continuously evolving threat environment and complete visibility of the current DoD counter-threat portfolio to enable rapid response to warfighter vulnerabilities and to enhance force protection and maneuverability.  DTRA responds to the following improvised threats: Home-Made Explosives (HME), Vehicle-Borne IED (VBIED), Unmanned Aerial Systems (UAS) Vehicle-Attached IED (VAIED), Anti-Armor IED (AIED) Buried IED, Radio Controlled IED (RCIED), Person-Borne IED (PBIED), Booby Trapped Structures (BTS), Improvised WMD, Water-Borne IED (WBIED), Tunnels, and emerging threats that are identified by the warfighter deployed forward."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JC:  Enable Rapid Capability Delivery"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "234.795"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.993"
                                            },
                                            "Text": {
                                                "val": "- Conduct and participate in test and evaluation events in support of improvised threats.\n- Develop and test C-IED\/C-sUAS systems for compatibility prior to systems deploying to operational theaters in support of the warfighter. \n- Maintain production platforms that support the development and fielding of capabilities that combat improvised threats and the network.\n- Improve deployable forensic field kits to provide near real time feedback and reduce the reach back support requirement.\n- Conduct modeling and simulation in support of countering improvised threats\n- Continue threat device characterization, prototyping and production."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "221.802"
                                            },
                                            "Text": {
                                                "val": "- Increase Positive Detection (PD) and acceptable False Alarm Rate (FAR) with multiple integrated sensors in Latest Time of Value (LTOV) in support of Standoff Detection of improvised threats\n- Improve size, weight, power and integration of sensors to small unmanned systems.  \n- Improve on-board vs. off-board data processing to provide real time data in unmanned systems to support real-time improvised threat detection.\n- Develop Magnetometers that can detect items emplaced on vehicle and report to mobile app in support of VAIED friendly notification. \n- Develop the ability to reverse polarity of the vehicle upon emplacement of magnet in support of VAIED.\n- Improve video monitoring\/physical security in support of VAIED notification.\n- Identify and develop technology that is portable enough to look through walls and identify hazards with fidelity in real-time for BTS.  \n- Develop imagery that can provide fidelity to operator and complete inspection of room in support of BTS  \n- Proof of concept for unmanned vehicle that can autonomously operate within confined spaces and provide necessary imagery to operator for BTS\n- Integrate sensor to detect various anomalies in unstructured environment with the ability to detect through clothes and report in real-time at safe standoff distances in support of PBIED\n- Identify \/ develop biometry and non-cooperative biometrics from standoff distance in support of behavioral prediction and tracking in uncontrolled environments in support of PBIED.\n- Obtain baseline threat signatures for vehicles to support sensor development for VBIED detection.\n- Improve bulk explosive detection through metal at standoff distance in support of VBIED.\n- Improve automatic slewing of sensors and non-lethal vehicle\/driver stopping technologies for stopping VBIED.\n- Develop counter measures for RCIED’s based on the evolving global network environments (4G, LTE and 5G). \n- Identify alternative methods to Common Timing Protocol (CTP) for current and future Electronic Counter Measure (ECM) capabilities. \n- Develop remote neutralization of HME and pre-cursors: through the use of chemical neutralization, dilution solutions, and dispersants while controlling the thermal degradation to target HME manufacturing without putting the warfighter in harm’s way.\n- Improve \/ develop threat Improvised Explosive Device\/small Unmanned Aerial Systems (IED\/sUAS) detect and defeat capabilities against future technology:  acoustic detection at range, machine learning of constantly changing threat signatures (acoustic, RF signal, radar cross-section, optics, Unattended Radiated Emissions (URE), etc.)\n- Develop anti-armor detection and defeat capabilities: Real-time reporting from sensors on mounted vehicles that can detect road-side threats in high clutter, while operating at speed, with high Positive Detection and acceptable False Alarm Rate. \n- Develop real-time data processing of signal in subterranean environment to improve friendly operations in a tunnel.  \n- Improve in-tunnel ISR and communications.  \n- Develop explosive formulations and rapid remediation techniques for improvised threats in support of improvised threats in tunnels.  \n- Test and develop airborne detection using thermal changes in earth or condensation anomalies presented by voids for detection of tunnels. \n- Improve smaller laser to support pre-detonation capabilities\n- Improve size, weight and power for next generation of pre-detonation systems\n- Improve mounted detection of buried IEDs through real-time reporting from sensors on mounted vehicles that can detect buried threats at depths while conducting maneuver ops at speed with high Positive Detection and acceptable False Alarm Rate.  Hardware improvements enable faster sensing and software improvements enable faster systems-of-systems reporting (higher Positive Detection and lower False Alarm Rate)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 is due to the establishment of Project JC-Enable Rapid Capability Delivery in Program Element 0604134BR \/ Counter Improvised-Threat Technology Demonstration, Prototype Development, and Testing in the RDT&E appropriation.  This reflects the realignment of the DTRA-JIDO research and development activities in accordance with Congressional intent to terminate the Joint Improvised-Threat Defeat Fund in section 9015 of the Chairman's recommendation to the Senate Appropriations Committee for the Department of Defense Appropriations Bill, 2018 (FY 2018 Baseline:  $0 million.)"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Assessment and selection of best performer for developmental requirements to meet specific military capability needs. Performer base includes research developers across DoD and other Government agency laboratories, academia, and industry."
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of completed Counter Improvised-Threat Technology demonstration programs transitioning to Warfighter each year."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Iris Trace"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "I2WD-COMMUNICATIONS-ELECTRONICS RESEARCH, DEVELOPMENT AND ENGINEERING CENTER (CERDEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Abderdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.236"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.236"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Iris Sanctum"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Central Intelligence Agency"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fairfax, VA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.751"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.751"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tough Luck"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins University"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Baltimore, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Velvet Paper"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Johns Hopkins University\/Navy"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Anti-Armor IED (AAIED)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "4.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Booby Trapped Structures (BTS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.850"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "3.850"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Buried IED"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "19.750"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "19.750"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Home-Made Explosives (HME)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "18.100"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "18.100"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Network"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "40.668"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "40.668"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Person-Born IED (PBIED)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "5.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Radio Controlled IED (RCIED)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "32.500"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "32.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tunnel"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "7.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Unmanned Aerial Systems (UAS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "58.955"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "58.955"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Vehicle-Attached IED (VAIED)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "1.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Vehicle-Borne IED (VBIED)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "19.550"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "19.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Water-Borne IED (WBIED)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "2.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TAG Modeling and Simulation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Air Weapons Station"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "China lake, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.575"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.575"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Theater Support Test (JTB)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Naval Air Weapons Station"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "China Lake, CA"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.796"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.796"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Threat Devices Characterization Prototyping and Production"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "I2WD-COMMUNICATIONS-ELECTRONICS RESEARCH, DEVELOPMENT AND ENGINEERING CENTER (CERDEC)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Abderdeen, MD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.545"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Rapid Experimentation and Analysis for Development Support (READS)"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.060"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "2.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Joint Test Board"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.074"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "5.074"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "OC25"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.235"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Tech Exploitation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.060"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "2.060"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "N\/A"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}