{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604256A"
        },
        "ProgramElementTitle": {
            "val": "Threat Simulator Development"
        },
        "R1LineNumber": {
            "val": "152"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "28.883"
            },
            "CurrentYear": {
                "val": "22.862"
            },
            "BudgetYearOne": {
                "val": "12.835"
            },
            "BudgetYearOneBase": {
                "val": "12.835"
            },
            "BudgetYearTwo": {
                "val": "15.284"
            },
            "BudgetYearThree": {
                "val": "15.544"
            },
            "BudgetYearFour": {
                "val": "16.014"
            },
            "BudgetYearFive": {
                "val": "16.403"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "127.825"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) supports the design, development, acquisition, integration and fielding of realistic mobile threat simulators and realistic threat simulation products utilized in Army training and developmental and operational tests. This PE originally funded simulators representing Soviet equipment, but scope was expanded to address emerging world threats. Army Threat Simulator and Threat Simulation products are utilized to populate test battlefields for United States (U.S.) Army Test and Evaluation Command (ATEC), to conduct developmental and operational tests, and to support Program Executive Office (PEO) required user testing in System Integration Laboratories and hardware\/simulation in-the-loop facilities. These battlefield simulators represent adversary systems (e.g. missile systems, command, control and communications systems, electronic warfare systems, etc.) in order to portray a realistic threat environment during testing of U.S. weapon systems.\n\nArmy Threat Simulator and Threat Simulation products developed or fielded under this PE support Army-wide, non-system-specific threat product requirements. Each capability is pursued in concert and coordination with existing Army and tri-service capabilities to eliminate duplication of effort. Simulator development is responsive to Office of the Secretary of Defense and Government Accountability Office guidance for the Army to conduct operational testing in a realistic threat environment. Actual threat equipment is acquired when appropriate (in lieu of development) and total package fielding is still required (i.e., instrumentation, operations and maintenance, manuals, new equipment training, etc.). Threat simulator development is accomplished under the auspices of the Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) and the Director, Operational Test and Evaluation (DOT&E) Threat Simulator Investment Working Group.\n\nBeginning in Fiscal Year 2019, this PE will also support the Advanced Electronic Support Sensor Suite (AESSS) and Cyber Blue Teams activities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "25.675"
                },
                "CurrentYear": {
                    "val": "22.862"
                },
                "BudgetYearOne": {
                    "val": "23.885"
                },
                "BudgetYearOneBase": {
                    "val": "23.885"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "28.883"
                },
                "CurrentYear": {
                    "val": "22.862"
                },
                "BudgetYearOne": {
                    "val": "12.835"
                },
                "BudgetYearOneBase": {
                    "val": "12.835"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.208"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-11.05"
                },
                "BudgetYearOneBase": {
                    "val": "-11.05"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "4"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.585"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.2"
                                },
                                "BudgetYearOne": {
                                    "val": "-11.05"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-11.05"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2017 includes a Congressional Add of $4.000 million for cyber vulnerabilities. FY 2019 difference between Previous President's Budget and Current President's Budget reflects a realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation. The FY 2019 funding request was also reduced by $1.612 million to account for the availability of prior year execution balances."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "976"
                    },
                    "ProjectTitle": {
                        "val": "Army Threat Sim (ATS)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "28.883"
                        },
                        "CurrentYear": {
                            "val": "22.862"
                        },
                        "BudgetYearOne": {
                            "val": "12.835"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.835"
                        },
                        "BudgetYearTwo": {
                            "val": "15.284"
                        },
                        "BudgetYearThree": {
                            "val": "15.544"
                        },
                        "BudgetYearFour": {
                            "val": "16.014"
                        },
                        "BudgetYearFive": {
                            "val": "16.403"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "127.825"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports the design, development, acquisition, integration and fielding of realistic mobile threat simulators and realistic threat simulation products utilized in Army training and developmental and operational tests. Army Threat Simulator and Threat Simulation products are utilized to populate test battlefields for United States (U.S.) Army Test and Evaluation Command (ATEC), to conduct developmental and operational tests, and to support Program Executive Office (PEO) required user testing in System Integration Laboratories and hardware\/simulation in-the-loop facilities. \n\nArmy Threat Simulator and Threat Simulation products developed or fielded under this Project support Army-wide, non-system-specific threat product requirements. Each capability is pursued in concert and coordination with existing Army and tri-service capabilities to eliminate duplication of effort. These battlefield simulators represent systems (e.g. missile systems, command, control and communications systems, electronic warfare systems, etc.) that are used to portray a realistic threat environment during testing of U.S. weapon systems. Simulator development is responsive to Office of the Secretary of Defense and General Accounting Office guidance for the Army to conduct operational testing in a realistic threat environment. Actual threat equipment is acquired when appropriate (in lieu of development) and total package fielding is still required (i.e., instrumentation, operations and maintenance, manuals, new equipment training, etc.). Threat simulator development is accomplished under the auspices of the Project Manager for Instrumentation, Targets and Threat Simulators (PM ITTS) and the Director, Operational Test and Evaluation, Threat Simulator Investment Working Group.\n\nBeginning in Fiscal Year (FY) 2019, this Project will also support the Advanced Electronic Support Sensor Suite (AESSS) and Cyber Blue Teams activities."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Add - Cyber Vulnerabilities"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network Exploitation Test Tool (NETT)."
                                    },
                                    "Description": {
                                        "val": "Engineering, Manufacturing and Development (EMD) for the NETT as a comprehensive Threat Cyberspace Operations (TCO) tool. Integrates new tools, tactics, and techniques into NETT to portray evolving Threat environments.\n\nNETT is a comprehensive TCO tool designed for Test and Evaluation (T&E) to portray evolving hostile and malicious Threat effects within the Cyber domain. Program will continue to provide an integrated suite of open-source\/open-method exploitation tools to be integrated with robust reporting and instrumentation capabilities. NETT is used by TCO teams to replicate the tactics of state and non-state Threats and is supported by a robust TCO development environment. The Cyber domain will be the most rapidly changing domain in which our systems operate. NETT program will continue research of these capabilities and will use an in-depth process to clean, fix, and integrate required Threat tools, tactics, and techniques that will be needed during T&E. Focus areas include: continued Threat integration, instrumentation, distributed collaboration between multiple users, targets and attack visualization, data collection and remote agent development."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.683"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the NETT. NETT will be a comprehensive Computer Network Operations (CNO) tool, designed for T&E, to portray evolving hostile and malicious Threat effects within the cyber domain. The program will provide an integrated suite of open-source\/open-method exploitation tools which will be integrated with robust reporting and instrumentation capabilities. NETT will be used by Threat CNO teams to replicate the tactics of state and non-state Threat and will be supported by a robust CNO development environment. The Cyber domain will be the most rapidly changing domain in which our systems operate.  The NETT program will research these new capabilities and will use an in-depth process to clean, fix, and integrate required Threat tools, tactics, and techniques that will be needed during T&E. Focus areas will include continued Threat integration, instrumentation, distributed collaboration between multiple users, targets and attack visualization, data collection and remote agent development."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.675"
                                            },
                                            "Text": {
                                                "val": "Continues EMD phase for the NETT. Integrates new tools, tactics, and techniques into NETT to portray evolving Threat environments. Will continue research of these capabilities and will use an in-depth process to clean, fix, and integrate required Threat tools, tactics, and techniques that will be needed during T&E. Focus areas include: continued Threat integration, instrumentation, distributed collaboration between multiple users, targets and attack visualization, data collection and remote agent development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.552"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.552"
                                            },
                                            "Text": {
                                                "val": "Continue EMD phase for the NETT including the integration of new tools, tactics, and techniques into the NETT to portray evolving Threat environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the O&M, Army appropriation in FY19.\nRealignment of funds to higher Army priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Systems Management Office's (TSMO) Threat Operations"
                                    },
                                    "Description": {
                                        "val": "The Threat Operations program will fund the operation, maintenance, management, and sustainment capability for Threat systems used to portray a realistic threat environment during Army testing and training within the Army's Threat inventory in order to support multiple Army test events including Network Evaluation Integration \/ Army Warfighting Assessment (NEI \/ AWA) and anticipated excursion test events for numerous Systems Under Test \/ Programs of Record (SUT \/ POR)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.395"
                                            },
                                            "Text": {
                                                "val": "The Threat Operations program will fund the operation, maintenance, management, and sustainment capability for Threat systems used to portray a realistic threat environment during Army testing and training within the Army's Threat inventory in order to support multiple Army test events including (Network Integration Evaluation - NIE\/Army Warfighter Assessments - AWA) and anticipated excursion test events for numerous Systems Under Test (SUT)\/Programs of Record (POR) currently identified through FY17."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.627"
                                            },
                                            "Text": {
                                                "val": "Will continue to support multiple Army test events including NIE \/ AWA and anticipated excursion test events for numerous SUT \/ POR currently identified through FY18."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.357"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.357"
                                            },
                                            "Text": {
                                                "val": "Will continue to support multiple Army test events including NIE \/ AWA and anticipated excursion test events for numerous SUT \/ POR currently identified through FY19."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the O&M appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Threat Force (ITF), formerly named Threat Battle Command Center"
                                    },
                                    "Description": {
                                        "val": "EMD phase for the ITF program to complete hardware \/ software development and Threat systems integration in support of the build-out of the threat force architecture. Full Operational Capability achieved in September 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.965"
                                            },
                                            "Text": {
                                                "val": "Will continue the EMD phase for Increment 4 of the ITF program to enhance the ITF's Threat Battle Command applications, the C3 interfaces with the Increment 1 - 3 threat systems as well as enhance the C2 functionality of the Threat Battle Command Center (TBCC).  FY17 funding is expected to finish the design and development of distributed C2 functionality and fulfill the KPPs for Increment 4."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Cyberspace Operations (TCO), formerly named Threat Computer Network Operations Team (TCNOT)"
                                    },
                                    "Description": {
                                        "val": "TCO supports ATEC events by maintaining a team of highly qualified, trained, and certified CNO professionals who execute Cyber operations against systems under test. The TCO program was designated a \"Threat CNO Team\" under Army Regulation (AR) 380-53 and is accredited as a United States Cyber Command (USCYBERCOM) \/ National Security Agency (NSA) certified \"Red Team\"."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.051"
                                            },
                                            "Text": {
                                                "val": "Funding will support unique training, credentials, and authorizations involving organizations such as INSCOM, NSA, HQDA-G2, and industry. FY17 will fund requirements such as continued research of the intelligence-based TCNO TTP and threat portrayal capabilities up to the Nation State level; development of the necessary, highly specialized TCNO Training program; development, research, and analysis of continually emerging foreign threat capabilities; and data collection capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.764"
                                            },
                                            "Text": {
                                                "val": "Funding will support unique training, credentials, and authorizations for organizations such as Army Intelligence and Security Command (INSCOM), Deputy Chief of Staff (DCS) G2, NSA, and industry. FY18 plans include: continued research of intelligence-based TCO Tactics, Techniques, and Procedures (TTP) and Threat portrayal capabilities up to the Nation State level; development of a highly specialized TCO Training program; development, research, and analysis of continually emerging foreign threat capabilities; and data collection capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.565"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.565"
                                            },
                                            "Text": {
                                                "val": "Funding provides for Contractor subject matter expertise within the Cyber Red Team workforce to support critical threat assessments. Beginning in FY19, O&M funds will enable Cyber Red Team Department of the Army Civilian (DAC) subject matter expertise to execute this unique threat intelligence based mission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the O&M appropriation in FY19.  \nRealignment of funds to higher Army priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Cyberspace Operations (TCO) Fidelity Enhancements. formerly named Threat Computer Network Operations (CNO) Fidelity Enhancements"
                                    },
                                    "Description": {
                                        "val": "Establishes high-fidelity Threat malware and real-world tools, tactics, techniques, and procedures of Threat employment of TCO using commercial Information Technologies (IT) intended to engage complex U.S. operations. Threat packages range from \"technological nomads\" operating autonomously to state level forces using both active and passive network attack to selectively degrade or disrupt Army C4ISR (Command, Control, Communications, Computers, Intelligence, Surveillance and Reconnaissance) and Enterprise Business Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.333"
                                            },
                                            "Text": {
                                                "val": "Program will continue to validate high-fidelity Threat malware and real-world tools, tactics, techniques, and procedures of Threat employment of CNO using commercial IT technologies intended to engage complex U.S. operations.  Will continue to develop state and non-state threat targeting packages that are \"current\", accurately profiling attack trends and timelines, intent, levels of sophistication, and threat training that will not be available to evaluate the exploitation of existing vulnerabilities in Enterprise Business Systems and network enabled systems.  These threat packages range from \"technological nomads\" operating autonomously to state level forces using both active and passive network attack to selectively degrade or disrupt Army C4ISR and Enterprise Business Systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.402"
                                            },
                                            "Text": {
                                                "val": "Program will continue in FY18 to validate high-fidelity Threat malware and real-world tools, tactics, techniques, and procedures of Threat employment of CNO using commercial IT technologies intended to engage complex U.S. operations. Will continue to develop state and non-state threat targeting packages that are \"current\", accurately profiling attack trends and timelines, intent, levels of sophistication, and threat training. These Threat packages range from \"technological nomads\" operating autonomously to state level forces using both active and passive network attack to selectively degrade or disrupt Army C4ISR and Enterprise Business Systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.762"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.762"
                                            },
                                            "Text": {
                                                "val": "Program will continue the validation of high-fidelity threat malware and real-world tools, tactics, techniques, and procedures of threat TCO employment using commercial IT technologies intended to engage complex U.S. operations. Will continue to develop state and non-state threat targeting packages that are current, accurately profiling attack trends and timelines, intent, levels of sophistication, and threat training. These threat packages represent state and non-state level forces using both active and passive network attack to selectively degrade or disrupt Army C4ISR and Enterprise Business Systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the O&M appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Networked Electronic Support Threat Sensors (NESTS)"
                                    },
                                    "Description": {
                                        "val": "Program will begin prototype design and implementation to deliver advanced threat Electronic Support (ES) platforms. The Advanced NESTS program aims to increase existing Threat ES capabilities to match U.S. Intelligence Community performance assessments of real-world Threat capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.109"
                                            },
                                            "Text": {
                                                "val": "The Advanced NESTS program will continue to increase existing threat Electronic Support (ES) capabilities to match the U.S. Intelligence Community performance assessments of real-world threat capabilities. This program seeks to replicate emerging real-world threat capabilities targeting advanced U.S. communication systems operating up to 18GHz.  Program will continue the detailed design and the integration effort."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.5"
                                            },
                                            "Text": {
                                                "val": "The Advanced NESTS program will continue to increase existing threat ES capabilities to match U.S. Intelligence Community performance assessments of real-world threat capabilities. This program seeks to replicate emerging real-world threat capabilities targeting advanced U.S. communication systems operating up to 18GHz. Program will continue the detailed design and the integration effort in pursuit of FOC during FY18."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "System achieves FOC in FY18.  Beginning in FY19, this Program will transition to Advanced Electronic Support Sensor Suite (AESSS)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Jammer Suite (AJS)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Jammer Suite will continue to expand the Army's open air and alternatives for Electronic Attack (EA) in a test environment by using variations of jamming to include direct jamming, open air jamming and GPS jamming. It will keep the current jamming Threat as an asset to the Army for use in testing at lower test costs while expanding the Army alternative EA in a test environment by using appropriate jamming techniques for the applied testing environment. This program continues Threat representation for the Army in the jamming domain, developing new and future jamming threats, to include satellite jamming."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.394"
                                            },
                                            "Text": {
                                                "val": "The Advanced Jammer Suite expands the Army's open air and alternatives for EA in a test environment by using variations of jamming to include direct jamming, open air jamming and GPS jamming.  This program will keep the current jamming threat as an asset to the Army for use in testing, at lower test costs.  The Advanced Jammer Suite expands the Army alternative EA in a test environment by using appropriate jamming techniques for the applied testing environment. This program continues the threat representation for the Army in the jamming domain. This program will continue to procure upgraded injection jamming units, as well as develop new and future jamming threats, to include satellite jamming threats.  This threat development would include, but is not limited to techniques such as Frequency Follower Direct Sequence Spread Spectrum (DSSS) threat jamming; Digital Radio Frequency Modulation (DRFM) \"spoofing;\" and, extended RF range into the Extremely High Frequency (EHF) range."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Threat development will include, but is not limited to, techniques such as Frequency Follower Direct Sequence Spread Spectrum (DSSS) threat jamming; Digital Radio Frequency Memory (DRFM) \"spoofing,\" and extended Radio Frequency (RF) range into the Extremely High Frequency (EHF) range."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.079"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.079"
                                            },
                                            "Text": {
                                                "val": "Threat development will include, but is not limited to, techniques such as Frequency Follower Direct Sequence Spread Spectrum (DSSS) threat jamming; Digital Radio Frequency Memory (DRFM) \"spoofing,\" and extended Radio Frequency (RF) range into the Extremely High Frequency (EHF) range."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the O&M appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Threat Battle Command Force (TBCF), formerly named Integrated Threat Force (ITF)"
                                    },
                                    "Description": {
                                        "val": "The Threat Battle Command Force (TBCF) incorporates remote operations via distributed Command and Control (C2) while maintaining valid Threat TTP during T&E and training events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.953"
                                            },
                                            "Text": {
                                                "val": "The Threat Battle Command Force (TBCF) incorporates remote operations via distributed C2 while maintaining valid Threat tactics, techniques, and procedures (TTP) during T&E and training events.  This program will integrate the Next Generation Electronic Support Suite, Next Generation Electronic Attack Suite and Computer Network Operations into future Threat C2 operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.237"
                                            },
                                            "Text": {
                                                "val": "Integrate the Advanced NESTS system. Continue development of distributed C2 capabilities to support remote test operations. Will incorporate emerging Threat capabilities identified by the Intelligence Community."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.37"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.37"
                                            },
                                            "Text": {
                                                "val": "Integrate the Advanced Jammer Suite and additional Threat systems as identified by Threat assessments. Develop parsing tools to increase situational awareness for the Threat operations commander.  Increase remote operations capabilities to decrease test costs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Integration of different threat systems based upon Threat assessments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Mobile Communication Network Infrastructure Test Range (Next GEN MCNITR)"
                                    },
                                    "Description": {
                                        "val": "Next Generation MCNITR provides a mobile, scalable closed-loop cellular communications network infrastructure implementing multiple technologies capable of providing a realistic commercial Radio Frequency (RF) signals environment needed for testing and training of U.S. forces in urban and suburban battle space environments. The Next Generation MCNITR program acquires a capability that simulates real-world RF signals environment and that supports representative Threat force reliance of network enabled devices dependent on advanced cellular technology."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Text": {
                                                "val": "Conduct risk reduction phase to decompose Threat requirements and system and sub-system functional requirements. Determine most efficient technology insertion schedule."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.266"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.266"
                                            },
                                            "Text": {
                                                "val": "Integrate commercial RF technologies to create a threat faithful communications environment based upon results of the risk reduction phase."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY18 transition from MCNITR to Next GEN MCNITR"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Electronic Support Sensor Suite (AESSS)"
                                    },
                                    "Description": {
                                        "val": "AESSS provides expansion of Army's ability to portray acoustic, seismic, and electro-optical \/ infrared (EO\/IR) sensor capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.959"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.959"
                                            },
                                            "Text": {
                                                "val": "Conduct risk reduction phase to decompose Threat requirements into system and sub-system functional requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Beginning in FY19, this Program will transition from Advanced Networked Electronic Support Threat Sensors (NESTS)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management and oversight of Cyber Blue Team vulnerability assessments"
                                    },
                                    "Description": {
                                        "val": "In 2016 the Army Acquisition Executive (AAE) designated PM ITTS as the Office of Primary Responsibility for Acquisition Blue Teams, to provide management and execution of relevant Cyber Blue Team assessment capabilities in support of the acquisition and test communities. Cyber Blue Teams refer to the cyber team which works cooperatively with the system owner to ensure programs can defend against attackers and\/or Red Teams. These Cyber Blue Team capabilities are essential to enable military operators to assess and defeat the presence of cyber security threats across Army networks. PM ITTS will also serve as the primary point of contact for cyber-related testing and vulnerabilities assessments with U.S. Cyber Command and Army Cyber. This Project executes the establishment and management of certification standards for Acquisition Blue Teams and coordination of Blue Team requirements on behalf of the Assistant Secretary of the Army for Acquisition, Logistics, and Technology (ASA ALT)."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.925"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.925"
                                            },
                                            "Text": {
                                                "val": "This activity will establish and manage certification standards for Cyber Blue Teams in coordination with all Project Managers on behalf of Assistant Secretary of the Army for Acquisition, Logistics, and Technology. It will be the single point of contact with United States Cyber Command (CYBERCOM) for open and closed networks, and will develop and field a central repository for vulnerability assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Cyber Blue Team Activities begin in FY19 for this Program."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}