{
    "id": "2019-AirForce-PB-3600-MJBOOK-3-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-38",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0305600F"
        },
        "ProgramElementTitle": {
            "val": "International Intelligence Technology and Architectures"
        },
        "R1LineNumber": {
            "val": "278"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "2.360"
            },
            "CurrentYear": {
                "val": "3.491"
            },
            "BudgetYearOne": {
                "val": "8.464"
            },
            "BudgetYearOneBase": {
                "val": "8.464"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "8.515"
            },
            "BudgetYearThree": {
                "val": "8.660"
            },
            "BudgetYearFour": {
                "val": "8.711"
            },
            "BudgetYearFive": {
                "val": "8.780"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "2.360"
                },
                "CurrentYear": {
                    "val": "3.491"
                },
                "BudgetYearOne": {
                    "val": "3.527"
                },
                "BudgetYearOneBase": {
                    "val": "3.527"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "2.360"
                },
                "CurrentYear": {
                    "val": "3.491"
                },
                "BudgetYearOne": {
                    "val": "8.464"
                },
                "BudgetYearOneBase": {
                    "val": "8.464"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.937"
                },
                "BudgetYearOneBase": {
                    "val": "4.937"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "4.937"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.937"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY2019 increase supports additional design, development, testing, and technical refresh for cross-domain capabilities (such as the TNE), new US BICES-enabled ISR capabilities, and new Geospatial Intelligence and biometric tools for the US BICES Enterprise. This will enable the US BICES Program Office (BPO) to: a) modernize and transform the US BICES\/US BICES-X worldwide enterprise; b) align US BICES\/US BICES-X with the Joint Information environment (JIE) and the DI2E standards, process, and framework; c) develop a cybersecurity roadmap and implement improved cybersecurity assessment tools; and d) smartly enhance capability, capacity, and scalability across the US BICES\/US BICES-X enterprise seeking improved integration with the Distributed Common Ground\/Surface System (DCGS) family of Systems."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675898"
                    },
                    "ProjectTitle": {
                        "val": "International Intelligence Technology and Arc"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.360"
                        },
                        "CurrentYear": {
                            "val": "3.491"
                        },
                        "BudgetYearOne": {
                            "val": "8.464"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.464"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "8.515"
                        },
                        "BudgetYearThree": {
                            "val": "8.660"
                        },
                        "BudgetYearFour": {
                            "val": "8.711"
                        },
                        "BudgetYearFive": {
                            "val": "8.780"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "International Intelligence Technology and Architectures oversees, manages, and provides the United States (US) component of the multi-national Battlefield Information Collection and Exploitation System (US BICES) with a collaborative environment and intelligence sharing enterprise required for processing and disseminating critical intelligence information between and among US, North Atlantic Treaty Organization (NATO), allied and coalition forces. The US BICES program procures and maintains a standing intelligence information sharing capability across Department of Defense (DoD), Combat Support Agencies, and multiple Combatant Commands (CCMD) for the Office of the Under Secretary of Defense, Intelligence (OUSD(I). At the request of OUSD(I), US BICES is extended beyond U.S. European Command (EUCOM) into all CCMDs and is known as US BICES Extended (US BICES-X). US BICES provides an \"enduring\" US and Coalition interoperable intelligence sharing multi-level secure technical architecture utilizing releasable elements of the Defense Intelligence Information Enterprise (DI2E) framework and functions to support the full spectrum of intelligence operations and dissemination throughout the DoD community. Also, it enables instantiation of US BICES\/US BICES-X as the intelligence contribution to the Mission Partner Environment (MPE).\n\nResearch and Development funding will:\n\n- Provide increased intelligence information sharing capabilities in support of US and coalition forces utilizing the US BICES and NATO virtual networks and provide increased database information via Distributed Common Ground System - Army.\n- Expand available intelligence disciplines (Geospatial Intelligence, Signal Intelligence, and potentially Human Intelligence) to support US and allied\/coalition forces.  Support increased intelligence advanced analytics tools, Joint Intelligence Operation Center-IT and DI2E developments to significantly increase the timeliness of intelligence and bring US BICES\/NATO Special Operations Forces Headquarters\/NATO Intelligence Fusion Center capabilities into the current technology baselines.\n- Develop and provide a federated Trusted Network Environment (TNE) that incorporates the Asian Pacific intelligence Information Network to support the National Defense Strategy.\n-  Provide multi-level security intelligence bi-laterals and multi-laterals to meet Combatant Commander Integrated Priority Lists.\n-  Develop the Coalition Partner Network for CENTCOM, the Coalition Information Exchange Network for SOUTHCOM, and the Coalition Partner Network for EUCOM and AFRICOM.\n- Expand capabilities for bi-lateral and multi-lateral federated TNEs in support of CCMD requirements.\n\nThis program is in Budget Activity 7, Operational System Development because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Intelligence Technology and Architectures"
                                    },
                                    "Description": {
                                        "val": "Continue the research and development in emerging and maturing technologies and capabilities for modernizing and transforming US BICES\/US BICES-X for improved agility, scalability, access, cybersecurity, and data and information sharing tools and infrastructure."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.360"
                                            },
                                            "Text": {
                                                "val": "Complete a separate Certification Test and Evaluation (CT&E) for an interim accelerated release of the Trusted Network Environment (TNE) to support the fielding of telephony and cross-domain virtual desktop services more quickly than currently scheduled.  Fielding the interim release of the TNE, v2.2."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.491"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development for future releases of the TNE, to include Identity and Access Management (IdAM), peer-federated chat services, and adding video to the telephony services. Begin the Certification Test and Evaluation (CT&E) of new capabilities, to include the implementation and certification of new services such as video teleconferencing (VTC), metadata handling, restricted user communities for isolating authoritative data sources, integration of multi-domain relational database operations, and an application programming interface that will enhance information sharing through the use of existing applications like Share Point with the TNE."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.464"
                                            },
                                            "Text": {
                                                "val": "Continue the research and development for future releases of the TNE, to include IdAM, peer-federated chat services, and adding video to the telephony services. Continue the CT&E of new capabilities, to include the implementation and certification of new services such as VTC, metadata handling, restricted user communities for isolating authoritative data sources, integration of multi-domain relational database operations, and an application programming interface that will enhance information sharing through the use of existing applications like Share Point with the TNE."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$5 million was added for additional software testing to accelerate software releases to the field."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "O&M PE 0305600F"
                                    },
                                    "Title": {
                                        "val": "Int'l Intel Tech Architecture"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "101.488"
                                        },
                                        "BudgetYearOne": {
                                            "val": "96.567"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "96.567"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "75.619"
                                        },
                                        "BudgetYearThree": {
                                            "val": "75.498"
                                        },
                                        "BudgetYearFour": {
                                            "val": "75.751"
                                        },
                                        "BudgetYearFive": {
                                            "val": "77.115"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line item 832050"
                                    },
                                    "Title": {
                                        "val": "International Intelligence Technology and Architecture"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "18.350"
                                        },
                                        "CurrentYear": {
                                            "val": "22.335"
                                        },
                                        "BudgetYearOne": {
                                            "val": "8.290"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "8.290"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "11.386"
                                        },
                                        "BudgetYearThree": {
                                            "val": "11.314"
                                        },
                                        "BudgetYearFour": {
                                            "val": "10.884"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.167"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Utilize existing General Dynamics Mission Systems (GDMS) contract number FA8240-14-D-2751. The contract is structured as a fixed price incentive fee with one base year and four option years and a period of performance beginning 1 June 2014 through 31 May 2019.  US BICES also utilizes the Air Force Research Laboratory for majority of the testing of the latest TNE releases."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "TNE Software"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AFRL"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Rome, NY"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.360"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.491"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.464"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.464"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Trusted Network Environment Software Version 2.2 features Voice over IP, Cross Domain View."
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "TNE"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Network Environment Software Version 3.0 features Database replication, federated P2P Voice, Non-Federated Virtual Desktop Interface"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "TNE"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Network Environment Software Version 3.1 features Search, Face Phone Video, Improved Content Inspection, Increased Network Capacity"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "TNE"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Network Environment Software Version 3.2 features Conferencing & Video Teleconferencing, Advanced Search, Metadata, XML Messaging, Chat Peer Federation, Federated Virtual Desktop Interface"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "TNE"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Network Environment Software Version 4.0 features Full Motion Video, Multi-party federated Video Teleconferencing, Intel Mission applications support, Intel Mission database federation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "TNE"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Trusted Network Environment Software Version 4.1 features SharePoint Search enhancement, Common operating picture, Video Teleconferencing Enhancement"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "TNE"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}