{
    "id": "2019-Navy-PB-1319-JBOOK-acd04f4d9735e80412f4a8ec0a89d7f055132a6f39299672558b4188f84667ad-51",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA4-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604030N"
        },
        "ProgramElementTitle": {
            "val": "Rapid Prototyping, Experimentation and Demonstrati"
        },
        "R1LineNumber": {
            "val": "82"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "0.000"
            },
            "BudgetYearOne": {
                "val": "48.796"
            },
            "BudgetYearOneBase": {
                "val": "48.796"
            },
            "BudgetYearTwo": {
                "val": "36.197"
            },
            "BudgetYearThree": {
                "val": "41.977"
            },
            "BudgetYearFour": {
                "val": "42.358"
            },
            "BudgetYearFive": {
                "val": "43.266"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Efforts in this Program Element (PE) and Project Unit (PU) 0385 were previously funded in PE 0603382N Advanced Combat Systems Tech; PU 0385 Rapid Prototype Development, and PU 0399 Unmanned Rapid Prototype Development. Funds are transferred to this PU effective FY2019."
        },
        "ProgramElementMissionDescription": {
            "val": "Department of Navy (DON) leadership has acknowledged that maintaining maritime superiority depends in part on our ability to accelerate the speed of warfighting and technological innovations in order to extend our advantage to offset our adversaries' growing capabilities. It is fundamental to the DON's efforts to improve our acquisition outcomes. This program element is aligned with, and in direct response to, calls for increased prototyping and experimentation in USD(AT&L)'s Better Buying Power 3.0, Secretary of the Navy's (SECNAV) Task Force Innovation direction, and the CNO direction to achieve High Velocity Learning at Every Level. These efforts will reinvigorate and increase the use of prototyping to rapidly field new warfighting capabilities, concepts and technologies, and engineering solutions. \n\nThe Rapid Prototype Development program funds a strategic focus on rapid prototyping of innovative combat system technologies and engineering innovations to explore Fleet-proposed capability concepts and needs, as well as foster advancements in naval warfighting capabilities. With an emphasis on rapidly prototyping mature technologies, the program is intended to expedite the development, exploration and fielding of technology and engineering prototypes to provide advanced warfighting capabilities, new technologies and engineering innovations across all Naval warfighting domains. Concepts and enabling technologies include but are not limited to; directed energy weapons, hypersonics, unmanned systems, artificial intelligence, machine learning, and multi-domain operations.\n\nSpecific projects under this program will be selected and executed in accordance with the Department of the Navy (DoN) Accelerated Acquisition Process as described in SECNAVINST 5000.42. The Secretary of the Navy will notify Congress prior to initiation of a project under this program in accordance with the requirements established in Section 216 of the FY2017 National Defense Authorization Act."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "48.796"
                },
                "BudgetYearOneBase": {
                    "val": "48.796"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "48.796"
                },
                "BudgetYearOneBase": {
                    "val": "48.796"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "48.796"
                                },
                                "BudgetYearOneBase": {
                                    "val": "48.796"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Technical: Not applicable.\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0385"
                    },
                    "ProjectTitle": {
                        "val": "Rapid Prototype Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "48.796"
                        },
                        "BudgetYearOneBase": {
                            "val": "48.796"
                        },
                        "BudgetYearTwo": {
                            "val": "36.197"
                        },
                        "BudgetYearThree": {
                            "val": "41.977"
                        },
                        "BudgetYearFour": {
                            "val": "42.358"
                        },
                        "BudgetYearFive": {
                            "val": "43.266"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Efforts in this Project Unit (PU) 0385 were previously funded in PE 0603382N Advanced Combat Systems Tech; PU 0385 Rapid Prototype Development and PU 0399 Unmanned Rapid Prototype Development. Funds are transferred to this PU effective FY2019."
                        },
                        "ProjectMissionDescription": {
                            "val": "Department of Navy (DON) leadership has acknowledged that maintaining maritime superiority depends in part on our ability to accelerate the speed of warfighting and technological innovations in order to extend our advantage to offset our adversaries' growing capabilities. It is fundamental to the DON's efforts to improve our acquisition outcomes. This project is aligned with, and in direct response to, calls for increased prototyping and experimentation in USD(AT&L)'s Better Buying Power 3.0, Secretary of the Navy's (SECNAV) Task Force Innovation direction, and the CNO direction to achieve High Velocity Learning at Every Level. These efforts will reinvigorate and increase the use of prototyping to rapidly field new warfighting capabilities, concepts and technologies, and engineering solutions.\n\nThe Rapid Prototype Development project funds a strategic focus on rapid prototyping of innovative combat system technologies and engineering innovations to explore Fleet-proposed capability concepts and needs, as well as foster advancements in naval warfighting capabilities. With an emphasis on rapidly prototyping mature technologies, the project is intended to expedite the development, exploration and fielding of technology and engineering prototypes to provide advanced warfighting capabilities, new technologies and engineering innovations across all Naval warfighting domains. Concepts and enabling technologies include but are not limited to; directed energy weapons, hypersonics, unmanned systems, artificial intelligence, machine learning, and multi-domain operations.\n\nSpecific projects under this project number will be selected and executed in accordance with the Department of the Navy (DoN) Accelerated Acquisition Process as described in SECNAVINST 5000.42. The Secretary of the Navy will notify Congress prior to initiation of a project under this project number in accordance with the requirements established in Section 216 of the FY2017 National Defense Authorization Act."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Rapid Prototype Development, Experimentation and Demonstration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Plans and associated resources in this project support the SURTASS-E  Rapid Prototyping, Experimentation and Demonstration (RPED) effort which will provide a modular, flexible, and rapidly deployable mobile acoustic wide-area surveillance capability for installation aboard a vessel of opportunity (VOO).  The project will deliver and demonstrate one system consisting of International Organization for Standardization containerized mission system ship set, installed on a VOO.  Specific FY18 activities include: design and development of the SURTASS-E winch and handling system; procurement of long lead sub-systems for the command, control, communications, computers and intelligence (C4I) van; mission system hardware and software development and integration; VOO assessment, leasing and platform evaluation; VOO installation hardware; towed array towing hardware; acoustic processing development; and system level ship integration and performance assessment.   \n\nAdditionally, Project 0385 will support other FY2018 RPED initiatives, as designated by the Accelerated Acquisition Board of Directors (AABoD) in accordance with SECNAVINST 5000.42 to expedite the development, exploration and fielding of technology and engineering prototypes to provide advanced warfighting capabilities, new technologies and engineering innovations across all Naval warfighting domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.796"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete SURTASS-E RDT&E activities to support initial fielding of capability in FY2019.\n\nContinue to fund RPED projects designated by the AABoD. Potential RPED projects may include, but are not limited to; directed energy weapons, hypersonics, unmanned systems, artificial intelligence, machine learning, and multi-domain operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY2018 and FY2019 in this project reflect increased investment in RPED projects designated by the AABoD and planned for execution in FY2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects identified for execution under this project number are non-acquisition programs.  Each project will develop a project plan to support project execution.  Project plans will include a project schedule and technical requirements and objectives to measure project performance.  The selected technical solutions will be demonstrated in operationally relevant environments to assess their ability to meet warfighter requirements.  Project deliverables include actual integrated hardware\/software prototype systems, CONOPS, requirements, test reports, technical data, and associated doctrine, organization, training, leadership and education, and personnel aspects necessary to support decision making. These deliverables will be used to support project disposition decisions to include transition of technologies to acquisition, further refinement of the technology, or termination and reinvestment of remaining funds to other technologies that add military value."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are specific to each of the projects funded. All will include measures identified in the Statement of Objectives (SOO), including completions, successes, terminations, and iterative prototype cycle times reported against schedules and deliverables stated in the requirement documents."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Support and Test and Evaluation costs are directly associated with the delivery of the primary product and included in the product development cost category for rapid prototype development, experimentation and demonstration cost categories."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Common Support Modules Dev Integration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PMS 420"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Washington, DC"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.900"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "5.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.900"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Towed Army Towing"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Manassas, Va"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.700"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.700"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "3.700"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.400"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Prototype Dev, Experiemt & Demonstration"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "44.196"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "44.196"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 0385"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Prototype Development, Experimentation and Demonstration"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}