{
    "id": "2019-DefenseThreatReductionAgency-PB-0400-JBOOK-bf68c82cd3f91617db25d8e39cf586d94f70da3ccd1feef55140850f55488f14-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DTRA-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Threat_Reduction_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Threat Reduction Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601000BR"
        },
        "ProgramElementTitle": {
            "val": "*DTRA Basic Research"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Threat Reduction Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "254.315"
            },
            "PriorYear": {
                "val": "34.623"
            },
            "CurrentYear": {
                "val": "37.201"
            },
            "BudgetYearOne": {
                "val": "37.023"
            },
            "BudgetYearOneBase": {
                "val": "37.023"
            },
            "BudgetYearTwo": {
                "val": "37.229"
            },
            "BudgetYearThree": {
                "val": "38.265"
            },
            "BudgetYearFour": {
                "val": "39.290"
            },
            "BudgetYearFive": {
                "val": "40.117"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Defense Threat Reduction Agency (DTRA) Basic Research funds support research across physical, material, engineering, computational, and life sciences directed toward increased knowledge and understanding of the fundamental aspects of observable phenomena associated with the threats posed by weapons of mass destruction (WMD).\n\nDTRA's Basic Research effort is the Nation’s only basic research portfolio solely dedicated to countering weapons of mass destruction (CWMD).  It provides for the discovery and development of basic knowledge by research performers from academia and world-class research institutions in government and industry. This investment helps motivate the scientific community to conduct research benefiting WMD-related defense missions, advancing the body of CWMD knowledge, and improving knowledge of research efforts that support nonproliferation, counter proliferation, and consequence management. These efforts are closely coordinated with DTRA’s Chemical and Biological Technologies Department, which executes a basic research portfolio under DoD’s Chemical and Biological Defense Program. \n\nEach year, program and technical managers conduct formal assessments of the portfolio, leveraging deep Science and Technology (S&T) expertise within DTRA, as well as from the Defense Basic Research Advisory Group, independent external panel reviews, and other CWMD-focused stakeholders. This coordination facilitates unique, CWMD-relevant basic research while eliminating unintended duplication of effort in the broader defense S&T community."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "35.436"
                },
                "CurrentYear": {
                    "val": "37.201"
                },
                "BudgetYearOne": {
                    "val": "37.340"
                },
                "BudgetYearOneBase": {
                    "val": "37.340"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.623"
                },
                "CurrentYear": {
                    "val": "37.201"
                },
                "BudgetYearOne": {
                    "val": "37.023"
                },
                "BudgetYearOneBase": {
                    "val": "37.023"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.813"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.317"
                },
                "BudgetYearOneBase": {
                    "val": "-0.317"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.813"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Economic Assumptions"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.317"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.317"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The decrease in FY 2019 is due to the impact of lower economic assumptions for inflation.  The funding level in this program element continues to reflect the impact of incremental Service Requirement Review Board reductions, as part of the Department of Defense reform agenda, for consolidation and reduction of service contracts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "RU"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research for Countering WMD"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "254.315"
                        },
                        "PriorYear": {
                            "val": "34.623"
                        },
                        "CurrentYear": {
                            "val": "37.201"
                        },
                        "BudgetYearOne": {
                            "val": "37.023"
                        },
                        "BudgetYearOneBase": {
                            "val": "37.023"
                        },
                        "BudgetYearTwo": {
                            "val": "37.229"
                        },
                        "BudgetYearThree": {
                            "val": "38.265"
                        },
                        "BudgetYearFour": {
                            "val": "39.290"
                        },
                        "BudgetYearFive": {
                            "val": "40.117"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Prior year funds are related to this project in program element 0602718BR."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Basic Research for Countering WMD project, as the nation’s only basic research portfolio solely dedicated to countering weapons of mass destruction (CWMD), is a core strategic investor in future scientific and technological progress across the full spectrum of the Defense Threat Reduction Agency's (DTRA's) CWMD mission areas.  This project concentrates on high risk, high-payoff basic research, leveraging world-class expertise in academia, government, and industry, to increase the foundational body of scientific knowledge supporting DTRA’s Applied Research and Advanced Technology Development projects.  \n\nThis project aligns with DTRA’s strategic objectives that support policy and planning guidance from the Office of the President, the Department of Defense (DoD), and the broader WMD threat reduction community.  The portfolio addresses this guidance through capability enhancements, projects, and Science and Technology (S&T) investments that support CWMD and reduce global nuclear dangers.  Specifically, they include: accelerating the development of standoff radiological\/nuclear detection capabilities; researching countermeasures and defenses to non-traditional agents; enhancing nuclear forensics; securing vulnerable materials; developing new verification technologies; developing an in-depth understanding of the capabilities, values, intent, and decision making of potential adversaries, whether they are states, networks, or individuals; defeating WMD agents; researching biologically-based and inspired materials for DoD applications; and leveraging science, technology, and innovation through domestic and international partnerships and agreements.  \n\nThis project solicits, coordinates, and conducts research to build a robust, forward-looking fundamental research portfolio targeting strategic, mission-focused, basic research with high potential impact for CWMD.  The research projects are selected for scientific merit, technical quality, and the potential for innovation.  Each individual research project offers opportunities to expand the knowledge base to help the warfighter, to bring to bear new science solutions with a fresh approach, or to leverage revolutionary approaches to technical surprise, building a foundation for future CWMD solutions.  This research will enable new capabilities to: better understand the environment, threats and vulnerabilities; control, defeat, disable, and\/or dispose of WMD threats; and safeguard the force by managing consequences.  Each program manager's portfolio leverages a wide range of scientific disciplines, including physics, chemistry, biology, mathematics, information and network sciences and focuses basic research on the CWMD mission."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Project RU: Basic Research for Countering WMD"
                                    },
                                    "Description": {
                                        "val": "Project RU funds the exploration and discovery of fundamental scientific knowledge related to DTRA’s CWMD mission by research performers from academia, government, and industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.623"
                                            },
                                            "Text": {
                                                "val": "- Manage over 150 active basic research awards on a three to five year cycle.  The Agency’s Basic Research portfolio directly addresses the DoD priority on CWMD S&T and supports specific priorities on Autonomy, Data to Decisions, Electronic Protection, and Engineered Resilient Systems.\n- Support the development of the future Science, Technology, Engineering, and Mathematics workforce by supporting world-class talent in WMD research at universities and laboratories. \n- Conduct an annual technical review of each grant to assess the scientific advancements and progress in meeting the award’s technical objectives and to foster collaboration and build relationships within the scientific community.\n- Conduct an annual external panel review of the basic research program that is open to DoD research stakeholders.  The panel will assess the focus and scope of the program related to CWMD challenges and will assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.201"
                                            },
                                            "Text": {
                                                "val": "- Shape and oversee the CWMD Basic Research portfolio, comprised of approximately 150 active basic research awards on a three to five year cycle. This portfolio continues to address the DoD priority on CWMD science and technology, and supports specific priorities on Autonomy, Data-driven Decisions, Electronic Protection, System Resiliency and other emerging areas of interest.\n- Support world-class talent in WMD research at universities and laboratories to bolster the development of the future Science, Technology, Engineering, and Mathematics workforce.\n- Assess entire CWMD Basic Research portfolio on an annual basis.  \n- Assure progress toward technical objectives and support collaborative relationships within the scientific community through an annual technical review of each grant to assess scientific advancement.\n- Assess the focus and scope of the program related to CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships via an External Panel Review."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.023"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.023"
                                            },
                                            "Text": {
                                                "val": "- Manage and steer the CWMD Basic Research portfolio, comprised of approximately 150 active basic research awards on three- to five-year cycles. This portfolio continues to address DoD CWMD science and technology requirements, supporting specific priorities focused on current and emerging areas of interest.\n- Support collaborative relationships within the scientific community and ensure progress toward technical objectives through an annual technical review of each grant to assess scientific advancement.\n- Support the development of world-class talent in WMD research at universities and laboratories to foster the future Science, Technology, Engineering, and Mathematics workforce.\n- Conduct an Internal Portfolio Review to assess the focus and scope of the portfolio related to CWMD challenges and assess the coordination of CWMD basic research across the DoD mission space and the broader basic research community to avoid duplication and ensure successful partnerships."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "*Prior year funds are related to this project in program element 0602718BR."
                        },
                        "AcquisitionStrategy": {
                            "val": "Procurement methods include competitive selection awards through DTRA’s Broad Agency Announcement and collaborative funding through other organizations."
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance is measured via a combination of statistics including the number of publications generated, number of students trained in sciences and engineering supporting DoD educational goals, number of participating research organizations, and percentage of awards transitioned to other programs for further development."
                        }
                    }
                }
            ]
        }
    }
}