{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-17",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602716A"
        },
        "ProgramElementTitle": {
            "val": "Human Factors Engineering Technology"
        },
        "R1LineNumber": {
            "val": "22"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "23.359"
            },
            "CurrentYear": {
                "val": "24.127"
            },
            "BudgetYearOne": {
                "val": "24.131"
            },
            "BudgetYearOneBase": {
                "val": "24.131"
            },
            "BudgetYearTwo": {
                "val": "24.596"
            },
            "BudgetYearThree": {
                "val": "25.092"
            },
            "BudgetYearFour": {
                "val": "25.604"
            },
            "BudgetYearFive": {
                "val": "26.116"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "173.025"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment. The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance. Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, and intervention methods, and identify and quantify human performance measures and methods to address current and future warrior performance issues. Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nEfforts in this PE support the Army Science and Technology Soldier portfolio.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the S&T priorities of the Army's Chief of Staff, Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nWork is performed by the Army Research, Development, and Engineering command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "23.671"
                },
                "CurrentYear": {
                    "val": "24.127"
                },
                "BudgetYearOne": {
                    "val": "25.16"
                },
                "BudgetYearOneBase": {
                    "val": "25.16"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "23.359"
                },
                "CurrentYear": {
                    "val": "24.127"
                },
                "BudgetYearOne": {
                    "val": "24.131"
                },
                "BudgetYearOneBase": {
                    "val": "24.131"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.312"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.029"
                },
                "BudgetYearOneBase": {
                    "val": "-1.029"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.308"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.029"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.029"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.004"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H70"
                    },
                    "ProjectTitle": {
                        "val": "Human Fact Eng Sys Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23.359"
                        },
                        "CurrentYear": {
                            "val": "24.127"
                        },
                        "BudgetYearOne": {
                            "val": "24.131"
                        },
                        "BudgetYearOneBase": {
                            "val": "24.131"
                        },
                        "BudgetYearTwo": {
                            "val": "24.596"
                        },
                        "BudgetYearThree": {
                            "val": "25.092"
                        },
                        "BudgetYearFour": {
                            "val": "25.604"
                        },
                        "BudgetYearFive": {
                            "val": "26.116"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "173.025"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project conducts applied research on human factors to maximize the effectiveness of Soldiers in concert with their equipment.  The resulting data are the basis for weapon systems and equipment design standards, guidelines, handbooks, and Soldier training as well as manpower requirements to improve equipment operation and maintenance. Application of this research will yield reduced workload, fewer errors, enhanced Soldier protection, user acceptance, and allows the Soldier to extract the maximum performance from the equipment.  \n\nMajor efforts research sources of stress, potential stress moderators, and intervention methods, and identify and quantify human performance measures and methods to address current and future warrior performance issues. Individual efforts exploit adaptive learning methods and strategies, enhance and validate human performance modeling tools; investigate integration of advanced concepts in crew stations designs, optimizes interfaces for information systems and improves human robot interaction (HRI) in a full mission context.\n\nEfforts in this Project support the Army Science and Technology Soldier portfolio.\n\nResults of these efforts are transitioned to the Research, Development, and Engineering Centers, the Program Executive Offices (PEO) & Program Managers, Army Training and Doctrine Command (TRADOC), Army Medical Command (MEDCOM), Human Systems Integration (HSI) Directorate (Army G1), and Army Test and Evaluation Command (ATEC).\n\nThe cited work is consistent with the S&T priorities of the U.S. Army Chief of Staff, Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Interfaces for Collaboration and Decision Making"
                                    },
                                    "Description": {
                                        "val": "This effort looks at the study of how networks influence, and are influenced by, human behavior in the context of military decision making.  The studies, which range from computational modeling to networked simulations in a laboratory environment, to large-scale simulation exercises, will investigate the effects of technology on information flow, cognitive workload, team collaboration, organizational effectiveness, situational awareness, and decision making."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.695"
                                            },
                                            "Text": {
                                                "val": "Will conduct fact extraction and analysis of data from complex networked teams (including civil-military), to inform development of technology for enhanced decision-making; and conduct research on data-to-decisions and decision-support technologies for cyber security, mission command and understanding of big data domains to enhance decision-making and collaborative performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.756"
                                            },
                                            "Text": {
                                                "val": "Develop metric approach to quantify digital performance in human-system interactions; leverage current networking technology and recent advances in wearables and computer-mounted sensor technologies to collect and analyze large volumes of data to characterize behavioral, physiological, task-based and environmental factors influencing task performance and decision making of individuals and teams; develop cyber-security ontologies and scenarios to characterize human dynamics in the cyber domain using approaches such as game theory, artificial intelligence, cognitive modeling, multi-agent simulation, and online platforms for investigation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.847"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.847"
                                            },
                                            "Text": {
                                                "val": "Will develop initial capability for real-time empirical assessment of human cyber performance to include leveraging human digital behaviors (i.e. keystrokes, mouse-clicks, tool use, screen recordings); identify specifications for Soldier cyber security training needs in tactical environments; develop techniques and measures to assess cyber team effectiveness; create behavioral models of Soldier situation understanding and defense of enterprise-level networked operational environments; continue development of capabilities for dynamic human\/agent cyber experimentation using cyber test-range for on-site and remote human-in-the-loop experiments with authoring and execution of repeatable cyber scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased investments to expand program to develop real-time assessment of human cyber performance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Performance Modeling"
                                    },
                                    "Description": {
                                        "val": "Enhance human performance modeling tools to enable system analysis that will inform system design early in the acquisition process.  These tools will allow the identification of design flaws that can be mitigated to reduce workload and human errors and increase user acceptance of developing technologies allowing the Soldier to extract the maximum performance from the equipment.  Collect and analyze empirical data on human perception (vision and hearing) to support human and system performance models used for equipment design and training. Efforts are coordinated with Program Element (PE) 0602786A\/H98 (Clothing and Equipment Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.974"
                                            },
                                            "Text": {
                                                "val": "Will incorporate new cognitive demand scales and update micromodels within IMPRINT; and investigate the effects of physical and cognitive stress such as dehydration or vigilance on Soldier performance, and transition results to models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.506"
                                            },
                                            "Text": {
                                                "val": "Maintain and improve IMPRINT reporting and visualization capabilities; update new performance shaping functions within IMPRINT; research trustworthiness effects within communities and develop methods of using human performance modeling tools as a hybrid modeling architecture; and enhance accommodation modeling tools with improved H-point seated posture positioning for human figure modeling analysis."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.08"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.08"
                                            },
                                            "Text": {
                                                "val": "Will investigate the use of Human Systems Integration (HSI) tools to validate the effects of autonomous systems on operator workload and mission performance; conduct human performance modeling tool maintenance, development, and support; continue to extend development of human accommodating analysis to quantify human resource costs in terms of manpower, personnel and training; develop training videos to support the HSI practitioners; explore the development of human agent assisted tools for supporting HSI evaluations and assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased investments to expand Human System Integration program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brain-Computer Interaction"
                                    },
                                    "Description": {
                                        "val": "Investigate the use of neurophysiological and behavior-based technologies for enhancing the interaction between Soldiers and systems such as autonomous systems and advanced crew stations.  Implement guidelines for: algorithms for characterizing Soldier brain activity in operational contexts; real-time techniques to integrate neurally-based information into systems designs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.134"
                                            },
                                            "Text": {
                                                "val": "Will develop novel techniques that enable co-adaptation of multiple computer vision and brain-computer interface systems for distributed processing of large-scale image data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.54"
                                            },
                                            "Text": {
                                                "val": "Develop and integrate novel neural classification algorithms that enable brain-computer interaction technologies for image analysis to be used without requiring a calibration to the individual user."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.238"
                                            },
                                            "Text": {
                                                "val": "Will develop novel multiclass rapid-serial visual presentation brain-computer interaction paradigms for improved integration with deep-learned computer vision; develop novel approaches for determining the optimal allocation of images across hybrid teams of computer vision and brain-computer interface-using humans for enhancing efficiency of image analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduced investment in brain-computer interaction paradigms in order to support the development of tools for assessing human\/intelligent team performance."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Soldier Performance"
                                    },
                                    "Description": {
                                        "val": "Investigate equipment design standards and human performance measures and create guidelines for maneuver team information systems solutions that improve situational understanding and decision cycle time; identify, mature, and quantify human performance limitations to address future warrior performance issues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.507"
                                            },
                                            "Text": {
                                                "val": "Will examine the tradeoffs between ballistic armor coverage area, armor plate design and mobility to quantity the effect to Soldier performance; conduct research to provide a greater understanding of the effects of physical augmentation (such as exoskeleton devices) on Soldier performance; examine the effects of physical load mitigation technologies on physical performance; investigate the effects of motivation on cognitive performance for individuals and small teams; and examine the effects of prolonged physical stress on physical and cognitive performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.256"
                                            },
                                            "Text": {
                                                "val": "Work to understand the underlying mechanisms by which physical load (equipment mass, physical fatigue, etc.) affects dismounted Soldier performance; investigate the effects of team interaction on operationally relevant cognitive and physical tasks; work to quantify the effect of human variability on the performance of small arms shooting accuracy, and determine ways of mitigating negative effects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.384"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.384"
                                            },
                                            "Text": {
                                                "val": "Will determine the performance thresholds associated with individual and small team performance as a function of physical and cognitive constraints; examine the distinctions between equipment configurations, including novel system interface approaches designed to improve performance metrics (e.g., timing, accuracy, mobility); continue to investigate the effects of human variability on the performance of small arms shooting accuracy, and will determine ways of mitigating negative effects; conduct studies that relate characteristics of individual Soldier weapon systems, ancillary equipment, and ammunition to dismounted Soldier shooting performance (accuracy and precision)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreased investments in physical load mechanisms in order to support the development of Soldier focused neurotechnologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human-Robot Interaction"
                                    },
                                    "Description": {
                                        "val": "Design human-centered design requirements and technologies for supervision and Soldier interaction with multiple semi-autonomous unmanned vehicles in urban and unstructured environments.  This research will be transitioned to U.S. Army Tank Automotive Research Development and Engineering Center (TARDEC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.998"
                                            },
                                            "Text": {
                                                "val": "Will develop and assess multimodal bidirectional communication solutions, including natural language, gesture, and tactile methods, for effective Soldier-agent interaction and teaming; and develop models of trust and transparency as basis for human-centered design requirements for intelligent, autonomous systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.054"
                                            },
                                            "Text": {
                                                "val": "Refine multimodal bidirectional communications solutions, including natural language and language-based methods, for effective Soldier-agent interaction and teaming; enhance models of trust and transparency to serve as basis for human-centered design requirements for intelligent, autonomous systems; both bidirectional communications and trust and transparency will be considered in a variety of applications, including multi-human, multi ? intelligent agent, distributed systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.135"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.135"
                                            },
                                            "Text": {
                                                "val": "Will extend advances in multimodal, bidirectional communications models, including natural language solutions for small teams, to enhance Soldier collaborations with multiple heterogeneous agents in a distributed operational environment; enhance models of trust and transparency to include adaptive roles for both humans and agents and serve as basis for human centered design requirements in multi-agent systems; explore applications for bidirectional communication and trust and transparency to include both mounted and dismounted operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Expanded investments in communication models to support S&T strategy and senior leader priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Understanding Socio-cultural Influence"
                                    },
                                    "Description": {
                                        "val": "Investigate and model cognitive aspects of socio-cultural influences on Soldier\/Commander decision making and communication to enhance Soldier performance with systems, within teams and in the mission context.  Extend models of individual and teams to societal levels to support regional understanding, training, mission rehearsal, and influence.  This work complements and is coordinated with PE 0602784A\/T41 (Socio\/Cultural Behavior) and PE 0602785A\/790 (Personnel Performance & Training Technology)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.029"
                                            },
                                            "Text": {
                                                "val": "Will develop metrics and supporting models to map the effect of socio-cultural factors on Soldiers? decision-making, and improve asymmetric threat forecasting to inform battlefield operations; and develop representative algorithms of social-cultural variables to integrate into models that will predict adversary behavior."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.06"
                                            },
                                            "Text": {
                                                "val": "Validate new social cultural representation models integrating civil affairs and intelligence social-cultural expertise into the US Army?s Common Operating Picture to augment the Commander?s military decision making process; identify sociocultural influences that facilitate teaming amongst socio-cultural diverse groups; develop an ontological framework of these influences and interactions to obtain a better understanding of cause and effect and to support predictive model development."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.059"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.059"
                                            },
                                            "Text": {
                                                "val": "Will continue to quantify the processes and proficiencies that are selected for and taught by practitioners who collect, process, and distribute sociocultural information within the Army; develop a predictive model of group behavior based on religion to augment Civil Affairs decision making; conduct preliminary experiments to explore methods for improving situational understanding and decision making when visualizing sociocultural information in virtual reality; leverage theory from cognitive science to inform experimentation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor reduction in the visualization of sociocultural information."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Continuous Multi-Faceted Soldier Characterization for Adaptive Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort will investigate technologies that provide the foundation for future Army systems to adapt to individual Soldier?s states, behaviors, and intentions in real-time.  Develop novel approaches to individualize adaptive systems through enhanced interfaces, interactions, or interventions that capitalize on prediction methods; and decrease time-to-train, augment physical, cognitive, and social performance, and improve human-network interactions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.6"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques to integrate behavioral, physiological, environmental, and task-based sensors to enable continuous low resolution multi-faceted monitoring of an individual."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.259"
                                            },
                                            "Text": {
                                                "val": "Develop capability for real-time performance assessment using novel techniques for aggregation, storage and access of individual specific, low-resolution, longitudinal data from a combination of behavioral, physiological and task domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.6"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques and algorithms to collect, synchronize and integrate high resolution behavioral, physiological, environmental, and task-based sensor information with existing low-resolution multi-faceted assessment capability to enable continuous monitoring of an individual across a variety of timescales; develop capability for real-time group-based performance assessment incorporating multi-faceted individual metrics and social dynamics through integration of multiple, pervasive data sources."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreased investments in performance assessments to support senior leader Soldier Lethality priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Sensory Performance"
                                    },
                                    "Description": {
                                        "val": "Conduct Soldier-oriented research to understand attention and cognitive challenges of interpreting unaided and aided tactile signals, visual imagery, and auditory events in complex, dynamic battlefield environments.  Results are used for enhancing sensory performance by providing the materiel development community with the knowledge necessary to effectively design systems that maximize mission effectiveness and survivability of the dismounted Soldier."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.485"
                                            },
                                            "Text": {
                                                "val": "Will develop models of target saliency and concepts for training methodologies to enhance IED detection performance; validate concepts of integrating bone conduction communications systems into chemical, biological, radiological and nuclear protective masks as an improvement to Soldier communication and performance; and characterize operator\/system performance capabilities of night vision devices (NVDs) to support development of digital sensor technology."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness Research"
                                    },
                                    "Description": {
                                        "val": "Novel technologies and their implementation in Army systems may result in demands on Soldiers that exceed their knowledge, skill, or memory capacity.  When demands cannot be remediated by human systems integration, training may enable the demands to be met.  This effort will identify human operator tasks in complex, intelligent, and emerging systems critical to mission employment of new technologies.  The aspects (particularly knowledge and skill) of those tasks will be determined through experimentation and analysis to inform development of training and simulation technologies, fundamental research on the effectiveness of training regimes, and simultaneous task combinations that must be trained.  This effort leverages research from PE 0601102A\/74A (Human Engineering) and will be transitioned to PE 0603015\/S29 (Next Generation Training and Simulation Systems)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.937"
                                            },
                                            "Text": {
                                                "val": "Will develop automated performance measurement capabilities for use in evaluating the effectiveness of training; and conduct research on the integration of multi-sensor data (e.g. accuracy, communications, psycho-physiological, and\/or movement\/location) for automated measurement of critical training outcomes and perform validation studies assessing metrics (algorithms) of training performance in virtual test-bed and live training environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.932"
                                            },
                                            "Text": {
                                                "val": "Refine research-based integration of multi-sensor data (e.g. accuracy, communications, psycho-physiological, and\/or movement\/location) for automated measurement of critical training outcomes; conduct research to validate training performance assessment algorithms for virtual test-bed and live training environments; refine and validate automated performance measurement capabilities for use in evaluating the effectiveness of training."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments with refined research-based integration of multi-sensor data (e.g. accuracy, communications, psycho-physiological, and\/or movement\/location) for automated measurement of critical training outcomes; explore and identify training effectiveness measures for collective training (mixed reality and live); explore and identify multi-sensor data for automated measurement of effective collective training outcomes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased investments to support collective training capabilities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "Soldier performance is affected by mission demands, environment, human characteristics, equipment, and technology.  System development requires considering tradeoffs among these factors and sufficient data about them on which to base analyses. This effort will identify and develop human performance measures of effectiveness (MOEs) and measures of performance (MOPs) critical to performing individual and team tasks in a mission text. Tools and techniques for analysis of these tradeoffs will also be developed. Empirical data will be mined from existing sources or collected where gaps exist to inform the interaction among factors affecting Soldier mission performance for emerging technologies. This research supports the development of the SSEA and is coordinated with PE 0602786A\/H98, 0603015A\/S28, PE 0603710A\/Project K70, PE 0602308A\/ C90, PE 0602787A\/869, and 0603004A\/232."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Will develop an analysis methodology and proof of concept front end analysis tool for SSEA; and develop operational scenarios to examine cognitive, physical, and social aspects of performance to exercise within SSEA."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments on Soldier Resilience (arousal) and Effects of Stress on Soldier performance to shoot, move, and communicate.  Purpose is to collect output data informing future model development and supporting SSEA scenarios at the tactical level of warfare; validate SSEA analysis methodology and proof-of-concept front-end analysis tool in a military relevant context."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Soldier Capability Enhancement"
                                    },
                                    "Description": {
                                        "val": "Research the relationship of augmentation agents and Soldier performance & behavior.  Investigates the effects of augmentation agents (perceptual, cognitive, and\/or physical), used either individually or coupled as a system of agents, on Soldier performance, resilience, and training during operationally relevant tasks. Development of guidelines and models for designing and employing augmentation agents. Implementation of guidelines will enhance augmented Soldier performance."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.76"
                                            },
                                            "Text": {
                                                "val": "Investigate augmentation applications, including timing, amplitude, and duration relative to biological and environmental signals, to understand functionality in varied and complex environments; model performance and adaptation to augmentation agents in order to predict capability enhancement; investigate individual variability and short and long term adaptation to augmentation agents; plan to investigate the extension of methods and metrics developed for single augmentation agent to the quantification of Soldier performance while using a system of augmentation agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.784"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.784"
                                            },
                                            "Text": {
                                                "val": "Will investigate augmentation applications, to understand functionality in mounted and dismounted operational environments; enhance models of performance and adaptation to facilitate more robust prediction of capability enhancement including short and long term adaptations and factors related to individual variability; enhance metrics for quantifying Soldier performance while using a system of augmentation agents in complex environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase in funding to refine models of performance and adaptation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tools for Assessing Human\/Intelligent Team Performance"
                                    },
                                    "Description": {
                                        "val": "Develop tools for verifying and validating Soldier interactions and overall human-system performance of mixed Soldier-intelligent agent teams, while providing the foundation for a generalizable tool for a broad range of Human-System Integration (HSI) assessments. Focus on flexible, tailor-able analysis tools for laboratory grade, high-resolution assessment of dismount-robot interactions in complex environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Will develop portable, ?plug and play? analysis toolkit that enables individualized assessment of a single human interacting with an intelligent agent in pseudo-controlled environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports the acceleration of Human\/Intelligent agent team performance work."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Explainable Intelligence Underlying Efficient Integration of Cognitive assist Agents"
                                    },
                                    "Description": {
                                        "val": "This effort will develop novel methods for joint human \/ intelligent agent learning and decision making to capitalize on the individual strengths of humans and intelligent agents to improve emergent group performance; and enable rapid, cooperative decision making and learning utilizing machine learning approaches."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.061"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.061"
                                            },
                                            "Text": {
                                                "val": "Will develop novel machine learning approaches for learning the optimal allocation of tasks across hybrid teams of humans and artificial intelligent agents; develop novel approaches to deep neural networks based on the underlying geometry of the data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports the acceleration of task allocation research for hybrid teams."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Focused Neurotechnologies"
                                    },
                                    "Description": {
                                        "val": "Neurotechnologies for Soldier use are limited by a lack of sufficient tools and methodologies capable of interpreting brain data in real world environments. Research will focus on the development of novel user-transparent data acquisition systems that are comfortable and non-invasive and on the development of robust tools that account for high levels of variance and noise expected in recorded brain data in real-world environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.343"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.343"
                                            },
                                            "Text": {
                                                "val": "Will determine and develop efficacy of novel materials for use in advanced validation tools for mobile brain-recording hardware; develop a framework describing the relationship between computational neural data features and the performance of corresponding neural state classifiers within non-ideal, noisy environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports the acceleration of Soldier neurotechnology research."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Exoskeleton"
                                    },
                                    "Description": {
                                        "val": "Accelerates Soldier lethality and mobility capabilities through exoskeleton systems with improved Soldier compatibility and reduced training requirements. Advances innovative assessment and analysis techniques and metrics that inform hardware design, system control and technology use case objectives. Identifies and matures fundamental assessment protocols for transition to Army Test and Evaluation community."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.6"
                                            },
                                            "Text": {
                                                "val": "Will identify and validate initial surrogate tasks and associated performance metrics against an anticipated urban terrain scenario; identify key quantitative measures and model their relationship to performance outcomes; characterize human movement variability in performance of and transitions between component tasks and responses to perturbations within movement through complex urban environment scenario."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort supports the acceleration of exoskeleton research in support of senior leader priorities for Soldier Lethality."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}