{
    "id": "2019-DefenseTechnicalInformationCenter-PB-0400-JBOOK-72b8d40b58078936b55b8de7d47333621ce02d605c9f74aaedb2baa28cd072fe-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DTIC-U_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Technical_Information_Center_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Technical Information Center",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605801KA"
        },
        "ProgramElementTitle": {
            "val": "Defense Technical Information Center"
        },
        "R1LineNumber": {
            "val": "161"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Technical Information Center"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "163.946"
            },
            "PriorYear": {
                "val": "43.834"
            },
            "CurrentYear": {
                "val": "54.145"
            },
            "BudgetYearOne": {
                "val": "56.853"
            },
            "BudgetYearOneBase": {
                "val": "56.853"
            },
            "BudgetYearTwo": {
                "val": "58.411"
            },
            "BudgetYearThree": {
                "val": "60.348"
            },
            "BudgetYearFour": {
                "val": "62.273"
            },
            "BudgetYearFive": {
                "val": "63.375"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense Technical Information Center’s (DTIC) unique mission is to aggregate and fuse science and technology data to provide rapid, accurate, and reliable knowledge to researchers and developers of the next generation of technologies needed to assure our national security. DTIC, a DoD Field Activity, is the DoD’s singular executive agent and designated source for DoD-funded scientific, technical, engineering, and industry-related information.  DTIC also operates DoD Information Analysis Centers (IACs) focused on Defense Systems, Cyber Security and Information Systems, and Homeland Defense and Security.\n\nEach year, DoD invests over $13.0 Billion in research, development and procurement of advanced technologies needed to defend our nation.  DTIC preserves the fruits of these costly labors for reuse across the enterprise.  As an efficient and cost-effective steward of technical information, DTIC collects data and provides answers to researchers seeking state-of-the-art data relevant to their projects.  Through this interchange of information DTIC accelerates innovation and prevents duplication of experiments, tests, and prototyping activities because researchers can build on what has been done or choose other paths if prior research resulted in a dead end. Using DTIC-created forums, researchers, Warfighters, and industry partners can also rapidly collaborate and connect across the DoD research and engineering (R&E) enterprise.  Finally, DTIC provides a department-level map of R&D activity.  This map gives decision-makers insight into current and past research, highlighting where progress is being made and by whom.  Through the preservation and sharing of the results of billions of dollars of past DoD investments, DTIC increases the return on past investments and accelerates current efforts, saving the Department precious time and dollars.  Through its collaboration tools and outreach to the R&E community, DTIC connects researchers across the lab enterprise, to include researchers and engineers, Warfighters and DoD’s industry partners. \n\nDTIC’s strategic themes center on customer focus, innovation, operational excellence, and strategic partnering.  In support of these themes, DTIC’s organizational efforts are focused on the following priority areas:\n1) Search:  Develop new algorithms that enable our users to quickly discover useful information and to ensure we present the most relevant information.  Expand and enhance our data collections to improve the quality and completeness of the data. \n2) Collaboration:  Provide collaboration platforms for the DoD science and technology community to work together on investments that efficiently deliver solutions to the Warfighter.\n3) Access Identity:  Strengthen methods of user authentication through the use of public key infrastructure (PKI) tokens, biometrics and other methods to grant access to recognized, trusted and authorized users.  Protect intellectual property (IP) and industry proprietary data assets entrusted to DTIC’s stewardship (protect information access).\n4) Data Fusion\/Analysis:  Gather information from multiple data sources and provide knowledge products that fuse the disparate data sets into a single view of the life cycle of research.  Present an overarching picture of research investment that enables decision-makers to link multiple efforts with integrated capabilities (employ resources to highest priority efforts and coordinate efforts across Services).  \n5) Cyber Security:  Continue to leverage state-of-the art technologies, processes and practices designed to protect DTIC networks, computers, programs and data from attack, damage or unauthorized access.\n6) Data Center Optimization\/Cloud:  Migrate services to cloud providers to improve availability, redundancy, and mission flexibility; to reduce time to deliver new capabilities; to save costs; and to enhance cyber security.\n\nDTIC recognizes the need to accomplish its mission while increasing the value of its services and products.  DTIC has reduced its headquarter staffing, physical footprint, civilian personnel and support contractors.  DTIC has restructured the IAC program, and continues to consolidate its data center.  \n\nRecently, DTIC has taken on additional programs, to include its new role in leading the Department in efforts to provide public access to DoD-funded journal articles and research data and increase outreach to industry through DTIC’s Defense Innovation Marketplace.  In addition, DTIC is sponsoring the publication of a quarterly DoD R&E Journal.  The purpose of the Journal is to share controlled unclassified and classified information throughout the R&E community, reduce exfiltration of information, and to serve as a vehicle to recognize talented individuals in sensitive technology areas.  Moreover, DTIC activities promote citizen science.  Citizen science mobilizes the public to engage in the scientific process and thereby address real-world problems.  Citizen scientists identify research questions, collect and analyze data, interpret results, make new discoveries, develop technologies and applications, and solve complex problems.  DTIC continues to ensure its activities are efficient and effective, meet users’ expectations, and employ industry best practices and standards, while protecting its wealth of information from cyber threats. \n\nDTIC's restructured Information Analysis Centers (IACs) drive innovation and technological development by anticipating and responding to the information needs of the defense and broader community. The IAC Program Office provides core funding, management and oversight of three IACs, which are chartered by DoD to collect, analyze, and disseminate worldwide scientific and technical information in specialized fields. The IAC multi-award task order contracts ensure that new research, analysis, and development builds on prior investments and puts to work the best practices of government, industry, and academia. The IAC approach was identified as a \"best practice\" by the Director of Defense Procurement and Acquisition Policy in a January 2015 memo wherein he promoted maximum use of the IAC contracts across DoD.  The IACs are structured into three application areas:  Cyber Security and Information Systems, Homeland Defense and Security, and Defense Systems. As part of the Department's acquisition improvement initiatives, the IAC multi-award contracts enhance competition, increase usage of small businesses, and reduce costs. For the last several years, competition inherent in the IAC model has produced savings of 17-25 percent over projected costs, delivering vetted technical expertise to address many of the complex challenges DoD faces. An independent assessment by the Center for Strategic and International Studies reported that the IACs improve affordability, productivity, and standardization within defense acquisition programs. Providing the acquisition enterprise access to thousands of industry subject matter experts, DTIC's IACs perform over $1.0 Billion of customer-funded research and prototyping annually.  The results of the work are a rich source of new material in DTIC's information asset collections and are available to users across the Department (and other federal agencies, e.g., Department of Energy, Department of Homeland Security).\n\nThis Program Element (PE) supports DTIC mission operations. DTIC focuses on three core mission areas (Collection, Dissemination and IACs) and purchases space and shared services (e.g., human resources (HR); financial management; contracting; IT security; communications; and civilian payroll services) from expert and efficient DoD providers."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "43.834"
                },
                "CurrentYear": {
                    "val": "54.145"
                },
                "BudgetYearOne": {
                    "val": "57.647"
                },
                "BudgetYearOneBase": {
                    "val": "57.647"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "43.834"
                },
                "CurrentYear": {
                    "val": "54.145"
                },
                "BudgetYearOne": {
                    "val": "56.853"
                },
                "BudgetYearOneBase": {
                    "val": "56.853"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.794"
                },
                "BudgetYearOneBase": {
                    "val": "-0.794"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Change"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.794"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.794"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Program Change:  The FY 2019 Base program reduction (-$0.794 Million), as compared to the Previous President’s Budget FY 2019 PB Base, reflects a net change resulting from the following:  1) a program adjustment levied by the Department, and 2) economic price adjustments.\n\nFY 2019 Service Requirements Review Board (SRRB) Reduction:  The FY 2019 program includes a $0.740 Million reduction in accordance with the Department’s recent service contract downsizing effort."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "001"
                    },
                    "ProjectTitle": {
                        "val": "Defense Technical Information Center"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "145.397"
                        },
                        "PriorYear": {
                            "val": "38.086"
                        },
                        "CurrentYear": {
                            "val": "49.071"
                        },
                        "BudgetYearOne": {
                            "val": "51.837"
                        },
                        "BudgetYearOneBase": {
                            "val": "51.837"
                        },
                        "BudgetYearTwo": {
                            "val": "53.395"
                        },
                        "BudgetYearThree": {
                            "val": "55.332"
                        },
                        "BudgetYearFour": {
                            "val": "57.257"
                        },
                        "BudgetYearFive": {
                            "val": "58.359"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DTIC is responsible for developing, coordinating and enabling a strong scientific and technical information (STINFO) program for the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the DoD scientific & technical (S&T) enterprise. In this role, DTIC sets policy for scientific and technical information (STI) exchanges for the research and engineering (R&E) community. DTIC’s aim is to maximize the availability and use of technical information and products resulting from Defense-funded technical activities while ensuring restrictions to safeguard national security, export control, and intellectual property rights.\n\nRecognizing the common elements across budget justification documents, progress reports, completed work reports, studies, and journal articles, DTIC is mapping relationships to enable users to access the life cycle of research projects from planning to final results. DTIC employs information technology to verify and validate information submitted and improve user confidence in DoD research documentation.\n\nDTIC is leading the Department’s efforts to implement public access to published journal articles, and digital data from research funded by taxpayers. In this role, DTIC is actively working with partners across the Services, components, other federal agencies and publishers.  These ongoing efforts directly complement and support the Department’s objectives associated with Citizen Science.  Consistent with the Administration’s (Office of Management and Budget) emphasis for open standards and machine readable formats, DTIC initiated the transition from paper and Portable Document Format (PDF) based information to Web Service Extensible Markup Language (XML) standard data submission and machine readable delivery. DTIC partnered with the OSD Comptroller to collect investment account budget justification documentation in XML and embed this XML in PDF for justification books delivered to Congress. DTIC employed this same technology in collecting S&T progress reports from the Services and Agencies, and Independent Research and Development (IR&D) data from industry. DTIC is planning the migration of its completed technical reports collection to the same open standards, i.e., machine readable formats.  \n\nThrough the use of commercial search technology, DTIC provides search capability that links its knowledge of the DoD domain and metadata to support both text searches and data mining. DTIC continually works to enable additional features within our search capabilities and from commercial partners to improve information discovery and relevance.\n\nDoD conducts science and technology research via the following means:  60+ labs, Federally Funded Research and Development Centers (FFRDCs), DTIC’s Information Analysis Centers (IACs), and other contracts and grants.  Spanning over a dozen distinct priority area communities of interest, the results of this work are available through DTIC’s web-based R&E Gateway.  To protect this information, DTIC regulates access through a database of registered users.  In addition, DTIC uses commercial software in compliance with DoD Identity Management Standards to provide instant authenticated access to users of the DoD Common Access Card (CAC)\/Federal Government Personal Identity Verification (PIV) cards, industry PIV-I cards or External Certificate Authority (ECA).  DTIC’s unclassified assets, tools and community interaction capabilities foster innovation, competition and identification of solutions in an access-controlled environment.\n\nFocus on User Communities and Distribution Points:  DTIC supports user communities on the network where they work, i.e., NIPRNET, SIPRNET and public internet, and uniquely provides access controls within unclassified and classified material to protect intellectual property in our search, distribution, and collaboration tools.\n\n- DoD’s RDT&E Enterprise:  As a Field Activity to ASD(R&E)\/AT&L, DTIC’s priority is the RDT&E enterprise, hosting information assets and tools on the NIPRNET (the primary network for the community).\n\n- Warfighter:  Improving coordination between the acquisition enterprise and warfighter communities, DTIC hosts a subset of information assets and tools on the SIPRNET. DTIC is working to expand the availability of science and technology (S&T) information, to include Independent Research and Development (IR&D), on the SIPRNET.  DTIC is continuing its efforts to establish parity of information and capabilities on applications hosted on both NIPRNET and SIPRNET platforms.\n\n- Industry and Academia via Public Internet:  Engaging industry outside the NIPRNET firewall to support acquisition improvement initiatives and encourage the introduction of innovation, DTIC hosts unclassified public information and tools accessible to all users on the Internet. The Public Access initiative adds importance to the public distribution point, to encourage technology transfer of basic and public research to the private sector, and to give an economic boost to small businesses that can use that data to provide new applications to consumers.\n\nSummary.  DTIC protects and preserves DoD’s multi-billion dollar investment in research, which empowers the acquisition enterprise through innovative tools, information systems, and decision support capabilities. The efficiency benefits can be enormous.  Each 1 percent increase in the reuse of S&T efforts produces over $100 Million in savings that can be redirected.  Those savings come from elimination of inefficient redundancy (and unnecessary delays), increased community interaction, and ultimately, a more capable military.  DTIC is uniquely positioned to support and to ensure the value of DoD’s R&D portfolio is fully realized."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Defense Technical Information Center"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "38.086"
                                            },
                                            "Text": {
                                                "val": "- Evaluate FY 2016 progress in semantic technology; expand semantic enhancement of content to promote exploration and discovery across multiple collections to identify related search topics, concepts and associations, to the extent maturing capabilities allow.\n-- Apply semantic linking and tagging technology to new collections, such as journal articles, data set metadata and acquisition data. As of April 2017, the tagging technology has been utilized to tag new technical reports and journal articles added to the DTIC Collection with subject terms. Plan to continue expanding to include communities of interest and technical readiness levels, and report subject groupings. The tagging technology has the ability to batch process 4 million documents in under 20 days.\n-- Addition of a semantic search option to standard keyword search results.\n- Enhance DTIC identity management by implementing the capability to accept PIV-Industry (PIV-I), the federal government standard for two-factor authentication; enables authenticated industry adapters to access DTIC collections and products.  Initial companies seeking access with PIV-I are Boeing, Lockheed Martin, Northrup Grumman, Raytheon, and Symantec.\n- Support DoD’s public access effort, albeit at a reduced level. Providing public access to federally funded research not only brings the Department into compliance with the Office of Science and Technology Policy (OSTP) Memorandum, but also provides DoD with a central repository of published science and technology (S&T) information to encourage innovation.\n-- Pursue collaborative efforts with other Federal agencies to leverage existing systems and lessons learned.\n-- Establish draft guidance for data management plans (DMPs). Work with subject matter experts to develop DMP requirements relevant to specific science and technology disciplines.\n-- Continue to plan for the integration of input, public access search, and authentication capabilities to support the submission of journal articles from contractors and grantees.\n- Complement the Department’s acquisition improvement initiatives by expanding the search and analytic capabilities of the Defense Innovation Marketplace.\n-- Maintain the Marketplace capability to support all the Services’ communications with industry for Technology Interchange Meetings, across all of the Communities of Interest (COIs). \n- Continue migrating legacy standalone collection feeds to DTIC’s standard library content management system in the DoD-hosted cloud, reducing the footprint of multiple technologies and driving efficiencies and cost avoidance.\n-- Migrate the second collection, the Information Analysis Center (IAC) Total Electronic Migration System (TEMS) collection and process into the DTIC consolidated content management system.  The IACs process over 30,000 technical reports annually into the DTIC collection.\n- Implement the Master Data Repository (MDR) for the DTIC collections on SIPRNET.\n-- Deploy a new SIPR search, which leverages the new MDR, to enable users to discover more relevant science and technology information faster by refining a search using Boolean, wildcards, nesting, truncation, stemming, phrases and proximity operators.\n- Collaborate with the DoD Intelligence community and other AT&L representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD begins to rewrite its guidance for marking documents.\n- Complete the enhancement of the International Agreements Database (IADB) to include re-engineering the application for more efficient integration with the database and search capability.\n- Continue the initial evaluation and prototyping of Cloud Service Provider offerings to select the best provider for Infrastructure As A Service (IAAS), Platform As A Service (PAAS), and Software As A Service (SaaS).\n-- Further explore options to establish a DTIC Cloud location and vendor; begin preparations to initiate the transition from a DTIC-provided Data Center to a DoD-CIO approved Cloud Service Provider.\n-- Stand up an initial public site (unclassified, unlimited) in a commercially available cloud; move selected public web-sites static content to a Cloud Service Provider."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.071"
                                            },
                                            "Text": {
                                                "val": "- Deliver customers the capability to apply flexible search strategies across all DTIC collections.\n-- Continue to integrate search and analysis capabilities across all collections on SIPRNET and NIPRNET for improved analysis and discovery of information. \n-- Complete upgrade and update to the main DTIC NIPR and SIPR search interface to incorporate new search capabilities and improve the user experience with DTIC search products.\n-- Complete transition of all search capabilities to the Master Data Repository (MDR); discontinue the DTIC Google Search Appliances (GSA). \n- Provide capability to automate processing of public release content to eliminate backlog, and enable rapid availability.\n-- Reduce the footprint of multiple technologies and retire the 25 year-old legacy system to drive efficiencies and reduce cost of ownership.\n- Conduct an analysis of alternatives to support the advancement of user access and identity management capabilities.\n-- Review and investigate innovative commercial technologies and available government offerings.\n-- Develop requirements; establish a Subject Matter Expert (SME) position; track industry technology advancements.\n- Leverage the DTIC Thesaurus to enhance search results.  Continue the improvement of real-time analysis of incoming records to promote exploration and discovery.\n- Help the defense community locate the most relevant technical information by leveraging the Master Data Repository (MDR) solution. \n-- Expose richer Technical Reports metadata to NIPR users, ingest 2018 R2\/P40 content, and implement Health assessment recommendations. \n-- Initiate the streamlining of process data flows to public search products, reducing maintenance and data copies, facilitating cloud migration, and providing richer metadata to include both Digital Object Identifiers (DOIs, a unique identifier assigned to a particular document so it can always be found) and public journal articles.\n-- Assess data quality in primary collections and begin addressing issues with the greatest impact.\n- Broaden and expand DTIC collections to include material from the Department’s Rapid Fielding and Prototyping communities, which fall under the Research, Development, Test, and Evaluation (RDT&E) Budget Activity (BA) 4, Advanced Component Development and Prototypes (ACD&P).\n-- Develop, build and foster collaboration, partnerships, and business relationships with leadership elements from within these communities.\n- Collaborate with the DoD Intelligence community and other AT&L representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD continues to negotiate with the Federal CUI Executive Agent on implementation appropriate for DoD, and rewrites the guidance for marking DoD documents.\n- Support DoD’s public access effort; conduct outreach and educate intramural and extramural researchers on the requirement to submit journal articles to DTIC.\n-- Collaborate with the DoD laboratories to design an efficient, integrated submission mechanism for all types of public access information.\n-- Implement contractors\/grantees input capability for journal articles.\n-- Enhance public access search to include both new and legacy journal articles submitted to DTIC, combined with pointers to publisher versions.\n-- Begin to accept voluntary input of metadata pointing to public or limited dissemination data sets.\n-- Initiate an independent study and a prototype to examine options for the management of digitally formatted scientific datasets.\n-- Evaluate dataset dissemination capabilities. \n-- Collaborate with other federal agencies to acquire multi-funded journal articles, streamlining the burden on contractors\/grantees to comply with public access requirements.\n- Deliver customer-driven features based on an improved understanding of customer successes and experiences on DTIC sites.\n-- Implement decision-based metrics across primary DTIC products to improve DTIC’s ability to understand customer behavior and make business decisions on investments in products and services.\n-- Deliver capability for DTIC program managers and product owners to have full visibility and transparency on product usage, customer trends, and customer tendencies in products and services. This will allow full visibility on all user actions and interactions in the search user interface, and fully capture user successes by measuring downloads, bibliography builds and exports, and user paths through the interfaces.\n- Conduct initial planning to establish a functional IT Continuity of Operations (COOP) capability for DTIC.\n-- In conjunction with Cloud migration planning, complete an IT COOP analysis in order to produce an approved and executable IT COOP plan.  Review commercial technologies and government offerings.\n-- Integrate effort with concurrent cloud services planning to provide required infrastructure to support and sustain the future IT COOP environment.\n-- Design cyber Risk Management Framework (RMF) documentation and accreditation; conduct initial system engineering to ensure the highest availability of future services.\n- After 2017’s successful migration of the initial websites to commercial cloud providers, DTIC will continue the planning and migration of DTIC’s information, systems and services to a Cloud based infrastructure. \n-- DTIC will complete an assessment and detailed plans for its migration to the Cloud to build a Cloud-based infrastructure that maximizes flexibility both in capability and acquisition of services, provides redundancy, improves reliability, and provides robust cyber security for all DTIC information systems.\n-- Develop a plan to determine options in support of a Cloud based production environment for DTIC’s unlimited unclassified information and systems.\n-- Begin the design of a cloud architecture to create an optimal cloud environment that will improve the customer support experience, reduce cost and labor, capture user data, and improve security posture in order to meet DoD Data Center reduction goals.\n-- Plan the transition stages for phasing DTIC’s public, NIPRNET, and SIPRNET activities to a Cloud environment.\n-- Develop and design the Risk Management Framework (RMF) controls for a new DTIC Cloud environment; prepare accreditation documentation and an update to the Authority to Operate (ATO).\n-- Design the integration of Single Sign-On capabilities, User Registration Systems, and public key infrastructure (PKI) authentication methods for a new DTIC Cloud environment.\n-- Explore options to establish a contract or service level agreement with an organization or company to facilitate DTIC’s transition from its Data Center to a Cloud Service Provider.  Ensure progress is synchronized with DoD cloud efforts, approved platforms, and contract vehicles.\n-- Construct a flexible cost model to track true cost of ownership in order to share costs with DTIC customers and better track internal expenditures. \n-- Continue the successful migration of public sites to a commercial or government-provided cloud\/data center.\n- Research and investigate innovative commercial and open source technologies needed to field mobile capabilities in support of user devices, operating systems, and browsers.\n-- Conduct an analysis of alternatives to support development of mobile capabilities.\n-- Develop initial plans for incorporating mobile technologies to include metrics, software development, testing, and cyber security.\n-- Begin development of a prototype mobile application for searching DTIC public data.\n- Establish and publish the initial R&E Journal at the CUI and Classified levels.\n-- Use the Journal to share information throughout the R&E community, and as a vehicle to recognize individuals in sensitive technology areas."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "51.837"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "51.837"
                                            },
                                            "Text": {
                                                "val": "- Deliver the next generation Search and Discovery capability, allowing customers to gain intricate knowledge of DTIC data and collections, the ability to use that data in a variety of ways, and to analyze that data through a single user-oriented solution.\n-- Collapse multiple user interfaces that are used to access the same data sets into a consolidated user interface that has multiple functionalities.\n-- Complete the exposure of Marklogic functionalities in this next generation Search and Discovery user interface.\n-- Enhance the user’s ability to package relevant information generated through search and discovery for their use in research papers, presentations, and analysis and decision tools.\n-- Continue to encourage DoD adaptation and use of persistent open source identifiers, such as Open Researcher and Contributor ID (ORCID), in order to build complete author profiles and establish links to the author’s technical documents contained within the collection.\n-- Improve relevance of user search and discovery results, including use of semantic technologies to pre-process metatag\/label\/categorize material and to expand user search terms at runtime in order to help users--who are not experts--locate information to answer questions.\n-- Develop enhanced mobile technologies focused on mobile applications search and discovery.\n- Continue to develop Access and Identity Management technologies to further protect DTIC data and enhance visibility of a user’s path through DTIC products and services.\n-- Initiate implementation of a commercial off-the-shelf access and identity management system that replaces the current DTIC Registration system on both NIPR and SIPR.\n- Enable the defense community to locate the most relevant technical information by leveraging the Master Data Repository (MDR) solution. \t\n-- Initiate effort to surface richer metadata describing Information Analysis Center (IAC) Technical Reports.\n-- Initiate development of Application Programming Interface (API) for organizations to pull data from MDR and to federate searches to MDR.\n-- Establish links across data, enabling integrated displays of project, organization, topic, and user data.\n- Implement MDR internal interfaces for the DTIC staff to test the system, manage content, and assist users.\n- Continue to broaden and expand DTIC collections to include material from the Department’s Rapid Fielding and Prototyping communities, which fall under the Research, Development, Test, and Evaluation (RDT&E) Budget Activity (BA) 4, Advanced Component Development and Prototypes (ACD&P).\n-- Continue to develop, build and foster collaboration, partnerships, and business relationships with leadership elements from within these communities.\n- Collaborate with the DoD Intelligence community and other AT&L representatives on policy and implementation of the new Controlled Unclassified Information (CUI) federal marking regulations, as DoD rewrites the guidance for marking DoD documents.\n-- Create requirements for changes to DTIC systems in support of the new CUI Framework, and begin the development process for initial systems.\n- Support DoD’s public access effort; conduct outreach and educate intramural and extramural researchers on the requirement to submit journal articles to DTIC.\n-- Implement an automatic authentication method for contractors\/grantees journal article input.\n-- Initiate development of a catalog\/locator of data sets using discovery and descriptive metadata, along with the capability to send metadata for public data sets to data.gov.\n-- Establish a pilot project to accept submissions of data management plans (DMPs) for DoD-funded research programs.\n-- Integrate the search and display features of existing DTIC products with public access materials.\n-- Examine the feasibility of integrating other federal agency submission flows for publications, metadata and\/or data sets in order to reduce the burden of multi-funded researchers, and aid in compliance measures.\n-- Extend existing collaborations with other federal agencies to comply with public access requirements.\n- Expand customer outreach efforts to the R&E community.\n-- Build and foster relationships to further enable scientific collaboration by researchers, scientist, and engineers across the services. \n-- Further engage Communities of Interest (COIs), DoD Labs and Combatant Commands (CCMDs) for DTIC growth opportunities.\n-- Continue to reach out to industry partners in order to share both information and DoD customer requirements. \n-- Seek out new opportunities supporting collaboration.\n- Achieve and maintain SIPRNET parity in the DTIC Information Technology (IT) environment.\n-- Ensure the DTIC Information Technology (IT) infrastructure and equipment can fully provide DTIC’s capabilities equally to users on SIPRNET and NIPRNET.\n- Establish and maintain a fully functional IT Continuity of Operations (COOP) capability for DTIC’s unclassified infrastructure.\n-- Achieve Full Operational Capability (FOC) for reliable data management to include data backup and restoral of DTIC information.\n-- Complete an approved and executable IT COOP plan; plan and design SIPRNET COOP infrastructure.\n-- Fully integrate efforts with concurrent Cloud services planning to provide required infrastructure to support and sustain the future COOP environment.\n-- Complete the design and implementation of the cyber security architecture; implement Risk Management Framework (RMF) continuous monitoring for full COOP capabilities.\n- Continue the migration of DTIC’s information systems and services to Cloud based infrastructure.\n-- Align with DoD cloud efforts; leverage enterprise-wide solutions, platforms, and contract vehicles.\n-- Complete the migration of DTIC’s public infrastructure to Cloud environments as planned, allowing DTIC staff to focus on more complex activities, and improving IT infrastructure availability.\n-- DTIC will have an approved Authority To Operate (ATO) with a continuously monitored Risk Management Framework (RMF) for its Cloud-based IT infrastructure, strengthening its Cyber security posture.\n-- Implement Cloud based identity management system enhancements and actionable user metrics.\n-- Complete the establishment of well-defined processes and procedures for operating in the Cloud environments.\n-- Establish DTIC contracts and service level agreements with selected Cloud Service Providers (CSP).\n- Implement innovative commercial technologies needed to field mobile capabilities in support of user devices (desktops, laptops, tablets, etc.), operating systems, and browsers.\n-- Support with authenticated user access.\n-- Ensure the DTIC Information Technology (IT) infrastructure and equipment can fully support mobile capabilities. \n- Continue to publish R&E Journal at the CUI and Classified levels in order to share information throughout the R&E community.\n-- Expand marketing and awareness of the Journal; seek out a broader pool of article contributors to the Journal."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In the FY 2018 President’s Budget, the Department recapitalized DTIC across the FYDP.  The $2.77 Million increment in the FY 2019 PB builds upon FY 2018 activities and progress towards meeting urgent operational mission requirements:\n\n- Improvements to DoD search tools.\n- Identity management and information protection.\n- Re-establishment of an IT COOP.\n- Parity of services on SIPRNET.\n- Migration to cloud services.\n- Support of Public Access\/citizen science.\n\nCritical efforts are included in FY 2019: \n- Address technology shortfalls in user interface and the continuing migration of users to mobile devices.\n- The Department’s implementation of Controlled Unclassified Information (CUI) marking."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Figures reflect FY 2017 end-of-year data.\n\nTotal Unique DTIC NIPRNET Users:  27,711\nTotal Unique DTIC SIPRNET Users:  6,160\nTotal Unique IAC (CSIAC, DSIAC, and HDIAC) Users:  94,445\nTotal DTIC Users:  128,316\n\nTotal scientific and technical information (STI) holdings in DTIC collections:  4.195 Million\n\nSTI added and updated to DTIC Collection:  89,665\n- Total STI (NIPRNET and SIPRNET) Added:  78,645\n- Total STI (NIPRNET) Updated:  11,020\n\nSTI records downloaded to Public:  45.6 Million\nRecords downloaded to DoD NIPRNET:  965.7 Thousand\n\nTotal unique website visits:  17.6 Million\nTotal page views:  106.1 Million\n\nIAC Customer Technical Support Requests for Analysis:  5,356"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "002"
                    },
                    "ProjectTitle": {
                        "val": "Information Analysis Centers"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.549"
                        },
                        "PriorYear": {
                            "val": "5.748"
                        },
                        "CurrentYear": {
                            "val": "5.074"
                        },
                        "BudgetYearOne": {
                            "val": "5.016"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.016"
                        },
                        "BudgetYearTwo": {
                            "val": "5.016"
                        },
                        "BudgetYearThree": {
                            "val": "5.016"
                        },
                        "BudgetYearFour": {
                            "val": "5.016"
                        },
                        "BudgetYearFive": {
                            "val": "5.016"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "DoD Information Analysis Centers (IACs), established under DoD Instruction 3200.14, serve as a vital resource in providing timely, relevant information directly to users when and where it is needed. IACs serve as a bridge between the warfighter and the Acquisition\/Research community, providing essential technical analysis and data support to a diverse customer base, to include the Combatant Commands (CCMDs), the Office of the Secretary of Defense, Defense Agencies, and the Military Services. IACs actively partner and collaborate with Defense Research and Engineering (R&E) focus groups and communities of interest in areas of specialized fields or specific technologies. The IACs create and maintain comprehensive knowledge analysis centers that include historical, technical, scientific, and other data and information collected worldwide. They are staffed with scientists, engineers and information specialists to provide research and analysis to customers with diverse, complex and challenging requirements. IAC operations directly support the warfighter, and play an ongoing and critical role in solving key CCMD operational issues such as cyber security, unmanned aerial vehicle visual\/audible signature reduction, and improvements to the ballistic resistance of body armor.\n\nThe IAC Program Management Office at DTIC performs contract acquisition, management, and operational support for IAC contract operations and the technical information that is generated as a result of research and studies. In a time of shrinking budgets and increasing responsibility, IACs are a valuable resource for accessing scientific and technical information culled from efforts to solve new and historic challenges.  Direct IAC customer support activities, such as Technical Area Task (TAT) order processing, Basic Center Operations (BCO) support, Defense Finance and Accounting Service (DFAS) activities, contracting\/acquisition related activities, etc., are funded in part through partnerships with the Defense R&E community and the annual collection of customer reimbursements for shared direct costs, in accordance with the IAC Reimbursable Review Board (IRRB) recommendations, with OSD-COMPT and Office of General Counsel concurrence.  This represents the maximum cost-sharing with IAC customers allowable, per guidance from the OSD Office of General Counsel. Annual IAC efforts and accomplishments are dependent on the level of participation and collaboration by the R&E community at large."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Information Analysis Centers"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.748"
                                            },
                                            "Text": {
                                                "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries and provide in-depth science and technology (S&T) analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Continue to use ACC Picatinny for processing TAT awards; engage in aggressive customer outreach to initiate processing early.\n- Increase the ceiling limit for the Homeland Defense TAT (HD TAT) multi-award contract from its current $900 Million limit to about $1.3 Billion (at its present ceiling burn rate, HD TAT will hit its ceiling in Sept 2017, about 1.5 years before it ends).\n- Issue Request for Proposals (RFP) and conduct proposal evaluations for two follow-on IAC contacts: Cyber Systems IAC (CS IAC) and the IAC Multiple Award Contract (IAC MAC)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.074"
                                            },
                                            "Text": {
                                                "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries and provide in-depth science and technology (S&T) analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Gradual ramp-down of use of ACC Picatinny for processing TAT awards; engage in aggressive customer outreach to initiate processing early.\n- Award IAC Multiple Award contract, a $28 Billion contract, to teams of Large and Small Businesses (4th Qtr, FY 2018)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.016"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.016"
                                            },
                                            "Text": {
                                                "val": "- Support the DTIC mission to provide technical information to DoD.\n- Provide administrative and operational oversight of basic core contract activities for DoD IACs to collect, analyze, synthesize and disseminate worldwide scientific and technical information (STI) in support of DoD's critical technologies and the warfighter.\n- Respond to technical inquiries (average 400 per month) and provide in-depth science and technology (S&T) analysis; create and provide STI results via IAC websites; capture STI products from new\/on-going analysis tasks; and support the exchange of information among members of the operational and technical communities.\n- Manage and support Technical Area Tasks (TATs) ordered by the DoD and non-DoD customers; provide program strategy and ensure alignment with Department goals\/direction.\n- Begin making new Task Order awards to the IAC MAC contract (awarded in Sept 2018) from Homeland Defense, Defense Systems, and Cyber Systems contacts; close these contracts to new awards while continuing work on existing Task Orders.\n- Award Homeland Defense Basic Center of Operations contract by Dec 2018 (1st Qtr, FY 2019)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- The decrease in the FY 2019 Base (-$0.058 Million) reflects contract reductions in concert with the Department’s recent service contract downsizing effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Figures reflect FY 2017 end-of-year data.\n\nNumber of:\n- IAC web inquiries:  1,282,692\n- IAC technical inquiries:  5,356\n- STI documents added to IAC collection:  23,568\n- STI documents generated by Technical Area Task (TAT) activities:  3,217\n- Training or meeting events:  5,208 \n- Number of training attendees:  27,340 \n- Documents uploaded to DTIC's online repository: 70,941\n\nAmount of funding:\n- Provided by external customer requesting IAC technical analysis (TAT Funding):  $1.4 Billion\n- Provided by external customers purchasing IAC information products (Non-TAT funding):  $886,871\n\nCustomer satisfaction regarding:\n- IAC products and technical inquiry support (scale of 1 to 5, 5 being best):  4.8\n- IAC TATs and training (scale of 1 to 5, 5 being best):  5.0"
                        }
                    }
                }
            ]
        }
    }
}