{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-16",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602712A"
        },
        "ProgramElementTitle": {
            "val": "Countermine Systems"
        },
        "R1LineNumber": {
            "val": "21"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.495"
            },
            "CurrentYear": {
                "val": "26.190"
            },
            "BudgetYearOne": {
                "val": "21.244"
            },
            "BudgetYearOneBase": {
                "val": "21.244"
            },
            "BudgetYearTwo": {
                "val": "22.914"
            },
            "BudgetYearThree": {
                "val": "23.366"
            },
            "BudgetYearFour": {
                "val": "23.895"
            },
            "BudgetYearFive": {
                "val": "24.326"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "171.430"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates, designs, and develops technologies to improve counter explosive hazard detection, signature management, and counter-sensor capabilities. Focus areas are sensor components, sub-components, and software algorithms to improve detection of mines and explosive threats; novel methods to defeat mines and explosive threats; and signature management technologies to reduce the reconnaissance capabilities of enemy forces. The technologies being investigated are for both mounted and dismounted applications. Project H24 investigates state of the art counter explosive hazard technologies to accurately detect and neutralize threats with a high probability, reduce false alarms, and enable an increased operational tempo. Project H35 designs and develops advanced sensor protection, signature management, and deception techniques for masking friendly force capabilities and intentions. Project HB2 funds Congressional special interest items.\n\nWork in this PE is related to and fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602709A (Night Vision Technology), PE 0602784A (Military Engineering Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603606A (Landmine Warfare and Barrier Advanced Technology), and PE 0603710A (Night Vision Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army\nModernization Strategy.\n\nWork in this PE is performed by the United States (U.S.) Army Research, Development and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "26.497"
                },
                "CurrentYear": {
                    "val": "26.19"
                },
                "BudgetYearOne": {
                    "val": "25.111"
                },
                "BudgetYearOneBase": {
                    "val": "25.111"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.495"
                },
                "CurrentYear": {
                    "val": "26.19"
                },
                "BudgetYearOne": {
                    "val": "21.244"
                },
                "BudgetYearOneBase": {
                    "val": "21.244"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.998"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-3.867"
                },
                "BudgetYearOneBase": {
                    "val": "-3.867"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "4"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.989"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.867"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.867"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.013"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reduce countermine technology research in H24 and camouflage technologies in H35 to fund higher Army priorities in communications and networks."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H24"
                    },
                    "ProjectTitle": {
                        "val": "Countermine Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.038"
                        },
                        "CurrentYear": {
                            "val": "20.453"
                        },
                        "BudgetYearOne": {
                            "val": "15.248"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.248"
                        },
                        "BudgetYearTwo": {
                            "val": "16.126"
                        },
                        "BudgetYearThree": {
                            "val": "16.484"
                        },
                        "BudgetYearFour": {
                            "val": "16.823"
                        },
                        "BudgetYearFive": {
                            "val": "17.112"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "122.284"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and develops new technology components, sub-components, and software algorithms for detection, discrimination, and neutralization of individual mines, minefields, and other explosive threats. The goals of this Project are to accurately detect threats with a high probability, reduce false alarms, and enable an increased operational tempo.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Standoff Sensors for Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the challenges of sensing and confirming potential in-road and roadside threats at standoff ranges. The effort focuses on understanding the phenomenologies that impact sensor design concepts and steer novel technologies that provide the primary means for detecting anomalies. The result is higher-confidence target detection and improved clutter\/background filtering. Examples of candidate technologies include Forward Looking (FL) Electro-Optic\/Infrared (EO\/IR) and Ground Penetrating Radar (GPR) sensors, which are used to detect surface threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.116"
                                            },
                                            "Text": {
                                                "val": "Will continue the investigation of vibration sensing and polarization technologies for the discrimination of man-made objects; will continue the investigation of advanced processing techniques to combine FL GPR and FL vibration sensor data in order to reduce false alarm rates; will continue to investigate new sensors for identification and confirmation of threats; will investigate microwave sensors, as well as digital receivers, for increased sensitivity of FL GPR sensors in order to help discriminate concealed explosive hazards on roadsides; will explore techniques to detect wires from standoff distances."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.155"
                                            },
                                            "Text": {
                                                "val": "Explore and develop novel sensing methods using multiple geometric configurations to enhance FL sensor modalities, including multi-look GPR, Long-wave Infrared (LWIR) and Visible; mature processing techniques by combining datasets from multiple sensor technologies in order to improve probability of detecting threats in complex environments; investigate new sensors for confirmation of threats for modular platforms; validate techniques to detect wires from standoff distances."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.126"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.126"
                                            },
                                            "Text": {
                                                "val": "Will design and validate novel sensors and processing approaches using advances in correlated FL and multistate GPR, vibration, and EO\/IR sensors; will combine fused signal processing methods to better detect targets in the presence of clutter in the natural environment; will develop new processing techniques to improve detection capability of complementary sensors in varying environments; will investigate modular sensor components including unique radars, EO\/IR sensors, wire detection techniques, and sensitive radio frequency technologies to remotely detect explosive hazards and indicators of emplacement such as command wires and initiation devices for application to small unmanned air and ground platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor funding decrease due to personnel adjustments"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dismounted Explosive Hazard Detection Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates emerging component technologies to enhance detection of explosive hazards, including metallic and non-metallic landmines, Improvised Explosive Devices (IEDs), Home Made Explosives (HMEs), and Explosively Formed Penetrators (EFPs). Emphasis is on increased coverage area, higher detection rates, and increased discrimination probabilities. Technologies that provide low Size, Weight, and Power (SWaP) solutions are considered and studied to ensure solutions are viable for Soldier-portable applications. This effort also investigates advanced signal processing and detection algorithms for increased real-time feedback for threat detection and identification, and it collects data to inform studies investigating methods to reduce the operator's cognitive burden."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.218"
                                            },
                                            "Text": {
                                                "val": "Will refine data collection processes to incorporate controlled, relevant outdoor environments with refined combinations of novel components and sensors that will be used for real-time detection and identification of buried explosive hazard threats; will continue to investigate advanced signal processing approaches and to design optimal data algorithms and processing techniques; will conduct data collections and analyses to verify the accuracy of sensor position designs and to determine the level of improvement in feedback to operators to reduce cognitive burden and reduce clutter."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.508"
                                            },
                                            "Text": {
                                                "val": "Finalize combinations of novel components and sensors to support real-time detection and identification of buried explosive hazard threats in relevant outdoor environments; conduct experiments to confirm component designs and mature signal processing techniques; mature visualization components to enhance clutter rejection and improve operator interfaces; conduct limited user assessment of integrated breadboard design."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort is ending in FY18"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter Explosive Hazard Phenomonology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates potential long term solutions to nonconventional explosive hazard threats. It leverages recent lessons learned to investigate new ideas and emerging counter explosive hazard (CEH) technologies by gaining a better understanding of how to detect, neutralize, and mitigate the threat. The effort includes a series of innovative exploration and discovery events focused on the identification of new ideas and concepts in a structured and organized framework, enabling the Army to identify\/investigate opportunities to leverage technologies traditionally associated with other arenas, such as the intelligence community, big data, and the financial industry."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.704"
                                            },
                                            "Text": {
                                                "val": "Will continue the ongoing series of innovative investigation and informational events with industry and academia to collect information on previously unexplored phenomenologies; based on the knowledge gained from Fiscal Year (FY) 2015 and FY16 knowledge capture events, will evaluate and validate nonconventional Counter Explosive Hazard (CEH) technologies for buried or concealed explosive hazard detection, such as multi-static GPR, polarized ultraviolet (UV) radiation, and explore novel passive radio frequency (RF)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.79"
                                            },
                                            "Text": {
                                                "val": "Evaluate and validate nonconventional CEH technologies for buried or concealed explosive hazard detection, such as novel neutron sources and gamma detectors for identification of buried explosive, and radio frequency (RF) atomic magnetometers for discrimination of buried man-made objects; continue the ongoing series of innovative investigation and informational events with industry and academia to collect information on previously unexplored phenomenologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was ended in FY18 to move funds to higher priority efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neutralization and Breaching Technology"
                                    },
                                    "Description": {
                                        "val": "This effort addresses the challenges of selectively neutralizing individual explosive hazards at standoff ranges as well as the challenges of scaling up such capabilities to neutralize multiple explosive hazards for effective complex obstacle breaches. This effort focuses on validation of techniques to confirm the location of buried threats and on the design and development of technology components to defeat the confirmed target. The result is matured components to facilitate follow-on efforts to develop an integrated explosive hazard neutralization and breaching capability. Examples of candidate technologies for neutralization include high energy devices (lasers and radio frequency) and explosives."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.122"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.122"
                                            },
                                            "Text": {
                                                "val": "Will investigate standoff confirmation sensor techniques to determine discrimination thresholds and to set parameters for the design of neutralization techniques; will investigate laser, radio frequency, and microwave sources to determine maturity; determine options for use of explosive techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This is a new start in FY19"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H35"
                    },
                    "ProjectTitle": {
                        "val": "Camouflage  & Counter-Recon Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.457"
                        },
                        "CurrentYear": {
                            "val": "5.737"
                        },
                        "BudgetYearOne": {
                            "val": "5.996"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.996"
                        },
                        "BudgetYearTwo": {
                            "val": "6.788"
                        },
                        "BudgetYearThree": {
                            "val": "6.882"
                        },
                        "BudgetYearFour": {
                            "val": "7.072"
                        },
                        "BudgetYearFive": {
                            "val": "7.214"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "45.146"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and develops techniques for masking friendly force capabilities and intentions. The Project pursues technologies to reduce the susceptibility of sensor systems to detection and targeting by threat forces, as well as to inform the development of next generation camouflage coatings and paints. Novel technologies are investigated, such as novel optics designs combined with signal processing, spectral filtering, and threat sensing algorithms.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Camouflage and Counter-Reconnaissance Technology for Advanced Spectral Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and advances new techniques to reduce susceptibility of sensors to detection by lasers, Electro-Optic (EO) sensor systems, and Infrared (IR) sensor systems. This effort also researches signature reduction approaches for camouflage nets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.457"
                                            },
                                            "Text": {
                                                "val": "Will investigate sensor vulnerabilities to future laser threats, and will develop algorithms and explore new materials, devices, and strategies to counter these threats; will develop sensor protection technologies that can be applied across multiple platforms; will continue to investigate techniques to minimize the spectral signatures of two-sided camouflage nets for desert and woodland environments; will investigate the colors, patterns and materials needed to design arctic camouflage patterns with minimal spectral signatures; will research future urban camouflage solutions for both vehicles and dismounts; will explore hyperspectral sensor technology to locate both red force and blue force targets in obscured locations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.737"
                                            },
                                            "Text": {
                                                "val": "Validate through experimentation optical cross section reduction methods for day television (TV) sensors; continue to investigate sensor vulnerabilities to future laser threats; research new materials, devices, and strategies to counter these threats; develop sensor protection technologies that can be applied to new day TV sensors employed on multiple platforms. Define signature reduction characteristics for urban and artic camouflage solutions for both vehicles and dismounts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.996"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.996"
                                            },
                                            "Text": {
                                                "val": "Will investigate new protective coatings for dual band IR systems that have high out of band rejection, very high in-band transmission, and laser durability while still meeting camera window environmental performance requirements; will continue to support signature characteristics testing for urban and arctic camouflage solutions for both vehicles and dismounted Soldiers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in FY19 funds due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "HB2"
                    },
                    "ProjectTitle": {
                        "val": "COUNTERMINE COMPONENT TECHNOLOGY (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase for Program increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Countermine Systems applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}