{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-21",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603680D8Z"
        },
        "ProgramElementTitle": {
            "val": "Defense Wide Manufacturing Science and Technology Program"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "398.688"
            },
            "PriorYear": {
                "val": "177.419"
            },
            "CurrentYear": {
                "val": "136.159"
            },
            "BudgetYearOne": {
                "val": "114.637"
            },
            "BudgetYearOneBase": {
                "val": "114.637"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "87.647"
            },
            "BudgetYearThree": {
                "val": "68.752"
            },
            "BudgetYearFour": {
                "val": "69.925"
            },
            "BudgetYearFive": {
                "val": "71.207"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Defense-wide Manufacturing Science and Technology (DMS&T) program is the joint, defense-wide component of the DoD Manufacturing Technology (ManTech) Program directed in Title 10 U.S.C. Section 2521, the latter of which represents the Department’s comprehensive advanced manufacturing program focused on enabling the strategic goals of timely, affordable delivery of dominant technologies to the warfighter, and improving the acquisition and sustainment of defense products and systems across their life cycles.  Designing for manufacturability early in the development of defense-essential products and systems can yield dramatic and positive impacts for the Department’s operational and modernization missions. \n\t\t\t\nThe DMS&T component of the DoD ManTech program specifically focuses on the development of cross-cutting and potentially game-changing manufacturing technologies, processes and capabilities that are typically beyond the scope or risk of any one Military Department or Defense Agency or platform.These high-leverage, defense-wide investments are designed to benefit the performance, affordability, and delivery timelines\/deployment cycles of many of the department’s most essential products and systems in ways that are not typically achievable through the efforts of a single service, agency or program office.\n\t\t\t\nThe DMS&T program, therefore, is a unique and fundamental DoD ManTech Program component that is needed to optimize a coordinated manufacturing technology development process across the department broadly.  Concurrent development of manufacturing processes and capabilities along with S&T development enables the timely, affordable adoption and deployment of emerging technologies needed to maintain U.S. warfighting dominance.  Key DMS&T technical areas for investment include Advanced Electronics and Optics Manufacturing, Advanced Materials Manufacturing, Enterprise and Emerging Manufacturing, and respective technology focus areas addressed by each of the DoD-led manufacturing innovation institutes (discussed in the next paragraph).  Advanced Electronics and Optics addresses advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Advanced Materials addresses advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, metamaterials, and low observables.  Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and enterprise business practices for defense applications.  Key focus areas include the industrial information infrastructure, advanced design\/qualification\/cost tools, supply network integration technologies and management practices, direct digital (or additive) manufacturing, machining; robotics, assembly, and joining.\n\nManufacturing innovation institutes established by the DoD and part of the whole-of-government Manufacturing USA Program are also funded in this program element. Technical innovation and leadership in U.S. manufacturing are essential to sustaining the foundations of industrial competitiveness to enable our military to maintain technological advantage and global dominance. Eight DoD Manufacturing USA institutes have been established to serve as regional hubs accelerating technological innovation and associated production processes and educational\/workforce competencies for military and commercial applications via shared public-private sectors.  These Manufacturing USA institutes, supported by resources from multiple U.S. Government agencies, are generating significant industry cost-share for manufacturing innovation and are forming new technology transition pathways via regional hubs spurring active collaboration among government, industry, and academia to help meet critical government and warfighter needs. The overall concept of the Manufacturing USA program (previously named the National Network for Manufacturing Innovation until changed in FY16) and the design of its manufacturing innovation institutes are provided in several key federal documents; among them: 1) the President’s National Science and Technology Council (NSTC) report by the Advanced Manufacturing National Program Office entitled, “National Network for Manufacturing Innovation: A Preliminary Design,” published in January 2013, and more recently, in the following two NSTC reports: 2) ”National Network for Manufacturing Innovation Program Strategic Plan” and 3) “National Network for Manufacturing Innovation Annual Report,” both published in February 2016."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "158.398"
                },
                "CurrentYear": {
                    "val": "136.159"
                },
                "BudgetYearOne": {
                    "val": "115.573"
                },
                "BudgetYearOneBase": {
                    "val": "115.573"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "177.419"
                },
                "CurrentYear": {
                    "val": "136.159"
                },
                "BudgetYearOne": {
                    "val": "114.637"
                },
                "BudgetYearOneBase": {
                    "val": "114.637"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "19.021"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.936"
                },
                "BudgetYearOneBase": {
                    "val": "-0.936"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "25.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-5.805"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.174"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.936"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.936"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Three project codes are used in this Program Element (PE) to distinguish between DMS&T Manufacturing Technology investments (P680), the manufacturing innovation institute investments (P350), and the newly added program the National Security Technology Accelerator (P607).  The growth in funding in this PE from prior President's budgets is primarily associated with the additional of the National Security Technology Accelerator program.\n\nEconomic Adjustment for inflation."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "680"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Science and Technology Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "149.403"
                        },
                        "PriorYear": {
                            "val": "25.527"
                        },
                        "CurrentYear": {
                            "val": "21.512"
                        },
                        "BudgetYearOne": {
                            "val": "22.328"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.328"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.162"
                        },
                        "BudgetYearThree": {
                            "val": "34.602"
                        },
                        "BudgetYearFour": {
                            "val": "34.583"
                        },
                        "BudgetYearFive": {
                            "val": "34.539"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The DMS&T investment strategy follows a two-pronged approach built on: 1) broad technology initiatives  and 2) specific individual projects meeting more focused manufacturing technology needs.  Investments in both cases are built and managed in collaboration with the Department’s research, development and acquisition (RDA) communities (including active, ongoing coordination with the DoD ManTech Program’s Joint Defense Manufacturing Technology Panel) and industry and target the development of defense-essential advanced manufacturing processes and associated workforce capabilities.  The portfolio includes a focus on above-the-shop-floor new manufacturing processes and practices having the potential to improve manufacturing efficiencies at broader, enterprise levels. Single specific projects address investment opportunities not associated with selected technology initiatives and enable the program to more surgically apply investments to compelling and sometimes urgent manufacturing needs.\n \t\t\t\nData calls are launched through two methods to identify technology initiatives and single specific issues requiring investment.  One method is through the JDMTP.  The JDMTP is comprised of the ManTech Directors from the Services, Defense Logistics Agency, and Office of Secretary of Defense (OSD).  The call is distributed through the ManTech Directors to the four JDMTP sub panels: Metals Processing and Fabrication Subpanel, Composites Processing and Fabrication Subpanel, Electronics Processing and Fabrication Subpanel, and Advanced Manufacturing Enterprise Subpanel. Potential candidates are evaluated by the JDMTP based on criteria set forth in the call and announcements, and then down-selected for further development prior to final selection.  The other method is through funding opportunity announcements to industry.  Priority is given to investments that support affordability and producibility of critical enabling manufacturing technologies that cut across multiple platforms.  Investments also balance defense priorities in specialty materials, electronics, propulsion and power, and manufacturing processes including \"above the shop floor\" (lean and business technologies facilitating interoperable manufacturing).  Final projects are selected by the OSD ManTech Director, considering input from the JDMTP,and as approved by Deputy Assistant Secretary of Defense, Manufacturing and Industrial Base Policy (MIBP).  Technology initiatives and projects are executed at the Component level."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Electronics and Optics"
                                    },
                                    "Description": {
                                        "val": "Advanced Electronics and Optics is a series of efforts addressing advanced manufacturing technologies for a wide range of applications such as sensors, radars, power generation, switches, and optics for defense applications.  Focal points are productivity and efficiency gains in the defense manufacturing base to accelerate delivery of technical capabilities to impact current warfighting operations, and manufacturing technologies to reduce the cost, acquisition time and risk of our major defense acquisition programs. Future efforts will focus on advances in fuel cells, lasers, enhanced acuity microdisplays, and transparent ceramics for opto-mechanical and armor applications.\n\nThe Transparent Ceramic Initiative will address DoD applications for electro-optics, including fibers, films, and bulk solid state components, such as windows. Typical materials include: sapphire, ALON, and spinel. Transparent ceramics offer the potential for improved ballistic strength for battlefield armor and personnel protection. Investments include but are not limited to: high strength spinel scale-up, Nanocomposite Optical Ceramics (NCOC) powder scale-up, infrared windows, and curved transparent ceramics. \n\nProjects:\n\nMini Short-wave Infrared (SWIR) Cameras and Imagers (FY 2016): Expedite the transition of 10 um (TEC)-less SWIR cameras to the warfighter and develop wafer level processing techniques to improve yield and reduce contaminants in the SWIR focal plane array (FPA)\/ camera assembly. Will establish the industrial base for SWIR technology systems and components. Reduced unit cost allows more individuals to carry imagers; 6x improved cost, reduced from $30K to $5K; 3x reduced size from 3cm3 to 1cm3; 3x reduced weight from 120 g to 40 g. Applications include COSI, INOD, COS3, AWST, Joint Effect Targeting System (JETS), IDNST, PAWS, and MTS-B.\n\nMini Vis - SWIR Cameras and Imagers (FY 2016): Develop a manufacturing capability to produce one camera that can see the entire spectral band of Visible, Near Infrared (NIR), and Short-wave Infrared (SWIR); while being compatible with visible, NIR, and SWIR laser pointers and illuminators. Applications include: COSI, INOD, COS3, Advanced Weapon Sight Technology (AWST), Joint Effect Targeting System (JETS), Integrated Day\/Night Sight Technology (IDNST), PAWS, and Multispectral Targeting System (MTS-B).\n\nManufacturability of Vertical Cavity Surface Emitting Lasers (VCSELs) – Phase II (FY 2016-2018): Develop the capability to produce a Multi-Function Laser Illuminator and Pointer that delivers the functionality of five different devices (Green, NIR, and Short-wave Infrared (SWIR) Laser Pointers plus NIR and SWIR illuminators) in a single, high-power, lightweight unit, which would give the warfighter commonality with all other weapon systems and be covert. Would provide the SWIR VCSEL a three-fold increase in efficiency and output power to meet critical needs for covert illumination in both High Definition and SXGA formats. Applications include: PUMA, RAVEN, TigerShark, Anubis, Spectre-FINDER, Speckles, TigerMoth, WAAS, PAWS, IPODS, AngelFire, MAV-OBAT, nLoss, LOS-short, CLRF, Joint Effect Targeting System (JETS), IDNST, TLDS, Big Safari, OEF, OIF,  STINGER , and ARGUS, others.\n\nVital Infrared Sensor Technology Acceleration (VISTA) High Temp Mid-Wave Infrared (MWIR) Detectors (FY 2016-2017): Establish a critical domestic industrial base for MWIR focal plan arrays (FPA) having capabilities in III-V antimony-based Infrared (IR) FPAs to reduce size, weight, power, and cost while increasing yield and operability as an alternative to current technology.  Will achieve wafer production scale-up to 40-50 wafers per month while shortening sensor turn-on and cool down time by 50%, extending cooler lifetimes 150% - 200% as a result of reduced stress during temperature cycling, and substantially reducing the sensor lifecycle maintenance cost. Applications include: Air Force: EODAS Enhancement (F-35), EOTS Enhancement (F-35), LWIRST (F-15), Targeting System Enhancements (MQ-9, F-16), Overhead Persistent Infrared (OPIR); Army: Next Gen FLIR, Degraded Visual Environment, Rotary Wing Pilotage; Navy: Shipboard Multifunction Sensors (APDIS), Overhead Persistent Surveillance for USMC, UAV, and Navy: BAMS, F-18 (Advanced IRST), EO\/IR Standard Integration System (EISIS), and Affordable Modular Panoramic Photonics Mast.\n\nImproved Focal Plane Array (FPA) – Hyperspectral – Phase II (FY 2016): Demonstrate utility of III-V based FPAs for Long-Wave Infrared (LWIR) Hyperspectral (HIS) applications. Up to $1M\/year\/sensor reduction in system life cycle costs compared to arsenic-doped silicon blocked impurity band (Si:As BIB) detectors. Significant reduction in up-front costs compared to Mercury Cadmium Telluride (MCT). Improved reliability, maintainability, and availability, along with increased detection range.\n\nOrganic Light Emitting Diode (OLED) Microdisplays - Phase II (FY 2016-2017): Establish manufacturing capability for producing an ultra-high resolution, high brightness, high contrast, full color microdisplay at a low unit cost.  Mature and combine manufacturing processes: Silicon on Insulator (SOI) and Direct Patterning technologies to enable a 5X improvement in yield and 5X longer lifetime of displays, reducing life cycle costs. $221.7M savings for aviation and Enhanced Visual Acuity (EVA) goggles (27,700 displays between 2017-2032) x $8K\/unit savings). Applications include F-35 Heads-up Helmet Mounted Display System, Apache, EVA, F-18, F-15, F-16, affordable color\/monochrome displays with high brightness and high contrast to enable Warfighter to fully use sensors and cuing\/augmented reality hardware.\n\nNanocomposite Optical Ceramics (NCOC)(FY 2017-2018): Advance manufacturing maturity of NCOC to replace sapphire. The large reduction of emissivity at elevated temperatures experienced during flight makes NCOC more favorable for a missile dome by increasing the signal to noise ratio. Effort will focus on scale-up NCOC dome manufacturing processes to meet projected AIM-9X full rate production quantities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.766"
                                            },
                                            "Text": {
                                                "val": "Manufacturability of Vertical-Cavity Surface Emitting Lasers – Phase II: continue device development and product transitions; continue making gains in wall plug efficiency (WPE), illuminator power, and reliability.\n\nOrganic Light Emitting Diode Microdisplays - Phase II: deliver upgraded tooling to project contractor; develop direct patterning and SOI backplane; demonstrate critical manufacturing processes (direct patterning: 0.5 um accuracy, linear source process uniformity, SOI: high dynamic range, display uniformity); qualify the SOI process at the foundry; install the final direct patterning equipment; conduct iterative improvement direct patterning lot runs. Integrate lot runs for direct patterning and SOI; conduct a qualification process; perform a final TRL\/MRL assessment and produce a final TRL\/MRL report.\n\nVISTA High Temp MWIR Detectors: continue GaSb substrate quality improvement; continue single-detector-wafer production optimization; continue molecular beam epitaxy (MBE) capability scale up to 40 - 50 wafers per month; fabricate focal plane arrays (FPAs) on 5 inch wafers.\n\nNanocomposite Optical Ceramics (NCOC):  Continue powder conditioning, blank forming, heat treatment, optical finishing and coating related activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.213"
                                            },
                                            "Text": {
                                                "val": "Manufacturability of Vertical-Cavity Surface Emitting Lasers – Phase II: continue device development and additional product transitions; obtain feedback from end users and implement improvements.\n\nNanocomposite Optical Ceramics (NCOC):  Continue powder conditioning, blank forming, heat treatment, optical finishing and coating related activities; measure results and assess Manufacturing Readiness Levels."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.029"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.029"
                                            },
                                            "Text": {
                                                "val": "Manufacturability of Vertical-Cavity Surface Emitting Lasers – Phase II: continue device development and additional product transitions; obtain feedback from end users and implement improvements.\n\nNanocomposite Optical Ceramics (NCOC):  Continue powder conditioning, blank forming, heat treatment, optical finishing and coating related activities; measure results and assess Manufacturing Readiness Levels."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from 12.213 to 13.029 to support program priorities"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Advanced Materials Manufacturing is a series of efforts addressing advanced manufacturing technologies for a wide range of materials such as composites, metals, ceramics, nanomaterials, and metamaterials.  Through productivity and efficiency gains, these manufacturing technologies will accelerate delivery of technical capabilities to impact current warfighting operations, while reducing the cost, acquisition time and risk of our major defense acquisition programs.  Advanced materials manufacturing technologies undergoing development include materials for ballistic survivability and ballistic protection, survivability and rapid fabrication of structural components.\n\nAdvanced Propulsion Initiative: Advance propulsion has a crucial need to develop fuel efficient sustainable propulsion capabilities. Several technologies will be developed including Risk-based Life Cycle Management for System Sustainment and As-Manufactured and As-Maintained State Awareness. In addition, technologies will be pursued addressing capability gaps associated with adaptive engine design and high performance lightweight materials, organic matrix composites, oxide\/oxide composites, thermal barrier coatings for high temperature structure and light weight alloys. Additional capabilities will focus on unique manufacturing challenges associated with affordable Medium-Small Engine fabrication methods including Expendables.\n\nProjects:\n40MM M433 Warhead Producibility (FY 2016): Achieve improved anti-personnel lethality at the squad level, increasing first shot effectiveness against personnel targets through optimization of production process prior to transition to Full Rate Production, avoiding high cartridge unit costs.  Primary applications include Mk 19 GMG, M203 GL, M320GL, and M32 MSGL. Secondary applications include Cannon and Tank Calibers, and Hand Grenades.  \nCold Spray Repair and Rebuild Phase II Large Structures (FY 2016): Expand the Cold Spray product envelope from 5 feet to a target of 40 feet to enable large tubular component repair. Applications include Seawolf Class Submarine Periscopes and TD-63 Actuators.\n\nDimensions on Day One (FY 2016): Demonstrate a methodology that accurately predicts and accounts for the numerous geometric, tooling and material factors impacting finished composite parts enabling the correct upfront process and tooling design to yield first article parts meeting the “dimensional requirements on day 1”. Applications include F-35\/UCLASS\/F\/A-XX\/Long Range Strike for maintaining part and aircraft tolerances, which enables survivable, supportable and affordable air vehicles. \n\nLarge Scale Encapsulate Ceramics - Phase II (FY 2016): Enable combat vehicles to defeat the large caliber Kinetic and Chemical Energy objective threats within the allocated weight parameters.  Help address affordability of the armor, with an estimated cost reduction of $10K \/sq. foot. Armor panels will be producible in the shapes required by individual vehicles. Applications include Abrams, which has a known protection limitation. GCV and other vehicles will use this technology to design those areas of vehicles subject to large caliber KE and CE threats.\n\nOut of Autoclave Processing of Organic Matrix Composites (OMCs) for Advanced Propulsion (FY 2017-2018): Current state of the art out of autoclave processable OMCs are currently limited to a service life of between 325F and 375F limiting advanced propulsion applications. Expanding performance of OMCs to temperatures between 400F and 625F will dramatically increase the design trade space for developing the next generation advanced propulsion systems. Advanced propulsion structure includes front frames, vanes, stators and outer by-pass ducts. Insertion of this technology onto the AETP program will lower cost, increase range and maintain performance for the next generation tactical aircraft.\n\nFabrication of Non-Eroding Metallic Throat (FY 2016-2018): Scale the manufacturing of Thin walled, Non-Eroding Tungsten (W) Throats from 4” up to 12” inner throat diameters. Applications include Stage 2 & Stage 3 ICBMs as well as Stage 2 Standard Missile III.\n\nAdvanced Technology Capability (FY 2016-2018): Development of advanced technologies that support warfighter survivability and capability against advanced threats. Enables new capabilities to be produced in sufficient affordable quantities to allow transition to multiple platforms.\n\n\nAdvanced Propulsion Initiative: Advance propulsion has a crucial need to develop fuel efficient sustainable propulsion capabilities. Several technologies will be developed including Risk-based Life Cycle Management for System Sustainment and As-Manufactured and As-Maintained State Awareness. In addition, technologies will be pursued addressing capability gaps associated with adaptive engine design and high performance lightweight materials, organic matrix composites, oxide\/oxide composites, thermal barrier coatings for high temperature structure and light weight alloys. Additional capabilities will focus on unique manufacturing challenges associated with affordable Medium-Small Engine fabrication methods including Expendables.\n\nProjects:\n40MM M433 Warhead Producibility (FY 2016): Achieve improved anti-personnel lethality at the squad level, increasing first shot effectiveness against personnel targets through optimization of production process prior to transition to Full Rate Production, avoiding high cartridge unit costs.  Primary applications include Mk 19 GMG, M203 GL, M320GL, and M32 MSGL. Secondary applications include Cannon and Tank Calibers, and Hand Grenades.  \nCold Spray Repair and Rebuild Phase II Large Structures (FY 2016): Expand the Cold Spray product envelope from 5 feet to a target of 40 feet to enable large tubular component repair. Applications include Seawolf Class Submarine Periscopes and TD-63 Actuators.\n\nDimensions on Day One (FY 2016): Demonstrate a methodology that accurately predicts and accounts for the numerous geometric, tooling and material factors impacting finished composite parts enabling the correct upfront process and tooling design to yield first article parts meeting the “dimensional requirements on day 1”. Applications include F-35\/UCLASS\/F\/A-XX\/Long Range Strike for maintaining part and aircraft tolerances, which enables survivable, supportable and affordable air vehicles. \n\nLarge Scale Encapsulate Ceramics - Phase II (FY 2016): Enable combat vehicles to defeat the large caliber Kinetic and Chemical Energy objective threats within the allocated weight parameters.  Help address affordability of the armor, with an estimated cost reduction of $10K \/sq. foot. Armor panels will be producible in the shapes required by individual vehicles. Applications include Abrams, which has a known protection limitation. GCV and other vehicles will use this technology to design those areas of vehicles subject to large caliber KE and CE threats.\n\nOut of Autoclave Processing of Organic Matrix Composites (OMCs) for Advanced Propulsion (FY 2017-2018): Current state of the art out of autoclave processable OMCs are currently limited to a service life of between 325F and 375F limiting advanced propulsion applications. Expanding performance of OMCs to temperatures between 400F and 625F will dramatically increase the design trade space for developing the next generation advanced propulsion systems. Advanced propulsion structure includes front frames, vanes, stators and outer by-pass ducts. Insertion of this technology onto the AETP program will lower cost, increase range and maintain performance for the next generation tactical aircraft.\n\nFabrication of Non-Eroding Metallic Throat (FY 2016-2018): Scale the manufacturing of Thin walled, Non-Eroding Tungsten (W) Throats from 4” up to 12” inner throat diameters. Applications include Stage 2 & Stage 3 ICBMs as well as Stage 2 Standard Missile III.\n\nAdvanced Technology Capability (FY 2016-2018): Development of advanced technologies that support warfighter survivability and capability against advanced threats. Enables new capabilities to be produced in sufficient affordable quantities to allow transition to multiple platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.713"
                                            },
                                            "Text": {
                                                "val": "Out of Autoclave Processing of Organic Matrix Composites (OMCs) for Advanced Propulsion: Develop novel manufacturing capabilities for affordable OMC advanced propulsion structure including front frames, stators and ducts. Mature current state of the art OMC systems with elevated service life ranging from 375F to 625F, beyond the capabilities of BMIs and cyanate esters.\n\nFabrication of Non-Eroding Metallic Throat: produce 6” specimens and conduct testing; modify equipment and produce 9” specimens; study post VPS processing to assure 98% density. This included sintering and hot isostatic press (HIP) consolidation scale-up issues. Conduct research to improve the manufacturability of non-eroding throats; continue investigating and updating size requirements and non-destructive evaluation techniques; assess assembly requirements for supports\/insulators and recommend\/assess measures to reduce step down erosion in the exit cone; construct a material property data base as a function of VPS size and processing; create a preliminary design for scale-up of non-eroding throats to 12” ID.\n\nAdvanced Technology Capability: Improvement and continued development of new and novel advanced manufacturing processes to enable scale up of production capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.508"
                                            },
                                            "Text": {
                                                "val": "Fabrication of Non-eroding Metallic Throat: Modify existing system with tooling and plasma gun for 12” diameter throats; fabricate tungsten base alloyed powders; continue to refine fabrication of 6” and 9” diameter throats; make 12” diameter material property specimens; conduct sintering and Hot Isostatic Processing; improve manufacturing methods and practices to reduce unit costs and reduce rejects; finalize the design of 6” and 9” diameter throats; conduct a preliminary design analysis for 12” diameter throats; test 12” material property specimens.\n\nOut of Autoclave Processing of Organic Matrix Composites (OMCs) for Advanced Propulsion: Assess required operating parameters for processing Organic Matrix Composites without autoclaves.\n\nAdvanced Technology Capability: Improvement and continued development of new and novel advanced manufacturing processes to enable scale up of production capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.508"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.508"
                                            },
                                            "Text": {
                                                "val": "Fabrication of Non-eroding Metallic Throat: Modify existing system with tooling and plasma gun for 12” diameter throats; fabricate tungsten base alloyed powders; continue to refine fabrication of 6” and 9” diameter throats; make 12” diameter material property specimens; conduct sintering and Hot Isostatic Processing; improve manufacturing methods and practices to reduce unit costs and reduce rejects; finalize the design of 6” and 9” diameter throats; conduct a preliminary design analysis for 12” diameter throats; test 12” material property specimens.\n\nOut of Autoclave Processing of Organic Matrix Composites (OMCs) for Advanced Propulsion: Assess required operating parameters for processing Organic Matrix Composites without autoclaves.\n\nAdvanced Technology Capability: Improvement and continued development of new and novel advanced manufacturing processes to enable scale up of production capabilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enterprise and Emerging Manufacturing"
                                    },
                                    "Description": {
                                        "val": "Enterprise and Emerging Manufacturing addresses advanced manufacturing technologies and business practices for defense applications.  Key focus areas include direct digital (or additive) manufacturing, advanced manufacturing enterprise, machining, robotics, assembly, and joining.  Projects selected will accelerate delivery of technical capabilities to impact current warfighting operations while reducing cost, acquisition time, and risk of major defense acquisition programs.\n\nIt is paramount for the U.S. military to improve its own agility and flexibility. The focus is to find a solution to overcome a burdensome acquisition cycle requiring a great amount of cost, time, security, and storage space. Through the use of secure satellite data links or a local parts database, warfighters can access computer-aided design (CAD) for replacement parts, allowing them to repair equipment without the need to establish supply chains or wait for shipments. It allows operators to modify a part's design based on its performance in the field.\n\nEmerging manufacturing technologies undergoing development include:  a large-scale challenge for advanced, interoperable machine tool applications, and methods for exchange of 3D official technical data throughout the supply chain and between the Government and contractors.\n\nProjects:\nMTConnect Challenge Phase II (FY 2016): Promote academia’s educational development and implementation of production interactive solutions to the broad U.S industrial base with the expansion of MTConnect Challenge that contributes to reduced cycle times and the development of real-time production metrics for adaptable dashboard applications.\n\nSecuring American Manufacturing (SAM) (FY 2016): develop a Trusted and Assured supply chain, identify threat vulnerabilities of industrial control systems, provide input to DoD policies, and shape follow-on investment to mitigate threat vulnerabilities. Applications span the US Defense Industrial Base.\nCyber Security for the Shop Floor - Phase II (FY 2017-2018): The manufacturing factory floor is a growing area of concern for DoD cyber security because defense contractors throughout the DoD's supply chain are continually targeted by cyber criminals seeking to: 1) steal technical data, including critical national security information and valuable commercial intellectual property; 2) alter data, thereby affecting processes and products; and 3) impair or deny process control, thereby damaging or shutting down operations. Protecting the operational systems of a manufacturing enterprise presents a different set of challenges from protecting enterprise IT systems and networks.  This phase II project will develop a Trusted and Assured supply chain, identify threat vulnerabilities of industrial control systems, provide input to DoD policies, and shape follow-on investment to mitigate threat vulnerabilities. Applications span the US Defense Industrial Base."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.048"
                                            },
                                            "Text": {
                                                "val": "Cybersecurity for the Shop Floor - Phase II: develop a trusted and assured supply chain, identify threat vulnerabilities of industrial control systems, provide input to DoD policies, shape follow-on investment to mitigate threat vulnerabilities, and document assessment results that discuss DFAR requirements and suppliers’ mitigation and cost implications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.791"
                                            },
                                            "Text": {
                                                "val": "Cybersecurity for the Shop Floor – Phase II: enhance the relationship with the trusted and assured supply chain, analyze and mitigate known and suspected threat vulnerabilities of industrial control systems, provide input to DoD policies, and document and study assessment results that discuss DFAR requirements and suppliers’ mitigation and cost implications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.791"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.791"
                                            },
                                            "Text": {
                                                "val": "Cybersecurity for the Shop Floor – Phase II: enhance the relationship with the trusted and assured supply chain, analyze and mitigate known and suspected threat vulnerabilities of industrial control systems, provide input to DoD policies, and document and study assessment"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680F"
                                    },
                                    "Title": {
                                        "val": "Air Force ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA3) 0603680N"
                                    },
                                    "Title": {
                                        "val": "Navy ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7)  0708045A"
                                    },
                                    "Title": {
                                        "val": "Army ManTech - Industrial Preparedness"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "(BA7) 0603680S"
                                    },
                                    "Title": {
                                        "val": "DLA ManTech"
                                    },
                                    "Funding": {
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable for this item. Outyear data for \"Other Program Funding\" is contained within the Service budgets."
                        },
                        "PerformanceMetrics": {
                            "val": "The majority of DMS&T investment project performance metrics are specific to each effort and include measures identified in the project plans.  Typical metrics include target dates and conditions-based milestones in project work breakdown schedules, production measures, production goals, production numbers and demonstration goals and dates."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "350"
                    },
                    "ProjectTitle": {
                        "val": "Manufacturing Innovation Institutes"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "249.285"
                        },
                        "PriorYear": {
                            "val": "126.892"
                        },
                        "CurrentYear": {
                            "val": "114.647"
                        },
                        "BudgetYearOne": {
                            "val": "92.309"
                        },
                        "BudgetYearOneBase": {
                            "val": "92.309"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "57.485"
                        },
                        "BudgetYearThree": {
                            "val": "34.150"
                        },
                        "BudgetYearFour": {
                            "val": "35.342"
                        },
                        "BudgetYearFive": {
                            "val": "36.668"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Technological innovation and leadership in manufacturing are essential to sustaining the foundations of economic competitiveness to maintain technological advantage and global dominance for our military. To support these goals, Manufacturing USA institutes, each led by non-profit 501(c) entities, have been established by the Department to serve as national assests with headquarters and regional hubs to accelerate technological innovation into commercial applications and concurrently develop the educational competencies and production processes via shared public-private sectors.  Collaborative execution and funding by the Departments of Defense (DoD), Energy (DOE), and Commerce (DoC), the National Aeronautics and Space Administration (NASA), and the National Science Foundation (NSF) to support the establishment of these Manufacturing USA institutes  will spur industry cost-share for manufacturing innovation and quickly develop a pathway for technology-focused regional hubs for collaboration among government, industry, and academia that will meet critical government and Warfighter needs.  The overall concept of the Manufacturing USA program (previously named the National Network for Manufacturing Innovation until changed in FY16) and the design of its manufacturing innovation institutes are provided in several key federal documents; among them: 1) the President’s National Science and Technology Council (NSTC) report by the Advanced Manufacturing National Program Office entitled, “National Network for Manufacturing Innovation: A Preliminary Design,” published in January 2013, and more recently, in the following two NSTC reports: 2) ”National Network for Manufacturing Innovation Program Strategic Plan” and 3) “National Network for Manufacturing Innovation Annual Report,” both published in February 2016.\n\nEach of the eight DoD-led Manufacturing USA institutes addressed in this budget is expected to be self-sustaining, without reliance on federal sustainment funding, by the end of the period defined by the respective cooperative agreement (CA) or technology investment agreement (TIA) between the federal government and the non-profit organization leading each institute consortium of members.  This CA\/TIA period is typically for five years, with the flexibility to extend the agreement up to two years for the benefit of DoD projects, technical achievement, etc., and to fully leverage the minimum 1:1 cost share.  \n\nEach of the eight DoD-led Manufacturing USA institutes is intended to: \n1) Bring together industry, universities and community colleges, federal agencies, and state and local governments and organizations to create regionally-based but nationally-impactful public-private partnerships underpinning the formation of sustainable manufacturing innovation ecosystems\n2) Accelerate innovation to bridge the gap between Research and Development (R&D) and deployment of technological innovations in domestic production of goods\n3) Invest in industrially relevant manufacturing technologies with broad applications, accelerating innovation within DoD and across all manufacturing sectors to increase U.S. competitiveness\n4) Provide shared assets to help companies access cutting-edge capabilities and equipment \n5) Create an unparalleled environment to educate and train students and workers in advanced manufacturing skills\n6) Focus on maturing the associated manufacturing technologies typically from from Manufacturing Readiness Level (MRL) 4 through 7\n\nThe first and second year of each of these new institutes is devoted to establishing a sustainable business model and operations, with continued refinement throughout the full period of the cooperative agreement, including: expanding the institute’s membership base (as appropriate); establishing and solidifying revenue streams (e.g., funding from new R&D activity, membership fees, training and workforce development, certification and licensing, etc.); establishing provisional Executive Council and Technical Advisory committees to execute the business of each institute; finalizing Intellectual Property plans; developing technology roadmaps to inform investment strategies; opening industrial commons to provide for shared resource facilities available to all institute members; initiating workforce training programs in each technology area; establishing complementary relationships between Manufacturing USA institutes; analyzing the U.S. and Global industrial base in partnership with other government agencies to build upon the institute portfolio and address critical requirements; and further developing national technology roadmaps."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Institute 1 – National Additive Manufacturing Innovation Institute (America Makes)"
                                    },
                                    "Description": {
                                        "val": "Additive manufacturing (i.e., “3D printing”) is a process of joining materials to make objects from 3D model data, usually layer upon layer, as opposed to subtractive manufacturing methodologies such as traditional machining. Advanced additive manufacturing will benefit the DoD by enabling lifecycle cost savings and enhanced capabilities, including moving toward “focused logistics” – getting the right part in the right place in just the right time – for wartime and humanitarian missions using local supply chains. This Manufacturing USA institutes was established in 2012, with cooperative agreement funding included in this budget through FY 2015, and DoD program management costs included in subsequent fiscal years until all R&D projects, reporting, and fiduciary responsibilities are completed."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Complete technical performance of all projects awarded in FY 2015 and make results available in the knowledge base. Continue leading a group of Standards Development Organizations to define and document industry standards; continue implementing new processes for transitioning technologies developed by the institute; continue education and workforce training initiatives."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.026"
                                            },
                                            "Text": {
                                                "val": "Complete technical performance of all projects awarded in FY 2016 and make results available in the knowledge base. The period of performance for technical work under the Cooperative Agreement ends on August 31, 2017. Program management subsequently continues to provide oversight through August 31, 2019 for the close-out of all R&D projects, cost share accrual, final reporting, and transition to sustainability, in addition to completion of RDT&E fiduciary responsibilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "Complete technical performance of all projects awarded in FY 2016 and make results available in the knowledge base. The period of performance for technical work under the Cooperative Agreement ends on August 31, 2017. Program management subsequently continues to provide oversight through August 31, 2019 for the close-out of all R&D projects, cost share accrual, final reporting, and transition to sustainability, in addition to completion of RDT&E fiduciary responsibilities."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 2 – Digital Manufacturing and Design Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "This national institute focus is on the implementation of the Digital Thread, the unencumbered flow of data across the lifecycle of a manufactured product encompassing data from design, production, supply, sourcing, inventory, assembly, quality, maintenance and sustainment.  It includes the analysis of this data to reduce the time and cost of bringing new products to market, the elimination of barriers between design, manufacturing and sustainment by using both product data and process data in a way that is seamless and transparent.\n\nTechnology thrust areas: advanced manufacturing enterprise; intelligent machines; advanced analysis; open source platform; and cyber manufacturing system security.\n\nThis institute was established in February 2014, with cooperative agreement funding contribution included in this budget through FY 2018."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "Proposal calls are planned to occur approximately every six months, resulting in approximately 30 new projects with a planned value of $10 million.  Conduct multiple Proposal Call Workshops, and award projects in the technology thrust areas identified above. Continue the on-going workforce development projects initiated in FY 2016.  Instantiate a networking and capability matching mechanism with all new project calls and an online version on the website.  Launch the commercial version of the Digital Manufacturing Commons.  Revise the Technology Roadmap and Strategic Investment Plan to lead the technology domain in the completion of a Digital Thread. Announce the commercialization of new digital manufacturing and design technologies and industry capabilities. Significantly scale up commercialization, skill development and workforce development efforts from research projects and relationships with other government agencies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.635"
                                            },
                                            "Text": {
                                                "val": "Proposal calls are planned to occur approximately every six months, resulting in approximately 15 new projects with a planned value of $6 million.  Conduct two Proposal Call Workshops, and award projects in the technology thrust areas identified above. Continue and expand the workforce development projects initiated in FY 2016 and 2017.  Expand the Digital Manufacturing Commons Open Source collaboration tool.  Revise the Technology Roadmap and Strategic Investment Plan to lead the technology domain in the completion of a Digital Thread. Announce the commercialization of new digital manufacturing and design technologies and industry capabilities. Significantly scale up commercialization, skill development and workforce development efforts from research projects and relationships with other government agencies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.750"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.750"
                                            },
                                            "Text": {
                                                "val": "Proposal calls are planned to occur approximately every six months, resulting in approximately 15 new projects with a planned value of $6 million.  Conduct two Proposal Call Workshops, and award projects in the technology thrust areas identified above. Continue and expand the workforce development projects initiated in FY 2016 and 2017.  Expand the Digital Manufacturing Commons Open Source collaboration tool.  Revise the Technology Roadmap and Strategic Investment Plan to lead the technology domain in the completion of a Digital Thread. Announce the commercialization of new digital manufacturing and design technologies and industry capabilities. Significantly scale up commercialization, skill development and workforce development efforts from research projects and relationships with other government agencies."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 3 –  Lightweight and Modern Metals Manufacturing Innovation Institute (Lightweight Innovations for Tomorrow (LIFT))"
                                    },
                                    "Description": {
                                        "val": "Advanced lightweight metals retain properties comparable to heavier, traditional materials, and can enable weight reduction in a variety of components and products with significant energy savings and increased payloads. This institute will scale-up research across multiple areas to accelerate market expansion by applying an integrated materials and manufacturing approach, addressing a lack of design guides and certifications as well as cost and scale-up challenges. The goal is to catalyze the development of an advanced lightweight metal U.S. supplier base and to enable DoD to realize greater speed and agility of manned, unmanned, and Warfighter systems as well as benefits for commercial applications. \n\nTechnology thrust areas: \n(1) priority metal classes and its alloys of advanced high-strength steels, titanium, aluminum and magnesium; (2) technology development needs grouped into six pillars: melt processing; powder processing; thermo-mechanical processing; low cost - agile tooling, coatings, and joining and assembly; (3) Crosscutting themes: Integrated Computational Materials Engineering (ICME), design, life-cycle analysis, validation\/certification, cost modeling, supply chain, corrosion, and ballistic\/blast\n\nThis institute was established in February 2014, with cooperative agreement funds programmed in this budget through FY 2018."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur every six months, with a planned value of approximately $15 million for the year. In addition, will conduct several technology demonstrations and workshops to disseminate and implement the manufacturing technologies developed during project call number one.  Complete installation and training for several pieces of critical equipment within the headquarters high bay facility.  Conduct a series of workshops targeting small and medium enterprises (SME) across the nation.  LIFT will develop a replicable, scalable roadmap to building a technology-competent, educated and skilled workforce – incorporating the new solutions “tested” in the five-State LIFT region – that will expand and enhance STEM education in the nation.  Continue implementation and expansion of the “work and learn” initiative developed in FY 2016."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.108"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur every six months, with a planned value of approximately $15 million for the year. Will conduct additional technology demonstrations and workshops to disseminate and implement the manufacturing technologies developed during previous project calls.  Conduct a series of workshops targeting small and medium enterprises (SME) across the nation.  Complete installation of all equipment planned for the HQ high bay area.  Continue to invest in education and workforce development solutions that link education, workforce development, and economic development resources to help create a coordinated economic development asset.  Continue implementation and expansion of the “work and learn” initiative developed in FY 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "Project calls are planned to occur every six months, with a planned value of approximately $15 million for the year. Will conduct additional technology demonstrations and workshops to disseminate and implement the manufacturing technologies developed during previous project calls.  Conduct a series of workshops targeting small and medium enterprises (SME) across the nation.  Complete installation of all equipment planned for the HQ high bay area.  Continue to invest in education and workforce development solutions that link education, workforce development, and economic development resources to help create a coordinated economic development asset.  Continue implementation and expansion of the “work and learn” initiative developed in FY 2017."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 4 - Integrated Photonics Manufacturing Innovation Institute (American Institute for Manufacturing (AIM) Integrated Photonics)"
                                    },
                                    "Description": {
                                        "val": "Integrated photonics manufacturing advances the promise of unprecedented interconnection between electronics and photonics that will deliver previously unattainable performance in speed, density and power consumption, quickly providing differentiating benefits for defense applications such as high-speed signal processing, electronic warfare, information transport and computation, sensing, imaging and targeting. This institute will establish an end-to-end ‘ecosystem’ in the U.S. for advancing domestic integrated photonics manufacturing. This institute will include responsive integrated photonics fabrication foundry access, photonics-electronics integrated design tools, and advances in packaging, assembly and test automation.  The goal will be to catalyze a vibrant, enduring integrated photonics domestic industrial base, much as SEMATECH did with the domestic semiconductor industry. \n\nThis institute was established in 2015, with cooperative agreement funding programmed in this budget through FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "25.459"
                                            },
                                            "Text": {
                                                "val": "Fully implement the integrated photonics manufacturing innovation ecosystem, including evolutionary improvements in photonic integrated circuit design tools, multi-project wafer capabilities, and package, assembly, and test tools and facilities. Provide a second domestic-wide integrated photonics manufacturing capability (in addition to silicon photonics), in this case for indium phosphide-based integrated photonics. Stand-up the packaging, assembly and test hub in Rochester, NY. Continue development of novel automated tools for cost-effective high volume end-to-end assembly and packaging of photonic integrated components. Conduct an additional round of applied R&D project calls and award projects across the eight manufacturing centers of excellence and key technology manufacturing applications areas.  These projects will address common manufacturing challenges identified by the eight technology working groups and is reflected in the AIM roadmap. Transition FY 2016 projects’ output to the elements of the domestic integrated photonics supply chain.  Execute additional plans for development of a world-class integrated photonics work force through establishment of master’s level program, design training, webinars, and training programs. Begin to transition key capabilities from this institute to ongoing DoD programs requiring integrated photonics solutions across each military service."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.331"
                                            },
                                            "Text": {
                                                "val": "Continue advancement of the integrated photonics manufacturing innovation ecosystem, including release of mature photonic integrated circuit design tools for both silicon and indium phosphide-based photonics, full implementation of robust, high-yield multi-project wafer capabilities, and completed buildout of state-of-the-art package, assembly, and test tools and facilities in Rochester, NY. Conduct additional round of applied R&D project calls and award projects in the key core areas identified in the roadmapping phase. Transition FY 2017 projects’ output to the supply chain.  Leverage the now mature integrated photonics domestic ecosystem to develop novel integrated photonics components for DoD programs . Incorporate emerging domestic world-class integrated photonics work force into ecosystem.  Begin to see a sustainable integrated photonics institute emerging, as evidenced by fee-for-service wafer production, increased membership, licensing of institute intellectual property, and other revenues being realized.  This will help extend this institute beyond the length of the Cooperative Agreement, providing key manufacturing capability for the DoD requirements through 2020 and beyond."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "Continue advancement of the integrated photonics manufacturing innovation ecosystem, including release of mature photonic integrated circuit design tools for both silicon and indium phosphide-based photonics, full implementation of robust, high-yield multi-project wafer capabilities, and completed buildout of state-of-the-art package, assembly, and test tools and facilities in Rochester, NY. Conduct additional round of applied R&D project calls and award projects in the key core areas identified in the roadmapping phase. Transition FY 2017 projects’ output to the supply chain.  Leverage the now mature integrated photonics domestic ecosystem to develop novel integrated photonics components for DoD programs . Incorporate emerging domestic world-class integrated photonics work force into ecosystem.  Begin to see a sustainable integrated photonics institute emerging, as evidenced by fee-for-service wafer production, increased membership, licensing of institute intellectual property, and other revenues being realized.  This will help extend this institute beyond the length of the Cooperative Agreement, providing key manufacturing capability for the DoD requirements through 2020 and beyond."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 5 – Flexible Hybrid Electronics Manufacturing Innovation Institute (Nextflex – America’s Flexible Hybrid Electronics Manufacturing Institute)"
                                    },
                                    "Description": {
                                        "val": "Flexible hybrid electronics manufacturing involves highly tailorable devices on non-traditional, compliant substrates that combine thinned components manufactured from traditional processes with components that are added via “printing” processes. This institute will invest in prototyping and scale-up of manufacturing processes for high speed pick-and-place, printed circuits, and hybrid fabrication that will enable defense and commercial applications in wearable electronics, unattended sensors and integrated array antennas, medical devices and soft robotics devices, and the continuous improvement in SWAPC (Size, Weight And Power plus Cost) for electronic systems. This institute will establish an end-to-end domestic innovation ‘ecosystem,’ containing design, packaging, assembly and test automation research and workforce development capabilities which can be accessed by small, medium and large companies as well as academic institutes.  The goal is to help enable the creation of a sustainable domestic industrial base which can rapidly respond to global needs using a quick technology cycle and scale-up. This institute was established in 2015, with cooperative agreement funds programmed in this budget through FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.825"
                                            },
                                            "Text": {
                                                "val": "Major plans for FY17 include building to 100 members total, updating the technology driven and application aligned Roadmap  to version 2.0, and then releasing project call #3 (based upon Roadmap 2.0) targeting $20M of investment.  Continue to support the innovation ecosystem, with focus on Industry transition pathways and building Hub Capabilities “Pilot Line” through installation of tooling, metrology and application labs.  For Workforce Development, build “Flex Factor from 30 students to 300 students in FY17, expanding from one California school district to 4 districts in California and 3 districts in two other states. Host quarterly webinares, three technical workshops and a large “Flex” conference with peer-reviewed technical papers. Finally, engage with new DoD customers to bring at least $5M in new manufacturing R&D activities to the Institute."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.318"
                                            },
                                            "Text": {
                                                "val": "Project calls are expected to be made every year, with potential for continued Phase II investment for successful Projects from PC 1.0 and 2.0. Open a functioning pilot line for prototyping, using all major EMS processing steps for FHE. Focus on dissemination of the five Manufacturing Technology Area (MTA) and Technology Development Platform (TDP) results into Industry application areas. Refine workforce development activities to ensure sufficient pipeline expertise and recruitment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.500"
                                            },
                                            "Text": {
                                                "val": "Project calls are expected to be made every year, with potential for continued Phase II investment for successful Projects from PC 1.0 and 2.0. Open a functioning pilot line for prototyping, using all major EMS processing steps for FHE. Focus on dissemination of the five Manufacturing Technology Area (MTA) and Technology Development Platform (TDP) results into Industry application areas. Refine workforce development activities to ensure sufficient pipeline expertise and recruitment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 6 - Revolutionary Fibers and Textiles Manufacturing Innovation Institute"
                                    },
                                    "Description": {
                                        "val": "The RFT institute will address the spectrum of manufacturing challenges associated with revolutionary fibers and textiles, from design to end products. It will support an end-to-end innovation 'ecosystem' in the U.S. for revolutionary fibers and textiles manufacturing and leverage domestic manufacturing facilities to develop and scale-up manufacturing processes. The institute will provide innovative system demonstrations based on robust design and simulation tools, pilot production facilities, a roster of subject matter experts, suppliers, and workforce development opportunities through targeted training and curriculum programs. This institute will be established in early 2016, with cooperative agreement funds programmed in this budget through FY 2020."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "21.608"
                                            },
                                            "Text": {
                                                "val": "update pending\nupdate pending"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.229"
                                            },
                                            "Text": {
                                                "val": "The RFT institute will address the spectrum of manufacturing challenges associated with revolutionary fibers and textiles, from design to end products. It will support an end-to-end innovation 'ecosystem' in the U.S. for revolutionary fibers and textiles manufacturing and leverage domestic manufacturing facilities to develop and scale-up manufacturing processes. The institute will provide innovative system demonstrations based on robust design and simulation tools, pilot production facilities, a roster of subject matter experts, suppliers, and workforce development opportunities through targeted training and curriculum programs. This institute will be established in early 2016, with cooperative agreement funds programmed in this budget through FY 2020."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "The RFT institute will address the spectrum of manufacturing challenges associated with revolutionary fibers and textiles, from design to end products. It will support an end-to-end innovation 'ecosystem' in the U.S. for revolutionary fibers and textiles manufacturing and leverage domestic manufacturing facilities to develop and scale-up manufacturing processes. The institute will provide innovative system demonstrations based on robust design and simulation tools, pilot production facilities, a roster of subject matter experts, suppliers, and workforce development opportunities through targeted training and curriculum programs. This institute will be established in early 2016, with cooperative agreement funds programmed in this budget through FY 2020."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 7 - Advanced Tissue Biofabrication Manufacturing Innovation Institute (ATB-MII)"
                                    },
                                    "Description": {
                                        "val": "This institute is intended to advance state-of-the-art human tissue manufacturing innovations in cell and biomaterial processing, bioprinting, automation and non-destructive testing technologies. The motivation is to increase U.S. competitiveness in advanced tissue biofabrication manufacturing by encouraging insertion of disruptive technologies into multiple biotechnology sectors, streamlining integrated testing technologies and ultimately reducing the barrier to entry for new inventors. The goal is to establish a collaboration that will mature tissue-related technology across a range of manufacturing readiness levels (MRL) 4-7, enabling post-delivery assurance of tissue identity, viability, function, and efficacy. This Institute will bring together the diverse and currently fragmented collection of industry practices and institutional knowledge across many disciplines (cell biology, bioengineering, materials science, analytical chemistry, robotics, and quality assurance). Scaling up to commercial level production of tissues will require manufacturing and process automation suitable for living cells, as well as testing and preservation methods appropriate for tissue-based products with limited shelf-life and a narrow window of efficacy. \n\nTechnical focus at a minimum will be comprised of four thrust areas: 1) Cell & Material Selection & Sourcing;  2) Biofabrication Platforms;  3) Process Design and Automation;  4) Tissue Finishing and Testing Technologies\nThis institute was established in late 2016.  Technology Investment Agreement funds are programmed in this budget from FY 2016 through FY 2022."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Establish this new Manufacturing USA institutes following the processes used for previous institutes and as refined through lessons learned in solicitations and standup of Institutes 1-6.  Conduct initial technology road mapping activities. Complete a data call for a first round of S&T projects addressing common manufacturing problems in advanced tissue biofabrication and award project contracts in the key core technology areas identified within the road mapping activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Continue to expand the membership and refine core investment areas supporting the innovation ecosystem. Initiate two rounds of applied R&D project calls in core areas. Execute workforce development projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.159"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.159"
                                            },
                                            "Text": {
                                                "val": "Continue to expand the membership and refine core investment areas supporting the innovation ecosystem. Initiate two rounds of applied R&D project calls in core areas. Execute workforce development projects."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Institute 8 - Robotics in Manufacturing Environment (RiME)"
                                    },
                                    "Description": {
                                        "val": "The motivation for this Manufacturing Innovation Institute is to improve U.S. competitiveness in manufacturing through advancements in the smart collaborative robotic field. This technology has the potential to level the manufacturing playing field with competing low labor cost economies, with decreased manufacturing cost, better quality and timely reaction to changes needed by the customer. Smart, collaborative robotics can also enable \"batch of one\" production, also known as mass customization. The technologies developed in this institute will be primarily focused in making advanced manufacturing more competitive, addressing DoD needs, and contribute to improving prosperity in the United States. The Institute will focus on technology areas such as human robot interaction, adaption, learning, manipulation, autonomy, mobility and perception.\n\nThis institute will be established in FY 2017.  Cooperative Agreement\/Technology Investment Agreement funds are programmed in this budget from FY 2017 through FY 2022."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Award Technology Investment Agreement and establish this new institute following the processes used for previous institutes and as refined through lessons learned in solicitations and standup of Institutes 1-6.  Conduct initial technology road mapping activities. Complete a data call for a first round of S&T projects and award project contracts in the key core technology areas identified within the road mapping activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "Continue to expand the membership and refine core investment areas supporting the innovation ecosystem. Initiate two rounds of applied R&D project calls in core areas. Execute workforce development projects."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.400"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.400"
                                            },
                                            "Text": {
                                                "val": "Continue to expand the membership and refine core investment areas supporting the innovation ecosystem. Initiate two rounds of applied R&D project calls in core areas. Execute workforce development projects."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Each Manufacturing Innovation Institute is established through a competitive selection process.  The executing military department or agency, in close and continuous coordination with OSD ManTech, publishes a formal solicitation (funding opportunity announcement) for proposals describing the scope of required activities and extensive proposal evaluation criteria. Non-Profit Organizations (including universities) are eligible to bid, and each bidder forms a broad consortium of industry and academic partners. The executing military department or agency, in close coordination with OSD, uses a team of government experts to evaluate each proposal against the evaluation criteria and selects a winning consortium.  The final terms of the cooperative agreement\/technology investment agreement between the selectee and the federal government are then negotiated and the CA or TIA is signed.  Throughout and after completion of this process, the federal government makes clear that members of non-selected teams are encouraged to join the selected consortium as conditions permit."
                        },
                        "PerformanceMetrics": {
                            "val": "Assessing the performance of the DoD-led manufacturing institutess, part of the whole-of-government Manufacturing USA Program, requires a multi-faceted view of ‘performance,’ given the program’s layered base of DoD, government-wide, and national level public-private stakeholders and interests. Notwithstanding this complexity, the Department is careful to maintain orientation with the DoD ManTech program’s statutory goals and objectives and has concluded that those requirements are highly complementary to, and supportive of, the broader national goals of the Manufacturing USA Program as laid out in the Revitalize American Manufacturing and Innovation (RAMI) Act of 2014.  Performance relative to both sets of goals\/objectives is necessarily measured in both qualitative and quantitative terms, and many of the institutes accomplishments previously addressed represent rich and highly descriptive qualitative and quantitative measure of program performance.  The Department actively reviews or oversees the review of institute metrics at four levels: 1) the overall Manufacturing USA network level (this is done in coordination with the DoD’s Manufacturing USA interagency partners), 2)  at the DoD\/funding agency level (per the statutory requirements of DoD ManTech Program), 3) at the individual institute level (in coordination with each institute), and 4) at the specific technology project level (via DoD technical expert involvement in the institutes). Broadly, the institutes themselves are charged by the DoD, the Administration and Congress with ensuring that key elements of their innovation ecosystems will be matured and made widely available by fostering collaborations between appropriate elements of that ecosystem. The following four categories of metrics have emerged as common focus areas:\n1.\tImpact on U.S. Innovation Ecosystem\n2.\tFinancial Leverage\/Sustainability\n3.\tEducation and Advanced Manufacturing Workforce Development \n4.\tTechnical Advancement\nSpecific metrics and the annual cycle for measuring progress against benchmarks are developed for each institute consortium and reflect that institute’s unique technology capability, expertise, and organizational structure. The Department strives to ensure that the assessment process captures and articulates the benefits to national security based upon technological advancements and the industrial base."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "607"
                    },
                    "ProjectTitle": {
                        "val": "National Security Technology Accelerator Program"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "25.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This is a congressional add transferred from Defense Logistics Agency's Generic Logistics R&D Technology Demonstrations Program, PE 0603712S00"
                        },
                        "ProjectMissionDescription": {
                            "val": "This is a congressional add transferred from Defense Logistics Agency's Generic Logistics R&D Technology Demonstrations Program, PE 0603712S00"
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "National Security Technology Accelerator"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "25.000"
                                        },
                                        "Text": {
                                            "val": "This is a congressional add that moved over from an R&D PE."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "This is a congressional add that moved over from an R&D PE."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "National Security Technology Accelerator"
                                    },
                                    "Description": {
                                        "val": "This is a congressional add transferred from Defense Logistics Agency's Generic Logistics R&D Technology Demonstrations Program, PE 0603712S00"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This is a congressional add transferred from Defense Logistics Agency's Generic Logistics R&D Technology Demonstrations Program, PE 0603712S00"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "None"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "None"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "None"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}