{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-1-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-30",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605100D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Mission Environment Test Capability (JMETC)"
        },
        "R1LineNumber": {
            "val": "142"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "125.046"
            },
            "PriorYear": {
                "val": "65.062"
            },
            "CurrentYear": {
                "val": "91.057"
            },
            "BudgetYearOne": {
                "val": "84.184"
            },
            "BudgetYearOneBase": {
                "val": "84.184"
            },
            "BudgetYearTwo": {
                "val": "83.091"
            },
            "BudgetYearThree": {
                "val": "79.125"
            },
            "BudgetYearFour": {
                "val": "80.181"
            },
            "BudgetYearFive": {
                "val": "84.532"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The FY2019 funding request was reduced by $1.302 million to account for the availability of prior year execution balances."
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Mission Environment Test Capability (JMETC) program was established for the purpose of implementing the Department’s strategy to move to an enterprise-centric, distributed test capability that results in acquisition systems fielded with enhanced joint capabilities, reduced program costs, and improved acquisition timelines.  The JMETC program implements the infrastructure capabilities defined in the Department of Defense’s “Testing in a Joint Environment Roadmap” to provide acquisition program managers a robust nation-wide capability to “test like we fight.”  JMETC provides a persistent, distributed test and evaluation (T&E) capability that supports system development, interoperability testing, and cyber testing which otherwise would not be readily available to Service\/Component acquisition programs.  The JMETC program is funded within the Research, Development, Test and Evaluation (RDT&E) Management Support Budget Activity because it is intended to provide test capability in support of RDT&E programs. By linking distributed facilities, as well as providing the necessary tools, services and subject matter expertise, JMETC allows acquisition programs to efficiently evaluate their warfighting capability in a realistic joint mission environment.  \n\nIn 2012, the National Cyber Range (NCR) transitioned from the Defense Advanced Research Projects Agency (DARPA) to the Test Resource Management Center (TRMC).  The NCR mission is to provide secure facilities, technology, processes, and workforce to rapidly create hi-fidelity, mission representative cyberspace environments to conduct cyber test, experimentation, and training events.  The NCR supports a wide-range of customers performing Developmental and Operational Testing, Cyber Mission Force Training and Certification, and support for operational contingencies.  In FY 2016, the Department, as a result of a study conducted by DASD(C3&CB), recognized the magnitude of need for increased cyber test and training capacity and capability.  Based on this and other inputs, the Department increased funding in the Joint Mission Environment Test Capability (JMETC) in FY 17 to build out additional cyber T&E capacity based on the National Cyber Range (NCR) architecture.  This increased capacity will also be available to conduct training for the Cyber Mission Force.  The TRMC worked with the Services to identify facilities where this buildout could be accomplished most efficiently.  They also considered additional criteria such as accessibility by acquisition programs, availability of qualified work force, utilities and network availability, timing, and expected cost.  \n\nTo date, TRMC and the Services have identified five sites that are potential candidates.  We have begun detailed design in FY 17, to prepare for beginning the build-out in FY 18.  Once complete, the Department will have well over four times the cyber test and training capacity offered by the current NCR.\n\nThe Test Resource Management Center (TRMC) is the Department’s lead for the JMETC program, the National Cyber Range, and oversees both their development and test conduct.  In order to meet the significant growth in requirements, TRMC will use the increased funding for FY 18 to substantially increase cyber test and training capacity by 1) refurbishing the current NCR hardware that is nearing end-of-life and increasing computing capacity to support additional customers; 2) procuring and fielding additional enterprise computational and storage resources for JMETC’s Regional Service Delivery Points (RSDPs) capability; and 3) begin construction of a new high capacity cyber range similar to the NCR."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "87.080"
                },
                "CurrentYear": {
                    "val": "91.057"
                },
                "BudgetYearOne": {
                    "val": "86.077"
                },
                "BudgetYearOneBase": {
                    "val": "86.077"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "65.062"
                },
                "CurrentYear": {
                    "val": "91.057"
                },
                "BudgetYearOne": {
                    "val": "84.184"
                },
                "BudgetYearOneBase": {
                    "val": "84.184"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-22.018"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.893"
                },
                "BudgetYearOneBase": {
                    "val": "-1.893"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-20.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.931"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reductions"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.074"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.591"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.591"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.013"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.302"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.302"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "•  Internal strategic efficiency reductions in management headquarters funding and staffing for better alignment and to provide support to a smaller military force.\n•  SRRB - Service Requirement Review Board - As part of the Department of Defense reform agenda, the incremental reduction accounts for consolidation and reduction of service contracts.\n•  National Cyber Range (NCR) expansion to address increases in cyber test requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "087"
                    },
                    "ProjectTitle": {
                        "val": "Joint Mission Environment Test Capability Distributed Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "85.113"
                        },
                        "PriorYear": {
                            "val": "35.193"
                        },
                        "CurrentYear": {
                            "val": "22.523"
                        },
                        "BudgetYearOne": {
                            "val": "16.558"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.558"
                        },
                        "BudgetYearTwo": {
                            "val": "15.157"
                        },
                        "BudgetYearThree": {
                            "val": "14.819"
                        },
                        "BudgetYearFour": {
                            "val": "15.279"
                        },
                        "BudgetYearFive": {
                            "val": "15.950"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The JMETC mission is to provide an enterprise-level, persistent capability for linking distributed facilities, enabling Department of Defense (DoD) customers to develop and test warfighting capabilities in a Joint Context. JMETC provides a test infrastructure consisting of the components necessary to conduct Joint distributed test events by cost-effectively integrating live, virtual, and constructive (LVC) test resources that are configured to support the users' needs.  The JMETC program provides its customers a support team to assist with JMETC products and the conduct of distributed testing.  JMETC’s institutional funding builds, maintains, and operates the JMETC infrastructure and pays for persistent availability of national connectivity for testing; data communications middleware; identification and development of interface standards; common software tools and components; and a reuse repository.  JMETC Program funding also provides JMETC program management, facilities, equipment, operating costs, and special studies and analysis related to distributed test capabilities and infrastructure.  Key attributes of the JMETC include:  persistency; interoperability; reuse; various combinations of distributed capabilities (reconfigurable infrastructure to meet customer requirements); modeling and simulation (M&S) linkage; Live-Virtual-Constructive (LVC) test resource integration; and distributed test support to satisfy both Service and Joint needs.  System engineering, training, and experimentation all benefit from a corporate JMETC developed for T&E.  JMETC has grown from four sites in 2007 to well over 100 functional sites by the end of FY17.  JMETC will reduce the cost and time to plan and prepare for distributed joint testing by providing a readily-available, persistent connectivity with network security accreditation support, common integration software for linking sites, and accredited test tools for distributed testing. To support its customers, JMETC also provides extensive expertise in planning, preparing for, and executing the infrastructure for distributed test events.  Additionally in FY 2013, the JMETC mission included developing and fielding the Regional Service Deliver Points (RSDP) to support testing and training.  The RSDPs are a set of distributed computing and storage platforms designed to efficiently meet DoD capacity and capability demands for distributed and cyber test and evaluation (T&E) requirements as part of the Test Resource Management Center (TRMC).  They provide services (i.e. traffic generation, simulation, instrumentation, visualization, and integrated event management), a scalable architecture to increase capacity and capabilities as needed by the user community, a flexible and adaptable infrastructure to support users requirements which are prone to frequent change, and to deliver cost and performance efficiencies (virtualization, rapid reconstitution).  At a high-level architecture view, the RSDP adds enterprise compute and storage resources as well as a platform for distributed and cyber T&E tools and services at multiple classifications necessary to create high fidelity, operationally representative virtual environments, previously unavailable."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Environment Test Capability Distributed Test"
                                    },
                                    "Description": {
                                        "val": "- Continued to expand the JMETC Secret Network (JSN) infrastructure to 82 functional sites with 4 more planned and the JMETC Multiple Independent Levels of Security Network (JMN) infrastructure to 51 functional sites with 6 more planned.\n\n- Fielded an additional Regional Service Deliver Points (RSDPs), thus increasing cyber test and training capacity.  Improved RSDP performance through enhanced automation as well as upgraded computational and storage components.\n\n- Supported 83 distinct customer distributed test and training events to include the following: MQ-4C Triton, Small Diameter Bomb II Live Fly Tests, F-35 Record and Playback, Aegis Integrated Air & Missile Defense (IAMD) Baseline 9C1D Training Test, Joint Unmanned Air System – Mission Environment(JUAS-ME), Joint Integrated Air & Missile Defense Office (JIAMDO) Correlation \/Decorrelation Interoperability Test (C\/DIT), Interoperability Development and Certification Testing (IDCT), STRATCOM Simulation Exercise (SIMEX), NAVAIR Captive Carry Testing, Distributed Integration & Interoperability Assessment Capability (DIIAC) Certification Events, Common Connectivity Device (CCD) Cooperative Engagement Capability (CEC) Multi-Site Interoperability Testing, Air Ground Integrated Layer Exploration (AGILE) Fire IX, Joint Distributed IRCM Ground-test System (JDIGS), Kodiak Cyber Operations Team (KCOT) Capabilities Test, DoD Enterprise Cyber Range Environment (DECRE) Event, Command Post Computing Environment (CPCE) Event, Cyber Range Technology Proving Grounds (CRTPG), Cyber School (CF-17) Training, Cyber Security Test Bed (CSTB), USS SECURE, Thunderstruck, Missile Defense Agency (MDA),  Talon Hate Distro, Automated Cyberspace Threat Representation (ACTR) Demonstration, Massachusetts Institute of Technology\/ Lincoln Laboratories (MIT\/LL) Persistent Range, Army Integrated Air and Missile Defense (AIAMD) Live Virtual Constructive (LVC) Distributed Environment, Cyber Guard 17, and Cyber Flag 17.\n\n- Provided planning support to the following users and organizations: US Army Cyber Command (ARCYBER); Program Executive Office, Intelligence, Surveillance, and Sensor Systems (PEO IEW&S); Small Diameter Bomb (SDB) II; MQ-4C Triton;P-8A Increment 3;  Director, Operational Test and Evaluation(DOT&E); DIIAC, Unmanned Carrier Launched Airborne Surveillance & Strike (UCLASS); Common Aviation Command and Control System (CAC2S); Tactical Mobile (TacMobile), Army Product Manager Information Warfare (PM IW); U.S. Army Intelligence and Security Command (INSCOM); Naval Criminal Investigative Service (NCIS), 46th Test Squadron DET 2, JUPITER, Command Post of the Future (CPoF), PACOM J81, National Guard Bureau, NAVSEA Dahlgren Division, Long Range Bomber,  Air Force Northern Command, Distributed Common Ground System (DCGS); Littoral Combat Ship (LCS); Integrated Personnel and Pay System (IPPS-A); CH-47; AIAMD; Ground\/Air Task Oriented Radar (G\/ATOR);  Joint Surveillance and Target Attack Radar System (JSTARS); Combat Rescue Helicopter (CRH) , AH-64  and several others.\n\n- Continued strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cyber security requirements.\n\n- Assisted customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  Continue providing remote and on-site support for the planning and execution of distributed events.\n\n- Continued to develop and refine the RSDP capabilities to provide users with enhanced large scale, high-fidelity virtualized representations of cyber contested environments and do so as rapidly as possible to minimize event timelines and associated costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "35.193"
                                            },
                                            "Text": {
                                                "val": "- Increase cyber test and training capacity by fielding a 5th RSDP. Acquire additional storage capacity for existing RSDPs and implement a central library for reusable Red, Blue and Gray environments.  Initiate development of a NSA approved Type-1 encryption capability to secure data at rest in a Multiple Independent Levels of Security (MILS) architecture. Complete full automated sanitization capability to allow for unconstrained cyber activities to be conducted on the RSDPs.\n\n- Continue to provide distributed interoperability and cyber test and training support for major customer events such as the F-35 Joint Strike Fighter, Small Diameter Bomb II tests, MQ-4C Triton testing, JIAMDO project testing, MDA cybersecurity tests, Joint Interoperability Test Command JITS, Air Force AGILE Fire, NAVAIR Integrated Warfare Capability (IWC) test events, NAVSEA DIIAC, Marine Corps Virtual Rapid Prototyping Laboratory (VRPL) experiments, PM IW Development and Operations (DevOps), Air Force AFSIT, DIIAC certification tests, Cyber Flag, Cyber Guard, Red Flag, and numerous other test and training activities.\n\n- Continue planning support to new and on-going acquisition programs including: F-35, SDB II, JUPITER, Advanced Anti-Radiation Guided Missile (AARGM), MQ-4C Triton, P-8A Poseidon, UCLASS, CAC2S, TacMobile, IPPS-A, CRH, CH-47, LCS, G\/ATOR, AH-64, DCGS and several others. \n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cyber security as part of their Survivability KPP requirements.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  Continue providing remote and on-site support for the planning and execution of distributed events."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.523"
                                            },
                                            "Text": {
                                                "val": "- Increase cyber test and training capacity. Acquire additional storage capacity for existing RSDPs and implement a central library for reusable Red, Blue and Gray environments.  Initiate development of a NSA approved Type-1 encryption capability to secure data at rest in a Multiple Independent Levels of Security (MILS) architecture. Complete full automated sanitization capability to allow for unconstrained cyber activities to be conducted on the RSDPs.\n\n- Continue to provide distributed interoperability and cyber test and training support for major customer events such as the F-35 Joint Strike Fighter, Small Diameter Bomb II tests, MQ-4C Triton testing, JIAMDO project testing, MDA cybersecurity tests, Joint Interoperability Test Command JITS, Air Force AGILE Fire, NAVAIR Integrated Warfare Capability (IWC) test events, NAVSEA DIIAC, Marine Corps Virtual Rapid Prototyping Laboratory (VRPL) experiments, PM IW Development and Operations (DevOps), Air Force AFSIT, DIIAC certification tests, Cyber Flag, Cyber Guard, Red Flag, and numerous other test and training activities.\n\n- Continue planning support to new and on-going acquisition programs including: F-35, SDB II, JUPITER, Advanced Anti-Radiation Guided Missile (AARGM), MQ-4C Triton, P-8A Poseidon, UCLASS, CAC2S, TacMobile, IPPS-A, CRH, CH-47, LCS, G\/ATOR, AH-64, DCGS and several others.\n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cyber security as part of their Survivability KPP requirements.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures. Continue providing remote and on-site support for the planning and execution of distributed events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.558"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.558"
                                            },
                                            "Text": {
                                                "val": "-  Increase support to 100+ major customer events and numerous smaller test and training activities, as well as maintaining robust, persistent network infrastructures to support distributed collaboration and data dissemination.\n\n- Continue planning support to new and on-going acquisition programs.\n\n- Provide connectivity to new capabilities and services based on user requirements via both the JMETC Secret Network (JSN) and the JMETC MILS Network (JMN).\n\n- Continue collaboration with the Training community by providing distributed infrastructure and planning support to the Joint Staff, USCYBERCOMMAND and to other customers for their distributed training events.\n\n- Continue strategic planning efforts to engage new acquisition programs that must demonstrate compliance with Net-Ready Key Performance Parameter (NR-KPP) and Cybersecurity requirements.\n\n- Continue coordination efforts to migrate DoD, Service, Industry, and Academia distributed test and evaluation infrastructures to JMETC’s enterprise infrastructures.\n\n- Continue to enhance the web-based JMETC Reuse Repository to store distributed test tools, utilities, lessons learned, and test metadata making all available to the DoD test community.\n\n- Continue to assist customers with the use of distributed test tools and troubleshooting of the end-to-end network infrastructures.  Continue providing remote and on-site support for the planning and execution of distributed events.\n\n- Continue to refine, expand, and sustain the RSDP capabilities and processes to support increased customer demand. Implement NSA approved Type-1 encryption capability to secure data at rest in a Multiple Independent Levels of Security (MILS) architecture.\n\n- Continue to identify, assess, and develop cyber specific test tools as enterprise solutions to capability gaps."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Number of Distributed test sites\n - Number of events conducted\n - Number of acquisition programs supported"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "088"
                    },
                    "ProjectTitle": {
                        "val": "Joint Mission Environment Test Capability National Cyber Range (NCR) Complex"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "39.933"
                        },
                        "PriorYear": {
                            "val": "29.869"
                        },
                        "CurrentYear": {
                            "val": "68.534"
                        },
                        "BudgetYearOne": {
                            "val": "67.626"
                        },
                        "BudgetYearOneBase": {
                            "val": "67.626"
                        },
                        "BudgetYearTwo": {
                            "val": "67.934"
                        },
                        "BudgetYearThree": {
                            "val": "64.306"
                        },
                        "BudgetYearFour": {
                            "val": "64.902"
                        },
                        "BudgetYearFive": {
                            "val": "68.582"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In FY 2013, responsibility for the National Cyber Range (NCR) was transferred to the Test Resource Management Center (TRMC) and subsequently aligned under the Joint Mission Environment Test Capability (JMETC) Program Element.  Since then, the NCR has executed 200+ events for DOD Customers.  The NCR provides secure facilities, technology, processes, and workforce to rapidly create hi-fidelity, mission representative cyberspace environments and facilitate integration\/federation of cyberspace test and evaluation (T&E) infrastructure in support of the TRMC Mission. The NCR is accredited to operate at TS\/\/SI-G\/TK\/HCS-P\/\/SAR.  As a result of recent recapitalization and capacity enhancement efforts, the NCR now has the capability to support up to 8 concurrent events and scale up to ~250K virtual nodes. The NCR concurrently emulates complex (Red\/Blue\/Gray) operationally representative network environments at different classification levels using Multiple Independent Levels of Security (MILS) architecture. The NCR Test Automation Tool Suite minimizes human error, enables verification of test environment, ensures repeatable results and reduces event timelines from weeks\/months to hours\/days.  NCR computing assets can be sanitized after exposure to malicious attacks\/malware and restored to a known, clean state. The NCR conducts distributed events with other Cyberspace Ranges via the JMETC MILS Network (JMN) and Joint Information Operations Range (JIOR).\n\nThe NCR conducts Cyberspace Testing, Training and Operational Events for the full spectrum of DoD Customers including Research, Development, Acquisition, Testing, Training and Operational Cyber Mission Forces. The NCR executes wide variety of event types including Science and Technology (S&T) Demonstrations, Developmental Test & Evaluation (DT&E), Operational Test & Evaluation (OT&E), Security Controls Assessments (SCA), Cyberspace Operations Training, Cyberspace Tactics, Techniques Procedures (TTP) Development, Forensics\/Malware Analysis) and Cyberspace Operations Mission Rehearsal.  The NCR enables acquisition programs to conduct Cybersecurity Test and Evaluation (T&E) in a representative Cyberspace Environment to identify and close exposed vulnerabilities, evaluate resiliency and positively impact program cost, schedule and performance.  The NCR also supports Training and Certification of Cyber Mission Forces in support of US Cyber Command by enabling operational forces to efficiently evaluate cyber warfighting capability in a realistic joint mission environment. Finally, the NCR is supporting in real time Overseas Contingency Operations as directed by National Authority.\n\nIn FY 2016, the Department, as a result of a study conducted by DASD(C3&CB), recognized the magnitude of need for increased cyber test and training capacity and capability.  Based on this and other inputs, the Department made the decision to increase funding in the Test Resource Management Center (TRMC) in FY 17 to build out additional cyber T&E capacity based on the National Cyber Range (NCR) architecture. This increased capacity will also be available to conduct training for the Cyber Mission Force.  The TRMC worked with the Services to identify facilities where this buildout could be accomplished most efficiently.  They also considered additional criteria such as accessibility by acquisition programs, availability of qualified work force, utilities and network availability, timing, and expected cost.\n\nTo date, TRMC and the Services have identified five sites that are potential candidates.  We have begun design and cost estimation in FY17 so that we can begin detailed design and begin build-out in FY 18.  Once complete, the Department will have well over four times the cyber test and training capacity offered by the current NCR.\n\nIn addition, the JMETC NCR Complex supports the Executive Agent for DoD Cyber Test Ranges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Mission Environment Test Capability NCR Sustainment"
                                    },
                                    "Description": {
                                        "val": "- Since commencing operations, the NCR has executed more than 200+ events.  The NCR provided Cybersecurity Test and Evaluation “As a Service” for Major Defense Acquisition Programs (MDAP) and Major Automated Information Systems (MAIS) Acquisition Programs that is simply not available in other venues.\n\n- Acquisition Programs supported include Command Post Computing Environment (CP CE), Joint Space Operations Center (JSpOC) Mission System (JMS), P-8A Poseidon, Triton MQ-4C, FireScout, Tactical Mobile (TacMobile), CVN-78 Components (USS Secure, LHA-6, Enterprise GPS, 3DExtended Long Range Radar, Distributed Common Ground Station Family of Systems, Carrier Based Air Refueling System, Aviation Data Management and Control System.\n- The NCR Team helped DOD Customers manage Cybersecurity Testing by conducting Cyber Table Top (CTT) exercises. DOD programs supported include Command Post Computing Environment, Carrier Based Air Refueling System, P—8A Poseidon, MQ-4C Triton, TacMobile and Small Diameter Bomb. The NCR also supported CTTs for MRTFB Customers to help improve the Cybersecurity Posture of the Ranges.\n\n- The NCR supported customers from the Services and Joint Community. Customers include US Cyber Command, Joint Staff J-7, Director, Operational Test & Evaluation (DOT&E), Army PEO Command Control Communications Tactical, US Naval Air Systems Command (NAVAIR), Air Force Space and Missile Command, Army Intelligence and Information Warfare Directorate; Office of Naval Intelligence and the Army Communications and Electronics Research, Development and Engineering Command (CERDEC).\n\n- NCR supported Contingency Operations as requested by US Cyber Command."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.869"
                                            },
                                            "Text": {
                                                "val": "- Increased funding will be used to execute events at a steadily increasing OPTEMPO to support 8 concurrent events. NCR will conduct engineering activities to plan for technical refresh of emerging end of life and end of service computing assets. The NCR will modify the NCR Test Specification Tool Suite to streamline operations and make them interoperable with other cyber ranges. \n\n- Increased Funding will be used to conduct pathfinder events to evaluate Industrial Control Systems and Avionics Systems.\n\n- The NCR will execute formal runs for the record to complete periodic Security Assessment and Authorization in the 2QFY-17. \n\n- The NCR will implement improvements needed to increase capacity and support increased demand at the existing NCR location.   \n\n- NCR will begin to build out additional dedicated Persistent Testing and Training Environments to support testing and training customers\n\n- The NCR will continue to operate in support of the growing Acquisition Program Cybersecurity Test and Evaluation requirements.  The NCR will support test planning and execution for MDAP and MAIS acquisition programs.\n\n- The NCR will continue to provide Cyber Table Top support for acquisition programs to help programs address cyber security as early as possible in development.\n\n- The NCR will continue to provide support for USCC Training and Certification Events by developing blue, red and gray environments for including Cyber Flag and multiple Cyber Knight and Cyber Guard Events. NCR will support to the JS-J6\/DOT&E sponsored Enterprise Cyber Range Environment events as appropriate.\n\n- NCR will support DOT&E Assessments of Major Combatant Commands beginning with an event for TRANSCOM in 2QFY-17.   \n\n- NCR will continue to support Contingency Operations as requested by US Cyber Command."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "68.534"
                                            },
                                            "Text": {
                                                "val": "- Increased funding will be used to execute events at a steadily increasing OPTEMPO to support 8 concurrent events.  The NCR will conduct engineering activities to plan for technical refresh of emerging end of life and end of service computing assets.  The NCR will modify the NCR Test Specification Tool Suite to streamline operations and make them interoperable with other cyber ranges\n\n- NCR will begin to build out additional dedicated Persistent Testing and Training Environments to support testing and training customers.\n\n- The NCR will continue to provide support for USCC Training and Certification Events by developing blue, red and gray environments for including Cyber Flag and multiple Cyber Knight and Cyber Guard Events. NCR will support to the JS-J6\/DOT&E sponsored Enterprise Cyber Range Environment events as appropriate.\n\n- The NCR expansion will develop detailed plans for NCR expansion, including at Aberdeen Proving Ground, MD; Patuxent River Naval Air Station, MD; Space and Naval Warfare Systems, Charleston, SC; Eglin Air Force Base (AFB), FL; and Program Executive Officer for Simulation, Training, and Instrumentation (PEO-STRI), Orlando, FL.\n\n- NCR will continue to support Contingency Operations as requested by US Cyber Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "67.626"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "67.626"
                                            },
                                            "Text": {
                                                "val": "- The NCR will investigation the enhanced testing of Industrial Control Systems and Avionics Systems Test Beds.\n\n- The NCR will continue to implement improvements needed to increase capacity and support increased demand at the existing NCR location. \n\n- NCR will continue to build out additional dedicated Persistent Testing and Training Environments to support testing and training customers\n\n- The NCR will continue to operate in support of the growing Acquisition Program Cybersecurity Test and Evaluation requirements.  The NCR will support test planning and execution for MDAP and MAIS acquisition programs.\n\n- The NCR will continue to provide Cyber Table Top support for acquisition programs to help programs address cyber security as early as possible in development.\n\n- The NCR will continue to provide support for USCC Training and Certification Events by developing blue, red and gray environments for including Cyber Flag and multiple Cyber Knight and Cyber Guard Events. NCR will support to the JS-J6\/DOT&E sponsored Enterprise Cyber Range Environment events as appropriate. \n\n- NCR will continue to support DOT&E Assessments of Major Combatant Commands.   \n\n- NCR will continue to support Contingency Operations as requested by US Cyber Command.\n\n- NCR will expand in capacity by establishing additional NCR locations to support cyber Test and Training requirements.  TRMC will install computing equipment, install remote access capabilities, attain accreditation from Defense Intelligence Agency, put contracts in place, and hire work force.\n\n- Conduct engineering activities to plan for technical refresh of emerging end of life and end of service computing assets\n\n- Continue to assess cyber range requirements in close cooperation with the DoD Cyber Test and Training Executive Agents to build priority cyber range capability and capacity to meet identified RDT&E community and CMF needs.\n\n- Continue analyses of capability to determine requirements and standards needed to join these cyber test facilities with existing acquisition system hardware-in-the-loop, software-in-the-loop, and systems integration laboratories to test systems in a realistic cyber contested environment.  \n\n- Continue analyses of capability to determine requirements and standards needed to meet the need for exceptionally large cyber test and training environments, such as those required for Cyber Flag."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "- Amount of increase in computing power\n- Number of events capable of supporting\n- Number of NCR-like facilities available"
                        }
                    }
                }
            ]
        }
    }
}