{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601110D8Z"
        },
        "ProgramElementTitle": {
            "val": "Basic Research Initiatives"
        },
        "R1LineNumber": {
            "val": "3"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "66.750"
            },
            "CurrentYear": {
                "val": "40.612"
            },
            "BudgetYearOne": {
                "val": "42.702"
            },
            "BudgetYearOneBase": {
                "val": "42.702"
            },
            "BudgetYearTwo": {
                "val": "45.253"
            },
            "BudgetYearThree": {
                "val": "46.074"
            },
            "BudgetYearFour": {
                "val": "46.862"
            },
            "BudgetYearFive": {
                "val": "47.749"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Supporting basic research provides the Department of Defense (DoD) with a deep and broad awareness of current directions in areas of research important to U.S. military capabilities – including physics and the physical sciences, materials science, chemistry and chemical engineering, electrical engineering, mathematics, computer science, mechanical and aerodynamic engineering, ocean sciences, biological sciences, and the social sciences, among others.  Basic research sustains scientific and engineering communities as it generates the critical technical underpinnings of DoD capabilities.  Basic research allows exploration and discovery, yielding disruptive non-incremental advances that can improve or radically change military capabilities, strategy, and operations.\n\nThe Basic Research Initiatives program element (PE) supports the defense basic research enterprise in three critical areas:  Strategic Support for Basic Research (SSBR), the Minerva Research Initiative, and the Vannevar Bush Faculty Fellowship Program (Vannevar Bush), formerly known as the National Security Science and Engineering Faculty Fellowship (NSSEFF) program."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.654"
                },
                "CurrentYear": {
                    "val": "40.612"
                },
                "BudgetYearOne": {
                    "val": "43.006"
                },
                "BudgetYearOneBase": {
                    "val": "43.006"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "66.750"
                },
                "CurrentYear": {
                    "val": "40.612"
                },
                "BudgetYearOne": {
                    "val": "42.702"
                },
                "BudgetYearOneBase": {
                    "val": "42.702"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "30.096"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.304"
                },
                "BudgetYearOneBase": {
                    "val": "-0.304"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "31.500"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.324"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.075"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.017"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.017"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.287"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.287"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "010"
                    },
                    "ProjectTitle": {
                        "val": "Basic Research Initiatives"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.530"
                        },
                        "CurrentYear": {
                            "val": "12.444"
                        },
                        "BudgetYearOne": {
                            "val": "13.085"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.085"
                        },
                        "BudgetYearTwo": {
                            "val": "13.866"
                        },
                        "BudgetYearThree": {
                            "val": "14.118"
                        },
                        "BudgetYearFour": {
                            "val": "14.360"
                        },
                        "BudgetYearFive": {
                            "val": "14.631"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Research Initiatives project code, P010, includes Strategic Support for Basic Research (SSBR) and the Minerva Research Initiative.\n\nSSBR supports oversight, policies, and initiatives to implement the Under Secretary of Defense for Research and Engineering's (USD(R&E)) strategic plan for defense basic research.  This plan defines actions to help create conditions for defense basic research investments capable of producing high-payoff, transformative scientific breakthroughs for the Department.  SSBR initiatives support the five Basic Research Office strategic goals:  (1) drive the direction of DoD basic research investments; (2) coordinate and conduct oversight of DoD basic research programs; (3) improve the science and engineering (S&E) workforce and public outreach; (4) enhance university-industry collaboration; and (5) engage with the academic research community and international partners.\n\nThe Minerva Research Initiative, a department-wide basic research program in the social sciences directed by the Office of the Secretary of Defense (OSD) and executed by the Services, seeks to build a fundamental understanding of the sources of present and future conflict.  It is one of the Nation’s only social science basic research programs in support of national security.  Minerva promotes a deeper understanding of the social and cultural environments, where threats such as radicalization and regional instabilities develop, and supports more effective strategic and operational policy decisions.  Minerva program priorities are consistent with the goals set forth in the 2014 Quadrennial Defense Review (QDR), informing DoD efforts to effectively build security globally, and are updated annually according to inputs from across the defense enterprise."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "31.500"
                                        },
                                        "Text": {
                                            "val": "Hosted the inaugural Science, Technology, and Innovation Exchange (STIx) conference in August 2018.  This conference brought together DoD-funded researchers, including Vannevar Bush Faculty Fellows, National Defense Science and Engineering Graduate (NDSEG) Fellows, and Science, Mathematics, and Research for Transformation (SMART) Fellows, as well as university faculty researchers together with defense laboratory scientists and program managers from the Services and the Defense Advanced Research Projects Agency.  STIx showcased and connected the nation's brightest minds to communicate new ideas and share novel approaches to confronting old challenges facing the defense community.  Its Ted-like lightening talks were streamed online over two days and are posted on the web.\n\nPlanned and published a broad agency announcement for the Defense Enterprise Scientific Initiative (DESI) pilot program with assistance from the Air Force Office of Scientific Research in August 2017.  DESI was funded through the FY 2017 plus-up.  The program aims to inspire the collaboration among universities and industries in fundamental research.\n\nExecuted the first competition for the I-Corps @ DoD Commercialization pilot program, and supported 6 teams established in FY 2016.  One team received follow-on private capital to commercialize their research and another received the most improved award from the National Science Foundation's I-Corps teaching team.  The second competition is currently underway and will fund up to 12 teams.\n\nSelected ten laboratory scientists for the 2017 class of Laboratory University Collaboration Initiative (LUCI) Fellows.  The research topics included advanced manufacturing, robotics, data analytics, optics and novel engineering materials.  The awardees included NDSEG and SMART Fellowship recipients.  Organized the first review of the LUCI program in collaboration with the Army Research Laboratory in September 2017."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Strategic Support for Basic Research (SSBR)"
                                    },
                                    "Description": {
                                        "val": "The SSBR program creates conditions for defense basic research investments capable of producing high-payoff, transformative scientific breakthroughs for the Department.  SSBR initiatives support the five Basic Research Office strategic goals:  (1) drive the direction of DoD basic research investments; (2) coordinate and conduct oversight of DoD basic research programs; (3) improve the science and engineering (S&E) workforce and public outreach; (4) enhance university-industry collaboration; and (5) engage with the academic research community and international partners."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.973"
                                            },
                                            "Text": {
                                                "val": "Execute new \"Future Directions\" workshops for scientific situational awareness on topics recommended by DoD S&T community and academia.  Convene National research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research.  Continue studies of how past DoD investments and high priority basic research has led to advances in new technologies and new capabilities for the Nation.  As part of the ASD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency.  Continue support for scientific expertise to oversee science and engineering initiatives.  Organize DoD I-Corps competition to select projects that could lead to commercialization into industry or transition into DoD programs of record, with a goal of selecting two teams to enter the training program (Pub. L. 113–66, div. A, title XVI, §1603), and partner with organizations such as OSBP to create opportunities for further technology maturation and potential entrance to programs of record.  Launch the Defense Enterprise Scientific Initiative (DESI) pilot, which aims to build collaboration of universities, industry, and laboratories on defense-critical capabilities.  Explore other opportunities to foster partnerships between academia and industry."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.235"
                                            },
                                            "Text": {
                                                "val": "Conduct four to six workshops for scientific situational awareness that were planned in previous fiscal years.  Convene national research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research.  Continue studies of how past DoD investments and high priority basic research has led to advances in new technologies and new capabilities for the Nation.  As part of the USD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency.  Continue support for scientific expertise to oversee science and engineering initiatives.  Evaluate the effectiveness of the Defense Enterprise Scientific Initiative (DESI) and Innovative-Corps (I-Corps) pilot programs.  Organize the Science, Technology, and Innovation Exchange (STIx) ‎conference to increase awareness of department-wide basic research programs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.312"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.312"
                                            },
                                            "Text": {
                                                "val": "Conduct four to six workshops for scientific situational awareness that were planned in previous fiscal years.  Convene national research leaders to provide expert perspectives on potential breakthroughs and barriers of advancement in rapidly evolving fields of basic research.  Continue studies of how past DoD investments and high priority basic research has led to advances in new technologies and new capabilities for the Nation.  As part of the USD(R&E) mission, continue to analyze university-related business practices for improvement and efficiency.  Continue support for scientific expertise to oversee science and engineering initiatives.  Evaluate effectiveness of DESI and I-Corps pilot programs. Organize the STIx ‎conference to increase awareness of department-wide basic research programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 supports SSBR workshops and studies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Minerva Research Initiative"
                                    },
                                    "Description": {
                                        "val": "The Minerva Research Initiative includes three primary components:  (1) a university-based social science basic research grant program; (2) the Research for Defense Education Faculty (R-DEF) program for the professional military education (PME) institutions; and (3) a collaboration with the Congressionally-established United States Institute of Peace to award research support to advanced graduate students and early career scholars working on security and peace.  All components contribute to Minerva's goals of revitalizing connections between DoD and academic social science communities and building cultural and foreign area knowledge on topics ranging from the mechanisms of radicalization to geopolitical power projection strategies in a multi-polar world.  This deeper scientific understanding will provide a more informed basis to shape doctrine, analysis, and other strategic and operational decisions made by war planners and warfighters."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.057"
                                            },
                                            "Text": {
                                                "val": "Continue supporting university-led research initiatives on themes including: the social impact of autonomy; societal resilience; power and deterrence; cyber defense; interconnectivity between security and sociality; and great powers conflict. Maintain support of R-DEF program at defense education institutions. Enhance accessibility of research insights through a more robust website and outreach efforts. And continue connecting subject matter expertise to the operational community."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.209"
                                            },
                                            "Text": {
                                                "val": "Execute 12-14 new university-led research projects and continue support for successful ongoing projects, with priorities shaped by defense needs.  Maintain support of R-DEF program at defense education institutions.  Continue active engagement to provide subject matter expertise to the operational community through the annual Minerva Conference.  Continue to build policy and operational community connections to effectively connect new social science discoveries and analytical methods to current and future defense leadership and to inform tomorrow's key security decisions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.773"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.773"
                                            },
                                            "Text": {
                                                "val": "Continue to support successful ongoing university-led research projects and execute 12-14 new projects based on input from DoD stakeholders.  Encourage more partnerships between university-led and R-DEF projects and continue support for R-DEF program.  Continue active engagement with operational community by providing subject matter expertise on request and through the annual Minerva Conference and outreach to DoD stakeholders.  Retain existing and generate new connections to policy and operational communities to facilitate the transition of Minerva research.  Effectively connect new social science discoveries and analytical methods to current and future defense leadership and to inform future security decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase from FY 2018 to FY 2019 supports university-led research projects within the Minerva Research Initiative."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "060"
                    },
                    "ProjectTitle": {
                        "val": "Vannevar Bush Faculty Fellowship"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "22.220"
                        },
                        "CurrentYear": {
                            "val": "28.168"
                        },
                        "BudgetYearOne": {
                            "val": "29.617"
                        },
                        "BudgetYearOneBase": {
                            "val": "29.617"
                        },
                        "BudgetYearTwo": {
                            "val": "31.387"
                        },
                        "BudgetYearThree": {
                            "val": "31.956"
                        },
                        "BudgetYearFour": {
                            "val": "32.502"
                        },
                        "BudgetYearFive": {
                            "val": "33.118"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Vannevar Bush Faculty Fellowship, formerly the National Security Science and Engineering Faculty Fellowship (NSSEFF), program supports world-class researchers in scientific areas of critical importance to DoD and ensures the cultivation of exceptional talent.  Fellows’ research spans a broad set of emerging scientific areas with transformative potential, including Quantum Information Science, Novel Engineered Materials, Cognitive Neuroscience, Engineering Biology, Robotics, Data Analytics, and others.  The program fosters close connections between academia and the defense science and engineering enterprise, a primary goal of SSBR efforts.  Fellows provide the Department the deep scientific expertise from today’s leading research universities and collaborate with defense scientists and engineers.  This program actively engages and coordinates basic research across the Department."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vannevar Bush Faculty Fellowship (Vannevar Bush) Program"
                                    },
                                    "Description": {
                                        "val": "The Vannevar Bush Program ensures the DoD has a research portfolio that supports creative, innovative, and productive university researchers.  The objectives of the program are to:  (1) support scientific research that may lead to extraordinary outcomes; (2) educate and train student and post-doctoral researchers for the defense and national security workforce; (3) foster long-term relationships between university researchers and the Department; (4) familiarize select university researchers and their students with DoD's current and future challenges; and (5) increase the number of exceptionally talented technical experts that are contributing to DoD's mission."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "22.220"
                                            },
                                            "Text": {
                                                "val": "Continue support for 42 current Vannevar Bush Fellows and DoD collaborative research partners.  Review and update program topic areas.  Solicit for a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting which will be hosted by Air Force Research Laboratory (AFRL) at Wright-Patterson Air Force Base, with goals to familiarize Fellows and their research goals with AFRL mission and research strengths.  Utilize this venue to identify and facilitate new connections between new Fellows and DoD scientists and engineers, including the Vannevar Bush Steering Committee.  Organize and conduct a program review and report on Fellows’ progress.  Continue support for 16 LUCI Fellows in DoD laboratories to conduct collaborative basic research with Vannevar Bush Fellows.  Organize and conduct a new LUCI competition and selection for ten collaborative research projects between DoD researchers and Vannevar Bush Fellows in areas of scientific or technological importance to the Department.  Conduct a review on LUCI projects and report the scientific progress and the impacts of LUCI projects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "28.168"
                                            },
                                            "Text": {
                                                "val": "Provide support to 45 Vannevar Bush Fellows and support collaboration on research with 26 Laboratory University Collaboration Initiative (LUCI) Fellows from DoD Service Laboratories.  Review and update program focus topic areas with input from DoD science and technology (S&T) community.  Organize and execute a competition to select a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting, including DoD laboratory tours.  Identify and facilitate connections between new Fellows and DoD scientists and engineers, including the Vannevar Bush Steering Committee.  Organize and conduct a program review and site visits to monitor the research progress by Vannevar Bush Fellows and their DoD collaborators.  Conduct review of LUCI projects in DoD laboratories and report the scientific progress and impacts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "29.617"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "29.617"
                                            },
                                            "Text": {
                                                "val": "Support 47 Vannevar Bush Fellows and collaboration on their research with ten LUCI Fellows from DoD Service Laboratories.  Review and update program focus topic areas with input from DoD S&T community.  Organize and execute a competition to select a new class of Vannevar Bush Fellows.  Organize and conduct the Vannevar Bush annual meeting, including DoD laboratory tours.  Facilitate connections between new Fellows and DoD scientists and engineers, including the Vannevar Bush Steering Committee.  Organize and conduct a program review and site visits to monitor the research progress by Vannevar Bush Fellows and their DoD collaborators.  Conduct review of LUCI projects in DoD laboratories and report the scientific progress and impacts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2018 to FY 2019 increase supports the addition of two new Vannevar Bush Fellows."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}