{
    "id": "2019-Navy-PB-1319-MJBOOK-0-0-1cb3285e5eb3096a00efd774d79545d93ed7b90effed5e9c90908e9fa9d3e340-7",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602236N"
        },
        "ProgramElementTitle": {
            "val": "Warfighter Sustainment Applied Res"
        },
        "R1LineNumber": {
            "val": "8"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "50.465"
            },
            "CurrentYear": {
                "val": "48.649"
            },
            "BudgetYearOne": {
                "val": "56.197"
            },
            "BudgetYearOneBase": {
                "val": "56.197"
            },
            "BudgetYearTwo": {
                "val": "56.133"
            },
            "BudgetYearThree": {
                "val": "55.869"
            },
            "BudgetYearFour": {
                "val": "57.065"
            },
            "BudgetYearFive": {
                "val": "58.387"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Research and Development Framework which is developed from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century.  Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare.  \n\nThis PE supports innovation-based efforts that will provide technology options for future Navy and Marine Corps capabilities. Efforts focus on advanced Naval materials; biocentric technologies; environmental quality; human factors and organizational design; medical technologies; and Naval training technologies. Within the Naval Transformation Roadmap, this investment maps to future transformational capabilities and the FORCEnet pillar of the CNO and the Commandant of the Marine Corps vision for the future -- Naval Power 21. \n\nThis PE also includes the Office of Naval Research Global (ONRG) International Science Program whose mission is to search the globe for emerging scientific research and advanced technologies to enable the Office of Naval Research (ONR) and the NRE to address effectively the current needs of the Fleet\/Forces (F\/F), and investigate and assess revolutionary, high-payoff technologies for future Naval missions and capabilities. Within this Global mission is the Naval Science Advisor Program that develops leaders among civilian scientists and engineers in the Naval Research Enterprise (NRE). Upon tour completion, Science Advisors return to the NRE with first-hand knowledge of the F\/F, warfighting issues, and strategic decision making. This program enables continuous communication and collaboration between the warfighters, the technical community, and strategic development commands. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "45.467"
                },
                "CurrentYear": {
                    "val": "48.649"
                },
                "BudgetYearOne": {
                    "val": "48.448"
                },
                "BudgetYearOneBase": {
                    "val": "48.448"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "50.465"
                },
                "CurrentYear": {
                    "val": "48.649"
                },
                "BudgetYearOne": {
                    "val": "56.197"
                },
                "BudgetYearOneBase": {
                    "val": "56.197"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.998"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.749"
                },
                "BudgetYearOneBase": {
                    "val": "7.749"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.958"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.952"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "8.376"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.376"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.627"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.627"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increase from FY 2018 to FY 2019 is due to the realignment of funds from PE 0601153N Defense Research Sciences to 0602236N Warfighter Sustainment Applied Research to consolidate ONR Global - International Science Program support costs.\n\nThe FY 2019 funding request was reduced by $0.459 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Warfighter Sustainment Applied Res"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "45.629"
                        },
                        "CurrentYear": {
                            "val": "48.649"
                        },
                        "BudgetYearOne": {
                            "val": "56.197"
                        },
                        "BudgetYearOneBase": {
                            "val": "56.197"
                        },
                        "BudgetYearTwo": {
                            "val": "56.133"
                        },
                        "BudgetYearThree": {
                            "val": "55.869"
                        },
                        "BudgetYearFour": {
                            "val": "57.065"
                        },
                        "BudgetYearFive": {
                            "val": "58.387"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Efforts in this PE focus on; advanced naval materials; biocentric technologies; environmental quality; human factors and organizational design; medical technologies; international science and science advisor programs; and Naval systems training and education. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ADVANCED NAVAL MATERIALS"
                                    },
                                    "Description": {
                                        "val": "Advanced Naval Materials efforts support several S&T Focus Areas, in particular Platform Design & Survivability and Power & Energy, and perform research across a broad spectrum of technical areas including:  structural materials to increase platform performance and survivability at reduced weight and cost; advanced, high-performance materials for energy systems; corrosion mitigation strategies; high-temperature energy systems; enhanced sonar transducers; and environmental quality technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.389"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of acceptance testing methodologies for advanced transducer, single-crystal, high-strain materials and definition of standardized materials properties and composition ranges.\n- Continued development of compositional tuning of single-crystal, high-strain transducer materials, for specialized naval system applications.\n- Continued marine titanium alloy design and processing development, exploiting anticipated cost reductions for high performance, reduced maintenance naval applications.\n- Continued development of continuous, single wall, carbon nanotube composite materials for next generation air and naval platforms.\n- Continued development of surface preparation methods and characterization of corrosion performance for future naval ship materials.\n- Continued development of multifunctional coatings.\n- Continued development of coating performance and knowledge database for Naval use.\n- Continued development of innovative sonar transducers based on high-strain, high-coupling, piezoelectric single crystals.\n- Continued development of models and characterization methods for dynamic loading (water slamming and blast loading) in polymer composite materials.\n- Continued development of fiber-optic sensors, transducers and demodulation technology for structural health monitoring of ships and submarines.\n- Continued development of continuous based monitoring techniques of new synthetic fuels and lubricants based on\nelectromagnetic signature analysis.\n- Continued development and application of distributed fiber optic Bragg gratings for structural health monitoring of ships and aircrafts.\n- Continued development of novel growth methods to specialized single crystal transducer materials tuned to requirements of specialized naval systems.\n- Continued assessment of the degree of sensitization potential of marine grade Al alloys.\n- Continued evaluation of advanced material coating for erosion control on helicopter main rotor blade leading edges.\n- Continued studies on fuel cell corrosion.\n- Continued development of superhydrophobic surface modification technology.\n- Continued studies on mitigation of pitting corrosion and stress corrosion cracking in marine aluminum alloys.\n- Continued development of surface tolerant coating removal methods.\n- Continued development of processing technologies to fabricate piezoelectric single crystals into complex transducer assemblies.\n- Continued development of thermal management system(s) to arrest excessive heat fluxes and loads on amphibious ship by advanced Naval\/USMC aircraft.\n- Continued development of the rational engineering design of Al-alloys for naval applications.\n- Continued to increase emphasis on research efforts to discover innovative fundamental technologies to shape future Naval investments and strategies, leveraging the globe to support the Sailors & Marines of today and tomorrow.\n- Continued research and development incorporating physics and chemistry of the materials-environment interface, with the focus on materials with melting points above 3000C.\nContinued development of advanced NDE, SHM and Prognostics Technologies for improved readiness and reliability of air and naval platforms based on new and emerging electronic and photonics materials and devices.\n- Continued development of advanced structural composites with improved mechanical characteristics, blast resistance, and fire resistance, for more durable and reliable structures by optimizing the resin, the fibers and the interphases with new chemistries, additives and processes.\n- Continued development and exploitation of new and advanced forms of carbon based nanostructures (Graphene,\nNanotubes, Diamond and others) for next generation family of materials and structures with outstanding mechanical,\nthermal, electrical and energy applications.\n- Continued investigating and characterizing cellular structures via additive manufacturing\n- Continued development of low AC loss high temperature superconductors for advanced power. \n- Complete development and exploitation of new and advanced forms of carbon based nanostructures (Graphene,\nNanotubes, Diamond and others) for next generation family of materials and structures with outstanding mechanical,\nthermal, electrical and energy applications.\n- Complete development of novel processing technologies for increasing the fatigue strength and corrosion resistance of\nweldments for ship structures with reduced weight and maintenance requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.018"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ADVANCED NAVAL MATERIALS:  Expand research on structural materials, including, but not limited to, the following: Nanostructured materials processing, composite development, cellular materials and high temperature materials.  Conduct applied research related to critical S&T to investigate corrosion control modeling, acoustic transduction technologies and environmental quality. Complete the development of low AC loss high temperature superconductors for advanced power.\n\nMATERIALS AND PROCESSES:  Develop novel and scalable processing methods to produce mechanically robust high temperature superconductor tapes with minimal AC loss for various naval applications such as transformers, inductors, stators and for pulsed power delivery systems for all electric ships.  Design new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques.  Design of multifunctional material systems for use in new helmet suspension to mitigate multiple threats. Compositional modifications and processing parameters to optimize material performance have been demonstrated."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.455"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ADVANCED NAVAL MATERIALS:  \nContinue research on structural materials, including, but not limited to, the following: Nanostructured materials processing, composite development, cellular materials, high temperature materials and alternative hull materials. Conduct applied research related to critical S&T to investigate corrosion control modeling, high strength corrosion resistant compositionally complex alloys, corrosion resistant additive manufactured alloys and acoustic transduction technologies.\n\nMATERIALS AND PROCESSES:  \nContinue development of novel and scalable processing methods to produce mechanically robust high temperature superconductor tapes with minimal AC loss for various naval applications such as transformers, inductors, stators and for pulsed power delivery systems for all electric ships.  Continue design new microfluidic system for direct write additive manufacturing to significantly improve the existing techniques.  Continue design of multifunctional material systems for use in new helmet design to mitigate multiple threats.  Continue compositional modifications and processing parameters to optimize material performance have been demonstrated leading to current plans for their utilization."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "BIOCENTRIC TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Biocentric technologies provide novel solutions for naval needs based upon the applications of bio-inspired sensors, materials, processes and systems. Topic areas include, but are not limited to: development of biologically-based signal processing for medical, surveillance and security applications; bioinspired robotics; synthetic biology to produce high-value naval materials or to develop sentinel organisms, and marine mammal diagnostics to support the Navy's Fleet Marine Mammal Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.626"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NAVAL BIOSCIENCE:\n- Continued development of innovative naval biosensors, biomaterials, and bioprocess technology.\n- Continued engineering development and optimization of sea-floor sediment energy harvesting system for\nsustainable and autonomous powering of underwater sensor networks and AUV's.\n- Continued development of microbial fuel cells for powering a linear sensor array\n- Continued study of microbial electrochemical systems for shipboard desalination\/waste-to-energy conversion\n- Continued of closed-loop microbial fuels cells\n- Continued synthetic biology research on explosive-sensing plants\n- Continued studies of scalability of microbial liquid fuel \n\nSYNTHETIC BIOLOGY FOR SENSING & ENERGY PRODUCTION\n- Continued synthetic biology studies of engineered sentinel organisms for environmental surveillance\n\nLIFE SCIENCE AND BIOENGINEERING\n- Continued marine mammal diagnostics efforts, including immunobioassays for stress and infection detection.\n- Continued efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones.\n\nNEURAL, SENSORY AND BIOMECHANICAL SYSTEMS\n- Continued efforts on naval biosensor to detect brain structures and blood vessels through skull bones\n- Continued efforts on advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems.\n-Continued integration of biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift\npropulsors) to achieve closed loop control.\n- Continued efforts in bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors\nbased on animal wing and fin biomechanics.\n- Continued efforts for bio-inspired massively parallel vision systems.\n- Continued studies to develop brain-based intelligent systems to support high level interaction between\nwarfighters and autonomous systems.\n- Continued studies to develop electrosence and biosonar for MOC and EOD missions\n- Continued development of improved recombinant antibodies for biothreat agents.\n\nSYNTHETIC BIOLOGY FOR SENSING & ENERGY PRODUCTION:\nContinued studies of scalability of microbial liquid fuel component production via electrobiosynthesis or bioreactor\nmethodology."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.717"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NAVAL BIOSCIENCE:  \nContinue research into the development of innovative naval biosensors, biomaterials, and bioprocess technology.\nInvestigate engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and\nautonomous powering of underwater sensor networks and AUV's. Conduct research on the development of microbial\nfuel cells for powering a linear sensor array. Study microbial electrochemical systems for shipboard desalination\/\nwaste-to-energy conversion and the closed-loop microbial fuels cells. Research explosive-sensing plants and microbial\nelectrobiosynthesis of liquid fuels. Initiate development of microbial electronic devices.\n\nSYNTHETIC BIOLOGY FOR SENSING & ENERGY PRODUCTION:  \nContinue research on synthetic biology studies of engineered sentinel organisms for environmental surveillance. Initiate\nintegration of programmable cellular controllers with robotic devices. \n\nLIFE SCIENCE AND BIOENGINEERING:  \nContinue marine mammal diagnostics efforts, including immunobioassays for stress and infection detection and efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones.   \n\nNEURAL, SENSORY AND BIOMECHANICAL SYSTEMS:  \nContinue efforts on naval biosensor to detect brain structures and blood vessels through skull bones. Investigate advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems. Integrate biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors)to achieve closed loop control. Conduct research into bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics and in efforts of bio-inspired massively parallel vision systems. Study the development of brain-based intelligent systems to support high level interaction between warfighters and autonomous systems. Continue studies to develop electrosence and biosonar for MOC and Explosive Ordnance Disposal (EOD) missions and the development of improved recombinant antibodies for biothreat agents.\n\nMATERIALS AND CHEMISTRY:  Develop novel approaches to rapidly identify antibiotic resistant genes in bacterial pathogens of importance for the entire US military force. This effort will enable our transitional partners, the Naval Medical Research Center and the Naval Medical Research Laboratories, for rapid identification of highly resistant bacterial pathogens."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.684"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.684"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NAVAL BIOSCIENCE:  \nContinue research into the development of innovative naval biosensors, biomaterials, and bioprocess technology.\nInvestigate engineering development and optimization of sea-floor sediment energy harvesting system for sustainable and\nautonomous powering of underwater sensor networks and AUV's. Conduct research on the development of microbial\nfuel cells for powering a linear sensor array. Study microbial electrochemical systems for shipboard desalination\/\nwaste-to-energy conversion and the closed-loop microbial fuels cells. Research explosive-sensing plants and microbial\nelectrobiosynthesis of liquid fuels. Continue development of microbial electronic devices.\n\nSYNTHETIC BIOLOGY FOR SENSING & ENERGY PRODUCTION:  \nContinue research on synthetic biology studies of engineered sentinel organisms for environmental surveillance and\nintegration of programmable cellular controllers with robotic devices. \n\nLIFE SCIENCE AND BIOENGINEERING:  \nContinue marine mammal diagnostics efforts, including immunobioassays for stress and infection detection and efforts to detect, treat, and prevent diseases in dolphins, including diabetes and kidney stones.   \n\nNEURAL, SENSORY AND BIOMECHANICAL SYSTEMS:  \nContinue efforts on naval biosensor to detect brain structures and blood vessels through skull bones. Investigate advanced biomimetic sensing and neural control for human-robot interaction to enable effective collaboration of warfighters and autonomous systems. Integrate biomimetic sonar with bioinspired autonomous undersea vehicles (with high-lift propulsors)to achieve closed loop control. Conduct research into bioinspired quiet, and maneuverable self-propelled line array using high-lift propulsors based on animal wing and fin biomechanics and in efforts of bio-inspired massively parallel vision systems. Study the development of brain-based intelligent systems to support high level interaction between warfighters and autonomous systems. Continue studies to develop electrosence and biosonar for Mine Counter Measures (MCM) and Explosive Ordinance Device (EOD) missions.\n\nMATERIALS AND CHEMISTRY: \nContinue development of novel approaches to rapidly identify antibiotic resistant genes in bacterial pathogens of importance for the entire US military force.  Success of this effort will enable our transitional partners, the Naval Medical Research Center and the Naval Medical Research Laboratories, for rapid identification of highly resistant bacterial pathogens.  A major success has been demonstrated by utilizing NRL developed microbial resistant determinant assay for its advances to system design."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENVIRONMENTAL QUALITY"
                                    },
                                    "Description": {
                                        "val": "Environmental Quality technologies enable sustained world-wide Navy operations in compliance with all local, state, regional, national and international laws, regulations and agreements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.628"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms.\n- Continued development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems.\n- Continued field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology for reduced drag, and significant fuel savings.\n- Continued studies on oil emulsion issues and development of novel bilge water treatment systems on existing and new ships."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.573"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of new, advanced, environmentally benign Anti-Fouling (AF)\/Anti-Corrosive (AC) coating systems for Navy platforms.\n- Continue development of advanced environmentally sound technologies for shipboard waste treatment and pollution abatement systems.\n- Continue field evaluation of prototype robotic Hull BUG to identify gaps needed to refine and advance the technology for reduced drag, and significant fuel savings.\n- Complete studies on oil emulsion issues and development of novel bilge water treatment systems for existing and new\nships."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.764"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all FY 2018 efforts, less those noted to complete and expand research related to naval environmental technology."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HUMAN FACTORS AND ORGANIZATIONAL DESIGN"
                                    },
                                    "Description": {
                                        "val": "Description: The overarching objective of this activity is the achievement of FORCEnet and Sea Power 21 goals by developing human factors principles and cognitive models for human centric design, decision support systems for collaborative decision making, and adaptive command and control structures. The CNO's Maritime Strategy and the Commander Fleet Forces Command complementary plan to revise organization of Maritime Operations Centers (MOC) place high priority on the aforementioned FORCEnet and Sea Power 21 goals. Specific objectives focus on improving\nsmall team, platform, task force, and battle group operations by developing advanced human factors technologies for\nincorporation into operational systems. The goals and payoffs are to enhance human performance effectiveness; improve\nthe timeliness and quality of decision making; develop strategies to mitigate high workload and ambiguity; reduce\nmanning; improve situational awareness and speed of command through a deeper understanding of human capabilities and\nlimitations; and improvement of team decision making in ad-hoc, complex problem solving scenarios."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.085"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "HUMAN COMPUTER INTERACTION\/VISUALIZATION\n- Continued research on audio-visual cue integration for 360-degree periscope displays by utilizing eye-tracking,\nsleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions.\n\nCOMMAND DECISION MAKING (CDM)\n- Continued to develop task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents.\n- Continued development of information infrastructure that is operational context sensitive to allow the dynamic\nprioritization of date based on its anticipated information value and mission criticality.\n- Continued research building proactive decision support tools for Command and Control.\n- Initiated research for Navigating in Uncertainty.\n\nSOCIAL NETWORK ANALYSIS\n- Continued research on socio-technical aspects of community mobilization and complex humanitarian operations,\nincluding the use of novel platforms, social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts.\n- Initiated development of testbeds and tool chains for rapid disaster analysis and response.\n- Initiated development of novel information feeds for Pacific Command.\n\n- Completed technical demonstrations for European Command, NATO forces, and US Cyber Commands' Cyberschool on information environment assessment and transitioned new technologies to European Command for information environment assessment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.159"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "HUMAN COMPUTER INTERACTION\/VISUALIZATION:  Continue research on audio-visual cue integration for 360-degree periscope displays by utilizing eye-tracking, sleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions.\n\nCOMMAND DECISION MAKING (CDM):  Continue development of task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents. Research the development of an information infrastructure that is operational context sensitive to allow the dynamic prioritization of date based on its anticipated information value and mission criticality. Study building proactive decision support tools for Command and Control. Investigate Navigating in Uncertainty.\n\nSOCIAL NETWORK ANALYSIS:  Continue research on socio-technical aspects of community mobilization and complex humanitarian operations, including the use of novel platforms, social networks and the impact of novel technologies on human behavior in crisis and collaborative contexts. Continue development of novel information feeds for Pacific Command and for testbeds and tool chains for rapid disaster analysis and response. Continue efforts on information conflicts, social-cyber behavior and hybrid warfare.  Initiate research on competitive narrative and digital media assessment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.777"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.777"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "HUMAN COMPUTER INTERACTION\/VISUALIZATION:  Continue research on audio-visual cue integration for 360-degree periscope displays by utilizing eye-tracking, sleep studies and traditional behavioral measures to characterize human performance on periscope-related tasks under a variety of physiological conditions.\n\nCOMMAND DECISION MAKING (CDM):  Continue development of task management algorithms applicable to agile supervisory control of teams involving human and autonomous agents. Research the development of an information infrastructure that is operational context sensitive to allow the dynamic prioritization of date based on its anticipated information value and mission criticality. Study building proactive decision support tools for Command and Control. Investigate Navigating in Uncertainty.\n\nSOCIAL NETWORK ANALYSIS:  Initiate development of warfighting experiments for information environment assessment, civil-military communications (public affairs), information operations and psychological operations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MEDICAL TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "This program supports the development of field medical equipment, diagnostic capabilities and treatments; technologies to improve warfighter safety and to enhance personnel performance under adverse conditions; and systems to prevent occupational injury and disease in hazardous, deployment environments; including regenerative medicine technologies and therapeutic\/restorative practices for the treatment of combat-related traumatic injuries. Navy investment in these areas is essential because Navy\/USMC mission needs are not adequately addressed by the civilian sector or other Federal agencies. For example, civilian emergency medicine does not address casualty stabilization during long transit times to definitive care. The National Institutes of Health (NIH) focuses on the basic science of disease processes and not applied research related to development. Programs are coordinated with other Services through the Armed Services Biomedical Research Evaluation and Management (ASBREM) Committee, and Joint Technical Coordinating Group (JTCG) process, to prevent duplication of effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "UNDERSEA MEDICINE:\n- Continued efforts to reduce operational injuries\n- Continued studies on decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the\nprevention, detection and treatment of DCS\/AGE, particularly by nonrecompressive methods.\n- Continued efforts to develop prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes.\n- Continued efforts to assess the impact of thermal (i.e., heat and cold) stress on operational performance. Underwater\nthermal extremes can affect diver performance and alter risk of incurring decompression sickness.\n- Continued studies related to optimization of diver performance. Operational performance in the undersea environment can be hampered by a variety of environmental stressors.\n- Continued studies related to optimization of submariner health and performance. Submarine crewmembers are exposed to\na variety of unique stressors including prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc. that can impact health and performance.\n- Continued research to explore novel pharmaceutical interventions for hyperbaric oxygen toxicity.\n- Continued research on resuscitation therapies for near-drowning victims.\n- Completed research into improved cognitive agility for divers and diving supervisors.\n- Completed research into diver human system integration - displays and biometric monitoring.\n\nREGENERATIVE MEDICINE:\n- Continued the program with the Armed Forces Institute for Regenerative Medicine (AFIRM).\n\nNOISE INDUCED HEARING LOSS (NIHL):\n- Continued research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction.\n- Continued efforts to reverse NIHL.\n- Continued studies related to biomedical effects of underwater sound as military divers must operate safely and effectively in potentially complex underwater sound fields.\n- Continued efforts for \"stress inoculation\" to mitigate the impact of exposure to stressful combat environments prior to deployment.\n- Continued research to study the incidence, susceptibility, and mitigation strategies of NIHL and tinnitus.\n- Continued research in prevention and treatment of NIHL and tinnitus.\n- Continued research to improve personal protective equipment technology.\n- Continued Jet Noise Reduction Project to utilize analytical modeling and simulation tools anchored by experiment to\ndevelop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft.\n\n- Completed noise source research for noise reduction at the source.\n\nUNDERSEA MEDICINE:\n- Complete research on resuscitation therapies for near-drowning victims."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.465"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "UNDERSEA MEDICINE:  \nContinue efforts to reduce operational injuries. Study decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by non-recompressive methods. Investigate the development of prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes. Study the optimization of diver and submariner health and performance when exposed to a variety of environmental and unique stressors (heat and cold, prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc). Explore novel pharmaceutical interventions for hyperbaric oxygen toxicity. Initiate research on improving performance in extreme environments including integrated diving helmet audio-visual displays; human-machine symbiosis; nutrition, hydration and gut microbiome studies; and genomics\/metabolomic approaches.\n\nREGENERATIVE MEDICINE:  \nContinue the program with the Armed Forces Institute for Regenerative Medicine (AFIRM).\n\nNOISE INDUCED HEARING LOSS (NIHL): \nContinue research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction. Study the\nbiomedical effects of underwater sound as military divers must operate safely and effectively in potentially complex\nunderwater sound fields. Mitigate the impact of exposure to stressful combat environments prior to deployment through\n\"stress inoculation\". Study the incidence, susceptibility, and mitigation strategies of NIHL and tinnitus. Research the\nprevention, treatment and reversal of NIHL and tinnitus. Investigate the improvement of personal protective equipment\ntechnology. Continue Jet Noise Reduction Project to utilize analytical modeling and simulation tools anchored by\nexperiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.839"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "UNDERSEA MEDICINE:  \nContinue efforts to reduce operational injuries. Study decompression sickness (DCS) and arterial gas embolism (AGE), to include novel approaches to the prevention, detection and treatment of DCS\/AGE, particularly by non-recompressive methods. Investigate the development of prophylactic agents preventing hyperbaric oxygen toxicity. Prolonged exposure to hyperbaric oxygen can be toxic to lungs, nervous system and eyes. Study the optimization of diver and submariner health and performance when exposed to a variety of environmental and unique stressors (heat and cold, prolonged deployments, effects of altered diurnal rhythms, non-standard breathing gases, lack of sunlight, etc). Explore novel pharmaceutical interventions for hyperbaric oxygen toxicity. Continue research on improving performance in extreme environments including integrated diving helmet audio-visual displays; human-machine symbiosis; nutrition, hydration and gut microbiome studies; and genomics\/metabolomic approaches.\n\nREGENERATIVE MEDICINE:  \nContinue the program with the Armed Forces Institute for Regenerative Medicine (AFIRM).\n\nNOISE INDUCED HEARING LOSS (NIHL): \nContinue research to reduce noise at the source, i.e. jet engine quieting and flight deck noise reduction. Study the\nbiomedical effects of underwater sound as military divers must operate safely and effectively in potentially complex\nunderwater sound fields. Mitigate the impact of exposure to stressful combat environments prior to deployment through\n\"stress inoculation\". Study the incidence, susceptibility, and mitigation strategies of NIHL and tinnitus. Research the\nprevention, treatment and reversal of NIHL and tinnitus. Investigate the improvement of personal protective equipment\ntechnology. Continue Jet Noise Reduction Project to utilize analytical modeling and simulation tools anchored by\nexperiment to develop and assess solutions enabling mitigation of jet induced noise from high performance tactical aircraft."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "THE OFFICE OF NAVAL RESEARCH GLOBAL"
                                    },
                                    "Description": {
                                        "val": "Description: This PE supports the Office of Naval Research (ONR) Global mission to search the globe for emerging scientific research and advanced technologies to enable ONR and the Naval Research and Development Establishment (NR&DE) to effectively address the current needs of the Naval Fleet\/Forces (F\/F), and discover and assess revolutionary, high-payoff technologies for future Naval missions and capabilities. Within this Global mission, funding for the ONR Global Science Advisor Program ensures the F\/F help shape the DON investment in science and technology (S&T), develops teaming relationships to rapidly demonstrate and transition technology, supports development of technology-based capability options for Naval Forces, and enables warfighting innovations based on technical and conceptual possibilities. Science Advisors provide insight into issues associated with Naval Warfighting Capabilities that influence S&T program decision making. The program develops leaders among civilian scientists and engineers in the NR&DE. Upon completion of their tours, Science Advisors return to the NR&DE with firsthand knowledge of the how the SN\/USMC conduct business, operational warfighting issues, and strategic decision making. The ONR Global Science Advisor Program enables continuous communication and collaboration between the warfighters, the technical community, and strategic development commands."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "NTERNATIONAL SCIENCE PROGRAM\nEngaged with international scientists and engineers through more than 500 liaison visits to research institutions in more than 60 countries. ONR Global actively fostered international research collaboration by awarding 47 grants totaling $1.5M. Additionally, the command established the second office in South America, ONR Global Sao Paolo.\n\nSCIENCE ADVISORS\nONR Global embedded twenty-four (24) Science Advisors into Naval Fleet\/Force Commands worldwide to fulfill the role\nof Science and Technology (S&T) liaison for the principal, assist in current & future S&T requirements definition, and to provide US Sailors & Marines with near term technology solutions\/capabilities.\n\n- Initiate the establishment of an ONR office in India."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.757"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "ONR Global will continue to support all Science Advisor program efforts and will continue to engage with the international\nS&T community through 28 PhD-level scientists, placed in seven overseas offices, utilizing liaison visits and awarding\napplied research grants. Complete the establishment of an office in India."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.760"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue all FY 2018 efforts. \n-ONR Global will support 28 PhD level scientists, in seven overseas offices, continuing to engage with international scientists and engineers through liaison visits to research institutions and continue actively fostering international collaboration by awarding research grants."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018 to FY 2019 reflects the realignment of funds from PE 0601153N Defense Research Sciences to consolidate International Science Program support costs under single a program element."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGIES"
                                    },
                                    "Description": {
                                        "val": "Training technologies enhance the Navy's ability to train effectively and affordably in classroom settings, in simulated environments, while deployed, and to operate effectively in the complex, high stress, information-rich and ambiguous environments of modern warfare such as asymmetric warfare. Technology development responds to a variety of requirements, including providing more affordable approaches to training and skill maintenance. Improved training efficiency and cost-effectiveness is achieved by applying operations research, modeling and simulation, and instructional, cognitive, and computer sciences to the development, delivery, evaluation, and execution of training."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.891"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "COGNITIVE SCIENCE OF LEARNING\n- Continued research and assessment of advanced gaming technology for enhanced training.\n- Continued creation and conduct of experiments to validate automated performance assessment and after action reviews.\n- Continued a systematic program of applied research addressing unanswered questions regarding effective instructional strategies in artificially intelligent tutoring.\n- Continued research in the neuro-biology of learning including integration of the role of white matter\n- Continued development of games that incorporate AI techniques to teach complex warfighter skills decision-making and problem solving.\n- Continued development of intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences.\n- Continued development of scenarios generators that produce integrated training (e.g., individual and collective) training.\n- Continued development of optimal training strategies for intelligent jobs on mobile devices (e.g., IPad).\n- Continued development of immersive environments for training interpersonal and leadership skills.\n- Continued design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills.\n- Continued development of novel psychometric approaches to assess human performance in medical\/ military simulations and simulators.\n- Continued research in design features of medical and military simulators and simulations.\n- Continued field studies and user tests evaluating new features and job aiding tools.\n- Continued research into computational neuron-models in the design of training systems.\n\nENHANCING WARFIGHTER COGNITIVE CAPABILITY:\n- Continued research to understand the structural relations among the latent variables of short-term memory, working\nmemory, executive attentional control, and fluid intelligence.\n- Continued research to assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory.\n- Continued research to understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities.\n- Continued research to assess the efficacy of game-based brain training using hand-held (fieldable) hardware platforms.\n- Continued research to determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making.\n- Continued task to develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates.\n\nCOMPUTATIONAL MODELS OF HUMAN BEHAVIOR:\n- Continued research into game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.\n- Continued research on software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.\n- Continued the integration of cognitive and neuron-computational models of human learning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.960"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "COGNITIVE SCIENCE OF LEARNING:  \nResearch and assess advanced gaming technology for enhanced training. Conduct experiments to validate automated\nperformance assessment and after action reviews. Develop a systematic program of applied research addressing\nunanswered questions regarding effective instructional strategies in artificially intelligent tutoring. Research the neurobiology of learning including integration of the role of white matter. Develop games that incorporate artificial intelligence (AI) techniques to teach complex warfighter skills decision-making and problem solving. Develop optimal training strategies for intelligent jobs on mobile devices (e.g., IPad) and immersive environments for training interpersonal and leadership skills. Design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills. Design features and develop novel psychometric approaches to assess human performance in medical\/military simulations and simulators. Conduct field studies and user tests evaluating new features and job aiding tools. Research computational neuron-models in the design of training systems. Develop skill decay models for psychomotor, perceptual, and cognitive skills and refresher training strategies. Create intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences. Design scenarios generators that produce integrated (e.g.,individual and collective) training. Initiate development of computational model for learning theory to drive design of instruction and continue research on individual differences.\n\nENHANCING WARFIGHTER COGNITIVE CAPABILITY:\nContinue research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence. Assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory. Understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities. Study the efficacy of game-based brain training using hand-held (fieldable) hardware platforms. Determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making. Develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates.\n\nCOMPUTATIONAL MODELS OF HUMAN BEHAVIOR:  \nResearch game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.  Develop software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.  Integrate cognitive and neuron-computational models of human learning."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.918"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "COGNITIVE SCIENCE OF LEARNING:  \nContinue research and associated efforts to assess advanced gaming technology for enhanced training. Continue experiments to validate automated performance assessment and after action reviews. Continue development a systematic program of applied research addressing unanswered questions regarding effective instructional strategies in artificially intelligent tutoring. Continue research the neurobiology of learning including integration of the role of white matter. Continue to develop games that incorporate artificial intelligence (AI) techniques to teach complex warfighter skills decision-making and problem solving. Continue work to develop optimal training strategies for intelligent jobs on mobile devices (e.g., IPad) and immersive environments for training interpersonal and leadership skills. Work to design and conduct experiment to assess training effectiveness of intelligent tutor for training ship handling skills. Continue efforts to design features and develop novel psychometric approaches to assess human performance in medical\/military simulations and simulators. Conduct field studies and user tests evaluating new features and job aiding tools. Continue research in computational neuron-models in the design of training systems. Conduct ongoing efforts to develop skill decay models for psychomotor, perceptual, and cognitive skills and refresher training strategies. Continue work to create intelligent avatars to interact with learners from different cultural, linguistic backgrounds, and preferences. Continue design scenarios generators that produce integrated (e.g.,individual and collective) training. Continue development of computational model for learning theory to drive design of instruction and continue research on individual differences.\n\nENHANCING WARFIGHTER COGNITIVE CAPABILITY:\nContinue research to understand the structural relations among the latent variables of short-term memory, working memory, executive attentional control, and fluid intelligence. Work to assess the improvement in recruit classification provided by the addition of measures of fluid intelligence and working memory. Continue efforts to understand the role of intrinsic motivation in facilitating the transfer of working memory training to other cognitive capabilities. Continue the study the efficacy of game-based brain training using hand-held (fieldable) hardware platforms. Continue work to determine the relationship between induced gains in fluid intelligence and cognitive adaptability and agility, considered from the perspective of military decision-making. Develop multi-agent based architectures for modeling human behavior, improve techniques for human cognitive and behavioral modeling, and create highly realistic simulated teammates.\n\nCOMPUTATIONAL MODELS OF HUMAN BEHAVIOR:  \nResearch game based training to more effectively enable better warfighter understanding of languages and cultures to enhance their regional expertise.  Continue development of software tools to facilitate building natural language tutorial dialogs for artificially intelligent tutoring.  Continue integration of cognitive and neuron-computational models of human learning."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "As discussed in Section A, there are a significant number of varied efforts within this PE. Each effort is measured against both technical and financial milestones. Each program effort and its projects are reviewed in depth for technical and transition performance against established goals. The Program Managers conduct routine site visits to performing organizations to assess programmatic and technical progress and most projects conduct an annual or biannual review by an independent board of visitors who assess the level and quality of the Science and Technology (S&T) basis for the project."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "4.836"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.836"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Items not included in other Projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.836"
                                        },
                                        "Text": {
                                            "val": "SOCIAL NETWORKING:  Analyze and develop social network models to create effective mitigation strategies of extremist groups.  \n\nUNDERSEA MEDICINE:  Mitigate the human challenges of the extreme maritime environment such as hyperbaric exposure, thermal regulation, nutrition\/hydration in the field and optimize physical fitness for performance and injury prevention."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Congressional Interest Items not included in other Projects."
                        }
                    }
                }
            ]
        }
    }
}