{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-3",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603004A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Advanced Technology"
        },
        "R1LineNumber": {
            "val": "33"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "198.245"
            },
            "CurrentYear": {
                "val": "84.079"
            },
            "BudgetYearOne": {
                "val": "102.686"
            },
            "BudgetYearOneBase": {
                "val": "102.686"
            },
            "BudgetYearTwo": {
                "val": "112.213"
            },
            "BudgetYearThree": {
                "val": "119.085"
            },
            "BudgetYearFour": {
                "val": "97.152"
            },
            "BudgetYearFive": {
                "val": "88.655"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "802.115"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures weapons and munitions components\/subsystems and demonstrates lethal weapons systems with potential to increase force application and force protection capabilities across the spectrum of operations. Project 232 focuses on affordable delivery of scalable effects for kinetic weapons and munitions including: artillery, mortars, medium caliber, tank fired, Soldier weapons and shoulder fired weapons. Project L96 matures and integrates critical high energy laser subsystems into mobile demonstrators to explore and validate system performance in relevant environments. Project L97 demonstrates performance of advanced obscurants and delivery of mechanisms and conducts forensic analysis of explosives and hazardous materials to enable detection.  \n\nWork in this PE is related to, and fully coordinated with, PE 0602120A (Sensors and Electronic Survivability), PE 0602307A (Advanced Weapons Technology), PE 0602618A (Ballistics Technology), PE 0602622A (Chemical, Smoke, and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603008A (Electronic Warfare Advanced Technology), and PE 0603313A (Missile and Rocket Advanced Technology).\n  \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Chief of Staff of the Army's (CSA's) future capability opportunities for leap-ahead technology for directed energy.\n  \nThe work in this PE is performed by the Army Research, Development and Engineering Command (RDECOM) and the United States Army Space and Missile Defense Command\/Army Forces Strategic Command (USASMDC\/ARSTRAT)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "68.714"
                },
                "CurrentYear": {
                    "val": "84.079"
                },
                "BudgetYearOne": {
                    "val": "85.808"
                },
                "BudgetYearOneBase": {
                    "val": "85.808"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "198.245"
                },
                "CurrentYear": {
                    "val": "84.079"
                },
                "BudgetYearOne": {
                    "val": "102.686"
                },
                "BudgetYearOneBase": {
                    "val": "102.686"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "129.531"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "16.878"
                },
                "BudgetYearOneBase": {
                    "val": "16.878"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "132"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.438"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "16.878"
                                },
                                "BudgetYearOneBase": {
                                    "val": "16.878"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.031"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increase in project 43A Adv Weaponry Tech Demo for small Unmanned Aerial System (UAS), high energy laser research (HEL), and survive and project indirect fires. FY19 funding increased in this PE to address higher priority Army Modernization efforts in the area of Long Range Precision Fires."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "232"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Lethality & Survivability Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "44.32"
                        },
                        "CurrentYear": {
                            "val": "54.977"
                        },
                        "BudgetYearOne": {
                            "val": "70.41"
                        },
                        "BudgetYearOneBase": {
                            "val": "70.41"
                        },
                        "BudgetYearTwo": {
                            "val": "76.071"
                        },
                        "BudgetYearThree": {
                            "val": "81.479"
                        },
                        "BudgetYearFour": {
                            "val": "59.065"
                        },
                        "BudgetYearFive": {
                            "val": "49.82"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "436.142"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for affordable precision munitions including advanced energetic materials and munitions, novel fuze designs, penetrators, and scalable effects. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n\nEfforts in this Project support the Lethality and Ground Maneuver portfolios."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Based Networked Munitions Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates technology for improved capability remotely delivered area denial munition systems to include: networked munition architecture, low hazard effects, delivery mechanisms, and non-lethal response to tampering."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.242"
                                            },
                                            "Text": {
                                                "val": "Mature the networked munition modular architecture for use in future Programs of Record; demonstrate technologies for non-kinetic energy vehicle stopping."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates ultra-high reliability fuzing, advanced kill mechanisms, and alternative dispensing technologies for 155mm artillery to provide increased battlefield lethality with reduced unexploded ordnance (UXO) compliant with the Department of Defense (DoD) cluster munitions policy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.434"
                                            },
                                            "Text": {
                                                "val": "Validate the systems beginning to end capability as well as the system's ability to improve effectiveness against the desired target sets; mature and demonstrate various component designs in a system level solution. The effort continues to improve and mature a variety of integrated unitary and submunition system concepts to mitigate the gap that will emerge with the loss of cluster munitions. Concepts such as a unitary projectile geared towards medium armor targets, a full bore submunition with a highly reliable triple function fuze, a concept that increases the size and fuze volume of the Dual Purpose Improved Conventional Munition (DPICM) bomblet and incorporates high reliability fuzing while maintaining the traditional lethal mechanisms of DPICM. In Fiscal Year (FY) 2017 the efforts optimize the concept of bomblet\/system design and component space allocation to accommodate system level development and demonstrating concept performance through modeling and simulation. Efforts mature system level designs of unitary solutions and improve initial system level performance. Efforts continue to mature designs and exploit alternate technologies to mitigate risk; develop evaluation criteria to assess concept performance; integrate component technologies into system level solution that are effective against target sets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate various materiel cluster munition components at the system and component level; evaluate effectiveness of materiel solutions; and optimize solutions to address desired target sets. Submunition concepts undergo extensive laboratory testing to ensure arming in proper environments and ensure fuzing reliability growth."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct ballistic testing with the objective of a TRL6 demonstration at the end of FY19 to validate performance of critical components such as fuzing and warheads; will optimize tests to capture as much pertinent data as possible to inform requirements generation; will mature and demonstrate the performance of integrated components through ballistic testing to show improvements over legacy systems and serve as a down-select to a tactical design; will generate documentation capturing the cluster munition effort relevant data to facilitate transition to PEO\/PM in support of the Cannon-Delivered Area Effects Munitions (C-DAEM) Program of Record."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium Caliber Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced medium caliber ammunition, weapon, fire control, and Ammunition Handling Systems (AHS) optimized for remote operation. This effort demonstrates cannon-super high elevation engagement, high performance stabilization, remote ammunition loading, weapon safety and reliability, improved lethality, accuracy, ability to fire a suite of ammunition from non-lethal to lethal, and escalation of force capability in one system."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.291"
                                            },
                                            "Text": {
                                                "val": "Validate PABM fuze technology and warhead lethality data, iterating and improving as necessary; using a commercially developed barrel, demonstrate PABM and AP effectiveness against personnel and materiel targets; design and fabricate 50mm weapon and AHS prototypes; exploit advances in advanced Fire Control hardware to improve system performance; mature Fire Control software."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "18.7"
                                            },
                                            "Text": {
                                                "val": "Validate weapon system integration with AHS and conduct fixed hardstand integration to support initial weapon system demonstration to optimize and improve weapon\/ammo performance prior to test bed turret integration; mature test bed turret designs to support weapon system integration; exploit data from initial weapon demonstration to improve fire control software performance that provides increased system accuracy; improve effectiveness and performance of PABM and AP munition against personnel and materiel targets; and continue to mature combat load AHS to support integration into test bed turret for TRL 6 integrated system demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.015"
                                            },
                                            "Text": {
                                                "val": "Will mature fire control software to support 50mm weapon system integration; will integrate complete weapon system into a test bed turret to mature and demonstrate test bed turret control systems and fire control ballistic solutions for optimized lethal performance; will validate simulated system analysis data against various target sets and provide feedback into fire control solutions for integrated system optimization; will complete an integrated (TRL 6) 50mm demonstration to validate the integrated system accuracy and lethal performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to component technologies mature and ready for a fixed stand integrated demonstration in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scale-up of Energetic Materials"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates the performance and insensitivity of energetic materials ranging from 25mm medium caliber (direct fire) through 155mm large caliber (indirect fire) weapons."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.4"
                                            },
                                            "Text": {
                                                "val": "Qualify energetic materials to provide complete material characterization to reduce technical risk when transitioning to end-item; continue to mature the advancement of nano-energetic formulations to validate nano-materials characteristics to provide substantially less shock sensitivity than current formulations while maintaining optimal performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will continue to qualify energetic materials for complete material characterization; will demonstrate high-energy, reduced sensitivity melt-pour formulations for enhanced fragmentation representative munitions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to completion of energetic materials and load projectiles characterization with new formulations to demonstrate enhanced lethal effects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection Armament Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort supports the Army's Active Protection System (APS) program to mature and demonstrate APS technologies to reduce vehicle weight while reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. This effort is done in coordination with efforts in Program Element (PE) 0602601A, PE 0602618A, PE 0603004A, PE 0603005A, PE 0603270A, and PE 0603313A."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.973"
                                            },
                                            "Text": {
                                                "val": "Develop and bench test critical mature subcomponents as well as use of existing performance and simulation models to validate Hard Kill modularity as a capability; determine subsystem integration requirements and optimize interface specifications to support a Modular APS Framework (MAF) compliant Hard Kill component; mature modularity of subsystem components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.25"
                                            },
                                            "Text": {
                                                "val": "Modify Hard Kill Counter Measure (HKCM) subsystems to be compliant to MAPS standards; integrate, simulate and demonstrate Modular APS performance capability given mission scenario sets. Performance measures include: threat detection, tracking, signal processing (Fire Control\/Modular APS Controller (MAC)) and threat defeat of rocket propelled grenades (RPGs) and recoilless rifles.  Optimize interface specifications to support layered demonstrator of MAPS compliant hard kill component."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.5"
                                            },
                                            "Text": {
                                                "val": "Will conduct demonstrations of mature Modular APS Framework (MAF)-compliant HKCM subsystems to validate modularity and performance optimization; provide mature technologies for integration in a MAF-compliant HKCM subsystem for a layered demonstration of combined Soft Kill and Hard Kill component technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to Hard Kill Counter Measure (HKCM) maturation and availability for demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery weapon system and projectile technologies that increase the range by 25% without an increase in platform weight."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.611"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and optimize initial long range artillery subsystems components and prototypes including cannon tube, breech and mount; and mature component designs of secondary weapon subsystems such as scavenge systems, diagnostics, and muzzle brakes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.7"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and optimize integrated long range artillery subsystems including the armament and lightweight trunnion support bracket and mature component designs of secondary weapon subsystems such as scavenge systems, elevation, equilibration, automated breech operation, and thermal warning; mature and demonstrate armament with emerging charge and projectile technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.778"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.778"
                                            },
                                            "Text": {
                                                "val": "Will optimize the design of secondary weapon subsystems such as scavenge systems, elevation, equilibration, automated breech operation, and thermal warning technologies; will demonstrate compact automatic ammunition handling and loading systems with armaments using emerging charge and projectile technologies for improved range and rate of fire performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to finalization of armament system components as well as automatic ammo loading technologies in time for a demonstration"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort integrates complementing navigation sensors, actuators and subsystems in order to demonstrate precision delivery capability on an indirect fire munition system in a global positioning system (GPS) denied environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.911"
                                            },
                                            "Text": {
                                                "val": "Fully integrate the optics, image processing, navigation and control components into a guidance system for testing on candidate airframes; demonstrate baseline performance initially in day-time \/ favorable weather; demonstrate full system survivability in extreme environmental  conditions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the integrated image based terminal guidance system on an indirect fire platform. The system demonstration shows the end to end functionality of the Guidance, Navigation, and Control (GNC) system?s ability to maintain <10m precision capability in a GPS denied environment. After this demonstration series, a Technical Readiness Assessment (TRA) is conducted to verify system at TRL-6."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A; effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Unmanned Aviation System (C-UAS) Technology"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates C-UAS technologies designed to encompass the entire kill chain including detection, tracking, classification, and kinetic defeat of UAS for point defense and mobile applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.581"
                                            },
                                            "Text": {
                                                "val": "Continue the maturation and optimization of technologies for UAS tracking and defeating to include the integration of precision fire control mechanisms and weapons systems; validate the technologies at the subsystem level and evaluate results of the UAS defeat mechanisms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.7"
                                            },
                                            "Text": {
                                                "val": "Integrate matured C-UAS technologies, to include precision fire control radar and small caliber munitions, onto a common weapons platform to form a system of systems for UAS detection, tracking, and defeat; perform system integration evaluations and validate the fire control radar and software for the UAS kill chain; update modeling and simulation tools based on collected data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.74"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.74"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate integrated small (0.50) caliber counter UAS technologies at a live fire event; will demonstrate the ability to track outgoing rounds and incorporate data into fire control solution; will mature and demonstrate guided medium caliber armament system initially created through DARPA effort to search, identify, track and intercept maneuvering threats; will improve fire control and guidance algorithms for C-UAS\/Air Defense scenarios; will optimize kinetic armament system components design for integration on a ground vehicle platform."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to fund efforts to validate radar technology capabilities and optimize integration of C-UAS system into a ground platform."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerated Extended Range  Munition Suite"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range artillery technologies including rocket and base bleed propulsion, hybrid lifting surfaces and guidance technologies which increase range and accuracy."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.676"
                                            },
                                            "Text": {
                                                "val": "Demonstrate designs of extended range rocket assisted projectiles fires with currently fielded weapon systems; optimize next generation rocket assisted projectile designs to increase lethality and range when fired with extended range cannon systems; optimize projectiles for use with advanced navigation, flight control, and guidance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.134"
                                            },
                                            "Text": {
                                                "val": "Continue to exploit, mature, and demonstrate enhanced lethality from rocket assisted projectiles using technology enablers to optimize extended range vs. lethality; demonstrate integration of lifting surfaces, advanced navigation, flight control, and guidance technologies to enable precision at greatly extended ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.872"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.872"
                                            },
                                            "Text": {
                                                "val": "Will mature and evaluate long range unitary artillery projectile components in the areas of precision, counter-measure, and payload technologies; will conduct system modeling and simulation to assess improved projectile performance by these technologies when fired from Extended Range Cannon Artillery (ERCA) cannon tube; will develop and test integration concepts and algorithms and refine guidance and navigation system design concepts at extended ranges in GPS-denied environments; will mature component development for cargo and effects munition compatible with legacy and ERCA in the following areas:   1) dispensing techniques and sensor for area effects to service precisely located targets ; 2) optimal formulations and characteristics for smoke and illumination payloads that maximize effectiveness ; and 3) survivability of cannon-launched terrain shaping munition for maximum area denial effects; will conduct critical design review of component technologies; will perform test and evaluation of key enabling component technologies; refine concepts for system integration; and will mature modeling and simulation concepts for subsequent validation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase to allow higher priority Army acceleration efforts in the area of Long Range Precision Fires."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technology for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes, and advanced fuze setting. These technologies will provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.72"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate airburst fuze technology systems for increased accuracy in multi-mode medium caliber rounds; demonstrate low-cost, in-line safety and arming systems for advanced warhead initiation schemes; improve multi-point initiation systems applicable to Insensitive Munitions; optimize next generation fuze setting methodologies to more efficiently transfer and store power and data to smart indirect fire projectiles. These technologies will continue to support the Joint Munitions Program Technical Coordinating Group (TCG-5 and TCG-10) and the Joint Fuze Technology Program (JFTP)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.86"
                                            },
                                            "Text": {
                                                "val": "Optimize and demonstrate reduced range error for increased accuracy in multi-mode medium caliber rounds; demonstrate advanced large caliber fuze setting technologies; and demonstrate advanced multi-point initiation systems and optimize advanced power systems for both fuze and munition systems. These technologies continue to support the Joint Munitions Program TCG-5 and TCG-10 and the Joint Fuze Technology Program (JFTP)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.434"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.434"
                                            },
                                            "Text": {
                                                "val": "Will conduct live fire (Mann Barrel) demonstration of several 30x173mm or Light Weight 50mm airburst rounds that demonstrate an increase in range accuracy when rounds are corrected; will conduct live fire demonstration of a 40mm round using a pre-timed airburst function and low cost Electronic Safe and Arming (ESAD); will conduct demo of the Precision Guided Kit in a 155mm projectile using the Next Gen Large Cal Setter; and will conduct demo of the extended run time thermal battery."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to integrated demo of TRL 6 enabling technologies for airburst, fuze setter, and thermal battery."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Small Arms Ballistic System"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates advanced small arms ballistic calculations output from advanced sensor input and optimized architecture for rifles integrated with optic and precision-optical wind sensing."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.83"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate optimized architecture for the precision-optical wind sensing; mature technologies to improve and increase probability of hit, exploiting advanced sensor data including downrange wind sensing, to provide ballistic corrections supporting Program Management (PM) Individual-Weapons platforms."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Tactical Multi-Purpose (ETMP) Hand Grenade"
                                    },
                                    "Description": {
                                        "val": "This effort develops a multi-purpose selectable lethal hand grenade that produces either fragmentation or blast overpressure effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.051"
                                            },
                                            "Text": {
                                                "val": "Optimize and refine the design of the subsystems (mode selector, fuze, warhead) based on the results of testing completed to date; integrate all the components into a system and conduct laboratory assessments leading up to a TRL 5 demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Develop and qualify the power source, which powers the electronic fuze system, at extreme temperature; design and qualify dual printed detonators; integrate power source and dual printed detonators into the system; conduct final TRL 5 demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A; effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Armament and Fire Control Integration"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates extended range Armament technologies including light weight Cannon and Mount structures, high efficiency recoil cylinders, common lower power fire control hardware, improved fire control software, and improved sensor to shooter communications which will increase range and accuracy."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.096"
                                            },
                                            "Text": {
                                                "val": "Begin to exploit, mature, and demonstrate enhanced light weight structures for cannon and mount components; mature and demonstrate common fire control hardware with improved software to improve accuracy at extended and current ranges."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.559"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.559"
                                            },
                                            "Text": {
                                                "val": "Will optimize enhanced light weight structures for cannon and mount components, will integrated controls and ammunition handling system; will exploit projectile tracking and guidance technologies to provide accuracy at extended ranges in global positioning system (GPS)-denied environments; will continue to mature and demonstrate advanced and common fire control hardware and software to increase accuracy and reduce logistic burden."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to maturation of armament system technologies and fire control hardware and software."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aviation Armament System Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates armament solutions adaptable to current aviation and future vertical lift applications in small caliber, medium caliber, counter measure technologies with a focus on light lethal aerodynamic systems."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.237"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate technology for a multi-role armaments solution on Future Vertical Lift aircraft system; improve fire control algorithms for holistic offensive and defensive fires for aviation; optimize weapon system for stowed and deployed operability and munitions with hard kill lethality at range for conventional and more challenging threats."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.512"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.512"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a Technology Readiness Level (TRL) 6 airburst munition with a selectable proximity airburst - point detonation fuze for the Apache AH-64E; will optimize critical ammunition technologies in areas of power generation, proximity sensor, and smart multi-mode fuzing to support the Apache AH-64E."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to efforts on the airburst ammunition and the proximity fuze."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Leader-Soldier Effects Tool Suite"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates fires and effects planning, coordination and execution tool suite for sensor to shooter and tactical application. Provides enhanced collaborative engagement capability of fielded and emerging battle command systems supporting PM Soldier Warrior and PM Mission Command Program of Record (POR) architectures."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.7"
                                            },
                                            "Text": {
                                                "val": "Demonstrate advance fires planning capabilities, specifically develop commander guidance matrix, battery defense application, and echelonment of fires capability that provides digitized tools for the commanders at various echelons; enhance current fires and effects planning tools such as howitzer platforms and dismounted units range cards as well as sector sketches, optimal weapon emplacement tools, and three-dimensional (3D) de-conflictions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort was realigned to higher priority Army Modernization efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Small Arms Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort will mature and demonstrate advanced small arms ballistic calculations from advanced sensor input and optimized architecture for the precision-optical wind system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.2"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate optimized architecture for the precision-optical wind system; mature technologies to improve and increase probability of hit, exploiting advanced sensor data including down-range wind sensing, to provide ballistic corrections supporting PM Individual-Weapons platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A; effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Line of Site Munition (ELOS)"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates a 120mm Tank fired ELOS Munition that counters the growing Anti-Tank Guided Missile (ATGM) threat at extended line of sight ranges beyond current capability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6"
                                            },
                                            "Text": {
                                                "val": "Will optimize an ELOS Munition Air Frame (projectile) design to include fin stabilization element, Seeker Unit, Guidance Electronics Unit (GEU), Canard Actuation System (CAS), Warhead, GNC (Guidance, Navigation, and Control) Software, Target Acquisition and Tracking Software, and Propulsion system; will integrate these components to validate their performance through a preprogram maneuver cannon fired experiment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A; effort begins in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "43A"
                    },
                    "ProjectTitle": {
                        "val": "ADV WEAPONRY TECH DEMO"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "132"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "132.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increases for Program increase ($42M); Weapons mounts ($2.5M); Accelerate extended range cannon artillery ($21M); Laser defense system for small UAS ($15M); Weapon effectiveness in urban engagement ($8.5M); Armament systems integration ($5M); High energy laser research ($38M)"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Advanced Weaponry Technology development."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "42"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapons mounts"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "2.5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Accelerate extended range cannon artillery"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "21"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Laser defense system for small UAS"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "15"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weapon effectiveness in urban engagement"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament system integration"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High energy laser research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "38"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L96"
                    },
                    "ProjectTitle": {
                        "val": "High Energy Laser Technology Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.179"
                        },
                        "CurrentYear": {
                            "val": "24.096"
                        },
                        "BudgetYearOne": {
                            "val": "26.253"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.253"
                        },
                        "BudgetYearTwo": {
                            "val": "30.169"
                        },
                        "BudgetYearThree": {
                            "val": "30.035"
                        },
                        "BudgetYearFour": {
                            "val": "30.736"
                        },
                        "BudgetYearFive": {
                            "val": "31.35"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "189.818"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates advanced technologies for future High Energy Laser (HEL) weapons technology.  The major effort under this project is the phased approach for mobile high power solid state laser (SSL) technology demonstrations that are traceable to the form, fit, and function requirements for a HEL weapon.  SSL technology has demonstrated the potential to engage and defeat rockets, artillery and mortars (RAM), UAVs, cruise missiles, sensors, and optics at tactically relevant ranges.  HELs are expected to complement conventional offensive and defensive weapons at a lower cost-per-shot than current systems and without the need to strategically, operationally, or tactically stockpile ordnance.  This effort utilizes a modular building block approach with open systems architecture to ensure growth, interoperability, and opportunity for technology insertions for maturation of laser, beam control, sensor\/radar, integration of power and thermal management subsystems, as well as Battle Management Command, Control, and Computers (BMC3). \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy and supports the Chief of Staff of the Army's (CSA's) future capability opportunities for leap-ahead technology for directed energy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Laser System Ruggedization"
                                    },
                                    "Description": {
                                        "val": "This effort ruggedizes laser systems for integration on Army platforms.  Ruggedization includes modifications of the laser system to withstand vibration, temperature, and contamination environments expected on various Army platforms, while ensuring platform volume, weight, and interface specifications are met. The laser system consists of laser devices, such as the laboratory laser devices developed under Program Element (PE) 0602307A, Project 042, and the prime power (PE 0603005A, Project 441), command and control and thermal management subsystems required for the laser device operation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.216"
                                            },
                                            "Text": {
                                                "val": "Will complete the ruggedization and preparation of platform to accept the 50 kW-class laser from Project 042; develop and integrate prime power and thermal management subsystems to support the 50 kW risk reduction testing in Fiscal Year (FY) 2018 and optimize the command and control subsystem to manage the new laser, power, and thermal management subsystems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.961"
                                            },
                                            "Text": {
                                                "val": "Complete ruggedization and modification of the High Energy Laser Mobile Test Truck (HELMTT) Beam Control System (BCS) and ruggedization of the Robust Electric Laser Initiative (RELI) 60 kW laser to enable integration. Complete the Demonstrator Initial Design Review (IDR) of the next generation pre-prototype High Energy Laser (HEL) weapon system. This IDR matures the design of the HEL system as part of the HEL Tactical Vehicle Demonstrator effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "19.138"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "19.138"
                                            },
                                            "Text": {
                                                "val": "Will complete Critical Design Review (CDR) for the High Energy Laser Tactical Vehicle Demonstrator (HEL TVD). This review will complete the design of the system and includes details of the laser subsystems interfaces with the platform, a Family of Medium Tactical Vehicles (FMTV). Will begin ruggedizing and assembling thermal management, electrical power, and battle management subsystems for the HEL TVD based on designs of the laser and beam control system designs developed under PE 0602307A, Project 042."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase is due to additional ruggedization effort on HEL TVD laser developed under 62307\/042 - High Efficiency Laser Development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Energy Laser Systems Integration and Mobile Demonstrations"
                                    },
                                    "Description": {
                                        "val": "This effort integrates a 50 kW-class laser from Project 042 into the existing mobile laser demonstrator platform that includes the ruggedized Beam Control System (BCS) built under the High Energy Laser (HEL) Technical Demonstration effort and other required subsystems to demonstrate weapon system performance. The goal is to demonstrate and evaluate performance of a complete mobile high energy laser system in a relevant environment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.963"
                                            },
                                            "Text": {
                                                "val": "Will begin integration of the ruggedized 50 kW class laser subsystems into an Army platform and perform functional verifications to validate system operation; coordinate with the national test range(s) and procure targets for a system risk reduction demonstration; demonstrate the 50 kW class configuration in the laboratory to verify the system meets the performance metrics prior to beginning integration on the Army platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.135"
                                            },
                                            "Text": {
                                                "val": "Complete planning for the 50 kW-class High Energy Laser Mobile Test Truck (HELMTT) system demonstration in FY 2018. Conduct risk reduction demonstration of the 50 kW-class integrated laser system on the HELMTT to validate system design and interfaces. Collect data to be used to verify lethality models on atmospheric propagation data. This effort is part of the HEL Tactical Vehicle Demonstrator effort."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.115"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.115"
                                            },
                                            "Text": {
                                                "val": "Will complete analysis of the FY18 HELMTT 50 kW-class system risk reduction demonstration. Will consolidate lessons learned from HELMTT demonstration to apply to High Energy Laser Tactical Vehicle Demonstrator (HEL TVD). Will begin preliminary planning for HEL TVD demonstration and define target requirements for FY22 demonstration.  Will initiate system demonstration performance prediction analysis based on HEL TVD predicted performance parameters."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to the High Energy Laser Mobile Test Truck FY18 demonstration is complete at end of FY18. This demonstration provides a knowledge point for the HEL TVD development. The HEL TVD FY22 demonstration effort is not initiated until FY21."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "L97"
                    },
                    "ProjectTitle": {
                        "val": "Smoke And Obscurants Advanced Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.746"
                        },
                        "CurrentYear": {
                            "val": "5.006"
                        },
                        "BudgetYearOne": {
                            "val": "6.023"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.023"
                        },
                        "BudgetYearTwo": {
                            "val": "5.973"
                        },
                        "BudgetYearThree": {
                            "val": "7.571"
                        },
                        "BudgetYearFour": {
                            "val": "7.351"
                        },
                        "BudgetYearFive": {
                            "val": "7.485"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "44.155"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Project matures and demonstrates obscurant technologies with potential to enhance personnel\/platform survivability by degrading threat force surveillance sensors and defeating the enemy's target acquisition devices, missile guidance, and directed energy weapons. Dissemination systems for new and improved obscurants are developed with the goal of providing efficient and safe screening of deployed forces. This Project also matures and demonstrates improved detection of explosives and hazardous materials by Soldiers and Small Units.\n\nWork in this Project is related to, and fully coordinated with, Program Element (PE) 0602622A (Chemical, Smoke and Equipment Defeating Technology) and PE 0603606A, Project 608 (Countermine & Barrier Development).   \n\nThis Project sustains Army Science and Technology efforts supporting the Ground Maneuver portfolio.\n   \nThe cited work is consistent with the Director, Defense Research and Engineering Strategic Plan, the Army Modernization Strategy, and the Army Science and Technology Master Plan."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Obscurant Enabling Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates the dissemination of new and advanced obscurants. This effort will support Modular Active Protection System (MAPS) in 0603005\/221."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.788"
                                            },
                                            "Text": {
                                                "val": "Will develop techniques for dissemination of new microwave obscurants and explore new microwave obscurant applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.866"
                                            },
                                            "Text": {
                                                "val": "Redesign and improve vehicle protection grenade cloud characteristics. Initiate particulate materials dissemination studies for the Screening Obscuration Module generator system. Explore obscurants? ability to defeat anti-tank guided missiles."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.873"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.873"
                                            },
                                            "Text": {
                                                "val": "Will assess existing and emerging obscurants and their dissemination in vehicle protection grenades.  Will initiate design efforts to integrate with MAPS system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Significant demonstrations will occur during this FY, as a result a significantly larger amount of funding is needed."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Forensic Analysis of Explosives"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and stand-off detection of explosives and homemade explosive (HME) precursors."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.033"
                                            },
                                            "Text": {
                                                "val": "Will evaluate prototype CFIS standalone instruments to ensure they are fully integrated and will meet the fingerprinting and chemical identification requirements for the Common Analytical Lab System (CALS). Additionally will advance Ultraviolet-Visible Near Infrared (UV-Vis-NIR) multispectral imaging for improved discrimination of target materials and substrates."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.134"
                                            },
                                            "Text": {
                                                "val": "Refine prototype Chemical Fingerprint Imaging System (CFIS) standalone instrument and compare with commercial off the shelf alternative on their ability meet the fingerprinting and chemical identification requirements for the Common Analytical Lab System (CALS). Evaluate spatially offset Raman prototype for the forensic analysis of explosive materials in opaque containers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.152"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.152"
                                            },
                                            "Text": {
                                                "val": "Will revise and develop 2nd Generation Chemical Fingerprint Imaging System (CFIS) prototype showing optimized detection performance including improved detection of trace explosive residues and other molecules on curved surfaces and detection algorithm for discrimination of target materials on complex backgrounds."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Detection Mechanisms for Contaminants"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates improved point and standoff detection of a wide range of hazardous materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.925"
                                            },
                                            "Text": {
                                                "val": "Will identify up to four on-board calibrants in order to improve the real time detection of the CED by an order of magnitude.  Will determine mobility values of the calibrants and target molecules used as detection parameters for algorithms in ion mobility spectra. Will establish dependence of detection parameters on water vapor and make a final recommendation to JPM-CA of most stable calibrant.  Will Implement new detection parameters in software.  Will demonstrate improved ionization of explosives using up to four chlorine based dopants. Will optimize and mature CED probe design to enhance the detection performance on explosives and other low volatility threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.006"
                                            },
                                            "Text": {
                                                "val": "Improve standoff detection capabilities for homemade and military explosives by developing advanced Raman detection algorithm emphasizing detection of trace explosives on surfaces. Conduct analysis of alternative solutions for solid state laser sources and spectrometer designs to enhance detection sensitivity. Integrate hardware and software improvements into existing commercial system for subsequent testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.998"
                                            },
                                            "Text": {
                                                "val": "Will investigate UV laser alternatives and spectrometer for trace explosives standoff detection system.  Will conduct technology assessment of trace explosives sensors through a field trial to evaluate sensor sensitivity and technical performance analysis."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Demonstration of existing prototypes to evaluate sensor sensitivity will require a slightly reduced amount of S&T Funds."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}