{
    "id": "2019-AirForce-PB-3600-MJBOOK-0-0-c3a203aa28182b60f61dc370dc004d262f4542c92e834cf238859eb5ffc78d51-16",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603199F"
        },
        "ProgramElementTitle": {
            "val": "Sustainment Science and Technology (S&T)"
        },
        "R1LineNumber": {
            "val": "17"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "19.994"
            },
            "CurrentYear": {
                "val": "22.811"
            },
            "BudgetYearOne": {
                "val": "15.150"
            },
            "BudgetYearOneBase": {
                "val": "15.150"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "16.249"
            },
            "BudgetYearThree": {
                "val": "16.938"
            },
            "BudgetYearFour": {
                "val": "17.731"
            },
            "BudgetYearFive": {
                "val": "18.324"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "20.636"
                },
                "CurrentYear": {
                    "val": "22.811"
                },
                "BudgetYearOne": {
                    "val": "23.217"
                },
                "BudgetYearOneBase": {
                    "val": "23.217"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "19.994"
                },
                "CurrentYear": {
                    "val": "22.811"
                },
                "BudgetYearOne": {
                    "val": "15.150"
                },
                "BudgetYearOneBase": {
                    "val": "15.150"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.642"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-8.067"
                },
                "BudgetYearOneBase": {
                    "val": "-8.067"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.642"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-8.067"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.067"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 due to realignment of composite certification work from PE 0603199F, Sustainment Science and Technology (S&T), Project 635351, Technology Sustainment, to PE 0603211F, Aerospace Technology Dev\/Demo, Project 634920, Flight Vehicle Tech Integration."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635351"
                    },
                    "ProjectTitle": {
                        "val": "Technology Sustainment"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.994"
                        },
                        "CurrentYear": {
                            "val": "22.811"
                        },
                        "BudgetYearOne": {
                            "val": "15.150"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.150"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "16.249"
                        },
                        "BudgetYearThree": {
                            "val": "16.938"
                        },
                        "BudgetYearFour": {
                            "val": "17.731"
                        },
                        "BudgetYearFive": {
                            "val": "18.324"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This program develops and demonstrates mature Air Force Research Laboratory (AFRL) sustainment technologies such as: materials, corrosion, maintenance\/repair techniques, state awareness\/non-destructive inspection, health management, life prediction, low observable materials and processes, composite materials and logistics for transition into fielded Air Force systems to reduce life cycle sustainment costs and increase readiness. Technologies matured and demonstrated impact affordability and availability of fielded aerospace weapon systems by reducing sustainment costs, extending service life, and maintaining  mission readiness and capability. This program develops and demonstrates maintenance, life cycle management, and system\/fleet decision making technologies that can be implemented to address operational sustainment issues and could influence future system sustainability decisions via risk reduction to support inclusion into new systems. Studies are conducted to analyze processes and methodologies for application of technologies to address sustainment issues across the force, identifying cross cutting applications for fielded systems, and opportunities for building in sustainability into future applications. This program also develops and demonstrates affordable advanced composites for aircraft structures of fielded and emerging systems.  This includes studies, analysis, and tests for application of composites to address sustainment and affordability issues across the force. Efforts in this program have been coordinated through the Department of Defense (DoD) Science and Technology (S&T) process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "System Health Management\/Assessment Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition state awareness\/system health management technologies. Conduct studies and analyses to design sustainability into future applications. The short-term tasks in this area are selected based on warfighter needs identified via a bi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.798"
                                            },
                                            "Text": {
                                                "val": "Continue development of diagnostic technology to monitor\/assess health of airframe\/engines and components. Continue health assessment capability development for fielded systems and components. Continue development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine and components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Text": {
                                                "val": "Complete demonstration of aircraft electrical systems maintenance testing capability. Continue health assessment capability development for fielded air\/space\/cyber systems and components. Continue development of diagnostic system to assess aircraft wiring and avionics subsystems. Continue development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine, launch vehicle, spacecraft, intercontinental ballistic missiles (ICBMs), and components. These efforts are in Air Force Air, Space, and Cyber mission areas. Initiate the following effort based on competitive selection in FY 2017: development of system to reduce maintenance requirements of F-35 carbon monoxide detection system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.171"
                                            },
                                            "Text": {
                                                "val": "Complete development of automated software release capability to assess and maintain system health. Continue development of diagnostic system to assess aircraft wiring and avionics subsystems. Continue development of system to reduce maintenance requirements of carbon monoxide detection system. Continue health assessments capability development for fielded air\/space\/cyber systems and components. Continue development and demonstration of diagnostic technology to monitor\/assess health of airframe\/engine, launch vehicle, spacecraft, intercontinental ballistic missiles (ICBMs), and components. These efforts are in Air Force Air, Space, and Cyber mission areas. Continue development of testing systems to assess aircraft electrical subsystems. Initiate new efforts based on competitive selection processes in FY 2018."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $ 0.154 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Prevention\/Enhanced Maintainability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden. The short-term tasks in this effort are selected based on warfighter needs identified via a bi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.868"
                                            },
                                            "Text": {
                                                "val": "Complete first LO articles. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, replacement, and concepts for performance improvement and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas. Continue development and transition of technologies that simplify training for maintainers and improving their performance. Continue airframe\/engine subsystem technology efforts. Continue solid state amplifier replacement for B-1B. Continue enhanced ester oil and integrally bladed rotor repair modeling. Continue thermal spray coating process."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.325"
                                            },
                                            "Text": {
                                                "val": "Complete advanced monopropellant material replacement for space propulsion systems. Complete transition of two full sized B-2 Radomes for functional ground testing and flight service evaluation. Continue Advanced Canopy Technology development. Initiate Rapid Repair Requirements materials development for aircraft battle damage repair of advanced fighter aircraft. Continue efforts to develop an adaptive maintainer training capability to improve maintainer performance, and an improved method for removal of biofilms from in ground fuel storage systems. Continue development of materials and processes to reduce maintenance burden on low observable systems. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition sustainment technologies to improve component design, maintenance, repair, replacement, and concepts for maintainer training, extending part life and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas.  Initiate the following effort based on competitive selection in FY 2017: development of materials and processes to reduce maintenance burden on low observable systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.171"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.171"
                                            },
                                            "Text": {
                                                "val": "Complete thermal spray coating process development for engine components. Complete development of an improved method for removal of biofilms from in ground fuel storage systems. Complete improved durability conductive tape and enhanced edge treatment repair development for transition to the B-2. Continue Rapid Repair Requirements materials development for aircraft battle damage repair of advanced fighter aircraftContinue Advanced Canopy Technology development. Initiate total body non-destructive evaluation system for outer mold line inspection of advanced fighter aircraft. Continue development of materials and processes to reduce maintenance burden on low observable systems. Continue efforts to demonstrate high reliability of repair and maintenance technologies to increase service time between maintenance actions. Continue to develop, demonstrate, and transition maintenance and sustainment technologies to improve component design, maintenance, repair, replacement, and concepts for maintainer training, extending part life, and reduced maintenance burden spanning Air Force Air, Space, and Cyber mission areas. Initiate new efforts based on competitive selection processes in FY 2018."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $ 0.154 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Management\/Improved Reliability Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate, and transition technologies to improve existing and new components, fleet management\/ decision-making tools, and supply chain\/sustainment infrastructure to decrease downtime and costs, and increase reliability. The short-term tasks in this effort are selected based on warfighter needs identified via a bi-annual, competitive process."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.504"
                                            },
                                            "Text": {
                                                "val": "Continue efforts to develop system fleet management decision-making tools, repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. Continue durable structure demonstrations. Continue C-5 corrosion project."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.144"
                                            },
                                            "Text": {
                                                "val": "Complete corrosion data management and prediction tool demonstration and development of replacement honeycomb structures for C-5. Continue data mining software development to determine asset availability. Continue effort to assess and accurately determine B-2 exhaust liner thermal profile and structural environment, and demonstrate performance of exhaust structures coatings. Continue software development to increase speed and accuracy of solid rocket motor inspections to reduce sustainment costs and improve reliability. Continue efforts to develop system fleet management decision-making tools, maintenance\/repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. These efforts span Air Force Air, Space, and Cyber mission areas.  Initiate the following effort based on competitive selection in FY 2017: analysis techniques to extend engine component service life."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.024"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.024"
                                            },
                                            "Text": {
                                                "val": "Complete data mining software development to determine asset availability. Continue effort to assess and accurately determine B-2 exhaust liner thermal profile and structural environment, and demonstrate performance of exhaust structures coatings. Continue software development to increase speed and accuracy of solid rocket motor inspections to reduce sustainment costs and improve reliability.  Continue development of analysis techniques to extend engine component service life. Continue efforts to develop system fleet management decision-making tools, maintenance\/repair data base technologies and techniques, and supply chain\/infrastructure approaches to reduce sustainment costs. These efforts span Air Force Air, Space, and Cyber mission areas. Initiate new efforts based on competitive selection processes in FY 2018."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $ 0.120 million. Justification for the decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Composite Certification"
                                    },
                                    "Description": {
                                        "val": "Develop, demonstrate and transition reliability-based design of advanced composites for aircraft structures. This includes studies and analysis of processes and methodologies for application of composites to address sustainment and affordability issues across the force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.824"
                                            },
                                            "Text": {
                                                "val": "Continue demonstration of manufacturing processes and manufacturing process control of composite primary structures. Complete demonstrating the feasibility of implementing a damage tolerant design approach for composite structures. Continue demonstration of the feasibility and benefits of a robust process for predicting and addressing the risk elements for safe and affordable certification of composite structures. Continue demonstration of life extension of a composite primary structure beyond that of the original certified service life. Complete assessment and designs of affordable low cost composite manufacturing methods and processes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.017"
                                            },
                                            "Text": {
                                                "val": "Complete demonstration of manufacturing processes and manufacturing process control of composite primary structures. Complete demonstration of the feasibility and benefits of a robust process for predicting and addressing the risk elements for safe and affordable certification of composite structures. Complete demonstration of life extension of a composite primary structure beyond that of the original certified service life. Initiate a service life extension demonstration on a legacy fleet aircraft composite part."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.784"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.784"
                                            },
                                            "Text": {
                                                "val": "Continue service life extension demonstration on a legacy fleet aircraft composite part."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $7.233 million.  Justification for this decrease is due to realignment of composite certification work from Program Element 0603199F to Program Element 0603211F, Project 634920, Advanced Aerospace Structures Technologies effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}