{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c6d4730c5f45a9998742a765fe5a52840fa01fae9e79d847b7e2f989ef6d2407-20",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_A-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603662D8Z"
        },
        "ProgramElementTitle": {
            "val": "Networked Communications Capability"
        },
        "R1LineNumber": {
            "val": "46"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "9.123"
            },
            "CurrentYear": {
                "val": "12.661"
            },
            "BudgetYearOne": {
                "val": "12.696"
            },
            "BudgetYearOneBase": {
                "val": "12.696"
            },
            "BudgetYearTwo": {
                "val": "2.866"
            },
            "BudgetYearThree": {
                "val": "2.920"
            },
            "BudgetYearFour": {
                "val": "2.973"
            },
            "BudgetYearFive": {
                "val": "3.027"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "Currently fielded satellite communications (SATCOM), terrestrial, and Tactical Data Links (TDLs) will be adversely affected during operations in contested Anti-Access\/Area-Denial (A2\/AD) environments.  The primary threat is from sophisticated electronic warfare capable of advanced jamming and signal collection techniques that are rapidly evolving to be more capable and agile.  Department of Defense (DoD) advances in smart sensors and smart weapons have an urgent need for more resilient networks than tactical data links of today.  In FY 2016, the Network Communications Capability Program (NCCP) returned with a new focus on developing enabling technologies for Joint assured communications networks.  The goals of this program are: to mitigate degradation across battlespace tiers and domains and to provide agility that will support the mission needs of Joint Functional Component Commanders, Joint Force Commanders, and deployed forces.\n \nThe DoD’s current TDLs platforms and capabilities are not sufficiently protected from emerging adversary threats and contain insufficient capacity for future needs.  In order to enable the promise of net-centric operations for the warfighter, the next generation of airborne, surface, and ground tactical networks must provide greater affordability, higher network capacity, greater durability against electronic attack, better network connectivity, and faster response times to the changing demands from airborne, maritime, and ground users.  Many line-of-sight (LOS), beyond LOS, and SATCOM waveforms have been integrated onto platforms for various missions.  These waveforms necessarily exhibit tradeoffs in target performance attributes including capacity, latency, protection, and complexity.  As a result, no single waveform capability will be able to satisfy all emerging mission needs emphasizing the need for interoperability and software defined waveforms.  The challenge is to understand the essential needs of the users, avoid needless redundancy, develop affordable capabilities, and integrate separate capabilities into a cohesive network.  This research will develop transformative technologies to ensure performance in contested A2\/AD environments by focusing on future communications networks that are a “leap ahead” of today’s capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.331"
                },
                "CurrentYear": {
                    "val": "12.661"
                },
                "BudgetYearOne": {
                    "val": "7.779"
                },
                "BudgetYearOneBase": {
                    "val": "7.779"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.123"
                },
                "CurrentYear": {
                    "val": "12.661"
                },
                "BudgetYearOne": {
                    "val": "12.696"
                },
                "BudgetYearOneBase": {
                    "val": "12.696"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.208"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "4.917"
                },
                "BudgetYearOneBase": {
                    "val": "4.917"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.197"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.010"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.001"
                                },
                                "BudgetYearOne": {
                                    "val": "5.002"
                                },
                                "BudgetYearOneBase": {
                                    "val": "5.002"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.085"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.085"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "663"
                    },
                    "ProjectTitle": {
                        "val": "Network Communications Analysis"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.123"
                        },
                        "CurrentYear": {
                            "val": "12.661"
                        },
                        "BudgetYearOne": {
                            "val": "12.696"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.696"
                        },
                        "BudgetYearTwo": {
                            "val": "2.866"
                        },
                        "BudgetYearThree": {
                            "val": "2.920"
                        },
                        "BudgetYearFour": {
                            "val": "2.973"
                        },
                        "BudgetYearFive": {
                            "val": "3.027"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In a contested environment, especially when conducting forward operations, platforms face a significant electronic warfare threat.  The primary threat is from advanced jamming, signal collection, and geolocation techniques that are rapidly evolving to be more capable and agile.  DoD advances in smart sensors and weapons demand robust tactical waveforms and networks with greater capacity but lower cost than communication links of today.\n\nThe Future Autonomous Battlespace RF with Integrated Communications (FABRIC) (formerly referred to as Robust Tactical Data Links Modernization (RTDLM)) program will develop next generation communications layer architecture for tactical networks for operations in anti-access\/area denial (A2\/AD) threat environments.  This architecture will deliver capacity and affordability to enable future smart sensors and smart weapons.  The network architecture will be flexible enough to support Commander’s Intent in any mission, environment, operating tactical platform, and weapon system under various threat conditions.  FABRIC’s efforts will focus on developing the advanced component technologies, such as Anti-Jam(AJ), Low Probability of Interference (LPI), Low Probability of Detection (LPD), and Low Probability of Exploitation (LPE) waveforms; adaptive processing algorithms; adaptive antenna technologies (transmit\/receive\/nulling); adaptive power control; Dynamic Spectrum Access (DSA)\/Dynamic Spectrum Management (DSM) techniques; self-healing mechanisms and cyber hardening; and advanced routing to ensure Quality of Service.  The guiding tenets for creating this new Command, Control, Communications, Computers, & Intelligence (C4I) capability encompass enabling new missions, i.e. providing  resilient tactical data links, communications and networking “service level” capabilities, interoperation, cost (affordable), and improved performance in terms of military value.\n\nBased on the developed thresholds and objectives for the required network architecture, the specific advanced component technologies were prioritized and form the foundation of the FABRIC design.  Through simulation and field experimentation, FABRIC will verify the technology in operationally relevant environments against representative threats, and facilitate the migration and transition of these technologies to service platforms, radios, and other combat mission systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Future Autonomous Battlespace RF with Integrated Communications (FABRIC)"
                                    },
                                    "Description": {
                                        "val": "The FABRIC program develops hardware, software, and algorithms to advance network technologies creating a robust tactical network to operate in contested A2\/AD environments.  The project will investigate and develop flexible, high performance, and affordable technologies for the tactical network, supporting capability changes as a mission progresses from phase to phase.  The project will develop and mature technologies to support direct transition of the algorithms, prototype implementations, waveform improvements, and system design improvements to radio, waveform, and weapon systems programs managed by each military department."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.123"
                                            },
                                            "Text": {
                                                "val": "FY 2017 focus areas include: \n\nModeling and Simulation Frameworks: Provide high performance computing modeling and simulation capability to support hardware, software, and scenario development.  \n-\tDefine means for models developed in VHSIC (Very High Speed Integrated Circuit) Hardware Description Language (VHDL), MATLAB, C, Network Simulator-3 (NS-3) or CREATE to share the modeled performance to other models as required. \n-\tEstablish NS-3 baseline simulations for sparse and dense scenarios with performance visualization \n-\tAugment NS-3 models for platform orientation (roll-pitch-yaw)\n-\tAssess performance and scalability of network simulation capabilities (as a function of the number of nodes, traffic loads, and the platforms executing)\n-\tDevelop a VHDL simulation environment to model and simulate FABRIC’s CHEETAH processor\n-\tDevelop and assess VHDL and Instruction Set Architecture (ISA) simulator performance.\n\nHardware and Software Development: Perform detailed design and performance assessment of critical expected software and hardware functions.\n-\tSelect a suitable software development environment of common tools including C, C++, and MATLAB to enable the development, exchange and validation of models of FABRIC processors, waveforms, networking functionality in order to establish interoperability for all relevant activities of the FABRIC development participants.  \n-\tAnalyze selection and optimization of the operating systems including real time extensions.\n-\tStudy the selection of cyber defense and information assurance and information management functions suitable for the processor.\n-\tPort the Orthogonal Frequency Division Multiplexing (OFDM) Waveform baseline and assess its performance on the CHEETAH processor.  \n-\tComplete detailed behavioral VHDL design of the processor.\n\nFunctionality Design and Development: Design and prototype beamforming, modem, and network hardware and software functions.\n-\tPerform the mechanical and electrical design of the Electronically Steerable Aperture (ESA)\n-\tDevelop and evaluate a baseline of directional networking protocols to meet the FABRIC design performance metrics.  \n-\tEstablish and assess OFDM waveform modem baseline and\/or alternatives\n-\tModel and simulate OFDM waveform acquisition, beam quality, and nulls with platform dynamics\n\nScenario Assessment: Assess system and mission performance in a variety of realistic operational scenarios by integrating the performance models from each hardware, software, and functional domain.\n-\tModel multiple scenario environments, concept of operations and network traffic flows through the use\/experimentation of static and dynamic engagement models\n-\tDefine design features of various platform nodes regarding the mission execution that are able to be adapted via software control interactions with or through FABRIC  as part of mission functionality in response to threat detection and re-plans.\n-\tCharacterize performance metrics of all levels of communications (physical, media access control, link, network, etc.)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.661"
                                            },
                                            "Text": {
                                                "val": "System Integration\n-\tDefine the overall system architecture.\n-\tDetermine integration benchmarks; design and execute integration tests.\n-\tConduct modeling and simulation of aperture and platform interactions.\n\nTransition Planning\n-\tIdentify and consolidate transition paths including performance requirements and constraints. \n-\tContinue to modify and mature variations of the A2\/AD related scenarios to identify performance parameters and potential transition opportunities.\n-\tDefine and execute scenarios in a mega-city environment and those that involve Electronic Warfare (EW), signals intelligence (SIGINT), RADAR or Precision\/Navigation\/Timing (PNT) functions interacting with FABRIC to include red electromagnetic interactions.\n\nModeling and Simulation\n-\tLeverage and integrate into the ns-3 network simulator, the Joint Semi-Automated Forces high level architecture framework, to allow utilization of the “Mega-city\/Jakarta” model.\n-\tExtend network protocols and modem performance into ns-3.\n\nAperture Development\n-\tDesign program baseline aperture(s) that provide directional 360° coverage by mid FY 2018.\n-\tDevelop thermal and electrical model of intended electronically steerable antennas with no power amplifiers. \n-\tConduct a study focusing on the low-cost manufacturing of an electronically scanned array (ESA).\n\nPrototyping and experimentation\n-\tCode and refine FABRIC directional networking functionality to enable measurements of performance in realistic mission environments.\n-\tLab-bench prototyping of the directional networking functionality (radio frequency (RF)) front-end and the ESA.\n\nHardware and Software Development\n-\tComplete detailed design of chip processor and fabricate through 14 nanometer trusted foundry. \n-\tContinue software and firmware development (development, optimization, verification & validation) to include completion of software modeling on the instruction set simulator.\n-\tCreate emulation framework in Defense Advanced Research Projects Agency's (DARPA) Arrays at Commercial Timescales (ACT) common module. \n-\tDevelop FABRIC software architecture.\n\nDirectional Networking Functionality\n-\tCode and refine FABRIC directional networking functionality to enable measurements of performance in realistic mission environments.\n-\tConduct performance and scalability analysis to inform upgrade recommendations.\n-\tBaseline upgrades (waveform, networking concepts, antenna management).\n-\tComplete ns-3 integration of channel, beamforming, modem, and other directional networking functionalities.\n-\tComplete modeling of system level controls, interfaces, and DARPA ACT modules."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.696"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.696"
                                            },
                                            "Text": {
                                                "val": "System Integration \n-\tComplete integration of the DARPA ACT chips with the chip processor emulation board.\n-\tComplete integration of major functional system elements and hardware\/software components (such as ESA, RF, and processing).\n-\tConstruct and exercise preliminary FABRIC network for system integration and validation.\n\nScenarios and Transition Planning \n-\tComplete implementation of the mega city scenario.\n-\tContinue to refine joint demonstration plans.\n-\tModify and mature variations of the A2\/AD related scenarios to match realistic performance parameters to align with Service transition partners.\n-\tExplore dynamic mission adjustments and communication interactions with realistic EW\/SIGINT\/RADAR\/PNT functions on various platforms.\n\nPrototyping, Lab, and Field Testing \n-\tComplete physical, low cost (with size, weight, and power considerations) phased array prototype.\n-\tDesign and execute lab and controlled field testing of beam forming capability at the Air Force Research Laboratory’s Stockbridge Controlled Contested Environment site.\n-\tEvaluate performance results during field testing against planned performance parameters and adjust accordingly.\n-\tPlan for a system field testing of the network supporting links to unmanned aerial vehicle platforms and nearby units operating in an urban\/dense environment.\n-\tIdentify deficiencies in hardware.\n\nHardware\/Software \n-\tProbe test processor chips for functionality.\n-\tDeliver processor chip design for fabrication (second run on trusted foundry). \n-\tComplete and maintain suite of software development tools such as libraries, compiler, assembler, linker, profiler, debugger, mission developer, executable code, and loader.\n-\tDeliver full baseline software stack; validate execution speed, latency, and operational resilience of software.\n-\tCode and port EW\/SIGINT\/RADAR\/PNT functions into software architecture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The FABRIC project will address capability gaps for Joint tactical data link networks by developing the technologies that the Military can incorporate in future platform and radio acquisitions.  The proposed experimentation, with field demonstrations and modeling, will increase the Technology Readiness Level (TRL) of critical technology components, suitable for transition to acquisition programs.  This will also provide DoD leadership with the supporting technical and cost details to identify candidate \"building blocks\" for timely incremental improvements."
                        },
                        "PerformanceMetrics": {
                            "val": "The Research, Development, Test, and Evaluation (RDT&E) goal for FABRIC is capability improvements that achieve greater than 70 percent “Buy-Back” of the tactical data link operational range and 80 percent of the area of operation lost in the A2\/AD environment.\n\n-  Enhanced Link Capacity: 10X-100X Faster\n-  Enhanced Connectivity: 4X-10X Network Neighbor Connections\n-  Enhanced Spatial\/Time Filtering: 4-7 Adaptive Nulls (Scenario Dependent)\n-  Receiver Based Mitigation: 20-30dB per Jammer Type (Scenario Dependent)\n-  Enhanced LPI\/LPD: 4X-10X Closer Range to Target with Same Percent LPI\/LPD\n-  Enhanced Network Scalability: 300-1000 nodes\n-  Low cost AESA systems: <$25K each\n\nAchieve significant DoD savings for radio modifications or integration into new terminals or platforms (economies of scale) as services share non-recurring development costs for common and successful TDL enhancements."
                        }
                    }
                }
            ]
        }
    }
}