{
    "id": "2019-TheJointStaff-PB-0400-MJBOOK-0-0-ffce3191c7eefb8562d2a34cc99fec96721f2a4642336d58234fb945beaef3c0-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-TJS-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_The_Joint_Staff_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "The Joint Staff",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605126J"
        },
        "ProgramElementTitle": {
            "val": "Joint Integrated Air & Missile Defense Organization (JIAMDO)"
        },
        "R1LineNumber": {
            "val": "144"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "The Joint Staff"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "310.130"
            },
            "PriorYear": {
                "val": "32.744"
            },
            "CurrentYear": {
                "val": "36.581"
            },
            "BudgetYearOne": {
                "val": "52.565"
            },
            "BudgetYearOneBase": {
                "val": "52.565"
            },
            "BudgetYearTwo": {
                "val": "56.162"
            },
            "BudgetYearThree": {
                "val": "58.042"
            },
            "BudgetYearFour": {
                "val": "61.601"
            },
            "BudgetYearFive": {
                "val": "66.601"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense chartered to plan, coordinate, and oversee Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community’s proponent for requirements and capabilities in IAMD, and is the joint IAMD proponent within the DoD’s resource allocation structures.  JIAMDO also leads IAMD mission and utility analysis, integrates IAMD within the force protection joint capability area, conducts evaluations, demonstrations of joint IAMD architectures, and provides advocacy for innovative, technically mature, and affordable solutions.  \n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in the development of the IAMD prioritized capabilities list and the global integrated IAMD assessment and analysis of the Ballistic Missile Defense System.  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues and technical oversight of homeland capability solutions."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "38.059"
                },
                "CurrentYear": {
                    "val": "36.581"
                },
                "BudgetYearOne": {
                    "val": "36.469"
                },
                "BudgetYearOneBase": {
                    "val": "36.469"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "32.744"
                },
                "CurrentYear": {
                    "val": "36.581"
                },
                "BudgetYearOne": {
                    "val": "52.565"
                },
                "BudgetYearOneBase": {
                    "val": "52.565"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.315"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "16.096"
                },
                "BudgetYearOneBase": {
                    "val": "16.096"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.015"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Decrease for Historical Underexecution"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.603"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.603"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2017 Request for Additional Appropriations Not Addressed"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-5.300"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Increase for Homeland"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "15.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "15.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Realignment from Procurement to RDT&E"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "0.099"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.099"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Increase for JRICM"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "4.600"
                                },
                                "BudgetYearOneBase": {
                                    "val": "4.600"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 Request for Additional Appropriations Not Addressed ($5.3M).\n\nJIAMDO Core (P001): In FY 2019, $.1M was realigned from Procurement to Core to support higher priority requirements.\n\nThe FY 2019 funding request was reduced by $1.8 million to account for the availability of prior year execution balances and rephased into FY 2020 and FY 2021.\n\nJIAMDO-Black Dart (P003): The FY 2019 funding request was reduced by $0.3 million to account for the availability of prior year execution balances and rephased into FY 2020 and FY 2021.\n\nJIAMDO-Joint Distributed Engineering Plant (P004): The FY 2019 funding request was reduced by $0.5 million to account for the availability of prior year execution balances and rephased into FY 2020 and FY 2021.\n\nJIAMDO-Nimble Fire (P005):  Increased funding for FY 2018 will be used to hold two large Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Additionally, funds will be used to improve electronic warfare, multi-spectral environment, advanced capability model, and space warfare. The FY 2019 funding request was reduced by $0.5 million to account for the availability of prior year execution balances and rephased into FY 2020 and FY 2021.\n\nJIAMDO-Combat Identification (P006): The FY 2019 funding request was reduced by $0.5 million to account for the availability of prior year execution balances and rephased into FY 2020 and FY 2021.\n\nJIAMDO-Homeland Defense Capabibility (P007): Further details are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Annual Report to Congress\n\nJIAMDO-Joint Regional Integrated Air and Missile Defense Capability (P008): Was separated into a new project for transparency purposes. The program was increased by $4.6 million in support of a critical follow-on Joint Regional IAMD Capability Mix (JRICM) II integrated and defense capability mix study."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "P001"
                    },
                    "ProjectTitle": {
                        "val": "Core"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "134.240"
                        },
                        "PriorYear": {
                            "val": "9.014"
                        },
                        "CurrentYear": {
                            "val": "9.343"
                        },
                        "BudgetYearOne": {
                            "val": "9.967"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.967"
                        },
                        "BudgetYearTwo": {
                            "val": "12.407"
                        },
                        "BudgetYearThree": {
                            "val": "12.351"
                        },
                        "BudgetYearFour": {
                            "val": "11.610"
                        },
                        "BudgetYearFive": {
                            "val": "11.610"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads IAMD mission area and utility analyses, integrates IAMD within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with USSTRATCOM and USNORTHCOM in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM, and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated IAMD Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Core"
                                    },
                                    "Description": {
                                        "val": "Provides staff support for JIAMDO operations in the area of ballistic missile defense, air and cruise missile defense, homeland defense, requirements management, combat identification, modeling & simulation, all other JIAMDO analytical functions and products, senior level briefings, and all travel costs for government and contractor support personnel (including Combatant Commander liaison personnel).  This includes performing analyses, demonstrations, and programmatic assessments of technology, operations, requirements, and weapons systems.  In coordination with Services and CCMDs, JIAMDO Core also funds the definition, assessment, development, and approval of Joint IAMD operational concepts, operational architectures, and capability requirements to guide the Department's joint\/interagency\/combined fully integrated and net-centric capable IAMD (including defense against cruise missiles, unmanned aerial vehicles, and ballistic missiles).  JIAMDO Core also provides funding to:\n\n1. Develop and integrate joint studies, simulations, wargames, force resource allocation, and interoperability initiatives.\n\n2. Manage relevant Congressional interaction and CCMD interface through a cadre of liaisons collocated with major headquarters.\n\n3. Directly support and sponsor homeland air surveillance-related demonstration and analysis activities.\n\n4. Run the IAMD Working Group and co-chair the Protection Functional Capabilities Board focusing CCMD, Joint Staff, and Service collaboration efforts in generation of joint concepts and development of the IAMD architecture and roadmap.\n\n5. Develop U.S. positions for, and provide the U.S. head of delegation to, the NATO Air and Missile Defense Committee.\n\nJIAMDO Core enables strategic planning development, infrastructure, security, travel, and other support activities.  Funding pays for: contracted Systems Engineering and Technical Assistance (SETA) support for Air & Cruise Missile Defense (ACMD), Ballistic Missile Defense (BMD), Homeland Air Security (HAS) strategic planning, studies & analysis, combat ID, modeling & simulation, all other JIAMDO analytical functions and products, senior level briefings, and all travel costs for government and contractor support personnel (including Combatant Commander liaison personnel). Additionally, the JIAMDO Core budget funds daily on-site security management personnel to meet DoD, National Industrial Security Program Operating Manual (NISPOM), and other security regulations, for all administrative and support functions related to higher security classifications, as well as basic office supplies and furniture, and classified\/unclassified data connections."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.014"
                                            },
                                            "Text": {
                                                "val": "Continue performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Pursue further changes in program support activities as a result of reorganization and office move to the Pentagon.  Ancillary support functions such as administrative, security, communications, Information Technology, and finance will no longer require JIAMDO funding as they will be provided by the JS. Systems Engineering and Technical Assistance contract will still be in place to provide necessary mission support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.343"
                                            },
                                            "Text": {
                                                "val": "Continue performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Continue DepSecDef high priority follow on assessment of non-kinetic and kinetic studies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.967"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.967"
                                            },
                                            "Text": {
                                                "val": "Performing Ballistic Missile Defense studies as directed by higher authority and provide contracted expertise in support of all JIAMDO analytical and requirements management activities.  Execute DepSecDef directed tasking for non-kinetic and kinetic layered defense modeling.  Continue support to Chairman’s Net Assessment, Joint Military Net Assessment and OSD Policy using analysis and study findings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Net increase between FY 2018 and FY 2019 due to a combination of internal realignment of funding to the Core for DepSecDef directed non-kinetic and kinetic studies, historical underexcution rephasement of funds into FY 2020 and FY 2021, and Major Headquarters Activities (MHA) reductions."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "(1) Support two major Nimble Fire exercises during FY 2019.\n\n(2) Conduct two IAMD Working Groups and at least one Functional Capabilities Board per month.\n\n(3) Conduct the annual Black Dart Counter-Unmanned Aerial System technology demonstration.\n\n(4) Support U.S. Representative to NATO Air Defense Council and Missile Defense Committee including two overseas meetings per year and numerous lower-level supporting functions.\n\n(5) Develop and maintain operational architecture compliance with DoD Architectural Framework (DODAF) standards.\n\n(6) Ensure 100% of all government employee travel is in accordance with the Joint Federal Travel Regulation\/Joint Travel Regulation and all contractor travel is in accordance with applicable regulations.\n\n(7) Maintain all unclassified\/classified LANs on a daily basis in accordance with the Joint Staff's Office of the Chief Information Officer guidance\/policy.\n\n(8) Ensure all computers, NIPRNET\/SIPRNET, are refreshed according to applicable policy\/guidance."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P003"
                    },
                    "ProjectTitle": {
                        "val": "Black Dart"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "25.483"
                        },
                        "PriorYear": {
                            "val": "3.000"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.500"
                        },
                        "BudgetYearThree": {
                            "val": "3.466"
                        },
                        "BudgetYearFour": {
                            "val": "3.366"
                        },
                        "BudgetYearFive": {
                            "val": "3.366"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads mission area and utility analyses for air and missile defense, integrates air and missile defense within the force protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Black Dart Counter Unmanned Aircraft Systems Technology Demonstration"
                                    },
                                    "Description": {
                                        "val": "Provides funding to support administration and execution of Black Dart demonstrations. Black Dart is a unique joint, interagency demonstration focusing on rapid development and implementation of Counter - Unmanned Aircraft Systems (C-UAS) technology from readily-available commercial and governmental products.  Objectives include:\n\n1. Execute live-fly, live-fire C-UAS technology demonstration to assess and validate existing and emerging Integrated Air and Missile Defense (IAMD) capabilities.\n\n2. Present emerging solutions to inform requirements decision-making.\n\n3. Identify and develop IAMD operational concepts, system interoperability, and operational architectures for the C-UAS mission set.\n\n4. Advocate for warfighters’ desired C-UAS capabilities and affordable, integrated solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue FY 2016 plans including: Demonstrate UAS capabilities to employ within visual range (WVR) and beyond visual range (BVR) weapons in a counter-UAS role.  Explore ‘On-the-Move’ capabilities.  Expand the breadth, complexity, and integration of cyber capabilities. Expand scenarios to include dynamic and contested electromagnetic spectrum."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Expand coalition partner participation and develop scenarios integrating systems across land, littoral, and maritime domains."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Continue stakeholder participation utilizing scenarios which are integrating systems across land, littoral, and maritime domains at venues to include Urban and sea-based scenarios.  Analyze and present results of Black Dart 18 to Joint Staff, Joint Requirements Oversight Council and stakeholders."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Complete events within schedule and budget. Events provide useful data to improve C-UAS capability.\n\n2. Document gaps, develop and substantiate hardware, software, and employment concepts.\n\n3. Field C-UAS capability."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P004"
                    },
                    "ProjectTitle": {
                        "val": "Joint Distributed Engineering Plant"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.248"
                        },
                        "PriorYear": {
                            "val": "2.500"
                        },
                        "CurrentYear": {
                            "val": "2.738"
                        },
                        "BudgetYearOne": {
                            "val": "1.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.000"
                        },
                        "BudgetYearTwo": {
                            "val": "1.800"
                        },
                        "BudgetYearThree": {
                            "val": "1.700"
                        },
                        "BudgetYearFour": {
                            "val": "1.500"
                        },
                        "BudgetYearFive": {
                            "val": "1.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense chartered to plan, coordinate, and oversee joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads mission area and utility analyses for air and missile defense, integrates air and missile defense within the force protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Distributed Engineering Plant (JDEP)"
                                    },
                                    "Description": {
                                        "val": "The JDEP is a tool for evaluating interoperability of developing or newly fielded systems; identifying interoperability deficiencies in existing systems; and verifying corrective actions in a controlled, repeatable environment through the use of hardware in the loop."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint\/coalition IAMD interoperability program and test event to link Service and Agency systems, providing test and evaluations to improve the Joint Common Tactical Airspace Picture (CTAP). Supervise and conduct a live, virtual and constructive test event utilizing real-world C-UAS data within a hardware-in-the-loop model to improve L16 network IAMD communications; determine IAMD capability requirements and verify architectures; improve interoperability and ensure IAMD of current weapon systems; and evaluate concepts of operations and tactics, techniques, and procedures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.738"
                                            },
                                            "Text": {
                                                "val": "Fund an appropriate joint distributed test event to assess the interoperability of joint IAMD weapons systems. Provide users the means to create family of systems environments by linking existing capabilities using hardware, software, and operator-in-the-loop. Link existing Service and Joint combat system engineering and test sites via distributed communications.  Reduce developmental cycle times by leveraging existing facilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "Fund multiple, distributed test events to assess the interoperability of joint IAMD weapons systems with a focus on C-UAS capabilities to counter the emerging threat of Group 1 and 2 UAS. Continue to leverage live-fly data of the Black Dart technology demonstrations to develop scenarios that replicate the future operational environments. JDEP will continue to link existing Service and joint combat system engineering and test sites via distributed communications, as well as, reduce developmental cycle times by leveraging existing facilities and infrastructure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A majority of the functions executed in this program have been absorbed under the Nimble Fire and Black Dart programs.  In addition, funding was reduced because of MHA reductions and transfer of funds to the Core program for higher priority requirements."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Each JDEP event develops measures of effectiveness (MOE) & measures of performance (MOP) based on an eighteen month test planning and event process.\n\n2. Complete events within schedule and budget. \n\n3. Events provide useful data to improve air missile defense interoperability, with implemented and recommended corrective changes.\n\n4. Events must be linked to the current approved IAMD architecture, provide joint benefit, contribute to joint interoperability, and address IAMD capability gaps."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P005"
                    },
                    "ProjectTitle": {
                        "val": "Nimble Fire"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "69.539"
                        },
                        "PriorYear": {
                            "val": "12.230"
                        },
                        "CurrentYear": {
                            "val": "16.000"
                        },
                        "BudgetYearOne": {
                            "val": "14.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.000"
                        },
                        "BudgetYearTwo": {
                            "val": "13.800"
                        },
                        "BudgetYearThree": {
                            "val": "12.850"
                        },
                        "BudgetYearFour": {
                            "val": "12.650"
                        },
                        "BudgetYearFive": {
                            "val": "12.650"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the United States. JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "JIAMDO Nimble Fire"
                                    },
                                    "Description": {
                                        "val": "Nimble Fire is the Department’s only joint IAMD operator-in-the-loop modeling and simulation capability exploring the Chairman's top five critical joint IAMD capabilities: wide-area surveillance and engagement quality tracking, pre-launch interdiction, non-kinetic post-launch capabilities, ballistic missile discrimination, and increased weapons ranges and lethality.  Nimble Fire events explore joint IAMD capabilities and concepts in the FYDP timeframe combining experienced operators from the tactical communities, virtual simulations accredited by the program offices, current and future advanced capabilities, an integrated air, ballistic and cruise missile threat, and informed scenarios from the Department’s analytical agenda and CCMD operational plans.  JIAMDO brings together stakeholders across the engineering, analytical, and tactical communities to conduct multiple events to assess Joint interoperability of Service and MDA programs of record, explore concepts of employment, inform tactics, techniques and procedures and concepts of operation, provide insights that help shape CCMD integrated priorities and future operational plans, and inform senior leader acquisition and requirements decisions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.230"
                                            },
                                            "Text": {
                                                "val": "Execute two Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Provide material support for two additional Service and\/or program office events.  Additionally, accomplish significant upgrades to the VWC environment and IAMD systems and capabilities:\n•\tElectronic Warfare improvements in coordination with USSTRATCOM, Joint Electromagnetic Preparedness for Advanced Combat (JEPAC), the Services and MDA to better model red and blue electronic attack and electronic protection, visualize impacts, and conduct analysis of its impact on the tactical fight.  E.g., Eagle Passive-Active Warning Survivability Systems (EPAWSS) for F-15, Integrated Defensive Electronic Countermeasures (IDECM) for F\/A-18E, Surface Electronic Warfare Improvement Program (SEWIP) for Aegis, basic electromagnetic interference effects, and foundation for representing GPS modeling\n•\tMulti-spectral Environment improvements include upgrading the simulation backbone and service models to better handle capabilities such as Infrared Search and Track (IRST) sensors and kill chains, environmental effects such as rain and clouds, and higher-fidelity threat signatures \n•\tAdvanced Capability Model improvements include expanded integrated fire control concepts involving capabilities such as Naval Integrated Fire Control – Counter Air (NIFC-CA) and fighter-centric kill chains, incorporation of advanced sensor capabilities such as the new IAMD Radar (AMDR) for Aegis, Link-16 network enhancements, future threat kill chains and capabilities, and directed energy.  Additionally, integrate an Advanced Gun Weapon System model into the environment to explore tactical command and control challenges and contributions to the overall defense of critical assets\n•\tSpace Warfare – integrate higher fidelity representations of Overhead Persistent Infrared (OPIR) assets and national to tactical (N2T) contributions to the tactical fight\n•\tNon-Program of Record Experimentation of innovative uses of existing sensors and weapons across traditional IAMD assets.  E.g., ground-based sensors providing fire-control quality tracking to tactical air assets, contributions of unmanned assets to the air picture and joint engagement sequence\n•\tExplore integration of offensive and defensive capabilities (kinetic and non-kinetic) in protection of select critical assets in USEUCOM"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "Execute two large Nimble Fire events in support of U.S. Fleet Forces Command, USPACOM, USSTRATCOM and USEUCOM.  Provide material support for two additional Service and\/or program office events.  Additionally, accomplish significant upgrades to the VWC environment and IAMD systems and capabilities:\n\n1. Electronic Warfare improvements in coordination with USSTRATCOM, Joint Electronic Preparedness for Advanced Combat (JEPAC), the Services and MIssile Defense Agency (MDA) to better model \"red\" and \"blue\" electronic attack and electronic protection.  Conduct analysis of electronic attack impact on: (1) F-15 Eagle Passive-Active Warning Survivability Systems (EPAWSS); (2) F\/A-18E Integrated Defensive Electronic Countermeasures (IDECM), Surface Electronic Warfare Improvement Program (SEWIP) for Aegis, basic electromagnetic interference effects, and foundation for representing GPS modeling.\n\n2. Multi-spectral environment improvements include upgrading the simulation backbone and service models to better handle capabilities such as Infrared Search and Track sensors, kill chains, environmental effects such as rain and clouds, and higher-fidelity threat signatures.\n \n3. Advanced capability model improvements include expanded integrated fire control concepts involving capabilities such as Naval Integrated Fire Control – Counter Air (NIFC-CA) and fighter-centric kill chains, incorporation of advanced sensor capabilities such as the new IAMD radar for Aegis, Link-16 network enhancements, future threat kill chains and capabilities, and directed energy.  Additionally, integrate an Advanced Gun Weapon System model into the environment to explore tactical command and control challenges and contributions to the overall defense of critical assets.\n\n4. Space Warfare – integrate higher fidelity representations of Overhead Persistent Infrared (OPIR) assets and national to tactical contributions to the tactical fight.\n\n5. Non-program of record experimentation of innovative uses of existing sensors and weapons across traditional IAMD assets.  Examples include: ground-based sensors providing fire-control quality tracking to tactical air assets; contributions of unmanned assets to the air picture; and joint engagement sequences.\n\n6. Explore integration of offensive and defensive capabilities (kinetic and non-kinetic) in protection of select critical assets in USEUCOM."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.000"
                                            },
                                            "Text": {
                                                "val": "Execute two Nimble Fire events in support of PACOM, STRATCOM, EUCOM, and MDA.  Provide material support for two additional Service and\/or program office events including Joint Counter-Air Integration (JCI) Joint Test.  Additionally, accomplish significant upgrades to the Virtual Warfare Center environment and IAMD systems and capabilities:\n\n1. Electronic Warfare improvements in coordination with USSTRATCOM, Joint Electronic Preparedness for Advanced Combat (JEPAC), the Services and Missile Defense Agency to better model \"red\" and \"blue\" electronic attack and electronic protection.  Conduct analysis of electronic attack impact on: (1) F-15 Eagle Passive-Active Warning Survivability Systems (EPAWSS); (2) F\/A-18E Integrated Defensive Electronic Countermeasures (IDECM), Surface Electronic Warfare Improvement Program (SEWIP) for Aegis, basic electromagnetic interference effects, and foundation for representing GPS modeling.\n\n2. Multi-spectral environment improvements include upgrading the simulation backbone and service models to better handle capabilities such as Infrared Search and Track sensors, kill chains, environmental effects such as rain and clouds, and higher-fidelity threat signatures.\n \n3. Advanced Capability Model improvements include expanded integrated fire control concepts involving capabilities such as Naval Integrated Fire Control – Counter Air (NIFC-CA) and fighter-centric kill chains, incorporation of advanced sensor capabilities such as the new Air and Missile Defense Radar (AMDR) for Aegis, Link-16 network enhancements, future threat kill chains and capabilities, and directed energy.\n\n4. Space Warfare – integrate higher fidelity representations of Overhead Persistent Infrared (OPIR) assets and national to tactical (N2T) contributions to the tactical fight.\n\n5. Non-program of record experimentation of innovative uses of existing sensors and weapons across traditional IAMD assets.  Examples include: ground-based sensors providing fire-control quality tracking to tactical air assets; contributions of unmanned assets to the air picture; and joint engagement sequences."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "A funding increase for FY 2018 and FY 2019 was provided over baseline funding during FY 2018 to enhance electronic warfare modeling and simulation at the Virtual Warfare Center. The amount of the increase in FY 2019 ($2M) was less than the increase in FY 2018 ($4M), resulting in an apparent funding decrease from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "1. Complete events within schedule and budget.\n\n2. Document gaps and shortfalls.\n\n3. Inform the Joint Capabilities Board (JCB) on results and findings.\n\n4. Specific details are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P006"
                    },
                    "ProjectTitle": {
                        "val": "Cruise Missile Combat Identification (CID)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "63.620"
                        },
                        "PriorYear": {
                            "val": "6.000"
                        },
                        "CurrentYear": {
                            "val": "5.500"
                        },
                        "BudgetYearOne": {
                            "val": "4.998"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.998"
                        },
                        "BudgetYearTwo": {
                            "val": "4.655"
                        },
                        "BudgetYearThree": {
                            "val": "4.675"
                        },
                        "BudgetYearFour": {
                            "val": "4.475"
                        },
                        "BudgetYearFive": {
                            "val": "4.475"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads AMD mission area and utility analyses, integrates air and missile defense within the Force Protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cruise Missile Combat Identification (CID)"
                                    },
                                    "Description": {
                                        "val": "Establishes joint requirements for emerging national and tactical combat identification technology and positions it for fielding to frontline weapon systems and the warfighter. Monitors, assesses, and enhances current joint air and cruise missile defense combat ID programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.500"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified and will be provided under a separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.998"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.998"
                                            },
                                            "Text": {
                                                "val": "Details of this program are classified and will be provided under a separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant change in funding."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details of this program are classified."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P007"
                    },
                    "ProjectTitle": {
                        "val": "Homeland Defense Capability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "15.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.000"
                        },
                        "BudgetYearThree": {
                            "val": "23.000"
                        },
                        "BudgetYearFour": {
                            "val": "28.000"
                        },
                        "BudgetYearFive": {
                            "val": "33.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "ProjectMissionDescription": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Homeland Defense Capability"
                                    },
                                    "Description": {
                                        "val": "Develop Homeland Defense Capability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.000"
                                            },
                                            "Text": {
                                                "val": "Perform technology development efforts. Further details are reported in accordance with with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JIAMDO tasked with management of project to develop additional homeland defense capabilities. Further details are reported in accordance with with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "This program is reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "P008"
                    },
                    "ProjectTitle": {
                        "val": "Joint Regional Integrated Air and Missile Defense Capability"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "4.600"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.600"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Joint Integrated Air and Missile Defense Organization (JIAMDO) is the organization within the Department of Defense (DoD) chartered to plan, coordinate, and oversee Joint Integrated Air and Missile Defense (IAMD) requirements, joint operational concepts, and operational architectures.  As part of the Joint Staff, JIAMDO supports the Chairman of the Joint Chiefs of Staff in meeting his Title 10 responsibilities as they relate to IAMD issues.  JIAMDO is the operational community's proponent for characteristics, requirements, and capabilities in IAMD, and is the joint IAMD proponent within the DoD's resource allocation structures.  JIAMDO also leads mission area and utility analyses for air and missile defense, integrates air and missile defense within the force protection joint capability area, and conducts evaluations and demonstrations of joint IAMD architectures and concepts.\n\nJIAMDO has established a close partnership with Combatant Commands (CCMDs) and maintains liaison offices at major CCMD locations to facilitate coordination of integration issues and requirements.  In particular, JIAMDO maintains close coordination with U.S. Strategic Command (USSTRATCOM) and U.S. Northern Command (USNORTHCOM) in support of ballistic missile defense of the U.S.  JIAMDO provides the CJCS and the Joint Requirements Oversight Council the ability to meet statutory responsibilities to review the cost, schedule, and performance criteria of Missile Defense Agency missile defense programs, and assesses the validity of those criteria in relation to national and military requirements.  At the request of USSTRATCOM and at the direction of the CJCS, JIAMDO supports USSTRATCOM in development of the IAMD Prioritized Capability List, the Global Integrated Air and Missile Defense Assessment, and analysis of the Ballistic Missile Defense System (BMDS).  JIAMDO supports the USSTRATCOM ballistic missile early warning mission by ensuring operational and technical requirements are integrated into the theater missile warning architecture.  JIAMDO also provides direct support to North American Aerospace Defense Command and USNORTHCOM for homeland air and cruise missile surveillance issues."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Joint Regional Integrated Air and Defense Capability Mix (JRICM)"
                                    },
                                    "Description": {
                                        "val": "Joint Regional Integrated Air and Defense Capability Mix (JRICM) will use analysis of adversary ballistic and cruise missile capabilities to determine if a layered missile defense can successfully degrade or defeat adversary missile attacks to extend base defense duration and maintain aircraft sortie generations rates. Funding will enable the study to proceed with support from the various government organizations and FFRDCs. Organizations will be funded to develop detailed analysis using modeling and simulation to study and evaluate attack operations, as well as defense capabilities in the 2023 timeframe."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.600"
                                            },
                                            "Text": {
                                                "val": "Conduct studies and analysis on air and missile defense capability mix. Deliveries will include briefings summarizing the impact that layered defense capabilities have on extending defense durations and aircraft sortie generation rate.  Specific details are classified and can be provided upon request."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Study funding approved based on current threat environment."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific details are classified and can be provided upon request."
                        }
                    }
                }
            ]
        }
    }
}