{
    "id": "2019-Navy-PB-1319-MJBOOK-3-0-1cb3285e5eb3096a00efd774d79545d93ed7b90effed5e9c90908e9fa9d3e340-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258N"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "184"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "34.021"
            },
            "CurrentYear": {
                "val": "23.053"
            },
            "BudgetYearOne": {
                "val": "10.981"
            },
            "BudgetYearOneBase": {
                "val": "10.981"
            },
            "BudgetYearTwo": {
                "val": "9.227"
            },
            "BudgetYearThree": {
                "val": "8.569"
            },
            "BudgetYearFour": {
                "val": "8.791"
            },
            "BudgetYearFive": {
                "val": "8.993"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds the development of Aerial Target Systems, Unmanned Aerial Vehicle targets, Sea Surface Target Systems, Target Control systems, and associated Target Mission Support Systems, Target Threat Simulation Program and Target Augmentation and Auxiliary Systems required to simulate real world threats.  These capabilities are required to execute developmental\/operational test and evaluation of naval combat weapon systems and to satisfy advanced fleet training requirements while ensuring the Navy continues to develop threat simulations of emerging threat requirements. \n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST AND EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "36.662"
                },
                "CurrentYear": {
                    "val": "23.053"
                },
                "BudgetYearOne": {
                    "val": "26.504"
                },
                "BudgetYearOneBase": {
                    "val": "26.504"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "34.021"
                },
                "CurrentYear": {
                    "val": "23.053"
                },
                "BudgetYearOne": {
                    "val": "10.981"
                },
                "BudgetYearOneBase": {
                    "val": "10.981"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.641"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-15.523"
                },
                "BudgetYearOneBase": {
                    "val": "-15.523"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.100"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.541"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-12.791"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-12.791"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.732"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.732"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request was reduced by $1.621 million to account for the availability of prior year execution balances.  \n\nFY 2019  decrease of $1.111 million due to rate and inflation changes. \n\nIn FY 2019, $12.791 million was realigned to WPN Line Item 2280 Aerial Targets in support of QF-16 Full Scale Aerial Target (FSAT) transition from RDTEN to WPN."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0609"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Target System Dev"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.682"
                        },
                        "CurrentYear": {
                            "val": "6.345"
                        },
                        "BudgetYearOne": {
                            "val": "9.658"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.658"
                        },
                        "BudgetYearTwo": {
                            "val": "7.874"
                        },
                        "BudgetYearThree": {
                            "val": "7.184"
                        },
                        "BudgetYearFour": {
                            "val": "7.377"
                        },
                        "BudgetYearFive": {
                            "val": "7.551"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The mission of the Aerial Target Systems Development program is the design and development of threat representative subsonic and supersonic aerial targets that simulate threat weapon systems, threat aircraft or threat Unmanned Aerial Vehicles.  In addition to representative air vehicles, this includes development of Target Control (TC) systems, and associated Target Augmentation and Auxiliary Systems (TA\/AS) which are used to replicate specific threats.  Targets and auxiliary payloads are developed to support test and evaluation of combat systems required to defend fleet surface and air units in a hostile environment.  As to specific hardware development, this project includes:\n\n - Supersonic Targets: GQM-163A Supersonic Sea-Skimming Target (SSST) and GQM-173A Multi-Stage Supersonic Target (MSST) program.  Supersonic targets represent supersonic anti-ship cruise missile threats.  The design and development of GQM-163A capabilities provide threat representative targets that are used in direct support of Developmental Test and Evaluation, Operational Test and Evaluation, and Live Fire Test and Evaluation of major combat weapons programs and, to a lesser degree, support fleet training.  Critical live-fire Test and Evaluation events are supported for AEGIS, DDG-1000, LHA-6, CVN-78, LCS, and LSD-41\/49 (SM-6, SM-2, RAM, SSDS, and ESSM).  GQM-163A is a non-recoverable supersonic sea skimming aerial target, capable of speeds in excess of Mach 2.5 and cruise altitudes from 13.0 to 66 ft.  The GQM-163A has also demonstrated a capability to perform a higher altitude diving threat profile.  MSST was a supersonic development effort that was terminated on September 25, 2015.  Once the contract termination costs have been determined by DCMA, funds may be required to cover settlement costs. New supersonic target developments efforts include a Rapid Prototype alternative ground launched target and a replacement target for AQM-37.  \n\n - Subsonic Targets: The BQM-177A SSAT development primarily represents subsonic anti-ship cruise missile threats, replacing legacy BQM-74E targets with a modernized subsonic target with increased capabilities.  The BQM-177A SSAT provides threat representation for developmental and operational test & evaluation events of major combat weapons systems programs and in support of fleet training events.  Specifically, the BQM-177A SSAT provides critical live-fire test and evaluation events for AEGIS, SM-6, SM-2, RAM, and ESSM.  \n\n - Target Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), and Target Control and Target Augmentation and Auxiliary Systems (TC\/TA\/AS) development: The TTSP provides the payload equipment required to electronically enhance aerial targets to provide threat representative radio frequency signatures, specifically the electronic attack and threat radar emissions (active emitters). Development of threat representative simulation components is on-going and required to keep pace with evolving threats and ensure that the Navy's threat simulation capabilities maintain warfighter readiness in the current environment. TC provides command and control of targets to enable the execution of threat-representative mission profiles.  The mission also includes the design, development and qualification of various TMSS including but not limited to: scalar scorers, scoring ground station, telemetry antennas, radar and locator beacons, identification, friend or foe, and associated test sets.  TA\/AS enables each target to be uniquely configured for specific mission profiles and provide high fidelity simulation of foreign threats.  TA\/AS-configured targets are used for radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement and testing, radar cross section evaluation, decoy-effectiveness testing, maneuver analysis, electronic warfare evaluation, warhead-effectiveness testing and evaluation of fleet tactics.  TA\/AS scoring capabilities include both surface and airborne scalar and vector scoring systems.\n\nIn addition to the design and development of target hardware and software, funding supports studies performed by a University Affiliated Research Center (UARC) to specify and verify needed target performance for future target development.  For the design and validation of targets under development, the UARC will provide engineering studies in areas such as structures, controls, guidance, and propulsion.  For those hardware and software items presently under development by commercial vendors, the UARC will provide oversight and validation of vendor design and development approach."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Supersonic Targets - Development & Upgrades of Supersonic targets"
                                    },
                                    "Description": {
                                        "val": "Provides funding for the development of GQM-163A upgrades\/evolutionary development to keep pace with evolving threat characteristics. Efforts include continued development of performance envelope characteristics to include flight termination performance, enhanced speed and distance capabilities and multiple target launch capability.  Funding will also support the development of other unique supersonic targets as required, and the close out of the GQM-173 development effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the GQM-163A Supersonic Sea Skimming Targets multiple target launch capability development, which provided the required improvements in the current infrastructure of the launch platforms, to accommodate the increased number of targets to as many as six. Continued Radome and Radar Altimeter design and development efforts and Orbital Front End System space allocation studies for SSST.  Supported the development and test of other unique supersonic targets as required."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continued the GQM-163A Supersonic Sea Skimming Targets multiple target launch capability, which provided the required improvements in the current infrastructure of the launch capability to accommodate the increased number of targets to as many as six. Continued Radome, and Radar Altimeter design and development efforts and integration of Joint Advanced Missile Instrumentation (JAMI), Joint Target Integrated Module (JTIM), and Front End System space allocation studies for SSST. Commenced the development of deployable chaff dispensing capability. Initiated design and development of Electronic Attack (EA) payloads and enhanced flight performance capabilities.  Continue to support the development and test of other unique supersonic targets as required."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.229"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue the GQM-163A Supersonic Sea Skimming Targets improvement and increased capability efforts.  Complete Radome and Radar Altimeter design and development efforts, integration of Joint Advanced Missile Instrumentation (JAMI), Joint Target Integrated Module (JTIM), and Orbital Front End System space allocation studies for SSST. Continue to support the development and test of other unique supersonic targets as required."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Subsonic Targets - Development of subsonic aerial targets with increased capabilities"
                                    },
                                    "Description": {
                                        "val": "A Subsonic Aerial Target (SSAT)  replacement air vehicle, for the currently fielded BQM-74E target no longer in production, is required. The BQM-177A is a modernized subsonic target with increased capabilities providing realistic threat representation in support of critical live-fire Test and Evaluation events for major weapons systems and Fleet combat training.  The target features increased capabilities to include higher speed, longer range, lower cruise altitudes and greater maneuverability. Other subsonic target alternatives are being explored, including the BQM-74G."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.244"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Completed Milestone C\/procurement decision and awarded the Low Rate Initial Production (LRIP) 1 contract to support an Initial Operational Capability (IOC) decision planned for FY 2018. Funded continued EMD & NRE support from the OEM. Continued Navy led flight testing. Continued to review final design documents and perform required target characteristic testing to support key performance parameters and attributes. Provided government program management, engineering, training, test and logistics support and contract support services towards the Engineering, Manufacturing, and Development (EMD) efforts including but not limited to engineering and system verification reviews, initial shipboard suitability testing, radome redesign, RATO\/JATO qualification efforts, and component qualification testing. Commenced analysis of BQM-74G to satisfy subsonic target requirements.  $8.6M was internally reprogrammed from PU 0610 to PU 0609.  The reprogramming addressed the aforementioned N94\/DoN priority BQM-177A development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.912"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Complete Navy led flight testing. Continue to fund OEM EMD & NRE support. Provide government program management, engineering, test and logistics support and contract support services towards IOC and Full Rate Production (FRP) decisions. Support additional RATO\/JATO qualification efforts as required for safety of operations. Continue engineering, and manufacturing, training, logistics and test efforts of the BQM-177A SSAT for transition to LRIP 2 and FRP. Continue training and logistics requirements towards Full Operational Capability (FOC) including shipboard qualification and operations. Continue initial shipboard suitability testing and qualification efforts. Complete system validation and verification efforts and conduct production verification flight tests. Conduct Physical Configuration Audit for baseline configuration and support initial efforts for incorporating Engineering Change Proposals in the baseline design configuration. Continue studies & development efforts on other subsonic target alternatives including the BQM-74G."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to prepare for a Full Rate Production (FRP) contract award and obtain support of a FRP decision. Complete the Weapon System Explosive Safety Review Board (WSESRB) for approval of shipboard operations. Conduct required shipboard suitability testing in preparation of Full Operational Capability (FOC). Provide government program management, engineering, test and logistics support and contract support services towards FRP decision and contract award. Continue engineering, manufacturing, training, logistics and test efforts of the BQM-177A SSAT for transition to FRP. Continue training and logistics requirements towards FOC including shipboard qualification and operations. Incorporate Engineering Change Proposals and modernizations in the baseline design configuration as mission and threats evolve. Continue studies & development efforts on other subsonic target alternatives, including the BQM-74G."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increase of $0.088M is attributed to inflation and anticipated ECPs & modernizations in the baseline configuration of the BQM-177A."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Target Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), Target Control (TC) and Target Augmentation and Auxiliary Systems (TA\/AS)"
                                    },
                                    "Description": {
                                        "val": "Continue to support the development of Target Control (TC) systems and TA\/AS capable of supporting Test and Evaluation (T&E) and fleet training activities to ensure emerging threat simulation requirements are met.  Target Control Systems (TCS) involves the improved command and control systems capable of controlling multiple targets simultaneously while delivering adequate fidelity of T&E telemetry data.  The TMSS program provides target control, scoring, location, and navigation of air, land and seaborne targets for fleet training and weapons systems test and evaluation.  Continue to support design, development and qualification of TMSS including but not limited to the current and next generation TC systems, scalar scorers, scoring ground station, telemetry antennas, radar and locator beacons, identification friend or foe and associated test sets.  Augmentation and auxiliary systems must be capable of augmenting targets in support of radar acquisition test, electronic countermeasures (jamming) evaluation, infrared measurement\/test, radar cross section evaluation, decoy effectiveness, maneuver analysis, electronic warfare, warhead effectiveness and evaluation of fleet tactics, readiness, and training.  The TTSP provides the payload equipment required to electronically enhance aerial\/surface targets to provide threat representative Radio Frequency signatures, specifically the Electronic Attack and Threat Radar Emissions (Active Emitters).  The TTSP accomplishes this by providing a collection of modules which are integrated into individual targets in various configurations to provide the ability to simulate the RF environment.  TTSP equipment in various configurations is certified for carriage in aerial\/surface targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.238"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Development, prototype, and integration of threat electronic attack & active emitter simulators to ensure the fleet meets emerging threat simulation requirements. Developed threat electronic attack simulation capabilities to address shortfalls identified in the FY 2015 Top 20 threat listing.  Developed improved high peak power pulsed and pulsed Doppler emitter simulation capabilities. Gathered and exploited threat intelligence. Continued to support design, development and qualification of various TMSS including but not limited to TCS Radio Frequency Subsystem (SNTC BLK 3), the legacy frequency upgrade, DSQ-50A Scalar Scorer, AN\/DPN-90 Radar Beacon, & the GSQ-106C."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.204"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators to ensure the fleet meets emerging threat requirements.  Develop threat electronic attack simulation capabilities to address shortfalls identified in the FY 2017 Top 20 threat listing.  Develop improved high peak power pulsed and pulsed Doppler emitter simulation capabilities. Gather and exploit threat intelligence. Continue to support the design, development and qualification of various TMSS equipment, such as the TCS Radio Frequency Subsystem (SNTC BLK 3). Begin development of the SNTC BLK 3a Ground Control Station with associated hardware and software upgrades. Continue development of the replacement DSQ-50A Scalar Scorer and its associated Ground Telemetry Station, as well as the replacement AN\/DPN-90 Radar Beacon."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.429"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue development, prototype and integration of threat electronic attack & active emitter simulators to ensure the Fleet meets emerging threat requirements. Gather and exploit threat intelligence. Begin fielding of the TCS Radio Frequency Subsystem (SNTC BLK 3) upgrade hardware. Continue development and qualification of the SNTC BLK 3a Ground Control Station with associated hardware and software upgrades. Field the DSQ-50A Scalar Scorer and its associated Ground Telemetry Station. Field the replacement AN\/DPN-90 Radar Beacon. Begin development AN\/DPN-88 Identify, Friend or Foe (IFF) replacement for fielding in FY 2020. Begin acquisition planning for a replacement TDU-32 Tow Banner in support of Fleet Aerial Gunner Training."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase of $3.225M in FY 2019 is attributed to the payload development required for IOC\/FOC of the BQM-177A and for other targets to keep pace with evolving and emerging threats."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 2280"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "138.784"
                                        },
                                        "CurrentYear": {
                                            "val": "124.757"
                                        },
                                        "BudgetYearOne": {
                                            "val": "143.637"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "137.137"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "6.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "150.798"
                                        },
                                        "BudgetYearThree": {
                                            "val": "181.031"
                                        },
                                        "BudgetYearFour": {
                                            "val": "178.105"
                                        },
                                        "BudgetYearFive": {
                                            "val": "181.844"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Supersonics: The GQM-163A Supersonic Sea-Skimming Target (SSST) is an Acquisition Category II program. Development strategy includes the continued development of the Quad Launch capability. The SSST program development efforts also include the development and design efforts for a new Radome and Radar Altimeter and other Engineering Change Proposals as required to emulate emerging threat systems. These development efforts will continue to be rolled into the production baseline. Production efforts are expected to continue at higher quantities in order to meet projected MDAP T&E requirements. Additionally, development of alternative supersonic targets is being explored.  \n\nCongress was notified on September 25, 2015 that the Department of the Navy made the decision to terminate the Multi-Stage Supersonic Target (MSST) development program. Termination settlement efforts are ongoing with DCMA.\n\nSubsonics: The Subsonic Aerial Target (SSAT) program is an Acquisition Category IVM program. The EMD contract was awarded to an OEM that proposed a BQM-177A as the vehicle to satisfy the identified requirements for a new SSAT.  It is currently undergoing developmental testing with Critical Design Review, Test Readiness Review \/ Flight Readiness Review completed in FY16 and Milestone C completed in 1st Quarter FY17. The Low Rate Initial Production (LRIP) 1 option contract was awarded 28 June 2017 and the second pre-negotiated option, LRIP 2, is scheduled to award in 2nd Quarter FY18. IOC is scheduled for 4th Quarter FY18 and the program will transition to Full Rate Production (FRP) in FY19. \n\nTarget Threat Simulation Program (TTSP), Target Mission Support Systems (TMSS), Target Control, and Target Augmentation and Auxiliary Systems: TTSP will continue to award contracts to support the development of electronic attack & threat radar simulations, ensuring the fleet requirement for simulations of emerging threats is met. Additional contracts will be awarded to support the development and design of TMSS upgrades, including but not limited to the current and next generation Target Control Systems, Scalar Scorers, Scoring Ground Station, Telemetry Antennas, Radar and Locator Beacons, Identification Friend or Foe and associated test sets."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT         PERFORMANCE REQUIREMENT               OBJECTIVE                       THRESHOLD                  TEST RESULT\n\n BQM-177           Maximum Speed at Low Altitude              0.95 M @ 6.6 ft @              0.90 M @ 10.0 ft @           TBD\n EMD               [Mach(M) at feet (ft) above wave           Sea State 5                    Sea State 3                                                                                                                                                                                                              crest at WMO Sea State conditions]"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0610"
                    },
                    "ProjectTitle": {
                        "val": "Wpn Sys T&E Trng Dev\/Proc"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.081"
                        },
                        "CurrentYear": {
                            "val": "15.415"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "28.496"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project provides for the development and procurement of aerial targets and associated systems. These systems are used exclusively for test and evaluation of naval weapons systems, which closely represent current and projected threats to fleet units in the joint strike and the littoral warfare environments. These threat representations must include characteristics in relation to size, performance envelope, and electromagnetic and infrared signatures. As threats evolve, changes must be made to keep the targets threat representative in response to increased complexity  in the test requirements from the developers of naval weapons systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "QF-16 Full-Scale Aerial Target (FSAT)"
                                    },
                                    "Description": {
                                        "val": "The QF-16 FSAT is being developed as a 4th generation, full scale, threat representative target providing a replacement for the FSAT\/QF-4 and are maintained and operated by the Air Force.  The QF-16 FSAT is a converted F-16 aircraft that provides a supersonic, high altitude, remote-controlled aerial target.  This target will have full command and control capability through normal flight envelopes.  The QF-16 FSAT target presentations will support aircraft and weapons systems testing and development, including that of the Joint Strike Fighter, AIM-9X Sidewinder missile, AIM-120 Advanced Medium Range Air-to-Air Missile, and Standard Missile-6."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.081"
                                            },
                                            "Articles": {
                                                "val": "5"
                                            },
                                            "Text": {
                                                "val": "The USN provided incremental funding towards the procurement of five (5) Lot five (5) QF-16 FSAT test assets to be delivered 3rd Quarter FY 2021. Continued regeneration of engines and airframes and drone conversion of QF-16 FSAT aircraft retrieved from Davis Monthan AFB storage. Investigated the ability to conduct QF-16 operations at the Navy's West Coast Sea Test Range.  $8.6M was internally reprogrammed from PU 0610 to PU 0609.  The reprogramming addressed a N94\/DoN priority to fund BQM-177A Engineering, Manufacturing, and Development (EMD) efforts including but not limited to, Navy led DT-B2 flight testing, component qualification testing, engineering and system verification reviews, and nonrecurring engineering BQM-177A development efforts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.415"
                                            },
                                            "Articles": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Work with the Air Force to develop the Memorandum of Agreement for QF-16 Lot 6-8 procurement. Provide incremental funding to complete the procurement of the five (5) Lot five (5) QF-16 FSAT test assets to be delivered 3rd Quarter FY21. Procure three (3) QF-16 FSAT test assets. Conduct regeneration of engines and airframes and drone conversion of QF-16 FSAT aircraft retrieved from Davis Monthan AFB storage. A FSAT Gulf Range Drone Control Station (GRDCS) demonstration planned to be held March 2018 at NAS Pt. Mugu"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "FY 2019 funds were reprogrammed to the Weapons Procurement, Navy (WPN) appropriation (BLI 2280)."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "$15.415M decrease from FY 2018 to FY 2019 is due to the realignment of QF-16 funding from Research Development Test & Evaluation, Navy to WPN LI 2280 Aerial Targets commencing in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "WPN 2280"
                                    },
                                    "Title": {
                                        "val": "Aerial Targets"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "138.784"
                                        },
                                        "CurrentYear": {
                                            "val": "124.757"
                                        },
                                        "BudgetYearOne": {
                                            "val": "143.637"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "137.137"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "6.500"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "150.798"
                                        },
                                        "BudgetYearThree": {
                                            "val": "181.031"
                                        },
                                        "BudgetYearFour": {
                                            "val": "178.105"
                                        },
                                        "BudgetYearFive": {
                                            "val": "181.844"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A Memorandum of Agreement (MOA) for Lots 6-8 is being developed between the United States Navy (USN) and the United States Air Force (USAF) for the QF-16 Full-Scale Aerial Target Program (FSAT). Milestone C was achieved in 1st Quarter FY14 and Initial Operating Capability was achieved 4th Quarter FY 2016. FOC is planned for FY 2018. Commencing in FY 2019, the QF-16 program will be reprogrammed to a WPN program."
                        },
                        "PerformanceMetrics": {
                            "val": "EFFORT          PERFORMANCE REQUIREMENT                OBJECTIVE                 THRESHOLD             TEST RESULT\n\nQF-16                Drone Mission Performance                           Achieve requirement         Threshold=objective       TBD          \nFSAT                    Payload Integration                                       Achieve requirement    Threshold=objective      TBD \nSuperiority            carry, operation & monitoring TEMS,\nTarget                  ALE-47, AIM-9, ALQ-188, ALQ-167 ALE-56 & 300 Gallon Fuel Tank"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0612"
                    },
                    "ProjectTitle": {
                        "val": "Surface Targets Development"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "1.258"
                        },
                        "CurrentYear": {
                            "val": "1.293"
                        },
                        "BudgetYearOne": {
                            "val": "1.323"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.323"
                        },
                        "BudgetYearTwo": {
                            "val": "1.353"
                        },
                        "BudgetYearThree": {
                            "val": "1.385"
                        },
                        "BudgetYearFour": {
                            "val": "1.414"
                        },
                        "BudgetYearFive": {
                            "val": "1.442"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops seaborne targets and their related target augmentation systems in support of air-to-surface and surface-to-surface weapons test and evaluation and fleet training."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Surface Targets Development"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.258"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Developed graphical user interface (GUI) for target formation control during swarm training and test and evaluation exercises. Integrated and tested surface target collision avoidance hardware and software algorithms. Developed and implemented additional on-screen graphics to support complex target presentations. Measured and populated data in stability software tool to include Mobile Ship Target (MST). Researched predictive algorithms for stability of dynamic tow targets at higher speeds. Developed advanced radar and infrared signature enhancement for powered targets. Researched and developed electric propulsion system for Polyethylene Tow Target (PETT). Developed improvements to High Speed Maneuvering Surface Target - Streamlined Variant (HSMST-s) to increase speed and improve durability. Integrated SeaCAN on-board remote control system with new platform and systems for Fast Attack Craft Target (FACT)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.293"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Test new FACT platform performance and measure radar cross section and infrared signatures. Develop configurations of Low Cost Modular Target (LCMT) to support testing of Long Range Anti-Ship Missile (LRASM) and Joint Standoff Weapon (JSOW). Develop high fidelity control and feedback for target emitters and cameras. Develop improved Seaborne Target steering systems to increase precision under remote control. Develop improvements to target swarm formation control. Develop new scoring grid for Humannequin target augmentation system and conduct operational evaluation. Develop advanced radar and infrared signature enhancement for powered Seaborne Targets. Research cost-effective methods of producing towed Seaborne Targets in lower quantities to support customization and exercises with short lead times. Monitor developments in Command and Control and support developments for System for Naval Target Control (SNTC) applicable to Seaborne Targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.323"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.323"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Develop specifications and initiate design concepts for Mobile Ship Target - Large (MST-L) \/ Joint At-Sea Target (JAST). Analyze and develop control concepts for MST-L \/ JAST. Research improved system for over-the-horizon command and control for Seaborne Targets including satellite links. Integrate Ship Deployable Seaborne Target (SDST) with formation algorithms in Portable Command and Control Unit (PCCU). Test and evaluate advanced radar and infrared signature enhancement for powered seaborne targets. Measure radar cross section of High Speed Maneuvering Surface Target - Streamlined Variant (HSMST-s). Develop configurations of Low Cost Modular Target (LCMT) to support test and evaluation of new weapon systems. Review emerging threats and developing weapon systems and analyze requirements for new targets or improvements\/alterations to existing targets."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No significant program change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OPN\/5429"
                                    },
                                    "Title": {
                                        "val": "ASW SE"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "22.319"
                                        },
                                        "CurrentYear": {
                                            "val": "10.571"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.753"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.753"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "12.762"
                                        },
                                        "BudgetYearThree": {
                                            "val": "12.398"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.425"
                                        },
                                        "BudgetYearFive": {
                                            "val": "11.675"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "103.496"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Review capability of inventory with respect to threat, weapons test schedules and fleet training requirements.  OBJECTIVE:  Available inventory of seaborne targets meets fleet requirements."
                        }
                    }
                }
            ]
        }
    }
}