{
    "id": "2019-AirForce-PB-3600-MJBOOK-3-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-33",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0305220F"
        },
        "ProgramElementTitle": {
            "val": "RQ-4 UAV"
        },
        "R1LineNumber": {
            "val": "273"
        },
        "MdapCode": {
            "val": "252"
        },
        "PriorYearsDelta": {
            "val": "85.375"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "866.534"
            },
            "PriorYear": {
                "val": "244.807"
            },
            "CurrentYear": {
                "val": "214.849"
            },
            "BudgetYearOne": {
                "val": "221.690"
            },
            "BudgetYearOneBase": {
                "val": "221.690"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "214.272"
            },
            "BudgetYearThree": {
                "val": "168.472"
            },
            "BudgetYearFour": {
                "val": "154.523"
            },
            "BudgetYearFive": {
                "val": "157.748"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "The sum of all Prior Years is actually $2031.377 million more than the represented total due to several projects ending."
        },
        "ProgramElementMissionDescription": {
            "val": "This program element funds related Air Force projects sharing the RQ-4 platform in common: the RQ-4 Block 30, the RQ-4 Block 40, the RQ-4 Ground Segment\/Communication System, RQ-4 Capability Enhancements, and Multi-Platform Radar Technology Insertion Program (MP-RTIP).   The RQ-4 Block 30, Block 40, and Ground Segment\/Communications Segment projects support the development and testing of the baseline ACAT 1C RQ-4 capability and the initiation of the major modernization ACAT programs.  The majority of modernization funding was transferred to the Capability Enhancements project to support upgrades and modifications to the fielded RQ-4 weapon system to meet evolving threats and warfighter requirements.  The MP-RTIP project completes development and testing of the baseline MDAP MP-RTIP sensor capability.\n\nWhen judged feasible and affordable, this program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability. Studies and activities may be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aeriel System (UAS) Command and Control Initiative (UCI) or the DoD's Unmanned Control Segment standards (UCS) and Open Mission Systems (OMS). Ground Segment Modernization Program (GSMP) and Communication System Modernization Program (CSMP) will incorporate UCI and UCS standards.\n\nPer direction of USD(AT&L), the RQ-4 program was restructured from the original project 675144 (Baseline) into multiple projects: (1) Block 30, (2) Block 40, (3) GroundSegment\/Communications System, and (4) Common-Airborne Sense and Avoid (C-ABSAA). In FY17 the Ground Segment\/Communications System project (675147) ended. Prior year funds in the amount of $2031.377M were accounted for in project 675144 and $85.375M were accounted for in project 675147.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver RQ-4 UAV weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, and 0605898F.\n\nThe FY2017 funding was reduced by $11.500 million to account for the availability of prior year execution balances.\n\nThis program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "256.307"
                },
                "CurrentYear": {
                    "val": "214.849"
                },
                "BudgetYearOne": {
                    "val": "227.143"
                },
                "BudgetYearOneBase": {
                    "val": "227.143"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "244.807"
                },
                "CurrentYear": {
                    "val": "214.849"
                },
                "BudgetYearOne": {
                    "val": "221.690"
                },
                "BudgetYearOneBase": {
                    "val": "221.690"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-11.500"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-5.453"
                },
                "BudgetYearOneBase": {
                    "val": "-5.453"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "-11.500"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-5.453"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-5.453"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "-FY17 $11.500M decrease: Reduction due to forward financing.\n-FY19 $5.453M decrease: Air Force directed changes for under execution and for realignment within RQ-4 program."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "675145"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Block 30"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "364.419"
                        },
                        "PriorYear": {
                            "val": "123.237"
                        },
                        "CurrentYear": {
                            "val": "35.030"
                        },
                        "BudgetYearOne": {
                            "val": "25.950"
                        },
                        "BudgetYearOneBase": {
                            "val": "25.950"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "30.761"
                        },
                        "BudgetYearThree": {
                            "val": "27.490"
                        },
                        "BudgetYearFour": {
                            "val": "25.913"
                        },
                        "BudgetYearFive": {
                            "val": "26.384"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "659.184"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The RQ-4 Block 30 Project was directed by an Acquisition Decision Memorandum (ADM) signed 14 Jun 2011 by USD (AT&L). At the time of the ADM signature, and subsequent designation of projects, budgets had already been finalized.  Prior budgets for all projects are captured under the RQ-4 Baseline project, as its related Project (675144) was the core project for the RQ-4 program prior to the directed restructure."
                        },
                        "ProjectMissionDescription": {
                            "val": "The RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance Intelligence, Surveillance, and Reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios. RDT&E funding in this project supports design, development, integration, and testing of capabilities needed to meet validated requirements for Block 30 aircraft, including continuing aircraft system upgrade for Enhanced Integrated Sensor Suite (EISS) sensors, the Airborne Signals Intelligence Payload (ASIP), and alternate sensor payloads.\n\nThis funding also supports aircraft systems ugrades to include continuing airframe updates, aircraft operations surety, cybersecurity, airspace and interoperability enhancements, information assurance, and mission critical repair of Government Furnished Equipment (GFE).\n\nActivities include mission planning interoperability enhancements, weather capability enhancements and testing, airspace and interoperability enhancements and updates, airframe and software upgrades and deficiency report resolution across RQ-4 fleet, periodic Operational Flight Program updates and releases, sensor interoperability and communication enhancements and alternate sensor upgrades, upgrades to ASIP Signals Intelligence (SIGINT) sensor, Identification Friend or Foe (IFF) Mode 5 Automatic Dependent Surveillance-Broadcast (ADS-B) development and testing, development and testing activities associated with enhancing sensor capability and sensor integration, integration of alternate sensors, development and testing of ice protection system, support of demonstration\/development and technology insertion, and studies and analysis supporting future system enhancements.  \n\nThis project supports system engineering\/program management, test and evaluation, management services, and fielding support for all RQ-4 projects.  This reflects contracting\/acquisition strategy for these common elements within the Global Hawk program to provide efficiencies.\n\nThe RQ-4 program will maintain and upgrade interoperability for Blocks 20\/30\/40 with system of systems partners and continue to incorporate applicable synergies with other platforms such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploration & Dissemination (PED) elements.  The networking capability for intelligence dissemination is required to provide the data transport interface between the Weapons System, Operations Centers, and external Intelligence Community customers.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver RQ-4 UAV weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, and 0605898F.\n\nThis program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities will be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aerial System (UAS) Command and Control Initiative (UCI), the DoD's Unmanned Control Segment standards (UCS), or Open Mission Systems (OMS) as well as technology insertion activities in support of Better Buying Power (BBP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 30 Development and Demonstration"
                                    },
                                    "Description": {
                                        "val": "Global Hawk Unmanned Aerial Vehicle Development and Demonstration includes enterprise management, test and evaluation, software integration, and fielding support for all RQ-4 projects as well as periodic Operational Flight Program updates and releases, studies and analysis supporting future system enhancements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "66.642"
                                            },
                                            "Text": {
                                                "val": "- Continue upgrades to ASIP SIGINT and EISS sensors - Continue airspace integration activities including IFF Mode 5\/ADS-B, comm interoperability and upgrades, cybersecurity and information assurance and reliability & maintainability, and associated testing - Initiate Operational Flight Program updates and releases - Continue risk reduction and analysis of ice protection system - Development and operational test of enhanced weather capability and JMPS"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.980"
                                            },
                                            "Text": {
                                                "val": "- Continue upgrades to ASIP SIGINT and EISS sensors \n- Continue airspace integration activities including IFF Mode 5\/ADS-B, comm interoperability and upgrades, cybersecurity and information assurance and reliability & maintainability, and associated testing \n- Conduct Block 40 enhanced weather capability testing\n- Continue development of Operational Flight Program updates \n- Continue risk reduction and analysis of ice protection system"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.795"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.795"
                                            },
                                            "Text": {
                                                "val": "- Will continue upgrades to ASIP SIGINT and EISS sensors \n- Will continue airspace integration activities including comm interoperability and upgrades, cybersecurity and information assurance and reliability & maintainability, and associated testing\n- Will conduct Battlefield Airborne Communication Node enhanced weather capability testing"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort continues to decrease as the program transitions modernization into separate Accomplishments\/Planned Programs in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RQ-4 MS-177 Sensor Integration"
                                    },
                                    "Description": {
                                        "val": "Integration of MS-177 multispectral sensor into Block 30"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.182"
                                            },
                                            "Text": {
                                                "val": "- Continue the development, integration, and testing of MS-177 on Block 30, including additional spectral bands - Conduct first flight and development test activities"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- Continue in project 675149"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RQ-4 Infrastructure"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Infrastructure includes systems engineering, program management, test and evaluation, and fielding support for all RQ-4 projects as well as periodic Operational Flight Program updates and releases, studies, development testing, and Other Government Costs (OGC). This funding was previously included in the RQ-4 Block 30 Development and Demonstration and Block 30 Government Test and Non-Prime Support Accomplishments\/Planned Programs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.733"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.733"
                                            },
                                            "Text": {
                                                "val": "- Will continue development of Operational Flight Program updates \n- Will continue program test activities \n- Will continue non-prime engineering and technical support and Other Government Costs"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, as program transitions into modernization, Global Hawk flight test and system engineering\/program management within infrastructure transitions into its own effort and will be contracted in conjunction with capability development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Block 30 Government Test and Non-Prime Support"
                                    },
                                    "Description": {
                                        "val": "Government test, non-prime technical support and Other Government Costs (OGC) -- Funding supports RQ-4 development testing at the 412 Test Wing at Edwards AFB, CA as well as for support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS), other interoperability partners and OGC."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.413"
                                            },
                                            "Text": {
                                                "val": "- Continue government test - Continue non-prime engineering and technical support and Other Government Costs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.050"
                                            },
                                            "Text": {
                                                "val": "- Continue government test \n- Continue non-prime engineering and technical support and Other Government Costs"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.422"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.422"
                                            },
                                            "Text": {
                                                "val": "- Will continue non-prime engineering and technical support and Other Government Costs"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in this effort continues to decrease as the program transitions modernization into separate Accomplishments\/Planned Programs in FY19. This funding supports remaining OGCs asserted with core program."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 04 Line Item HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.488"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.488"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "32.045"
                                        },
                                        "CurrentYear": {
                                            "val": "43.968"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.851"
                                        },
                                        "BudgetYearThree": {
                                            "val": "126.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "117.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.166"
                                        },
                                        "CostToComplete": {
                                            "val": "89.085"
                                        },
                                        "TotalCost": {
                                            "val": "543.552"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item RQ4DIS"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.099"
                                        },
                                        "CurrentYear": {
                                            "val": "86.695"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "130.625"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.428"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.419"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.699"
                                        },
                                        "CostToComplete": {
                                            "val": "8.364"
                                        },
                                        "TotalCost": {
                                            "val": "314.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 832070"
                                    },
                                    "Title": {
                                        "val": "Intelligence Comm Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.826"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "31.095"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RQ-4 program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. A suite of contract vehicles is used for development efforts: primarily, Indefinite Delivery, Indefinite Quantity (IDIQ) contracts cover development, system upgrade, production, retrofit, fielding, and sustainment efforts.  MS-177 Sensor Enhancement RDT&E is being contracted directly with the Original Equipment Manufacturer (OEM), United Technology Corporation Aerospace Systems (UTAS).\n\nThe program successfully completed Milestone (MS) C in February 2015 and is transitioning core program activities to the Operations and Support phase of the Defense Acquisition System over the next several years. Future required capabilities beyond the core Acquisition Category (ACAT) IC RQ-4 program will be completed as separate ACAT II and ACAT III modification programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk EMD, IDIQ, and EPIC Contracts are not segregated by Budget Project Number.\nTarget Value of MS-177 contract includes $142.539M of funding in Budget Project Number 675149, RQ-4 Capability Enhancements.\nTarget Value of RQ-4 Infrastructure includes $151.278M of funding in Budget Project Number 675149, RQ-4 Capability Enhancements."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Global Hawk Engineering Manufacturing and Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "240.188"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "66.642"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-05"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "24.980"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-07"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.795"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.795"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "29.750"
                                                    },
                                                    "TotalCost": {
                                                        "val": "372.355"
                                                    },
                                                    "TargetValue": {
                                                        "val": "372.355"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RQ-4 MS-177 Sensor Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "86.086"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "36.182"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "122.268"
                                                    },
                                                    "TargetValue": {
                                                        "val": "264.808"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RQ-4 Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.570"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.570"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "77.768"
                                                    },
                                                    "TotalCost": {
                                                        "val": "87.338"
                                                    },
                                                    "TargetValue": {
                                                        "val": "238.615"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "2.655"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.383"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.396"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.434"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.434"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.606"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "19.020"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.338"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.163"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.163"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "52.127"
                                                    },
                                                    "TargetValue": {
                                                        "val": "52.127"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.347"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.735"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.315"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.349"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.349"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "2.803"
                                                    },
                                                    "TotalCost": {
                                                        "val": "16.549"
                                                    },
                                                    "TargetValue": {
                                                        "val": "16.549"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Government Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.537"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.275"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.001"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.073"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.073"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.227"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.113"
                                                    },
                                                    "TargetValue": {
                                                        "val": "5.113"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 30"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Enhanced Weather Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mode 5\/ADS-B Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "ASIP Inc 1 Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mission Planning Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Sensor Enhancements & Upgrades (MS-177) Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Flight Program Updates & Releases"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Test Support"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RQ-4 Infrastructure & Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675146"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Block 40"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "174.036"
                        },
                        "PriorYear": {
                            "val": "0.089"
                        },
                        "CurrentYear": {
                            "val": "0.139"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "174.264"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "The RQ-4 Block 40 Project was directed by an Acquisition Decision Memorandum (ADM) signed 14 Jun 2011 by USD (AT&L). At the time of the ADM signature, and subsequent designation of projects, budgets had already been finalized.  Prior budgets for all projects are captured under the RQ-4 Baseline project, as its related Project (675144) was the core project for the RQ-4 program prior to the directed restructure.\n\nIn FY 2019,  PE 0305220F, RQ-4 UAV, Project 675146, RQ-4 Block 40, efforts were transferred to PE 0305220F, RQ-4 UAV, Project 675149, RQ-4 Capability Enhancements, in order to allow greater visibility into Global Hawk modernization efforts."
                        },
                        "ProjectMissionDescription": {
                            "val": "The RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance Intelligence, Surveillance, and Reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios. \n\nRDT&E funding in this project supports design, development, integration, and testing of items needed to meet validated requirements for Block 40 aircraft, including further development, creation of additional radar modes, integration and test of the Multi-Platform Radar Technology Insertion Program (MP-RTIP) sensor capabilities. The Block 40 program provides critical Synthetic Aperture Radar (SAR) and Ground Moving Target Indicator (GMTI) data to the warfighter. This funding also supports continued aircraft\/communications systems upgrade to include Identification Friend or Foe (IFF) Mode 5\/ADS-B, mission planning upgrade development and testing, airspace and interoperability and communication enhancements and updates, periodic Operational Flight Program updates and releases, enhanced weather capability, development and testing of ice protection system, additional radar modes, sensor enhancements, reliability and maintainability improvements, and support of demonstration and technology insertion. Funding continues RQ-4 unique development and integration of upgraded capabilities. \n\nThis program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability.  Likewise, studies and activities will be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aerial System (UAS) Command and Control Initiative (UCI), the DoD's Unmanned Control Segment standards (UCS), or Open Mission Systems (OMS) as well as technology insertion activities in support of Better Buying Power (BBP).\n\nThe RQ-4 program will maintain capability and interoperability for Block 40 including efforts with system of systems partners and continue to incorporate applicable synergies with other platforms, such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements.\n\nActivities also include studies and analysis, support to future system enhancements, communication and interoperability enhancements, current and future program planning, and project execution."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 40 Development and Demonstration"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Block 40 Payload and Aircraft\/Communications Development and Demonstration as well as periodic Operational Flight Program updates and releases"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.089"
                                            },
                                            "Text": {
                                                "val": "- Initiate Operational Flight Program updates and releases - Continue enhancements to system interoperability, cybersecurity, comms, information assurance, and reliability & maintainability improvements and associated testing & evaluation - Continue development and testing of enhanced weather capability - Continue airspace integration of IFF Mode 5\/ADS-B - Continue integration of additional RTIP modes and associated testing"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.139"
                                            },
                                            "Text": {
                                                "val": "- Complete funding of airspace integration of IFF Mode 5\/ADS-B"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Efforts have been transferred to Program 0305220F, RQ-4, Project 675149, Capability Enhancements"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 04 Line Item HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.488"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.488"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "32.045"
                                        },
                                        "CurrentYear": {
                                            "val": "43.968"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.851"
                                        },
                                        "BudgetYearThree": {
                                            "val": "126.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "117.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.166"
                                        },
                                        "CostToComplete": {
                                            "val": "89.085"
                                        },
                                        "TotalCost": {
                                            "val": "543.552"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item RQ4DIS"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.099"
                                        },
                                        "CurrentYear": {
                                            "val": "86.695"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "130.625"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.428"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.419"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.699"
                                        },
                                        "CostToComplete": {
                                            "val": "8.364"
                                        },
                                        "TotalCost": {
                                            "val": "314.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 832070"
                                    },
                                    "Title": {
                                        "val": "Intelligence Comm Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.826"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "31.095"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 0305238F"
                                    },
                                    "Title": {
                                        "val": "NATO AGS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "38.904"
                                        },
                                        "CurrentYear": {
                                            "val": "44.729"
                                        },
                                        "BudgetYearOne": {
                                            "val": "51.527"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "51.527"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.567"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.787"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.796"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.810"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "171.120"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RQ-4 program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. A suite of contract vehicles is used for development efforts: a legacy Engineering & Manufacturing Development (EMD) \"C\" contract is being phased out with the completion of current efforts; Indefinite Delivery, Indefinite Quantity (IDIQ) contracts cover development, upgrade, production, retrofit, fielding, and sustainment efforts.\n\nThe program successfully completed Milestone (MS) C in February 2015 and is transitioning core program activities to the Operations and Support phase of the Defense Acquisition System over the next several years. Future required capabilities beyond the core Acquisition Category (ACAT) IC RQ-4 program will be completed as separate ACAT II and ACAT III modification programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 EMD, IDIQ, and EPIC contracts are not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Global Hawk Engineering Manufacturing and Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "138.984"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.089"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.139"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "139.212"
                                                    },
                                                    "TargetValue": {
                                                        "val": "139.212"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non-Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.369"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.369"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.231"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.231"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the Global Hawk effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "7.040"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "7.040"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.412"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.412"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Block 40"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Block 40 FOC June 2017"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Enhanced Weather Capability Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Mode 5\/ADS-B Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Sensor Integration\/Modes Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Operational Flight Program Updates and Releases"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "675149"
                    },
                    "ProjectTitle": {
                        "val": "RQ-4 Capability Enhancements"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "114.013"
                        },
                        "CurrentYear": {
                            "val": "167.745"
                        },
                        "BudgetYearOne": {
                            "val": "195.739"
                        },
                        "BudgetYearOneBase": {
                            "val": "195.739"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "178.390"
                        },
                        "BudgetYearThree": {
                            "val": "140.982"
                        },
                        "BudgetYearFour": {
                            "val": "128.610"
                        },
                        "BudgetYearFive": {
                            "val": "131.364"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The RQ-4 Remotely Piloted Aircraft (RPA) provides a high altitude, deep look, long-endurance Intelligence, Surveillance, and Reconnaissance (ISR) capability that complements space and other airborne collectors during peacetime, crisis, and war-fighting scenarios. RDT&E funding in this project supports design, development, integration, and testing of capabilities needed to meet validated requirements for RQ-4 aircraft, including continuing aircraft system upgrade for current and  alternate sensor payloads.\n\nThis funding supports aircraft systems upgrade to include continuing aircraft operations surety, cybersecurity, information assurance, and mission critical repair of Government Furnished Equipment (GFE).  This will include systems engineering\/program management, configuration and data management, test and evaluation, management services, DR\/MIP Investigations, studies and analysis and fielding support for Block 30, Block 40, and Ground Segment\/Comm System.\n\nActivities include airspace and interoperability and communication enhancements and updates, periodic Operational Flight Program updates and releases, airframe and software upgrades, deficiency report resolution across RQ-4 fleet, sensor enhancements and alternate sensor upgrades including the MS-177 and the Optical Bar Camera (OBC), enhanced comms capabilities, support for demonstration and technology insertion, development and testing of ice protection system, enhanced mission flexibility to accommodate changes to mission objectives inflight, enhancements to support multi-domain contested environment operations, and studies and analysis supporting future system enhancements.  Additionally, this project supports design, development, integration, and testing of items needed to meet validated requirements for Block 20\/30\/40 aircraft, including further development, mode creation, integration and test of the Multi-Platform Radar Technology Insertion Program (MP-RTIP) sensor capabilities, continued aircraft\/communications systems upgrade, additional radar modes, reliability and maintainability improvements, Ground Segment Modernization Program (GSMP) and Communication System Modernization Program (CSMP) efforts, as well as next generation communications capabilities. GSMP resolves fleet grounding Diminishing Manufacturing Sources (DMS) and obsolescence issues associated with ground segment equipment and provides critical warfighter capabilities such as building-based multi-aircraft control. It will also enhance interoperability data dissemination as well as provide training capability. CSMP resolves critical DMS and obsolescence issues in the RQ-4 communication infrastructure and provides enhancements across the RQ-4 communication network.\n\nRDT&E funding in this project also supports design, development, integration and testing of the weapon system's legacy ground elements and communications capabilities to enhance functionality and maintain interoperability prior to GSMP\/CSMP fielding.  The ground segment currently includes the Mission Control Elements (MCE), the Launch and Recovery Elements (LRE), and the networking resources required to simultaneously disseminate intelligence information while remaining compliant with DoD cybersecurity network requirements to operate on the Global Information Grid.\n\nThis project supports system engineering\/program management, test and evaluation, management services and fielding support for all RQ-4 projects.  This reflects contracting\/acquisition strategy for these common elements within the Global Hawk program to provide efficiencies.  \n\nThe RQ-4 program will maintain and upgrade interoperability for Blocks 20\/30\/40 with system of systems partners and continue to incorporate applicable synergies with other platforms such as the U.S. Navy's Triton, other RPA weapon systems, and Processing, Exploitation & Dissemination (PED) elements. The networking capability for intelligence dissemination is required to provide the data transport interface between the Weapons System, Operations Centers, and external Intelligence Community customers.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver RQ-4 UAV weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F, 0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, and 0605898F.\n\nThis program will participate in the development, testing, and implementation of international standards to enhance joint, allied, and coalition interoperability. Likewise, studies and activities will be initiated to further explore the utility of incorporating the emerging architectural standards such as the USAF Unmanned Aerial System (UAS) Command and Control Initiative (UCI), the DoD's Unmanned Control Segment standards (UCS), or Open Mission Systems (OMS) as well as technology insertion activities in support of Better Buying Power (BBP)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Capability Enhancements"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Development and Demonstration (includes development, system integration, software integration, development test, and fielding support for RQ-4 projects as well as studies and analysis supporting future system enhancements). Also supports RQ-4 development testing at the 412 Test Wing at Edwards AFB, CA and also includes funding for support from Air Force Operational Test and Evaluation Center (AFOTEC), Joint Interoperability Test Command (JITC), Distributed Common Ground System (DCGS), other interoperability partners and Other Government Costs (OGC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.622"
                                            },
                                            "Text": {
                                                "val": "- Support required sensor upgrades and current and alternate sensor enhancements and upgrades - Conduct airspace integration activities, integration of advanced sensors, utilization of additional radar modes, and comms system enhancements - Conduct risk reduction and analysis of ice protection system, continued system interoperability and upgrades, cybersecurity and information assurance and reliability & maintainability, and associated testing - Initiate Operational Flight Program updates and releases - Conduct pre-contract activities supporting the Communication System Modernization Program (CSMP) and Optical Bar Camera (OBC) - Continue government test and non-prime engineering and technical support and Other Government Costs"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "90.135"
                                            },
                                            "Text": {
                                                "val": "- Conduct airspace integration activities, integration of advanced sensors, utilization of additional radar modes, and comms system enhancements \n- Conduct risk reduction and analysis of ice protection solutions, continued system interoperability and upgrades, cybersecurity and information assurance and reliability & maintainability, and associated testing \n- Continue development and testing of alternate sensors and upgrades  \n- Continue development to integrate Radar Software Development (RSD) 1.5 software build into Block 40 Program \n- Continue development of radar capabilities to include Maritime Modes Integration\n- Continue government test and non-prime engineering and technical support and OGC"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.546"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.546"
                                            },
                                            "Text": {
                                                "val": "- Will conduct risk reduction and analysis of ice protection solutions, continued system interoperability and upgrades, cybersecurity and information assurance and reliability & maintainability, and associated testing\n- Will conduct Communication System Modernization Program (CSMP) pre-contract activities and establish as a formal program\n- Will Continue government test and non-prime engineering and technical support and OGC"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in FY19 decreased in accordance with program office estimate for future capability development."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Functional Capability 9 (IFC 9)"
                                    },
                                    "Description": {
                                        "val": "IFCs are periodic hardware and software capability, releases similar to an Operational Flight Program (OFP). IFC 9 provides (Optical Bar Camera (OBC), Nose Wheel Steering enhancement, in flight Waypoint Modification as well as numerous software enhancement and deficiency resolutions, and Other Government Costs (OGC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "- N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "55.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "55.345"
                                            },
                                            "Text": {
                                                "val": "- Will award contract and begin system design\/development\n- Will Continue government test and non-prime engineering and technical support and OGC"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in FY19 increased because it was previously included in the RQ-4 Capability Enhancements Accomplishment\/Planned Program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RQ-4 Ground Segment Modernization Program (GSMP)"
                                    },
                                    "Description": {
                                        "val": "GSMP resolves fleet grounding DMS and obsolescence issues associated with ground segment equipment and provides critical warfighter capabilities such as building-based multi-aircraft control. It will also enhance interoperability data dissemination as well as provide training capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "55.567"
                                            },
                                            "Text": {
                                                "val": "- Conduct software development and system level testing of the GSMP - Conduct development and purchase hardware for vendor Software Integration Laboratories (SILs), Development Testing (DT) and Operational Testing (OT) locations for the GSMP - Conduct development of technical publications, courseware and a trainer for the GSMP - Conduct Preliminary Design Review (PDR) and Critical Design Review (CDR)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "66.610"
                                            },
                                            "Text": {
                                                "val": "- Continue software development and system level testing of the GSMP \n- Continue development and hardware purchases for vendor SILs, DT and OT locations for the GSMP \n- Continue development technical publications, courseware and a trainer for the GSMP \n- Conduct installation of the GSMP cockpits at SILs, DT and OT locations"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "37.550"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "37.550"
                                            },
                                            "Text": {
                                                "val": "- Will continue software development and system level testing of the GSMP \n- Will continue development and hardware purchases for vendor SILs, DT and OT locations for the GSMP \n- Will continue development technical publications, courseware and a trainer for the GSMP \n- Will begin developmental test of GSMP"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in FY19 decreased in accordance with program office estimate and prime contract costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RQ-4 MS-177 Sensor Integration"
                                    },
                                    "Description": {
                                        "val": "Integration of MS-177 multispectral sensor into Block 30"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "44.824"
                                            },
                                            "Text": {
                                                "val": "- In project 675145"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.000"
                                            },
                                            "Text": {
                                                "val": "- Continue the integration, and testing of MS-177 on Block 30, including additional spectral bands \n- Conduct MS-177 OT and Initial Operational Capability (IOC) \n- Continue development of MS-177A (10-Band)"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "39.732"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "39.732"
                                            },
                                            "Text": {
                                                "val": "- Will continue the integration, and testing of MS-177 on Block 30, including additional spectral bands \n- Will conduct MS-177 OT and attain Initial Operational Capability (IOC) \n- Will continue development of MS-177A (10-Band) and integration \n- Will begin DT of MS-177A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding in FY19 increased in accordance with program office estimate and prime contract costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "RQ-4 Infrastructure"
                                    },
                                    "Description": {
                                        "val": "RQ-4 Infrastructure includes system engineering, program management, test and evaluation, and fielding support for all RQ-4 projects as well as periodic Operational Flight Program (OFP) updates and releases, development testing, and Other Government Costs (OGC). This funding was previously included in the RQ-4 Capability Enhancements Accomplishment\/Planned Program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "-N\/A"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "49.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "49.566"
                                            },
                                            "Text": {
                                                "val": "- Will develop OFP releases\n- Will perform government test and non-prime engineering and technical support and OGC"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19, as program transitions into modernization, Global Hawk flight test and system engineering\/program management within infrastructure transitions into its own effort and will be contracted in conjunction with capability development."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 04 Line Item HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.488"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.488"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "32.045"
                                        },
                                        "CurrentYear": {
                                            "val": "43.968"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.851"
                                        },
                                        "BudgetYearThree": {
                                            "val": "126.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "117.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.166"
                                        },
                                        "CostToComplete": {
                                            "val": "89.085"
                                        },
                                        "TotalCost": {
                                            "val": "543.552"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item RQ4DIS"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.099"
                                        },
                                        "CurrentYear": {
                                            "val": "86.695"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "130.625"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.428"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.419"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.699"
                                        },
                                        "CostToComplete": {
                                            "val": "8.364"
                                        },
                                        "TotalCost": {
                                            "val": "314.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 832070"
                                    },
                                    "Title": {
                                        "val": "Intelligence Comm Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.826"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "31.095"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The RQ-4 program uses an evolutionary acquisition strategy to provide the warfighter with a near-term combat capability with increased time-phased capability improvements as technology and risk achieve satisfactory levels. Northrop Grumman Corporation is the prime contractor. A suite of contract vehicles is used for development efforts: primarily, IDIQ contracts cover development, upgrade, production, retrofit, fielding, and sustainment efforts.\n\nThe program successfully completed Milestone (MS) C in February 2015 and is transitioning core program activities to the Operations and Support phase of the Defense Acquisition System over the next several years. Future required capabilities beyond the core Acquisition Category (ACAT) IC RQ-4 program will be completed as separate ACAT II and ACAT III modification programs."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 EMD, IDIQ, and EPIC Contracts is not segregated by Budget Project Number. \nTarget Value of GSMP contract includes $28.414M of funding in Budget Project Number 675147, RQ-4 Grnd Segment\/Comm System\nTarget Value of MS-177 contract includes $122.268M of funding in Budget Project Number 675145, RQ-4 Block 30\nTarget Value of RQ-4 Infrastructure includes $87.338M of funding in Budget Project Number 675145, RQ-4 Block 30"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "RQ-4 Capability Enhancements"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.144"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "78.708"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.573"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.573"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "464.274"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Integrated Functional Capability 9"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "51.345"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "51.345"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "119.709"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RQ-4 Ground Segment Modernization Program (GSMP)"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPIF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "55.567"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-04"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "66.610"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "37.550"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "37.550"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "216.468"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RQ-4 MS-177 Sensor Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Diego, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "44.824"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-04"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "39.732"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "39.732"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-04"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "264.808"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "RQ-4 Infrastructure"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "39.286"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "39.286"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "238.615"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Non Prime Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.267"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.137"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.421"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.421"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "412 TW"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Edwards AFB, CA"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.717"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.280"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.280"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "Target Value of the RQ-4 effort is not segregated by Budget Project Number."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.985"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.653"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.653"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Government Costs"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Varous"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Dayton, OH"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.318"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.588"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.899"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.899"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "RQ-4 Capability Enhancements"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Sensor Enhancements & Upgrades (MS-177) Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ice Protection System Risk Reduction & Analysis"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Segment Maintenance\/Upgrades Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Ground Segment Modernization Program Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Comms Systems Maintenance\/Upgrades Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Communication System Modernization Program Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "RQ-4 Infrastructure & Test"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Integrated Functional Capability 9"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67RTIP"
                    },
                    "ProjectTitle": {
                        "val": "MP-RTIP"
                    },
                    "MdapCode": {
                        "val": "293"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "242.704"
                        },
                        "PriorYear": {
                            "val": "7.468"
                        },
                        "CurrentYear": {
                            "val": "11.935"
                        },
                        "BudgetYearOne": {
                            "val": "0.001"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.001"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "5.121"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "267.229"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "Beginning in FY09, the Multi-Platform Radar Technology Insertion Program (MP-RTIP) funding was transferred to program 0305220F (RQ-4) Global Hawk (GH).  Therefore, the data in this package includes only FY09 and subsequent funding related to program 0305220F."
                        },
                        "ProjectMissionDescription": {
                            "val": "The MP-RTIP sensor was designed as a family of modular, scalable sensors to provide next generation capabilities to support sustainable network centric operations with integrated Command and Control, Intelligence, Surveillance and Reconnaissance (C2ISR) capability. MP-RTIP provides the RQ-4 Block 40 aircraft with advanced Synthetic Aperture Radar (SAR) and Moving Target Indicator (MTI) sensor capabilities.\n\nThis project (67RTIP) includes MP-RTIP modernization and integration efforts for the RQ-4 Block 40 Platform. MP-RTIP modernization studies and development insertion include the implementation of Maritime Modes (MM), Maritime Inverse SAR(MISAR), product improvements and other advanced capabilities. GH Program Office will continue integration of radar capabilities to include Maritime Modes integration into RQ-4 aircraft and ground systems. \n\nActivities also include studies and analysis supporting current and future program planning and future modes development based on user requirements. This program is in Budget Activity 7, Operational System Development, because this budget activity includes development efforts to upgrade systems that have been fielded or have received approval for full rate production and anticipate production funding in the current or subsequent fiscal year.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver MPRTIP weapon system capability.  The use of such program funds would be in addition to the civilian pay expenses budgeted in program elements 0605826F,0605827F, 0605828F, 0605829F, 0605830F, 0605831F, 0605832F, and 0605898F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multi-Platform Radar Tech Insertion Program (MP-RTIP)"
                                    },
                                    "Description": {
                                        "val": "MP-RTIP development and integration"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.468"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of the MP-RTIP-RSD 1.5 software build (to include emergency builds if necessary). The completion of software build 1.5 will allow sustainment to perform system integration in the Global Hawk System Center (GHSC) - Complete rigorous testing of RSD 1.5 final System Design and Development (SDD) software builds in the RSIL"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.935"
                                            },
                                            "Text": {
                                                "val": "- Will complete transition of core capability development. \n- Will begin development to integrate Radar Software Development (RSD) 1.5 software build into the RQ-4 Block 40 Program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.001"
                                            },
                                            "Text": {
                                                "val": "- Will complete transition to sustainment. GH Program Office will have responsibility for future radar development in the RQ-4 Capability Enhancements Program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to transition to sustainment and realignment of funds from MPRTIP to GH Capability Enhancements for future radar development and integration."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "APAF 04 Line Item HAEUAV"
                                    },
                                    "Title": {
                                        "val": "RQ-4"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "6.488"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "6.488"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 05 Line Item HAWK00"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Mods"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "32.045"
                                        },
                                        "CurrentYear": {
                                            "val": "43.968"
                                        },
                                        "BudgetYearOne": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "23.715"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "4.851"
                                        },
                                        "BudgetYearThree": {
                                            "val": "126.340"
                                        },
                                        "BudgetYearFour": {
                                            "val": "117.382"
                                        },
                                        "BudgetYearFive": {
                                            "val": "106.166"
                                        },
                                        "CostToComplete": {
                                            "val": "89.085"
                                        },
                                        "TotalCost": {
                                            "val": "543.552"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "APAF 07 Line Item RQ4DIS"
                                    },
                                    "Title": {
                                        "val": "RQ-4 Post Production Support"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.099"
                                        },
                                        "CurrentYear": {
                                            "val": "86.695"
                                        },
                                        "BudgetYearOne": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "40.641"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "130.625"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.428"
                                        },
                                        "BudgetYearFour": {
                                            "val": "15.419"
                                        },
                                        "BudgetYearFive": {
                                            "val": "15.699"
                                        },
                                        "CostToComplete": {
                                            "val": "8.364"
                                        },
                                        "TotalCost": {
                                            "val": "314.970"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OPAF 03 Line Item 832070"
                                    },
                                    "Title": {
                                        "val": "Intelligence Comm Equipment"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.000"
                                        },
                                        "CurrentYear": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearOne": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "21.269"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "9.826"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.000"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.000"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "31.095"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "RDTE 07 PE 0305238F"
                                    },
                                    "Title": {
                                        "val": "NATO AGS"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "38.904"
                                        },
                                        "CurrentYear": {
                                            "val": "44.729"
                                        },
                                        "BudgetYearOne": {
                                            "val": "51.527"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "51.527"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "32.567"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.787"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.796"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.810"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "171.120"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "- Will complete transition to sustainment and GH Program Office will have responsibility for future radar development including integration of RSD 1.5 and Maritime Mode software in incorporate into Integrated Functional Capability (IFC) 9 plan."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Funds are required in FY20 to close out the entire MP-RTIP SDD contract #F19628-00-C-0100."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MP-RTIP"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "194.906"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.547"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.935"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.001"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.001"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "35.492"
                                                    },
                                                    "TotalCost": {
                                                        "val": "247.881"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "IRT Study"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various, NV"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.105"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.105"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.105"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Logistics Planning"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Northrop Grumman Integrated Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "El Segundo, CA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.667"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.667"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.667"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Flight Test & Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various, NV"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.536"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.536"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PMA: A&AS"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various, NV"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "30.698"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.893"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "32.591"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "PMA: Other Gov't Cost"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Boston, MA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.792"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.028"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.820"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "MP-RTIP"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Radar Software Build Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SDD MP-RTIP Radar Transition to RQ-4 Block 40 Program Office"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Radar Mode Integration & Mode Development (IFC 9\/10)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "SDD Contract Close Out"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}