{
    "id": "2019-Army-PB-2040-JBOOK-3be08eef265cbf3fa6ee9f25bc102fc8e7dd36b72efeeb78b5538ece49603c5b-24",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605042A"
        },
        "ProgramElementTitle": {
            "val": "Tactical Network Radio Systems (Low-Tier)"
        },
        "R1LineNumber": {
            "val": "133"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.198"
            },
            "CurrentYear": {
                "val": "20.076"
            },
            "BudgetYearOne": {
                "val": "3.829"
            },
            "BudgetYearOneBase": {
                "val": "3.829"
            },
            "BudgetYearTwo": {
                "val": "10.062"
            },
            "BudgetYearThree": {
                "val": "21.750"
            },
            "BudgetYearFour": {
                "val": "22.066"
            },
            "BudgetYearFive": {
                "val": "24.58"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "116.561"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Handheld, Manpack, and Small Form Fit (HMS) radio program is a materiel solution providing software-defined radio systems that are tailorable and scalable to support the Chief of Staff of the Army's \"fight tonight\" strategy. HMS is an Acquisition Category IC program that encompasses specific requirements to support the U.S. Army, Air Force, Navy, Marine Corps and Special Operations Command communications needs. \n\nHMS provides voice and data communications to the tactical edge\/most disadvantaged warfighter with an on-the-move, at-the-halt, and stationary Line of Sight (LOS) \/ Beyond Line of Sight (BLOS) capability for both dismounted personnel and platforms. HMS radio systems are software reprogrammable, networkable, multi-mode systems capable of simultaneous voice and data communications. \n\nHMS encompasses the Handheld Radios (one-channel Rifleman Radio (RR) and two-channel Leader Radio (LR)), Manpack Radio (MP), and Small Form Fit (SFF) radios. HMS radios will provide voice and support for data services such as text, control graphics, imagery, video, and telemetry to Warfighters and tactical end user devices including handheld, embedded, and larger computing devices, as well as unmanned systems. The program office will continue with the ongoing competition to procure the newest generation of software defined radios capable of running the threshold waveforms, to include MUOS for MP, and will pursue alternative waveforms to reduce the complexity of Mobile AdHoc Networking waveforms, improve spectral efficiency, and seek Electronic Counter-Countermeasures improvements for operations in contested environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "18.824"
                },
                "CurrentYear": {
                    "val": "20.076"
                },
                "BudgetYearOne": {
                    "val": "7.651"
                },
                "BudgetYearOneBase": {
                    "val": "7.651"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.198"
                },
                "CurrentYear": {
                    "val": "20.076"
                },
                "BudgetYearOne": {
                    "val": "3.829"
                },
                "BudgetYearOneBase": {
                    "val": "3.829"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-4.626"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-3.822"
                },
                "BudgetYearOneBase": {
                    "val": "-3.822"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-4.059"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.56"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-3.822"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-3.822"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 budget reduction from $7.651 Million to $3.829 Million reflects MP radio reaching end of operational testing in preparation for full rate production."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FA1"
                    },
                    "ProjectTitle": {
                        "val": "Manpack Radio"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "10.347"
                        },
                        "CurrentYear": {
                            "val": "10.039"
                        },
                        "BudgetYearOne": {
                            "val": "1.959"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.959"
                        },
                        "BudgetYearTwo": {
                            "val": "5.03"
                        },
                        "BudgetYearThree": {
                            "val": "10.875"
                        },
                        "BudgetYearFour": {
                            "val": "11.033"
                        },
                        "BudgetYearFive": {
                            "val": "12.29"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "61.573"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "HMS is structured as a single program of record. The MP radio is a NSA certified Type 1 radio used for transmission of up to SECRET information. MP is capable of providing two simultaneous channels of secure voice and data communications using SINCGARS, SRW, Demand Assigned Multiple Access Satellite Communication, Mobile User Objective System (MUOS), and other advanced networking waveforms. The MP provides range extension and connects soldiers in the lower tier network to the mid-tier network. It is interoperable with legacy waveforms and capable of route and retransmission and cross-banding. The MP provides networking waveforms connectivity, Networked LOS \/ BLOS voice and data communications. The MP will serve as the vehicular and man-packable tactical LOS radio."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "PdM HMS Manpack's program management includes overall management of program execution, major events, reporting, funds execution, contract management, and logistical support. Includes participation in program planning and Integrated Product Team meetings."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.312"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement HMS acquisition strategy. Includes Core, Matrix, and Contractor support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.6"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement PdM HMS acquisition strategy. Includes Core, Matrix, and Contractor support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.45"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.45"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement PdM HMS acquisition strategy. Includes Matrix and Contractor support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in requirement is a result of the removal of Core support as this requirement will be covered with OMA funds starting in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMS Engineering\/Technical Support"
                                    },
                                    "Description": {
                                        "val": "Overall technical analysis support to PdM HMS' Manpack products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.142"
                                            },
                                            "Text": {
                                                "val": "Provide technical systems engineering support to evaluate technical alternatives and perform communication architecture analysis to identify alternatives to reduce cost, improve performance, and achieve tactical radio objectives. Technical test support for the planning and execution of laboratory and field test events, including support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.7"
                                            },
                                            "Text": {
                                                "val": "To provide technical support, including systems engineering to evaluate technical alternatives and test support. System Engineering efforts includes: communication architecture analysis, identifying alternatives to reduce costs, improving system performance, and achieve tactical radio objectives. Technical test support includes: planning and execution of laboratory and field test events, support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.7"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.7"
                                            },
                                            "Text": {
                                                "val": "To provide technical support, including systems engineering to evaluate technical alternatives and test support. System Engineering efforts includes: communication architecture analysis, identifying alternatives to reduce costs, improving system performance, and achieve tactical radio objectives. Technical test support includes: planning and execution of laboratory and field test events, support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Manpack's Test and Evaluation focuses on the key technical and operational characteristics of the system: Radio Frequency performance, security, Reliability, Availability & Maintainability, suitability and survivability requirements, in addition to operational environmental performance requirements as per the Capability Production Document. All radios awarded a contract were required to go through the Qualification Test (QT) to qualify for a Customer Test (CT). Following CT there will be a Sandbox and Soldier Feedback Study and Field \/ Lab Based Risk Reduction Test (FBRR\/LBRR) that will serve as risk reduction events prior to Operational Test (OT) to ensure the radio is operational at full capability and ready to be used by soldiers. The QT and CT are complete and were executed by Electronic Proving Ground. \n\nThe QT validated the manufacturers' ability to meet the minimum functional requirements identified in the Performance Requirements Document. All vendors successfully demonstrated key capabilities during QT and proceeded to the CT. The Sandbox, Soldier Feedback Study and FBRR\/LBRR will serve as risk reduction events for delayed thresholds and OT. The OT will include support from Army and DoD operational testers and will use communication scenarios based on the Operational Mode Summary \/ Mission Profile of the system(s) under test. The OT will be designed to validate that HMS products meet warfighter needs in terms of effectiveness, suitability and survivability in an operationally realistic environment. Results from OT will facilitate the delivery orders for Full Rate Production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.893"
                                            },
                                            "Text": {
                                                "val": "The FY 2017 funding is needed to conduct testing for the MP candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; engineering and technical support at test events; and to fully fund the testing requirements on the MP candidate radios as laid out in the HMS Acquisition Strategy approved May 2014."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.739"
                                            },
                                            "Text": {
                                                "val": "The FY 2018 funding is needed to conduct testing for the MP candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; engineering and technical support at test events; and to fully fund the testing requirements on the MP candidate radios as laid out in the HMS Acquisition Strategy approved May 2014."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.809"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.809"
                                            },
                                            "Text": {
                                                "val": "The FY 2019 funding is needed to conduct testing for the MP candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; engineering and technical support at test events; and to fully fund the testing requirements on the MP candidate radios as laid out in the HMS Acquisition Strategy approved May 2014."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in requirement is a result of the radio reaching the end of operational testing while approaching full rate production."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FA2"
                                    },
                                    "Title": {
                                        "val": "Rifleman Radio (RR)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "3.851"
                                        },
                                        "CurrentYear": {
                                            "val": "10.037"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.87"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.87"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.032"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.875"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.033"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.29"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "54.988"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B95006"
                                    },
                                    "Title": {
                                        "val": "Handheld Radio"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "43.734"
                                        },
                                        "CurrentYear": {
                                            "val": "37.773"
                                        },
                                        "BudgetYearOne": {
                                            "val": "79.802"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "79.802"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "102.959"
                                        },
                                        "BudgetYearThree": {
                                            "val": "92.94"
                                        },
                                        "BudgetYearFour": {
                                            "val": "95.091"
                                        },
                                        "BudgetYearFive": {
                                            "val": "92.653"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "544.952"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B95007"
                                    },
                                    "Title": {
                                        "val": "Manpack Radio"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "224.388"
                                        },
                                        "CurrentYear": {
                                            "val": "317.578"
                                        },
                                        "BudgetYearOne": {
                                            "val": "271.763"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "271.763"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "413.805"
                                        },
                                        "BudgetYearThree": {
                                            "val": "402.038"
                                        },
                                        "BudgetYearFour": {
                                            "val": "453.968"
                                        },
                                        "BudgetYearFive": {
                                            "val": "505.349"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Manpack Radio is currently executing a May 2014 approved acquisition strategy to procure Non-Developmental Items (NDI). Utilizing a full and open competition strategy the Manpack (MP) base contract was awarded to all potential industry partners. The MP contract was awarded on 26 February 2016, and will procure NDI MP radios for use in a classified environment. The MP is capable of running the following waveforms: SRW, Single Channel Ground and Airborne Radio System (SINCGARS), Satellite Communications (SATCOM) - Army managed waveforms, Mobile User Objective System (MUOS) - Navy managed waveform, and other advanced networking waveforms. \n\nThe Army has awarded Firm Fixed-Price (FFP) Indefinite Delivery Indefinite Quantity (IDIQ) Contracts and will procure radios through a multiple step selection process:\na. Awarded FFP Contracts to all qualified vendors based on technical acceptability and demonstrations (26 February 2016)\nb. Awarded initial delivery orders based on Qualification Test results (19 December 2016)\nc. Awarded second delivery orders based on Customer Test results (31 July 2017)\nd. Award LRIP (4QFY18)\nd. Award FRP delivery orders based on best value trade off construct (3QFY19)"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, CECOM, PM TR Alliant"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various; APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.312"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.6"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.45"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.45"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.362"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMS Engineering\/Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, ARL, ESP, CECOM, CERDEC, LCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.142"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.7"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.7"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.7"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.542"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EPG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft. Huachuca"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.447"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing (2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OTC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "6.446"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.739"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.809"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.809"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "15.994"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_FA1.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Manpack (MP) Customer Test (CT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Sandbox and Soldier Feedback Study"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Field\/Lab Base Risk Reduction Test (FBRR\/LBRR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Operational Test (OT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP LRIP"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Log Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Full Rate Production (FRP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP Performance Verification Test (PVT) (FY19)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP PVT (FY20)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP PVT (FY21)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP PVT (FY22)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "MP PVT (FY23)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FA2"
                    },
                    "ProjectTitle": {
                        "val": "Rifleman Radio (RR)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.851"
                        },
                        "CurrentYear": {
                            "val": "10.037"
                        },
                        "BudgetYearOne": {
                            "val": "1.87"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.87"
                        },
                        "BudgetYearTwo": {
                            "val": "5.032"
                        },
                        "BudgetYearThree": {
                            "val": "10.875"
                        },
                        "BudgetYearFour": {
                            "val": "11.033"
                        },
                        "BudgetYearFive": {
                            "val": "12.29"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "54.988"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "HMS is structured as a single program of record. The HMS Handheld Radios encompass the one-channel Rifleman Radio (RR) and two-channel Leader Radio (LR). The RR is a handheld radio that connects soldiers at the lowest echelon of the Army network. It is a National Security Agency (NSA) certified Type 1 radio used for transmission of up to SECRET information. The RR provides one-channel secure voice and data communications using Soldier Radio Waveform (SRW). It is the primary squad level communication system. The LR is a Multiband two-channel handheld radio to be used at the Team, Squad, and Platoon level. The LR will simultaneously support Single Channel Ground and Airborne Radio System (SINCGARS) voice interoperability, SRW data and voice communications, and other advanced networking waveform communications, in one radio with both handheld and mounted configurations.\n\nOn 13 September 2016 the Army Acquisition Executive (AAE) approved a decreased Basis of Issue (BOI) for the single channel Rifleman Radio (RR), an increase to the BOI for the two channel Leader Radio (LR) and moving forward with acquisition activities for the two channel LR. Single channel RR procurement is being deferred."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Program Management"
                                    },
                                    "Description": {
                                        "val": "Handheld's program management includes overall management of program execution, major events, reporting, funds execution, contract management, and logistical support. Includes participation in program planning  and Integrated Product Team meetings."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.373"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement HMS acquisition strategy. Includes Core, Matrix, and Contractor support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.485"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement HMS acquisition strategy. Includes Core, Matrix, and Contractor support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.425"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.425"
                                            },
                                            "Text": {
                                                "val": "During this timeframe, will provide overall management and oversight to implement HMS acquisition strategy. Includes Matrix and Contractor support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in requirement is a result of the removal of Core support as this requirement will be covered with OMA funds starting in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HMS Engineering\/Technical Support"
                                    },
                                    "Description": {
                                        "val": "Overall technical analysis support to PdM HMS' Handheld products."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.154"
                                            },
                                            "Text": {
                                                "val": "Provide technical systems engineering support to evaluate technical alternatives and perform communication architecture analysis to identify alternatives to reduce cost, improve performance, and achieve tactical radio objectives. Technical test support for the planning and execution of laboratory and field test events, including support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Provide technical systems engineering support to evaluate technical alternatives and perform communication architecture analysis to identify alternatives to reduce cost, improve performance, and achieve tactical radio objectives. Technical test support for the planning and execution of laboratory and field test events, including support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.3"
                                            },
                                            "Text": {
                                                "val": "Provide technical systems engineering support to evaluate technical alternatives and perform communication architecture analysis to identify alternatives to reduce cost, improve performance, and achieve tactical radio objectives. Technical test support for the planning and execution of laboratory and field test events, including support for testing of prototypes, Engineering Design Models (EDMs), commercial radio solutions, Developmental and Operational Test events, and data collection\/reduction\/analysis of tactical radio performance."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Description": {
                                        "val": "Handheld's Test and Evaluation focuses on the evaluation of key technical and operational characteristics of the system: Radio Frequency performance, security, Reliability, Availability & Maintainability, and survivability requirements, in addition to operational environmental performance requirements as per the Capability Production Document. All radios awarded a contract will be required to go through the Qualification Test (QT) to qualify for Field \/ Lab Based Risk Reduction (FBRR\/LBRR) that will serve as risk reduction events prior to Operational Test (OT) to ensure the radio is operational at full capability and ready to be used by soldiers.\n\nThe QT will validate the manufacturers' ability to meet the minimum functional requirements identified in the Performance Requirements Document. Radios that successfully demonstrate key capabilities during QT will proceed to FBRR\/LBRR. The OT will include support from Army and DoD operational testers and will use communication scenarios based on the Operational Mode Summary \/ Mission Profile of the system(s) under test. The OT will be designed to validate that the HMS products meet warfighter needs in terms of effectiveness, suitability and survivability in an operationally realistic environment. Results from the OT will facilitate the delivery orders for Full Rate Production."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.324"
                                            },
                                            "Text": {
                                                "val": "Originally, the FY 2017 budget was to provide funding required for Performance Verification Testing (PVT) and any additional delta performance testing for the RR. The funding will also support program office support and other certifications necessary to prepare the products for fielding.\n\nGiven program direction, the FY 2017 funding is needed to conduct testing for the LR candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; and to fund the testing requirements on the LR candidate radios as laid out in the HMS Acquisition Strategy approved May 2014."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.252"
                                            },
                                            "Text": {
                                                "val": "The FY 2018 funding is needed to conduct testing for the LR candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; and to fund the testing requirements on the LR candidate radios as laid out in the HMS Acquisition Strategy addendum approved in March 2017."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.145"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.145"
                                            },
                                            "Text": {
                                                "val": "The FY 2019 funding is needed to conduct testing for the LR candidate products to demonstrate compliance with program requirements; assess effectiveness, suitability, and survivability; to obtain material release for FRP; and to fund the testing requirements on the LR candidate radios as laid out in the HMS Acquisition Strategy addendum approved in March 2017."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in requirement is a result of the radio reaching the end of operational testing while approaching full rate production."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "FA1"
                                    },
                                    "Title": {
                                        "val": "Manpack Radio"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "10.347"
                                        },
                                        "CurrentYear": {
                                            "val": "10.039"
                                        },
                                        "BudgetYearOne": {
                                            "val": "1.959"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.959"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "5.03"
                                        },
                                        "BudgetYearThree": {
                                            "val": "10.875"
                                        },
                                        "BudgetYearFour": {
                                            "val": "11.033"
                                        },
                                        "BudgetYearFive": {
                                            "val": "12.29"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "61.573"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B95006"
                                    },
                                    "Title": {
                                        "val": "Handheld Radio"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "43.734"
                                        },
                                        "CurrentYear": {
                                            "val": "37.773"
                                        },
                                        "BudgetYearOne": {
                                            "val": "79.802"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "79.802"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "102.959"
                                        },
                                        "BudgetYearThree": {
                                            "val": "92.94"
                                        },
                                        "BudgetYearFour": {
                                            "val": "95.091"
                                        },
                                        "BudgetYearFive": {
                                            "val": "92.653"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "544.952"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "B95007"
                                    },
                                    "Title": {
                                        "val": "Manpack Radio"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "224.388"
                                        },
                                        "CurrentYear": {
                                            "val": "317.578"
                                        },
                                        "BudgetYearOne": {
                                            "val": "271.763"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "271.763"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "413.805"
                                        },
                                        "BudgetYearThree": {
                                            "val": "402.038"
                                        },
                                        "BudgetYearFour": {
                                            "val": "453.968"
                                        },
                                        "BudgetYearFive": {
                                            "val": "505.349"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "On 13 September 2016 the Army Acquisition Executive (AAE) determined to decrease the Basis of Issue (BOI) for the single channel Rifleman Radio (RR), increase the BOI for the two channel Leader Radio (LR) and move forward with acquisition activities for the two channel LR. Single channel RR procurement is being deferred.  An acquisition strategy addendum adding LR was approved in March 2017. The addendum continues the multi-vendor approach utilizing the existing IDIQ RR base contract (awarded 29 April 2015) and lessons learned to award the LR competitive contracts. The LR effort will be a separate competition under the Handheld radio suite. The Program Office released the solicitation for the two channel LR to support Qualification Testing Sept 2017. The Program Office will change the strategy to request objective capabilities, rather than the previous approach of low cost technically acceptable, and seek a best value effort to increase operational flexibility. Rifleman Radio Increment 2 (LR) Capability Production Document (CPD) was JROC approved on April 2017.\n\nThe LR will simultaneously run the Soldier Radio Waveform (SRW), or other advanced networking waveforms, and Single Channel Ground and Airborne Radio System (SINCGARS).\n\nThe Army will award Firm Fixed-Price (FFP) Indefinite Delivery Indefinite Quantity (IDIQ) Contracts and will procure radios through a multiple step selection process:\na. Award FFP Contracts to all qualified vendors based on technical acceptability and demonstrations (3QFY18)\nb. Award initial delivery orders for FBRR\/OT assets (3QFY18)\nc. Award FRP delivery orders based on Operational Test and best value trade off construct (3QFY19)"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Project Management Office Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, CECOM, PM TR Alliant"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various; APG, MD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.373"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.485"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.425"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.425"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.283"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "HMS Engineering\/Technical Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO C3T, ARL, ESP, CECOM, CERDEC, LCMC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.154"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.3"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.754"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "EPG"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Fort Huachuca"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.676"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.1"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.776"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Follow on Delta Development & Testing (2)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "RO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OTC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.648"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.152"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.145"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.145"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "8.945"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_FA2.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Leader Radio (LR) Release For Proposal (RFP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Qualification Test (QT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Contract Award"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Field\/Lab Based Risk Reduction (FBRR\/LBRR)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Operational Test (OT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Log Demo"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Full Rate Production (FRP)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Performance Verification Test (PVT)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR Delivery Order"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR PVT (FY20)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR PVT (FY21)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR PVT (FY22)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "LR PVT (FY23)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}