{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-1-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-4",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603920D8Z"
        },
        "ProgramElementTitle": {
            "val": "Humanitarian De-mining"
        },
        "R1LineNumber": {
            "val": "89"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "57.464"
            },
            "PriorYear": {
                "val": "9.740"
            },
            "CurrentYear": {
                "val": "10.837"
            },
            "BudgetYearOne": {
                "val": "11.347"
            },
            "BudgetYearOneBase": {
                "val": "11.347"
            },
            "BudgetYearTwo": {
                "val": "10.820"
            },
            "BudgetYearThree": {
                "val": "11.031"
            },
            "BudgetYearFour": {
                "val": "11.267"
            },
            "BudgetYearFive": {
                "val": "11.260"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "10.007"
                },
                "CurrentYear": {
                    "val": "10.837"
                },
                "BudgetYearOne": {
                    "val": "11.347"
                },
                "BudgetYearOneBase": {
                    "val": "11.347"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.740"
                },
                "CurrentYear": {
                    "val": "10.837"
                },
                "BudgetYearOne": {
                    "val": "11.347"
                },
                "BudgetYearOneBase": {
                    "val": "11.347"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.267"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "0.000"
                },
                "BudgetYearOneBase": {
                    "val": "0.000"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Internal Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.267"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Reductions were in support of Departmental efficiencies and economic assumptions."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "920"
                    },
                    "ProjectTitle": {
                        "val": "Humanitarian De-mining"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "57.464"
                        },
                        "PriorYear": {
                            "val": "9.740"
                        },
                        "CurrentYear": {
                            "val": "10.837"
                        },
                        "BudgetYearOne": {
                            "val": "11.347"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.347"
                        },
                        "BudgetYearTwo": {
                            "val": "10.820"
                        },
                        "BudgetYearThree": {
                            "val": "11.031"
                        },
                        "BudgetYearFour": {
                            "val": "11.267"
                        },
                        "BudgetYearFive": {
                            "val": "11.260"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Under the Office of the Assistant Secretary of Defense for Special Operations and Low-Intensity Conflict (OASD SO\/LIC), the Humanitarian Demining Research and Development (HD R&D) program element develops, demonstrates and validates cost-effective technologies for use in humanitarian demining via operational field evaluations in support of Geographical Combatant Commands (GCC) Humanitarian Mine Action (HMA) goals and objectives.  \n\nThe HD R&D Program works closely with the GCCs and the Humanitarian Demining Training Center (HDTC) to craft a research and development plan that supports GCC HMA program plans and strategic objectives and enhances mil-to-mil partnerships in key regional states and provides access to live mines\/UXO around the world for operational test data collection unavailable to any other DoD organization.  The HD R&D Program accomplishes the GCC support by utilizing host nation demining partners to evaluate technology in actual minefields to simultaneously achieve HMA objectives and identify performance parameters; data is delivered to the US military countermine R&D programs to inform future investment decisions.  In addition to the improvements made to technologies used by U.S. forces and to the reduction of landmine and UXO threat to US forces and host nation population, the Program’s technology trainings and evaluations build mine action capacity and capability within mine-affected countries and improve safety, stability and economic development. \n\nSince 1995 the program has fielded technologies for 202 evaluations in 39 countries, including Afghanistan, Iraq, Vietnam, Cambodia, Angola and Zimbabwe.  The program’s technologies have cleared 46.7 million square meters of the world’s toughest minefields; and found or destroyed 186,000 mines and UXO.\n\nNew technology requirements and areas of emphasis are identified and validated at a biennial Requirements Workshop and a biennial UXO Working Group Meeting held by OASD SO\/LIC.  The meetings involve representatives from Department of State (DOS), GCC Humanitarian Mine Action offices, mine action organizations and mine-affected nations.  The program element’s work fulfills the Department of Defense’s strategic guidance to address instability and reduce the demand for significant US force commitments to stability operations; with DODI 3000.05 to foster security, economic security and development, and build indigenous capacity; and with § 407 and CJCSI 3207.01C to reduce the social, economic and environmental impact of landmines and unexploded ordnance."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "0603920D8Z - SO\/LIC Humanitarian De-mining"
                                    },
                                    "Description": {
                                        "val": "The HD R&D Program adapts commercial-off-the-shelf equipment, integrates mature technologies, and leverages R&D activity within DoD, particularly in the Army's Night Vision and Electronic Sensors Directorate (NVESD) Tactical Countermine mission area.  The program aims to improve existing technologies for: mine\/unexploded ordnance (UXO) detection, technical survey\/area reduction, mechanical mine\/UXO clearance, underwater UXO detection and clearance, vegetation clearance, mechanical mine neutralization, and post-clearance quality control (QC)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.740"
                                            },
                                            "Text": {
                                                "val": "Deploy new technology, including Wet Soil Buckets, Armored Operator Station, and Sparrow to Cambodia; Rambo to Laos; HSTAMIDS and Bearcat to Colombia; Remote Monitoring Station to Thailand;  and Quadcopter to Bosnia, Cambodia, Iraq, Laos, Lebanon, Sri Lanka, Ukraine, and West Bank\n•\tDevelop new technology for mine clearance in Iraq and Colombia\n•\tComplete ongoing equipment developments\/modifications\n•\tContinue successful operational evaluations from FY2016\n• Support the combatant commands and Embassy staffs by conducting new site surveys and country assessments in Vietnam, Colombia, Ukraine and Northern Iraq\n• Develop, test and evaluate new prototype technologies based on feedback from the field, including nine technology development tasks in individual mine\/UXO and minefield detection and six technology development tasks in mechanical mine\/UXO and vegetation clearance"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.837"
                                            },
                                            "Text": {
                                                "val": "Deploy new technology, including Ferex to Israel; Armored Operator Station, Empact, and improvements to Piranha to Cambodia; Little Storm, HSTAMIDS and Bearcat to Colombia; and Traxx to Ukraine \n• Develop new technology for mine clearance in Iraq and Colombia\n• Complete ongoing equipment developments\/modifications and test technology including Advanced Positioning System, Delta, Empact 3D, VMX10, UPEX-745, CMD-3, Primetech, and Little Storm\n• Continue successful operational evaluations from FY2017\n• Support the combatant commands and Embassy staffs by conducting new site surveys and country assessments in Vietnam, Chile, Colombia, Laos, and Ukraine\n• Develop, test and evaluate new prototype technologies based on feedback from the field"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.347"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.347"
                                            },
                                            "Text": {
                                                "val": "• Deploy new technology to Colombia, Iraq and other countries \n• Complete ongoing equipment developments\/modifications\n• Continue successful operational evaluations from FY2017\n• Support the combatant commands and Embassy staffs by conducting new site surveys and country assessments\n• Develop, test and evaluate new prototype technologies based on feedback from the field in the following areas: technical survey, individual mine\/UXO and minefield detection, mechanical mine\/UXO and vegetation clearance, underwater UXO detection and clearance, mechanical mine neutralization, and post-clearance QA"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from FY18 to FY19 due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Following a rapid prototyping strategy, the program emphasizes the use\/modification of existing, commercially-available equipment and components to build functional prototype equipment suited for humanitarian demining operations.  This approach is required due to the immediate need for new demining technologies in the face of ongoing U.S. forces and host nation citizen casualties in mine-affected countries.  The program evaluates prototype equipment by acquiring it off-the-shelf from industry using competition to the extent possible, by leveraging ongoing countermine R&D efforts in other U.S. and foreign R&D activities, and by taking advantage of extensive in-house fabrication capabilities at the Army's Night Vision and Electronic Sensors Division (NVESD)."
                        },
                        "PerformanceMetrics": {
                            "val": "Long Term Strategies:  Obtain adequate funding to support critical shortfalls; prioritize proposals that are deemed acceptable and allocate funding accordingly; and establish outreach programs to leverage institutional knowledge and expertise. \n\nPerformance Indicator and Rating:\nFY 2017 Target:\n90% of currently funded research technologies are completed on time and within budget\nComplete scheduled R&D project tasks\nTransition field-ready technologies to host nation demining partners\n\nFY 2018 Target:\n90% of currently funded research technologies are completed on time and within budget\nComplete scheduled R&D project tasks\nTransition field-ready technologies to host nation demining partners\nConduct biennial Humanitarian R&D Program Requirements Workshop\n\nFY 2017 Performance Rating: Funded research technologies were completed per the target.\n\nVerification: The Humanitarian Demining Program performs program reviews with other USG agencies (DOS PM WRA, DSCA, HDTC, CENTCOM, PACOM, SOUTHCOM, AFRICOM, EUCOM) and has oversight from OSD SO\/LIC.\n\nValidation: Completed R&D products increase the capabilities of the DoD to effectively perform demining missions."
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "The Humanitarian Demining Research and Development (HD R&D) program element rapidly develops, demonstrates and validates new technologies for DoD-supported nations to detect and clear landmines and unexploded ordnance (UXO), and to contribute to US military countermine R&D. The HD R&D Program focuses on development of new technologies to improve the efficiency and safety of indigenous nation-conducted, post-conflict clearance of residual mines and UXO, which pose a serious threat to US forces conducting stability operations, and to the host nation’s population and economy."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "The HD R&D Program adapts commercial-off-the-shelf equipment, integrates mature technologies, and leverages R&D activity within DoD, particularly in the Army's Night Vision and Electronic Sensors Directorate (NVESD) Tactical Countermine mission area."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Primary Hardware Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM-NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "34.099"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.116"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.796"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.095"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.095"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Evaluations of HD R&D Program-developed technologies in actual minefields are conducted by host nation demining partners (foreign military, non-governmental organizations and mine action centers) and provide valuable data for US military countermine R&D and next generation HD technology developments while directly contributing to world-wide mine and UXO clearance."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Humanitarian Demining Research and Development Program"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM-NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "21.634"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.354"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "4.770"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.980"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.980"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "The HD R&D Program managers oversee adaptation of commercial-off-the-shelf equipment, integration of mature technologies, and leverage of R&D activity within DoD, particularly in the Army's Night Vision and Electronic Sensors Directorate (NVESD) Tactical Countermine mission area. Areas of emphasis are identified and validated at a biennial Requirements Workshop held by OASD SO\/LIC. The Requirements Workshop involves representatives from Department of State (DoS), U.S. combatant commands (COCOMS) and mine-affected nations."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Humanitarian Demining Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "RDECOM-NVESD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Ft Belvoir, VA"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.731"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.270"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.271"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.272"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.272"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "HD R4.jpg"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Mechanical Mine\/UXO Clearance Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Mine\/UXO Detection Systems"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}