{
    "id": "2019-Army-PB-2040-JBOOK-79b591210fd408c628921aca85d0d9ff79c726d2b3f64254da15763996a4ed4f-21",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA5A-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604780A"
        },
        "ProgramElementTitle": {
            "val": "Combined Arms Tactical Trainer (CATT) Core"
        },
        "R1LineNumber": {
            "val": "105"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "14.538"
            },
            "CurrentYear": {
                "val": "18.566"
            },
            "BudgetYearOne": {
                "val": "21.964"
            },
            "BudgetYearOneBase": {
                "val": "21.964"
            },
            "BudgetYearTwo": {
                "val": "15.554"
            },
            "BudgetYearThree": {
                "val": "15.322"
            },
            "BudgetYearFour": {
                "val": "12.757"
            },
            "BudgetYearFive": {
                "val": "11.805"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "110.506"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Combined Arms Tactical Trainers (CATT) represent a family of combined arms simulation systems designed to support the Army's simulation-based, Combined Arms Training Strategy. The CATT program portfolio directly supports the Army's Training Strategy and progressive training model by providing realistic training events and comprehensive After Action Reviews (AAR). CATT enables units, from crew to the battalion task force level, to conduct a wide variety of combat tasks on a realistic, interactive, synthetic battlefield.  CATT's combination of manned simulators and staff officer workstations enables units to train as a combined arms team in a cost effective manner.  The primary CATT system is the Close Combat Tactical Trainer (CCTT) which provides the underlying baseline architecture and AAR for CATT expansions, Pre-Planned Product Improvements (P3I) and system enhancements.  The Reconfigurable Vehicle Simulator (RVS) supports combat convoy operations and Improvised Explosive Devices (IED) tasks.  Synthetic Environment (SE) Core provides for the expansion of the synthetic environment baseline to include enhanced interoperability and the products and infrastructure to support current and future combat operations and mission rehearsal required for Unified Land Operations.  The first synthetic environments expanded were in the Aviation Combined Arms Tactical Trainer (AVCATT) and the CCTT for both the Active and Reserve components.  Gaming Technology provides an application to train and rehearse convoy-operations, platoon level, mounted infantry tactics, dismounted operations, rules-of-engagement training, cross-cultural communications training, IED defeat training, route clearance, ground-air coordination, Unmanned Aerial Vehicle (UAV) integration, and other small unit and individual training and mission rehearsal requirements.  Soldiers can train in a common environment on geotypical or geospecific virtual terrain.  It is also possible to link Gaming technology to actual communication, command, control, computer, and intelligence (C4I) systems and other CATT simulation systems to increase the utility and realism of the training.  By practicing skills in CATT, units are able to effectively prepare for costly live fire and maneuver exercises, as well as training tasks deemed too hazardous to conduct in a live training environment. Fielded in both fixed site and mobile versions, CATT enables both Active and Reserve component units to prepare for real world contingency missions.  By being able to use a wide array of training terrain databases and modify the behavior of the computer generated opposing forces, CATT offers an unlimited array of training options to support the Army's many regional combat missions.  The combination of tough field and live fire training, and realistic simulation training in CATT, is the formula to prepare Soldiers and their Leaders for the uncertainties they face in combat operations.\n\nFY 2019 base funding of $0.665 million for CCTT enables gaming technology and visualization for maneuver training, and the P3I for the CCTT in order to reduce life cycle costs.\n\nFY 2019 base funding of $2.268 million for Games for Training will provide improved Government data rights and integration of an extended capability for the GFT software, Virtual Battlespace 3 (VBS3). These capabilities are to include, but not limited to, adding jamming and communications, close air support, and medical competencies. Additionally, funds will be used to conduct development and integration activities of the GFT system to ensure interoperability with Live, Virtual and Constructive training simulations and Mission Command Systems, and compliance with Risk Management Framework (RMF) requirements.\n\nFY2019 base funding of $9.729 million for SE Core will continue the development of the Standard Terrain Generation Capability (STDGC) to ensure the process remains Army Geospatial Center (AGC) certified and that the correlated terrain databases maintain the \"Gold Standard\" quality rating and remain concurrent with supported training systems.  FY19 funds will continue developing and integrating the tools and process for constructive terrain database generation. Additionally, funds will be used to enhance subterranean and building interiors capabilities for incorporation into the STDGC baseline to provide interoperability across training simulators and simulations. SE Core will continue to enhance Virtual One Semi-Automated Forces (Virtual OneSAF) in the SE Core Architecture and develop, upgrade, integrate and refine the common visual models with FY19 funds.\n  \nFY 2019 base funding of $9.302 million for AVCATT will design and develop software to inter-operate with other training devices and simulators in a Common Operating Environment (COE).  This is required to enable training with the Universal Mission Simulator, CCTT, Games For Training, and LVC-IA.  Additionally, the base funding will be used to design and develop the replacement of the Image Generator system as part of hardware modernization."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "15.068"
                },
                "CurrentYear": {
                    "val": "18.566"
                },
                "BudgetYearOne": {
                    "val": "19.601"
                },
                "BudgetYearOneBase": {
                    "val": "19.601"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "14.538"
                },
                "CurrentYear": {
                    "val": "18.566"
                },
                "BudgetYearOne": {
                    "val": "21.964"
                },
                "BudgetYearOneBase": {
                    "val": "21.964"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.53"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "2.363"
                },
                "BudgetYearOneBase": {
                    "val": "2.363"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.006"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.524"
                    },
                    "CurrentYear": {
                        "val": "-0.513"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "0.513"
                                },
                                "BudgetYearOne": {
                                    "val": "2.363"
                                },
                                "BudgetYearOneBase": {
                                    "val": "2.363"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY19 funding was primarily due to AVCATT's alignment with projected award of the AVCATT modernization \/ tech refresh contract and beginning of a three year RDT&E modernization cycle."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "571"
                    },
                    "ProjectTitle": {
                        "val": "Close Cbt Tact Trainer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.972"
                        },
                        "CurrentYear": {
                            "val": "0.937"
                        },
                        "BudgetYearOne": {
                            "val": "0.665"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.665"
                        },
                        "BudgetYearTwo": {
                            "val": "0.651"
                        },
                        "BudgetYearThree": {
                            "val": "0.988"
                        },
                        "BudgetYearFour": {
                            "val": "0.988"
                        },
                        "BudgetYearFive": {
                            "val": "0.988"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.189"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Close Combat Tactical Trainer (CCTT) immersively and comprehensively trains Armor, Cavalry, Infantry, Mechanized Infantry, and Armored Reconnaissance units from squad through Battalion\/Squadron level, to include their staffs.  The primary training audience operates from full-crew simulators, reconfigurable command posts, and live battalion command posts to accomplish their combined arms training tasks. CCTT is a ground based, collective training device comprised of the CCTT and the Reconfigurable Vehicle Tactical Trainer (RVTT).  CCTT is comprised of full fidelity, manned simulators for the M1 Abrams main battle tank, M2 Bradley Fighting Vehicles (BFV) variants, and Cavalry Fighting Vehicles (CFV).  RVTT is a CCTT Reconfigurable Vehicle Simulator (RVS) comprised of full fidelity, manned simulators for the High Mobility Multipurpose Wheeled Vehicle (HMMWV) and Heavy Expanded Mobility Tactical Truck (HEMTT).  \n\nFY 2019 core funding of $.665 million for CCTT enables: the continued development and integration of gaming technology, development of virtualization technology to support maneuver training, and the Planning, Performance, Process & Innovation (P31) to reduce life cycle costs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Close Combat Tactical Trainer (CCTT) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the CCTT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.138"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and will continue operational evaluation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.166"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and will continue operational evaluation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.169"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.169"
                                            },
                                            "Text": {
                                                "val": "Will support engineering, technical, contracting support, and will continue operational evaluation support."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "PMO costs increase for inflation"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for CCTT, and Interoperability between CCTT."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for CCTT."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.834"
                                            },
                                            "Text": {
                                                "val": "Will enable the continued development and integration of gaming technology; and development of virtualization technology into CCTT in support of maneuver training for Armor Brigade Combat Teams."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.771"
                                            },
                                            "Text": {
                                                "val": "Will enable the continued development and integration of gaming technology; and development of virtualization technology into CCTT in support of maneuver training for Armor Brigade Combat Teams."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.496"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.496"
                                            },
                                            "Text": {
                                                "val": "Will enable the continued development and integration of gaming technology; and development of virtualization technology into CCTT in support of maneuver training for Armor Brigade Combat Teams."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 was funded at lower levels than FY18.  The scope of development efforts will be reduced at a level commensurate with funding provided."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NA0170"
                                    },
                                    "Title": {
                                        "val": "Close Combat Tactical Trainer"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "47.962"
                                        },
                                        "CurrentYear": {
                                            "val": "45.718"
                                        },
                                        "BudgetYearOne": {
                                            "val": "33.08"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "33.08"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "46.156"
                                        },
                                        "BudgetYearThree": {
                                            "val": "34.42"
                                        },
                                        "BudgetYearFour": {
                                            "val": "23.543"
                                        },
                                        "BudgetYearFive": {
                                            "val": "16.059"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "246.938"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation 121018000, TCAT"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000 and 435104 TCAT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "2.95"
                                        },
                                        "CurrentYear": {
                                            "val": "3.246"
                                        },
                                        "BudgetYearOne": {
                                            "val": "7.913"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "7.913"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "8.239"
                                        },
                                        "BudgetYearThree": {
                                            "val": "7.241"
                                        },
                                        "BudgetYearFour": {
                                            "val": "6.736"
                                        },
                                        "BudgetYearFive": {
                                            "val": "5.401"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "The RDT&E efforts are essential to provide enhancements for the hardware and software of the program to meet warfighter mission priorities and validated requirements.  These enhancements, after proper testing, will be procured and fielded with the programs procurement funds.\n\nCivilian pay, per HQDA directive is now in OMA APE 435104.  For CCTT, the civilian pay amount is approximately $4.2M annually."
                        },
                        "AcquisitionStrategy": {
                            "val": "All CCTT development will utilize small business competively awarded contract vehicles or agreements with the Army Research Laboratory (ARL) and other Army programs for support of research and development."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Program Management, Engineering, Technical, Contracting Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "17.707"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.163"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.167"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.169"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.169"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "EMD Phase - Virtualization"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "T&M"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AVT Simulation"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.872"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.809"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.77"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-03"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.496"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.496"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.947"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260713_571.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "P3I in Support of Gaming Technology and Virtualization for Maneuver Training"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "577"
                    },
                    "ProjectTitle": {
                        "val": "Gaming Technology In Support Of Army Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.903"
                        },
                        "CurrentYear": {
                            "val": "0.536"
                        },
                        "BudgetYearOne": {
                            "val": "2.268"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.268"
                        },
                        "BudgetYearTwo": {
                            "val": "2.273"
                        },
                        "BudgetYearThree": {
                            "val": "1.615"
                        },
                        "BudgetYearFour": {
                            "val": "1.725"
                        },
                        "BudgetYearFive": {
                            "val": "0.913"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.233"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Games for Training (GFT) Program prepares Soldiers and leaders for combined arms maneuver operations for Force 2025 and beyond in support of the Joint Force and allies with tailorable and scalable training and mission rehearsal capabilities. Gaming Technology provides an application to train and rehearse convoy-operations, platoon level, mounted infantry tactics, dismounted operations, rules-of-engagement training, cross-cultural communications training, IED defeat training, route clearance, groundair coordination, Unmanned Aerial Vehicle (UAV) integration, and other small unit and individual training and mission rehearsal requirements. The GFT program satisfies the Active, the National Guard, and the Army Reserves' educational requirements in the Operational, Institutional, and Self-Development Training Domains with a low-overhead, flexible, persistent training capability on geo-specific and geo-typical terrain that is relevant with all military platforms and weapon systems. GFT comprehensively trains Company and below formations to operate in today's dynamic combat environment. GFT trains higher multi-echelon units and staffs without troops to meet Combatant Commanders' requirements.  \n\nFY 2019 base funding of $2.268 million for Games for Training will provide improved Government data rights and integration of an extended capability for the GFT software, Virtual Battlespace 3 (VBS3). These capabilities are to include, but not limited to, adding jamming and communications, close air support, and medical competencies. Additionally, funds will be used to conduct development and integration activities of the GFT system to ensure interoperability with Live, Virtual and Constructive training simulations and Mission Command Systems, and compliance with Risk Management Framework (RMF) requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Games for Training (GFT) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the GFT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.617"
                                            },
                                            "Text": {
                                                "val": "Funding will provide concurrency modifications to the GFT system to ensure integration compliance with Live, Virtual and Constructive simulations and Mission Command Systems in support of Force 2025 and beyond training. Funding will allow for Engineering and Manufacturing Development of the GFT system into Common Operating Environment (COE) for Data Cloud and Hand Held environments. Funding also provides market research for the GFT flagship replacement."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.268"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.268"
                                            },
                                            "Text": {
                                                "val": "Funding will provide increased Government data rights and integration of enhanced capability for Virtual Battlespace 3 (VBS3) in achieving training requirements. These capabilities are to include, but not limited to, adding jamming and communications, close air support, and medical competencies. Additionally, funds will be used to conduct development and integration activities of the GFT system to ensure interoperability with Live, Virtual and Constructive training simulations and Mission Command Systems, and compliance with Risk Management Framework (RMF) requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funding from FY18 to FY19 is result of the integration of capabilities and concurrency modifications for the GFT system to ensure integration compliance with Live, Virtual and Constructive simulations and Mission Command Systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the GFT program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the GFT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.286"
                                            },
                                            "Text": {
                                                "val": "Government program management, engineering, technical, contract and test activities will provide integration of software, fielding, and web hosted support to U.S. Army Soldier tactical training."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.536"
                                            },
                                            "Text": {
                                                "val": "Government program management, engineering, technical, contract and test activities to support market research for future commercial and Government gaming solutions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding for FY18 to FY19 is a result of concluding market research efforts for the GFT flagship replacement. Additionally, decrease is due to government civilian labor cost being moved to 435104 OMA, in accordance with Army Policy."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NA0176"
                                    },
                                    "Title": {
                                        "val": "OPA 3, Appropriation NA0176 Gaming Technology in Support of Army Training"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "11.543"
                                        },
                                        "CurrentYear": {
                                            "val": "5.406"
                                        },
                                        "BudgetYearOne": {
                                            "val": "25.471"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "25.471"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "18.564"
                                        },
                                        "BudgetYearThree": {
                                            "val": "17.006"
                                        },
                                        "BudgetYearFour": {
                                            "val": "14.527"
                                        },
                                        "BudgetYearFive": {
                                            "val": "7.396"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation 121018000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000, TCAT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.241"
                                        },
                                        "CurrentYear": {
                                            "val": "0.25"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.279"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.279"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.435"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.448"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.461"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.475"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation, 435104000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation, 435104000, TCAT"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "0.682"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.682"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.695"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.71"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.724"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.74"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "OPA funding provides concurrency of the Virtual Battlespace 3 (VBS3) software that provides the Army enterprise use rights. Additionally, OPA funding conducts the procurement and fielding of the Stryker Virtual Collective Trainers (SVCT), new gaming hardware suites, and gaming system refreshes. The GFT program will also provide other commercial and Government off the-shelf game software applications used to train Active, Reserve, and Army National Guard soldiers in a PC based, shared environment. OMA funding supports system monitoring of the Games for Training hardware and software configuration, in addition to funding Government program management, engineering and technical oversight for the GFT program."
                        },
                        "AcquisitionStrategy": {
                            "val": "The acquisition strategy supports Army-wide gaming software for a commercial game based training system with government data rights, Virtual Battlespace 3 (VBS3), and associated Games for Training system hardware. The hardware consist of a common desktop or laptop computer, headset, and peripherals. In support of concurrency initiatives to the COTS solution, the GFT program conducts development and integration activities for new models and visual concurrency for the VBS3 software baseline.\n\nIn FY17, the government awarded a firm-fixed price contract for concurrency of the VBS3 software, to include commercial software updates, and technical support for the VBS3 suite of products. Additionally, the government plans to procure VBS3 training support as well as commercial VBS3 software data rights to provide areas of training competency such as engineering tasks, call for fire, and the generation of supporting 3D models. The contract was awarded June 2017 with one base year and four (4) one year option periods."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "1.853"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.286"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.536"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Games for Training"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "9.286"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.617"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.268"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.268"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260713_577.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "GFT Program Management"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GFT Integration with LVC"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2010"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GFT Verification Testing"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GFT Software Development and Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "GFT Market Research"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "582"
                    },
                    "ProjectTitle": {
                        "val": "Synthetic Envir Core"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9"
                        },
                        "CurrentYear": {
                            "val": "11.513"
                        },
                        "BudgetYearOne": {
                            "val": "9.729"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.729"
                        },
                        "BudgetYearTwo": {
                            "val": "9.83"
                        },
                        "BudgetYearThree": {
                            "val": "9.863"
                        },
                        "BudgetYearFour": {
                            "val": "10.044"
                        },
                        "BudgetYearFive": {
                            "val": "9.904"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "69.883"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project supports the Synthetic Environment Core (SE Core) Program.  The Synthetic Environment Core (SE Core) Program is a foundational element and the only provider of correlated terrain for the Army's Live, Virtual, Constructive Integrated Training Environment (LVC ITE) that links Army training systems and simulators into an integrated and interoperable environment.  SE Core's mission is to ensure that Army systems and simulators support U.S. Army Readiness by providing visual models (buildings and vehicles), terrain (over which the simulator moves), and entity behaviors (models performing realistic and appropriate actions such as movement and weapon effects) that are relevant and realistic to Force 2025 and beyond.  As the exclusive provider of correlated terrain, SE Core ensures that all Army simulators\/operators receive terrain that allows for a \"Fair Fight\" capability; that is, no one will have an inherent advantage over another because training did not occur on a \"level playing field\".  Fair Fight allows air and ground forces to hold coordinated and integrated training events that accurately replicate combat operations for a train-as-we-fight capability.  \n\nA major component of the program is the SE Core-developed Standard Terrain Database Generation Capability (STDGC), the process used to build the terrain and models that the simulators and simulations employ.  The Army Geospatial Center (AGC) gave SE Core its highest rating, the \"Gold Standard\", based on the quality of the STDGC process and the geospatial data generated by it.  The program has been a certified, AGC co-producer of geospatial data since 2014.  In addition to the correlated terrain databases and common visual models, SE Core components include Virtual One Semi-Automated Forces (Virtual OneSAF) (the computer generated force behaviors for virtual systems); the virtual systems architecture; and mission command development. \n\nFY2019 base funding of $9.729 million for SE Core will continue the development of the STDGC terrain generation capability to ensure the process remains AGC certified and that the correlated terrain databases maintain the \"Gold Standard\" quality rating and remain concurrent with supported training systems.  FY19 funds will continue developing and integrating the tools and process for constructive terrain database generation. Additionally, funds will be used to enhance subterranean and building interiors capabilities for incorporation into the STDGC baseline to provide interoperability across training simulators and simulations. SE Core will continue to enhance Virtual OneSAF in the SE Core Architecture and develop, upgrade, integrate and refine the common visual models with FY19 funds."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Synthetic Environment Core (SE Core) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the SE Core program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.412"
                                            },
                                            "Text": {
                                                "val": "Continues to satisfy requirements in preparation to complete Increment 2.  Efforts will automate the terrain generation capability to meet the demand for synthetic terrain for constructive and gaming training. Will also increase interoperability across simulators and simulations by improving subterranean capabilities and transportation networks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.841"
                                            },
                                            "Text": {
                                                "val": "Satisfy requirements necessary to initiate Increment 3. Efforts will continue to automate the terrain generation capability to meet the demand for synthetic terrain for constructive and gaming training. Will also continue to increase interoperability across simulators and simulations by improving subterranean capabilities and building interiors. Will begin development of new tools and processes needed to support the Dense Urban Terrain environment requirement."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.214"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.214"
                                            },
                                            "Text": {
                                                "val": "Continue to fulfill requirements of Increment 3. Efforts to automate the terrain generation capability to meet the demand for synthetic terrain for constructive and gaming training will continue. Will continue to increase interoperability across simulators and simulations by improving subterranean capabilities and building interiors. Will research requirements and begin systems engineering required to add additional LVC-IA system formats into the terrain generation process."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease between FY18 to FY19 is a result from accelerating development of new tools and processes to support the complex Dense Urban Terrain environment requirements in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Synthetic Environment Core (SE Core) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the SE Core program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.588"
                                            },
                                            "Text": {
                                                "val": "Will provide program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of SE Core."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.672"
                                            },
                                            "Text": {
                                                "val": "Will provide program management, engineering and technical oversight, contract support, and travel for support of site surveys and Subject Matter Experts for the development of SE Core under the newly awarded contract."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.515"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.515"
                                            },
                                            "Text": {
                                                "val": "Will provide funding for program management travel supporting site surveys, in addition to, funding the Subject Matter Experts providing technical oversight in the development of SE Core terrain generation capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease from FY18 to FY19 is due to government civilian labor cost being moved to 435104 OMA, in accordance with Army Policy."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation, 121018000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 121018000, TBWG"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "16.829"
                                        },
                                        "CurrentYear": {
                                            "val": "16.915"
                                        },
                                        "BudgetYearOne": {
                                            "val": "14.927"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "14.927"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "15.47"
                                        },
                                        "BudgetYearThree": {
                                            "val": "15.883"
                                        },
                                        "BudgetYearFour": {
                                            "val": "17.483"
                                        },
                                        "BudgetYearFive": {
                                            "val": "17.336"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation, 435104000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation, 435104000, TBWG"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "1.268"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.268"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.292"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.673"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.708"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.698"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "OMA, Appropriation, 435A98000"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation, 435A98000, TBWG"
                                    },
                                    "Funding": {
                                        "CurrentYear": {
                                            "val": "0.157"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "0.157"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "OMA funds are used to generate and maintain the synthetic terrain, models, and virtual OneSAF for the Army's Integrated Training Environment (ITE) concept. Additionally, OMA funds provides Government Program Management Oversight of aforementioned activities."
                        },
                        "AcquisitionStrategy": {
                            "val": "The SE Core program is post Milestone B and will remain in the Engineering and Manufacturing Development phase for the remainder of its lifecycle.  SE Core is a \"software only\" program that continuously develops terrain, virtual models and other software products for integration into existing training systems. It does not field products to the end user, therefore the program will not require a Milestone C decision or go into the Production phase. The SE Core program is developing the software tools and processes to develop the Army's common virtual environment to link simulation devices [to include: Close Combat Tactical Trainer (CCTT), Aviation Close Combat tactical Trainer (AVCATT) , Games for Training (GFT), Live, Virtual, Constructive Integrating Architecture (LVC-IA), Homestation Instrumentation Training System (HITS), Joint Land Component Constructive Training Capability (JLCCTC), Fires Simulation (FIRESIM), One Semi-Automated Forces (OneSAF)] into an interoperable environment and maintaining the synthetic terrain, models, and virtual OneSAF for the Army's Integrated Training Environment (ITE) concept. \n\nThe government awarded Increment 2 as a single award, cost plus fixed fee (CPFF), indefinite delivery indefinite quantity (IDIQ) contract to Leidos in August 2011 with a period of performance start date of December 2011. Leidos was formerly known as Science Applications International Corporation (SAIC).  This contract has a one-year base with four one-year options.  The government exercised the first option in December 2012, the second option in December 2013, the third option in December 2014 and the fourth option in December 2015. The government awarded a final delivery order in December 2016 that extended the period of performance of the Increment 2 contract into December 2017.\n\nIn keeping with the original SE Core acquisition strategy of continuous development, the government intends to award the Increment 3 contract as a single award, CPFF, IDIQ contract in FY18. Increment 3, which will add the Dense Urban Terrain requirements, additional systems and formats, will align with the contract period of performance. The contract will have a one year base and four one-year options with a target end date of 2022."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Management Services"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.622"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.622"
                                                    },
                                                    "TargetValue": {
                                                        "val": "3.622"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "23.803"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "1.588"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-11"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.672"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.515"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.515"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "FY18 planned award date for Technology Development- Common Virtual Environment & Management INC III is slated for November 2017."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development - Architecture and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "6.946"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.946"
                                                    },
                                                    "TargetValue": {
                                                        "val": "6.946"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development -Architecture and Integration"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "SAIC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "50.785"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "50.785"
                                                    },
                                                    "TargetValue": {
                                                        "val": "50.785"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development -Database Virtual Environment Development"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "CAE, USA"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "56.179"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "56.179"
                                                    },
                                                    "TargetValue": {
                                                        "val": "56.179"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Common Virtual Environment & Management"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Leidos"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "69.275"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "7.412"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "76.687"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Common Virtual Environment & Management INC III"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC-Orlando"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "9.841"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.841"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Technology Development- Common Virtual Environment & Management INC III"
                                                },
                                                "ContractMethod": {
                                                    "val": "Option"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "ACC - Orlando"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.214"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.214"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.214"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Not Applicable"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technology Development - Test Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Test Community"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.125"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.125"
                                                    },
                                                    "TargetValue": {
                                                        "val": "0.125"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260713_582.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Increment 2 (Development and Integration)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2013"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Increment 3 (Development and Integration)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "585"
                    },
                    "ProjectTitle": {
                        "val": "Aviation Combined Arms Tactical Trainer"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.663"
                        },
                        "CurrentYear": {
                            "val": "5.58"
                        },
                        "BudgetYearOne": {
                            "val": "9.302"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.302"
                        },
                        "BudgetYearTwo": {
                            "val": "2.8"
                        },
                        "BudgetYearThree": {
                            "val": "2.856"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.201"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Aviation Combined Arms Tactical Trainer (AVCATT) is Army Aviation's only Collective Training Program of Record for Active, Reserve, and Army National Guard Aviation Units.  AVCATT enables unit collective and combined arms air-ground training for AH-64, UH-60, CH-47, and UH-72 aircrews within the Live, Virtual and Constructive (LVC) Integrated Training Environment (ITE). The AVCATT also supports the training of Non-Rated crew members in crew coordination, flight, aerial gunnery, hoist, and slingload related tasks via the Non-Rated Crew Member Manned Module (NCM3); which can be linked to AVCATT's UH-60, CH-47, and UH-72 cockpit configurations to support a unit's specific Mission Training Requirements.   \n\nFY2019 base funding of $9.302M for AVCATT will design and develop software to inter-operate with other training devices and simulators in a Common Operating Environment (COE).  This is required to enable training with the Universal Mission Simulator, Close Combat Tactical Trainers (CCTT), Games For Training, and LVC-IA.  Additionally, the base funding will be used to design and develop the replacement of the Image Generator system as part of hardware modernization."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Government Program Management for the Aviation Combined Arms Tactical Trainer (AVCATT) program."
                                    },
                                    "Description": {
                                        "val": "Government Program Management for the AVCATT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.435"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.104"
                                            },
                                            "Text": {
                                                "val": "Will support government program management, engineering, technical, contracting support, and continues operational evaluation support."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.106"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.106"
                                            },
                                            "Text": {
                                                "val": "Program Management costs were increased to reflect inflation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY17 RDTE program management costs were higher due to RDTE-specific requirements being imposed for one year.   Changes to reflect inflation in FY19 compared to FY18 costs."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activity for the Aviation Combined Arms Tactical Trainer (AVCATT) program."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase contract activities for the AVCATT program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.228"
                                            },
                                            "Text": {
                                                "val": "Will complete the design, development, and testing for the first article test for a virtualized AVCATT manned module architecture in order to reduce the current computer hardware footprint in preparation for FY18 planned hardware modernization."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.476"
                                            },
                                            "Text": {
                                                "val": "Will complete development and testing for new interfaces and protocols for the system to inter-operate with other training devices and simulators in a Common Operating Environment (COE).  Will begin design and development of upgraded image generators in preparation for FY20 planned hardware modernization."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.196"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.196"
                                            },
                                            "Text": {
                                                "val": "Continue EMD phase contract activities for the AVCATT program.  Replacement of both the AVCATT and NCM3 Image Generators with next generation, game based, cloud delivered rendering technology and the modification of existing AVCATT and NCM3 software baselines and data products (17 terrain databases and hundreds of 3D visual models) to accommodate the new image generator technology are planned."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 RDTE funding increases in FY19 to align with projected award of the AVCATT Modernization \/ Tech Refresh contract and beginning of a three year RDT&E modernization cycle.  Replacement of both the AVCATT and NCM3 Image Generators with next generation, game based, cloud delivered rendering technology and the modification of existing AVCATT and NCM3 software baselines and data products (17 terrain databases and hundreds of 3D visual models) to accommodate the new image generator technology are planned.  Enhancements to the NCM3 radio communications system are also planned."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "NA0173"
                                    },
                                    "Title": {
                                        "val": "OPA3, Appropriation NA0173 Aviation Combined Arms Tactical Trainer"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "40"
                                        },
                                        "CurrentYear": {
                                            "val": "30.568"
                                        },
                                        "BudgetYearOne": {
                                            "val": "24.599"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "24.599"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "34.665"
                                        },
                                        "BudgetYearThree": {
                                            "val": "32.774"
                                        },
                                        "BudgetYearFour": {
                                            "val": "36.758"
                                        },
                                        "BudgetYearFive": {
                                            "val": "37.455"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "Operations and Maintenance, Army"
                                    },
                                    "Title": {
                                        "val": "OMA, Appropriation 435104 TCAT"
                                    },
                                    "Funding": {
                                        "BudgetYearOne": {
                                            "val": "1.025"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "1.025"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "1.044"
                                        },
                                        "BudgetYearThree": {
                                            "val": "1.064"
                                        },
                                        "BudgetYearFour": {
                                            "val": "1.087"
                                        },
                                        "BudgetYearFive": {
                                            "val": "1.11"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "5.330"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "Civilian pay, per HQDA directive is now in OMA APE 435104.   No other OMA exists for the AVCATT program of record at this time."
                        },
                        "AcquisitionStrategy": {
                            "val": "The government awarded a single award, cost plus fixed fee (CPFF), indefinite delivery indefinite quantity (IDIQ) contract to Applied Visual Technologies, a minority owned, small disadvantaged business, in December 2012. The period of performance of the base contract is through December 2017. Additional tasks are exercised through delivery orders which each have multiple options for development. The most recently awarded RDTE effort was on the fourth delivery order, awarded in September 2014, which included options for gunnery enhancements, integrated data modem development, training environment virtualization, aviation mission planning software development, maintenance tool kit development, manned unmanned teaming, and AH-64E concurrency development.\n\nThe government awarded a single award, CPFF, IDIQ services contract to Cole Engineering Services, Inc, a small business, in September 2015.  The period of performance of the base contract is through September 2020.   The third task order, awarded in June 2016, included hardware modernization development and Windows 10 research and testing.  \n\nAVCATT utilizes small business competitively awarded contract vehicles when able. Currently small businesses are conducting development for dynamic terrain enhancements, NCM3 development, and training effectiveness analysis.\n\nThe AVCATT program is post Milestone C. Although the system is in the production phase, continuous research, development, testing, and engineering is required in order to maintain concurrency with the real world aircraft and systems that the AVCATT simulates in the virtual training environment. The AVCATT program has fielded the full base order of issue of 23 suites but continues to release incremental hardware and software upgrades at approximate semiannual intervals.  RDTE efforts will conclude in FY21, as system begins its transition into sustainment."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AVCATT Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO STRI"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.109"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.435"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.104"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.106"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.106"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.754"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Change in FY17 cost categories reflect shift of program priorities.  Specifically, interoperability and image generator development are more critical to training than maintenance tool kits or planning software."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "AVCATT Interoperability"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cole Engineering Services, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.938"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.042"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.042"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-07"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "3.980"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AVCATT Image Generators"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cole Engineering Services, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.538"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "8.154"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "8.154"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-05"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "10.692"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "AVCATT Virtualization - Manned Module"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Cole Engineering Services, INC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Orlando, FL"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.228"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "2.228"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260713_585.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "AVCATT Virtualization - Manned Module"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AVCATT Interoperability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AVCATT Image Generator"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AVCATT Flight Model Upgrade"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "AVCATT\/NCM3 Interoperability"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}