{
    "id": "2019-AirForce-PB-3600-MJBOOK-3-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-69",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "1201921F"
        },
        "ProgramElementTitle": {
            "val": "Service Support to STRATCOM - Space Activities"
        },
        "R1LineNumber": {
            "val": "309"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "7"
        },
        "BudgetActivityTitle": {
            "val": "Operational Systems Development"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "8.381"
            },
            "CurrentYear": {
                "val": "14.255"
            },
            "BudgetYearOne": {
                "val": "14.161"
            },
            "BudgetYearOneBase": {
                "val": "14.161"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "15.001"
            },
            "BudgetYearThree": {
                "val": "15.170"
            },
            "BudgetYearFour": {
                "val": "15.398"
            },
            "BudgetYearFive": {
                "val": "15.679"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The USSTRATCOM Defense Critical Infrastructure Protection program (DCIP) is a risk management program that seeks to ensure the availability of networked assets critical to USSTRATCOM and other DoD missions.  Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links. DCIP is directed by the Office of the Assistant Secretary of Defense (Homeland Defense & Americas' Security Affairs) [OASD (HD&ASA)].  DCIP manages the identification, prioritization, assessment, and assurance of Critical Infrastructure as a comprehensive program that includes the development of adaptive plans and procedures to mitigate risk, restore capability in the event of loss or degradation, support incident management, and protect defense critical infrastructure.\n\nNavigation Warfare (Navwar) is deliberate defensive and offensive action to assure positioning, navigation, and timing (PNT) information through coordinated employment of space, cyberspace, and electronic warfare (EW) operations. The JNWC develops and maintains the Department's premier collection of Navwar knowledge, and provides subject matter expertise support to warfighters, Department decision makers, the Federal Interagency (the Department of Homeland Security and other civil agencies concerned with the Critical National Infrastructure), and the Coalition. Navwar expertise is developed in part by execution of PNT Operational Field Assessments (POFAs), modeling and simulation, analysis, and exercise and training support. JNWC-conducted POFAs are a key element in evaluating US and Coalition Navwar capabilities and vulnerabilities and adversary capabilities and vulnerabilities, both crucial to executing PNT superiority mission sets in potentially denied \/ degraded PNT environments. JNWC provides Department wide PNT posture through the PNT Annual assessment. JNWC helps develop defensive and offensive PNT capabilities by focusing on two Joint Mission Essential Tasks:\n\n1. Provide Operational Navwar Support - Enable Navwar operations and provide planning subject matter expertise to Combatant Commands, Services, interagency partners\nand the coalition; Advocate DoD-wide Navwar activities to fully integrate Navwar into military operations and the future force structure.\n\n2. Create and Maintain Navwar Knowledge Operationalize PNT Superiority - Conduct PNT operational field assessments, studies and analyses, analyze and disseminate Navwar R intelligence, and maintain a Navwar armory \n\nThe Space Analysis and Application Development program integrates space based effects into Department's ‘Model of Record' for joint campaign analysis. Current modeling and simulation (M&S) models are inadequate to represent the contribution that U.S space capabilities make to the air, sea, and land fight and do not accurately portray current and future space threats. This line of effort integrates effects of space capabilities into the Synthetic Theater Operations Research Model (STORM) campaign level M&S tool. Enhanced space M&S will enable the DoD to make informed decisions regarding the direction of U.S. Space Doctrine, Tactics, Techniques, Procedures, and Resource Decisions. The DoD requires the ability to conduct campaign-level analysis to quantify the holistic operational impacts of adversary space actions on military campaigns and U.S. global operations. \n\nUSSTRATCOM Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. These data isolation challenges result from network isolation, incomplete communications architectures, data security, incompatible information formats, security release policy, etc., inhibiting effective and efficient consolidation of decision quality strategic, operational and tactical information. The DIFC develops machine to machine solutions capable of ingesting Title 10 data at multiple classification levels, to include Special Access Program data, and associating\/correlating with National Technical Means at multiple classification levels to both enhance and amplify the Common Operational Picture. The DIFC works closely with DoD SAPCO and elements of the Director of National Intelligence, to include NSA, NRO and CIA, to both identify and address policy barriers, architectures and training opportunities necessary to enable seamless flow of data from all available sensors to warfighters during time of conflict, primarily leveraging currently fielded tactical data links. Though some recommended solutions validated during demonstration events may not transition to operations immediately, but nevertheless provide validated architecture solutions and approved security policies for use should conflict arise versus ad hoc attempts to solve data movement issues during conflict."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "8.674"
                },
                "CurrentYear": {
                    "val": "14.255"
                },
                "BudgetYearOne": {
                    "val": "14.268"
                },
                "BudgetYearOneBase": {
                    "val": "14.268"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "8.381"
                },
                "CurrentYear": {
                    "val": "14.255"
                },
                "BudgetYearOne": {
                    "val": "14.161"
                },
                "BudgetYearOneBase": {
                    "val": "14.161"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.293"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.107"
                },
                "BudgetYearOneBase": {
                    "val": "-0.107"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.293"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.107"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.107"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "670373"
                    },
                    "ProjectTitle": {
                        "val": "DCIP"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.474"
                        },
                        "CurrentYear": {
                            "val": "0.492"
                        },
                        "BudgetYearOne": {
                            "val": "0.487"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.487"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.488"
                        },
                        "BudgetYearThree": {
                            "val": "0.496"
                        },
                        "BudgetYearFour": {
                            "val": "0.506"
                        },
                        "BudgetYearFive": {
                            "val": "0.515"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "An October 2014 memorandum of agreement between USSTRATCOM and Deputy Assistant Secretary of Defense for Defense Continuity and Mission Assurance transferred budget authority for DCIP funding  to USSTRATCOM beginning in FY16. THIS IS NOT A NEW START."
                        },
                        "ProjectMissionDescription": {
                            "val": "The USSTRATCOM Defense Critical Infrastructure Protection program (DCIP) is a risk management program that seeks to ensure the availability of networked assets critical to USSTRATCOM and other DoD missions.  Critical infrastructure assets can include installations, facilities, antennas, vehicles, computing systems, and communications links. DCIP is directed by the Office of the Assistant Secretary of Defense (Homeland Defense & Americas' Security Affairs) [OASD (HD&ASA)].  DCIP manages the identification, prioritization, assessment, and assurance of Critical Infrastructure as a comprehensive program that includes the development of adaptive plans and procedures to mitigate risk, restore capability in the event of loss or degradation, support incident management, and protect defense critical infrastructure."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Assett Dependancy \/ Risk Characterization, Mitigation, and Prototyping"
                                    },
                                    "Description": {
                                        "val": "Supports 1) systems engineering analysis for the decomposition of mission systems and assets, and supporting networks and infrastructure that execute USSTRATCOM mission, 2) research, studies, and operational assessment of mission system capabilities, methodologies, and tactics to identify critical assets and dependency relationships, and 3) evaluation of mission risk through research, studies, analysis and assessment of threats and hazards paired with exploitable vulnerabilities. Supports analysis for the identification and development of risk mitigation and remediation options through research, studies, analysis and assessment of current and future tactics, techniques and procedures and materiel solutions, enabling USSTRATCOM mission assurance planning, coordination, integration, synchronization supporting the reduction of risk to CDRUSSTRATCOM acceptable levels. Supports three spiral development cycles annually consisting of concept and requirement development, tool engineering, algorithm development, prototyping, and testing to support rapid mission impact assessment, risk assessment, and risk management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.474"
                                            },
                                            "Text": {
                                                "val": "- Continued analysis, studies and research of Space Sector critical infrastructure assets and dependencies supporting all USSTRATCOM assigned missions - Future critical infrastructure vulnerability assessments and researching the various sources to perform threats and hazards assessments - Remediation analysis of identified vulnerabilities at critical infrastructure assets necessary for individual USSTRATCOM missions - Research and identify risk mitigation options to ensure mission accomplishment. - Spiral improvements to the graphical mission impact tool - Concept and requirement development, design development, tool engineering, prototyping, and test & evaluation of a tool combining risk assessment methodology with threat and hazard evaluations of critical infrastructure assets"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.492"
                                            },
                                            "Text": {
                                                "val": "Supports analysis, studies and research of critical infrastructure assets and dependencies supporting all USSTRATCOM assigned missions, to include focusing efforts of future critical infrastructure vulnerability assessments and researching the various sources to perform threats and hazards assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.487"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.487"
                                            },
                                            "Text": {
                                                "val": "Continued support of analysis, studies and research of critical infrastructure assets and dependencies supporting all USSTRATCOM assigned missions, to include focusing efforts of future critical infrastructure vulnerability assessments and researching the various sources to perform threats and hazards assessments."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $5K is due to Air Force allocation to the program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Projects funded through DCIP will be awarded using competitive contracts to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Asset Dependency and Risk Characterization Research"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.492"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.487"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.487"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Defense Critical Infrastructure Program"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Asset Dependency, Risk Mitigation, Ops Research, Design\/Development, Modeling and Simulation, Test and Evaluation"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "672486"
                    },
                    "ProjectTitle": {
                        "val": "JOINT NAVWAR CENTER (JNWC) SPACE ACTIVITIES"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.602"
                        },
                        "CurrentYear": {
                            "val": "7.453"
                        },
                        "BudgetYearOne": {
                            "val": "7.427"
                        },
                        "BudgetYearOneBase": {
                            "val": "7.427"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.467"
                        },
                        "BudgetYearThree": {
                            "val": "7.513"
                        },
                        "BudgetYearFour": {
                            "val": "7.583"
                        },
                        "BudgetYearFive": {
                            "val": "7.723"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectNote": {
                            "val": "FY18 PDM plus up of $4.8M per year thru the FYDP."
                        },
                        "ProjectMissionDescription": {
                            "val": "Navigation Warfare (Navwar) is deliberate defensive and offensive action to assure positioning, navigation, and timing (PNT) information through coordinated employment of space, cyberspace, and electronic warfare (EW) operations.  The JNWC develops and maintains the Department's premier collection of NAVWAR knowledge, and provides subject matter expertise support to the warfighters, Department decision makers, the Federal Interagency (the Department of Homeland Security and other civil agencies concerned with Critical National Infrastructure), and the Coalition.   Navwar expertise is developed in part by execution of PNT Operational Field Assessments (POFAs), modeling and simulation, analysis, and exercise and training support. JNWC conducted POFAs are a key element in evaluating US and Coalition NAVWAR capabilities and vulnerabilities and adversary capabilities and vulnerabilities, both crucial to executing PNT superiority mission sets in potentially denied \/ degraded PNT environments.  JNWC provides Department wide PNT posture through the PNT annual assessment. JNWC helps develop defensive and offensive PNT capabilities by focusing on two Joint Mission Essential Tasks:  \n\n1. Provide Operational Navwar Support - Enable Navwar operations and provide planning subject matter expertise to Combatant Commands, Services, interagency partners and the coalition; Advocate DoD-wide Navwar activities to fully integrate Navwar into military operations and the future force structure. \n\n2. Create and Maintain Navwar Knowledge Operationalize PNT Superiority - Conduct PNT operational field assessments, studies and analyses, analyze and disseminate Navwar R intelligence, and maintain a Navwar armory."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "PNT Operational Field Assessments"
                                    },
                                    "Description": {
                                        "val": "The JNWC will investigate, operationally assess, and simulate potential threats and mitigation strategies for denial of blue force PNT capabilities as well as preventing the hostile use of PNT information. Major Performers - Best value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.602"
                                            },
                                            "Text": {
                                                "val": "- Operational assessments - Simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities - Continuing development to prevent the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.453"
                                            },
                                            "Text": {
                                                "val": "- Operational assessments - Simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities - Continuing development to prevent the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.427"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.427"
                                            },
                                            "Text": {
                                                "val": "- Continuing Operational assessments - Simulate potential threats and mitigation strategies for potential denial of blue force PNT capabilities - Continuing development to prevent the hostile use of Positioning, Navigation and Timing (PNT) information."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease of $26K is due to Air Force allocation to the program."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "New contracts will be awarded using competitive procedures to the maximum extent possible."
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Beginning in FY 2018 the JNWC portfolio transferred out of PE 15921F in to PE 120921F."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "PNT Operational Field Assessments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "PO"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Kirtland AFB, NM"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.602"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "7.453"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "7.427"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "7.427"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Navigation Warfare (NAVWAR)"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "NAVWAR Operational Field Assessements"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Create Maintain NAVWAR Knowledge - PNTAA"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "NAVWAR Operations & CONOPS Events"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        },
                        "ScheduleDetailNote": {
                            "val": "Joint Navigation Warfare Center (JNWC) conducts PRISM, FORTUNE, and GYPSY operational field assessments on an on-going, annual basis.\n\nPRISM events encompass all Operations, Actions, and Activities (OAAs) associated with events outside of specific Combatant Command and\/or Service exercise or mission event.  \n\nFORTUNE events are Positioning, Navigation, and Timing (PNT) vulnerability field assessments and are small scale technical risk assessments or can be risk reduction events for larger GYPSY events.\n\nGYPSY events are larger than FORTUNE PNT related events and involve other coalition partners, and multiple US services in direct support of Geographic Combatant Command requirements. \n\nJNWC uses the Major Range and Test Facility Base (MRTFB) program, administered by USD (AT&L). Requirements dictate which MRTFB facility will be contracted to host a GYPSY or FORTUNE event."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "67A011"
                    },
                    "ProjectTitle": {
                        "val": "Space Analysis and Application Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.305"
                        },
                        "CurrentYear": {
                            "val": "6.310"
                        },
                        "BudgetYearOne": {
                            "val": "6.247"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.247"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "7.046"
                        },
                        "BudgetYearThree": {
                            "val": "7.161"
                        },
                        "BudgetYearFour": {
                            "val": "7.309"
                        },
                        "BudgetYearFive": {
                            "val": "7.441"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Space Analysis and Application Development program Integrates space based effects into Department's ‘Model of Record' for joint campaign analysis. Current modeling and simulation (M&S) models are inadequate to represent the contribution that U.S space capabilities make to the air, sea, and land fight and do not accurately portray current and future space threats.  This line of effort integrates effects of space capabilities into the Synthetic Theater Operations Research Model (STORM) and other mission and campaign-level M&S tools. Enhanced space M&S will enable the DoD to make informed decisions regarding the direction of U.S. Space Doctrine, Tactics, Techniques, Procedures, and Resource Decisions.  \n\nThe DoD requires the ability to conduct campaign-level analysis to quantify the holistic operational impacts of adversary space actions on military campaigns and U.S. global operations. \n\nUSSTRATCOM Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. Funds are necessary to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Space Campaign Modeling and Simulation, Development\/Modification\/Verification\/Validation"
                                    },
                                    "Description": {
                                        "val": "Developed, modifies, verifies, and validates new models for space mission areas and modifies existing models to portray new capabilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.315"
                                            },
                                            "Text": {
                                                "val": "- Determine touchpoints between space capabilities and the Offensive Counter Air and Fighter Escort \/ Fighter Sweep mission tasks within STORM \n- Refine\/develop software code to represent US and adversary space interactions in engagement and mission level models\n- Develop software to input space effects from engagement and mission level models into STORM campaign-level M&S to determine effect of degraded space on U.S. military campaigns and global operations\n- Develop test cases to evaluate performance of campaign model\n- Analyze\/assess modeling results to determine impact\/effects of space activities on U.S. military campaigns and global operations"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.492"
                                            },
                                            "Text": {
                                                "val": "Determine touchpoints between space capabilities and mission tasks for additional Joint Mission Threads. \n \n- Extend space modeling, simulation and analysis process to classified space capabilities\n- Expand analysis of degraded\/denied space capabilities to an additional Theater\n- Assess use of Joint Space Warfighting Forum (JSWF) Space Modeling, Simulation and Analysis process in a different campaign model such as Joint Interagency Contingency Model (JICM)\n- Analyze\/assess modeling results to determine impact\/effects of space activities on U.S. military campaigns and global operations\n- Integrate enterprise-level model data for Position, Navigation, and Timing (PNT), Missile Warning, Battlespace Awareness, and Satellite Communications (SATCOM) space-based capabilities into campaign-level modeling\n- Coordinate and update Blue space order of battle data, Red counterspace order of battle data, and Red counterspace CONOPS to support integration of space into mission and campaign-level M&S\n- Integrate Red counterspace capability for an additional theater into mission-level modeling to support estimation of Blue survivability and assessment of Blue Defensive Space Control options\n- Support cost-benefit analyses of Defensive Space Control alternatives with quantifiable impacts to warfighter operations- Develop change request proposals and submit to STORM Configuration Control Board (CCB) to improve instantiation of the effects of denied\/degraded Satellite Communications (SATCOM), Battlespace Awareness, and Position, Navigation, and Timing (PNT) on the Warfighter in STORM\n- Provide Modeling, Simulation, and Analysis support to inform Air Force Space Command's Space Enterprise Vision (SEV)\n\nNo OCO Requested"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.447"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.447"
                                            },
                                            "Text": {
                                                "val": "In coordination with European Command and Pacific Command, identify and select 4 joint missions for mission-level analysis and integration into campaign-level modeling \n\n- Analyze\/assess modeling results to determine impact\/effects of space activities on U.S. military campaigns and global operations\n- Assess and integrate enterprise-level model data for Environmental Monitoring and ISR space-based capabilities into campaign-level modeling \n- Coordinate and update Blue space order of battle data, Red counterspace order of battle data, and Red counterspace CONOPS to support integration of space into mission and campaign-level M&S\n- Support cost-benefit analyses of Offensive Space Control alternatives with quantifiable impacts to warfighter operations\n- Develop change request proposals and submit to STORM Configuration Control Board (CCB) to improve instantiation of denied\/degraded Intelligence, Surveillance, and Reconnaissance (ISR) space-based capability and its effects on the Warfighter in STORM\n- In coordination with HAF\/A9 (Headquarters Air Force Studies, Analyses and Assessments), develop schedule and identify funding requirements and sources toward implementation of approved change requests and improved instantiation of space and contested space capabilities in STORM \n- Provide Modeling, Simulation, and Analysis support to inform Air Force Space Command's Space Enterprise Vision (SEV)\n\nNo OCO Requested"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO Requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to Air Force allocation to the program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Data Integration and Fusion Center"
                                    },
                                    "Description": {
                                        "val": "USSTRATCOM\/J8 Data Integration and Fusion Center (DIFC) is an innovative organization developing and experimenting innovative concepts designed to validate both material and non-material methodologies to overcome data isolation in order to enable kill chains in the Joint Battlespace. The DIFC will work to update current government-owned software to ingest and disseminate new data sources from Title 10 and Title 50 sensors.  The DIFC efforts at COCOM sponsored experimentation events will inform service acquisition decisions, capability gaps, intelligence gaps and tactics, techniques and procedures (TTP) development and implementation to mitigate effects on warfighter operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.990"
                                            },
                                            "Text": {
                                                "val": "The DIFC will investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collect through dissemination to tactical platforms using machine to machine solutions to move data more efficiently and affect kill chain timelines."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.818"
                                            },
                                            "Text": {
                                                "val": "The DIFC will continue to investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collect through dissemination to tactical platforms using machine to machine solutions to move data more efficiently and affect kill chain timelines."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.800"
                                            },
                                            "Text": {
                                                "val": "The DIFC will continue to investigate, experiment, and disseminate various Title 10 and Title 50 data sources from collect through dissemination to tactical platforms using machine to machine solutions to move data more efficiently and affect kill chain timelines."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No OCO Requested"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY17 RMD allocated funding stream in FY19 at $800K"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Any new projects funded in this program will be awarded using competitive procedures to the maximum extent possible.\n\nBest value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "Remarks": {
                                        "val": "Best value to the government selected contractors, universities, government facilities, federally funded research and development centers, laboratories, or other organizations"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Model Space effects for two mission tasks and integrate into STORM for joint campaign analysis"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.315"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.455"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "5.447"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "5.447"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Data Integration and Fusion Center"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Multiple Gov\/Civ Agencies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Schriever AFB, CO"
                                                },
                                                "Cost": {
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.990"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.855"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.800"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "BudgetYearOneOCO": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Space Analysis Modeling & Simulation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Develop 22 Joint Mission Threads accounting for Warfighter tasks dependent on space-based capabilities"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2017"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Conduct operational risk analysis with Combatant Commands on impacts of contested space to OPLAN missions and tasks; identify priority risk areas"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Coordinate implementation and schedule to implement modification proposals for improved space and counterspace effects in STORM"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Complete mission-level modeling and analysis of 22 Joint Mission Threads"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Complete priority integration of 22 Joint Mission Threads, space-based capabilities, and counterspace effects on the Warfighter in STORM."
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Run improved STORM model and update integrated risk analysis with Combatant Commands"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "Identify and develop 10 additional Joint Mission Threads for integration into mission and campaign-level modeling"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}