{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-1-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-17",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604771D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Tactical Information Distribution System (JTIDS)"
        },
        "R1LineNumber": {
            "val": "121"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "85.379"
            },
            "PriorYear": {
                "val": "15.691"
            },
            "CurrentYear": {
                "val": "15.358"
            },
            "BudgetYearOne": {
                "val": "19.503"
            },
            "BudgetYearOneBase": {
                "val": "19.503"
            },
            "BudgetYearTwo": {
                "val": "26.514"
            },
            "BudgetYearThree": {
                "val": "16.003"
            },
            "BudgetYearFour": {
                "val": "14.527"
            },
            "BudgetYearFive": {
                "val": "14.793"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Mission Description and Budget Item Justification: The JTIDS program supports collaborative efforts to achieve strategy-driven capability development spanning the suite of Department enablers to include Communications and Networks, Cyber, Command and Control (C2), Non-Intel Space and Business Systems. These efforts include conducting mission informed capability-based analysis; portfolio assessments to include analyzing modernization trends that result in the development of roadmaps or business area strategies that support balanced investment decisions; and monitoring and assessing Major Defense Acquisition Programs(MDAPs) , Major Automated Information Systems (MAIS), and defense Business Systems in a capability portfolio context.  Activities in the JTIDS project are divided into four areas:  (1) mission informed capability-based analysis; (2) Interoperability & Integration; (3) roadmap development and support to business area strategies; and (4) support tools and guidance.  JTIDS also enables cross-department collaboration to enable enterprise-wide approaches. This includes:  (1) vertical and horizontal integration activities within the Department and with the interagency where appropriate; (2) engaging in a coordinated portfolio-based approach to planning,  programming, budgeting and execution; and (3) reform efforts at the legislative, governance, management and execution levels.  JTIDS is focused on capabilities-based portfolio management of the Department's key enablers, thus there are many shared equities with in ASD(A) and across OSD.  To fully meet mission need the JTIDS program supports extensive collaboration with  required alliances and with other OSD PSA's for Communications and Networks, C2, Non-Intel Space  and Business Systems."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.288"
                },
                "CurrentYear": {
                    "val": "15.358"
                },
                "BudgetYearOne": {
                    "val": "13.953"
                },
                "BudgetYearOneBase": {
                    "val": "13.953"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "15.691"
                },
                "CurrentYear": {
                    "val": "15.358"
                },
                "BudgetYearOne": {
                    "val": "19.503"
                },
                "BudgetYearOneBase": {
                    "val": "19.503"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.597"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "5.550"
                },
                "BudgetYearOneBase": {
                    "val": "5.550"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.579"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.018"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.160"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.160"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.290"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.290"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Program Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "10.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "10.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY19 Program Adjustment - Funds added to conduct cyber vulnerability assessments of critical DoD infrastructure in accordance with direction in Section 1650 of the FY 2017 NDAA.\nFunds rephase from FY19 to FY20 and FY21 to aid in increasing program execution rates closer to the DoD benchmarks."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "771"
                    },
                    "ProjectTitle": {
                        "val": "Link-16 Tactical Data Link (TDL) Transformation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "81.454"
                        },
                        "PriorYear": {
                            "val": "11.196"
                        },
                        "CurrentYear": {
                            "val": "12.358"
                        },
                        "BudgetYearOne": {
                            "val": "9.503"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.503"
                        },
                        "BudgetYearTwo": {
                            "val": "13.940"
                        },
                        "BudgetYearThree": {
                            "val": "11.287"
                        },
                        "BudgetYearFour": {
                            "val": "11.527"
                        },
                        "BudgetYearFive": {
                            "val": "11.793"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Funds will be used to provide technical and systems engineering, acquisition assistance and management oversight of critical Command, Control, Communications (C3), non-intelligence space, and cyber programs, projects and activities to maximize the return on investment in information technology resources and assist programs to be successful as the Department migrates to a structure implementing Joint Information Environment (JIE) technical standards. The Joint Tactical Information Distribution System (JTIDS) funding fulfills the Department's requirement for joint and combined network-enabled tactical data link (TDL) capabilities, netcentric\/JIE communications which comply to standards for interoperability and seamless integration with joint communication systems as well as the mission functionality that uses these systems. Also, these funds underwrite assessment of design and procurement and execution correction of critical information systems from initial definition through development to successfully delivered configurations. Funds provide expertise supporting technical oversight of design, performance and cost parameters of key Defense IT and National Security Systems and supporting infrastructure including critical cyber assessments. Resources in this program fund architecture design and development, portfolio management, enterprise-wide systems engineering and operational impact analyses related to C3, non-intelligence space, and cyber activities. Typical deliverables associated with the instantiation of net-centric capabilities for these mission areas include network and vulnerability assessments, migration plans, investment strategies, architectures, roadmaps and technical guidance documentation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Common Joint Tactical Information Initiatives"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.196"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments.  Continue implementation and oversight of an enterprise transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications.  Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems.  Continue planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability.\n- Acquisition Management and Oversight: Provide technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.  Provide technical assessments and programmatic recommendations across DASD functional areas to address interoperability gaps and work early in the systems engineering. \n- FAB-T:  Support IOT&E execution. Work to assure the program has a successful LRIP-2 decision.  Continue to support PNVC integration and test.  Provide risk assessments of system integration into the various airborne, ground fixed an ground transportable systems prior to installation.\n-  Wideband SATCOM AoA: Conduct AoA plan assessing material solutions for WGS replenishment and for supporting other traditional commercial supplied users considering life-cycle cost, performance, suitability, operational effectiveness, and resiliency.  Support implementation and execution of the AoA plan including Senior Advisory Group meetings and evaluation of the space and control segments with associated user terminals for contested and benign operating environments.  \n- AEHF: Provide programmatic analysis, technical reviews, and assessments of the AEHF program to reduce development, integration, and procurement risks. Provide risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element.  Work to start efforts for the follow-on system to AEHF.\n- EPS:  Provide programmatic analysis, technical reviews, and assessments of the EPS program to reduce development, integration, and procurement risks.  Assess risk as the TT&C system is integrated and tested prior to operations.  Work to start efforts for the follow-on system to EPS.\n- National Leadership Command Capability (NLCC):  Continue in lead role as primary action office for AT&L in his role as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S).  Work directly with the Executive Secretariat (DOD CIO) to oversee all aspects of preparation and conduct of CONLC3S meetings, as well as the SSG and EMP meetings that are held to essentially prepare\/tee up decisions for the CONLC3S to make at their meetings.  Also lead review process for any NLCC related documents.\n- Handheld, Manpack, and Small Form Fit (HMS) JTRS:  Assess the HMS program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for both Rifleman and Manpack radios. Provide technical and programmatic analysis to support the Defense Acquisition Executive' Full Rate Production decision review.  Assess the results of Initial Operational Test and Evaluation (IOT&E) as well as the existing manufacturing process, performance and reliability, and sustainment capabilities to formulate a recommendation for Full-Rate Production.  \n- Joint Tactical Networking Center (JTNC) JTRS:  Provide technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD).  Provide Secretariat functions for the JTNC BoD.\n- All JTRS(HMS, MNVR, AMF, JTN)Programs - Provide assessments of program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.  Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assess the AMNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for MNVR radios.\n- Provide assessments of DoD Business System programs with related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight. Provide programmatic recommendations regarding cost\/schedule\/ performance tradeoffs.\n- Ground Tactical Networks Advanced Capabilities:  Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable software code.  Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.  Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems.  FY17 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n- Tactical Data Link Modernization:  Track and assess first Link 16 capability improvements in Multi-function Information Distribution System (MIDS-J) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, and Weapons Data Link (WDL) radios.  Begin standup of EA for Airborne Tactical Data Networking and develop detailed roadmaps and modernization strategies. Assess preliminary requirements for MADL 2.0 version and applicability to next generation aircraft needs.  Assess modeling and simulation infrastructure and currency with adversary threat emitters to improve investments decisions on TDL improvements.     \n- Warfighter Information Network – Tactical (WIN-T):  Review and assess the results of the Highband Networking Waveform (HNW) 3.0 air and ground node demonstration.  Track progress of the HNW 3.0 entry into the Waveform Repository.  Provide a technical review of the Increment 2 independent cyber design and implementation assessment.  Provide technical reviews and assessments of Increment 2 performance and corrective actions to include platform integration issues, Network Operations Tools improvements, and performance optimization of the HNW, Tactical Relay Tower, and Range Throughput Extension Kit. \n-  Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY17-21 version of the Joint C2 Sustainment and Modernization Plan.\n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provide technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands.\n- Friendly Force Tracking\/ Combat Identification: Provide technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC.  Provide technical support to DoD implementation of Mode 5 including supporting spectrum certification and assignment.   \n– Acquisition Management: Provide technical assistance in developing related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.\n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n- Space Control\/Space C2\/SSA:  Perform continued monitoring of cyber testing and cyber vulnerabilities of critical space programs. \n- Non-Intelligence Space Programs Technical Assessments:  Perform cyber vulnerability and cyber suitability assessments on space, PNT, METOC programs and others. Review system design documents, control plans, remote management control ports and methods. Recommend corrective actions to specific space, PNT, and METOC programs to address cyber vulnerabilities and to inform milestone decisions. Conduct non-intelligence space program technical reviews on to include data strategies, systems engineering, risks and mitigations. Support acquisition milestone decisions for programs including weather satellite follow-on activities.\n- PNT Programs Technical Assessments:  Continue OIPT leadership role.  Develop and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE.   Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field.  \n- PNT Portfolio Management:  Continue implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continue to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.358"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent (EA) to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments.  Continue implementation and oversight of an enterprise transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications. Assess CDL EA plans to invest in a Common Development Environment to improve development cycles leading to new capabilities for the warfighter.  Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems.  Continue planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability. Continue efforts to reduce CDL barriers to competition begun in FY17. \n- Acquisition Management and Oversight: Provided technical assistance in developing and applying IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.  Provided technical assessments and programmatic recommendations across DASD functional areas to address interoperability and work early in the systems engineering process to address risk areas.\n- FAB-T:  Support IOT&E execution. Work to assure the program has a successful ground transportable and airborne new antenna production decision.  Continue to support PNVC integration and test.  Provide risk assessments of system integration into the various airborne, ground fixed and ground transportable systems prior to installation.  Support implementation of additional reliability testing to provide increased data for program acquisition and operational decisions.\n-  Wideband SATCOM AoA: Conduct AoA plan assessing material solutions for WGS replenishment and for supporting other traditional commercial supplied users considering life-cycle cost, performance, suitability, operational effectiveness, and resiliency.  Support implementation and execution of the AoA plan including Senior Advisory Group meetings and evaluation of the space and control segments with associated user terminals for contested and benign operating environments.  \n- Evolved AEHF \/ AEHF: Provide programmatic analysis, technical reviews, and assessments of the Evolved AEHF and AEHF programs to reduce development, integration, and procurement risks. Provide risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element.  Work to support efforts for the Evolved AEHF and assess implementation of XDR and PTW waveforms on new satellite payload and bus.\n- Mid-Term Polar SATCOM (MPS) \/ EPS:  Provide programmatic analysis, technical reviews, and assessments of the MPS and EPS programs to reduce development, integration, and procurement risks.  Assess risk as the TT&C system is integrated and tested prior to operations.  Work to support and assess efforts for the follow-on MPS system, whether a hosted payload or a free flyer\nNational Leadership Command Capability (NLCC):  Continue in lead role as primary action office for AT&L in his role as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S).  Work directly with the Executive Secretariat (DOD CIO) to oversee all aspects of preparation and conduct of CONLC3S meetings, as well as the EMB, SSG, and subordinate working groups that prepare\/tee up decisions for the CONLC3S and execute assigned actions.  Continue as primary AT&L action office to respond to NLCC-related congressionally directed actions.  Continue as primary AT&L action office for NLCC-related GAO and DoD IG audits. Serve as primary AT&L representative to NLCC-related studies, analyses, & policy updates.  Also lead review process for any NLCC related documents.\n- ISPAN Increment 4:  Continue to provide acquisition oversight to assure successful FDD.  Support Production & Deployment execution to assure successful Full Deployment.\n- ISPAN Increment 5:  Continue to support Technology Maturation and Risk Reduction (MRR) execution to assure successful E&MD decision.\n\n- MUOS capable terminals: Provide analysis, technical assessments and fielding reviews for implementing the MUOS capability.  Work to support the certification of ground, maritime and airborne terminals, and testing required to enable operational authorizations.\n- Joint Tactical Networking Center (JTNC) JTRS:  Provide technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD). Facilitate and coordinate staffing and approval of the annual JTNC Management Plan. Provide Secretariat functions for the JTNC BoD.\n- All former JTRS(HMS, MNVR, AMF)Programs - Provide assessments of program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight.  Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs.\n- Mid-Tier Networking Vehicular Radio (MNVR) JTRS:  Assess the MNVR program to include the risk of vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of full and open competition process for MNVR radios.\n- Provide assessments of DoD Business System programs with related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight. Provide programmatic recommendations regarding cost\/schedule\/ performance tradeoffs.\n- Ground Tactical Networks Advanced Capabilities:  Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable waveform software code.  Form industry engagement to promote transition into non-developmental item radios.\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.  Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems.  FY17 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n- Electronic Warfare: Maintain situational awareness of and contribute to evolving DoD and Service electronic warfare strategy, and in conjunction with Electromagnetic Spectrum Operations efforts, assist in coordinating development of new and integrated enterprise capabilities.\n- Tactical Data Link Modernization:  Provide OSD oversight and cross-Service coordination of Tactical Data Link (TDL) modernization issues funded during FY16 Third Offset (3OS) Issue Team ($200M over FYDP, starting FY18).  Identify areas where additional risk reduction activities are necessary in order to meet CAPE and DMAG guidance\/schedule.  Employ analytic infrastructure developed in prior years to provide Mission Integration Management, with a focus on tactical line of sight aerial communications.  Track and assess Technology Readiness Level (TRL) maturity progress of Link 16 capability improvements for Multi-function Information Distribution System (MIDS JTRS) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, and Weapons Data Link (WDL) radios for testing in late FY18 and FY19 on targeted platforms and terminals.  Assess MADL waveform documentation delivered to the government and identify (with government and industry partners) key enabling improvements for a Government controlled technical baseline that enables future LO waveform capability.  Assess TDL network design and interoperability support infrastructure gaps that are preventing fully realized TDL networks across DoD and Coalition partners.  Identify any necessary bridging activities necessary to support any POM19 investments in Low Observable communications that resulted from FY17 Program Review.     \n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n- PNT Programs Technical Assessments:  Continue OIPT leadership role.  Develop and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE.   Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field. Conduct Nunn-McCurdy Reviews of program that have critically breached APB cost parameters and prepare for DAE Certification.  Report results to congress after DAE Certification and ensure regular reporting is conducted IEW public law.  Conduct reviews of innovative acquisition efforts intended to reduce overall satellite cost through payload and spacecraft competition.  Conduct Quarterly OCX Reviews at USD\/SECAF\/CEO level to ensure OCX maintains progress towards fielding user required capabilities.  Develop and implement contingency plans to ensure constellation command and control management and enable early M-Code availability.    \n- PNT Portfolio Management:  Continue implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continue to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc.\n-  Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY17-21 version of the Joint C2 Sustainment and Modernization Plan.\n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provided technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands. Refreshed the JC2 Terms of Reference to make it a viable and productive governance framework.\n- Conducted a successful Business Case Analysis (BCA) on the Global Command and Control System – Joint (GCCS-J) modernization program. The positive BCA Return on Investment influenced garnering critically needed modernization funding.\n- Friendly Force Tracking\/ Combat Identification: Provide technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC.  Provide technical support to DoD implementation of Mode 5 including supporting spectrum certification and assignment.  \n - Began an Analysis of Alternatives on the Coalition Information Sharing Environment.  This AT&L-led independent 18-month study will analyze and recommend a preferred alternative to determine the most effective and efficient means for the Department of Defense to provide a coalition network and services in support of Mission Partner operations.\n– Acquisition Management: Provide technical assistance in developing related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.503"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.503"
                                            },
                                            "Text": {
                                                "val": "- Common Data Link (CDL) Principal Staff Assistant: Continue to coordinate with CDL Executive Agent (EA) to develop and maintain a technology roadmap and terminal database to improve interoperability, configuration management, and focused technology investments.  Continue implementation and oversight of an enterprise transition strategy to modernize DoD ISR waveforms to converge on a DoD standard for tactical ISR communications.  Update CDL technology development roadmap to reflect current trends in technology that can add enhanced capabilities to CDL systems.  Continue planning and conduct of CDL SRP and IPT meetings to develop and refine the CDL investment portfolio and to identify strategic ISR communications issues the DoD will face in the future. Conduct analysis of Airborne ISR communications transport infrastructure in coordination with Joint Staff, Services and Combatant Commands in order to identify a way ahead for establishing an effective\/efficient global enterprise capability. Conduct annual CDL enterprise modernization analysis and review Service PPBE submissions to assess enterprise migration to Bandwidth Efficient CDL by 2023. Continue to promote open system development solutions that expand the vendor base and allow increased competition and innovation. Expand the CDL Reference Implementation Laboratory concept of a government owned technical baseline while assessing a Common Development Environment that encourages rapid develop, testing, and fielding of new capabilities. \n- Acquisition Management and Oversight: Provided technical assistance in developing IT related acquisition policy, including updates to DoD Series 5000 necessitated by changes in statue, regulation and management direction.  Provided technical assessments and programmatic recommendations across DASD functional areas to address interoperability gaps and work early in the systems engineering.\n- FAB-T:  Support IOT&E execution. Work to assure the program has a successful LRIP-2 decision.  Continue to support PNVC integration and test.  Provide risk assessments of system integration into the various airborne, ground fixed an ground transportable systems prior to installation. Support implementation of additional reliability testing to provide increased data for program acquisition and operational decisions.\n\n-  Wideband SATCOM AoA: Conduct AoA plan assessing material solutions for WGS replenishment and for supporting other traditional commercial supplied users considering life-cycle cost, performance, suitability, operational effectiveness, and resiliency.  Support implementation and execution of the AoA plan including Senior Advisory Group meetings and evaluation of the space and control segments with associated user terminals for contested and benign operating environments.  \n\n- Evolved AEHF \/ AEHF: Provide programmatic analysis, technical reviews, and assessments of the Evolved AEHF and AEHF programs to reduce development, integration, and procurement risks. Provide risk assessments as the program continues to launch spacecraft and improve the Mission Planning Element.  Work to support efforts for the Evolved AEHF and assess implementation of XDR and PTW waveforms on new satellite payload and bus.\n\n- Mid-Term Polar SATCOM (MPS) \/ EPS:  Provide programmatic analysis, technical reviews, and assessments of the MPS and EPS programs to reduce development, integration, and procurement risks.  Assess risk as the TT&C system is integrated and tested prior to operations.  Work to support and assess efforts for the follow-on MPS system, whether as a hosted payload or a free flyer.\n\n- MUOS capable terminals: Support FOT&E execution. Provide analysis, technical assessments and fielding reviews for implementing the MUOS capability.  Work to support the certification of ground, maritime and airborne terminals, and testing required to enable operational authorizations.\n\n- Joint Tactical Networking Center (JTNC):  Provide technical and programmatic analysis to support the Defense Acquisition Executive's role as the co-chair of the JTNC Board of Directors (BoD).  Provide Secretariat functions for the JTNC BoD.\n- All former JTRS(HMS, MNVR, AMF, JTN)Programs – Upon request, provide technical expertise and recommendations to facilitate program compliance with IT related acquisition policy, in accordance with DoD Series 5000 and applicable Milestone Decision Authority direction.  Provide programmatic recommendations regarding cost\/schedule\/performance tradeoffs and application of evolving acquisition policies, based on lessons observed in oversight of acquisition programs across the Department.\n\n- Mid-Tier Networking Vehicular Radio (MNVR):  Assess the MNVR program’s mitigation of risks associated with vendor selected radios (Modified Non-Developmental Item). Conduct independent technical reviews and recommend program performance improvement options to meet cost, schedule and performance objectives. Provide a technical assessment of the Army’s planned implementation of MNVR radios as the mid-tier of a ground tactical architecture.  Provide technical expertise and assistance with analysis of and planning for other potential mid-tier architectures and\/or waveform solutions.\n\n- Provide assessments of DoD Business System programs with related acquisition policy, in accordance with DoD Series 5000 and applicable senior management direction.  Assess readiness for major acquisition program milestone reviews, to include adequate documentation of compliance with statute\/regulation\/policy associated with acquisition program oversight. Provide programmatic recommendations regarding cost\/schedule\/ performance tradeoffs.\n\n- Ground Tactical Networks Advanced Capabilities:  Mature narrowband dismounted communications capability with radio hardware prototype, robust modeling and simulation, and reusable waveform software code.  Form industry engagement to promote transition into non-developmental item radios.\n\n- Integrated Electromagnetic Spectrum Operations (EMSO): Track implementation of iEMSO strategy in radio and EW device development plans.  Assess and down-select technical interoperability and architectural approaches.  Ensure adequate funding and testing to assess maturity of solutions.  Develop science and technology roadmap to synchronize transition of key technologies to programs of record for spectrum-dependent systems.  FY17 work will focus will focus on selected sensor and electronic warfare systems and continue work on communications systems.\n\n- Electronic Warfare: Maintain situational awareness of and contribute to evolving DoD and Service electronic warfare strategy, and in conjunction with Electromagnetic Spectrum Operations efforts, assist in coordinating development of new and integrated enterprise capabilities.\n\n- Tactical Data Link Modernization:  Provide OSD oversight and cross-Service coordination of Tactical Data Link (TDL) modernization issues funded during FY16 and FY17 Program Reviews.  Identify areas where additional risk reduction activities are necessary in order to meet CAPE and DMAG guidance\/schedule.  Track and assess testing of Link 16 capability improvements in Multi-function Information Distribution System (MIDS-J) terminals (4th Gen aircraft), Communications, Navigation & Identification (CNI) terminal in F-35, emerging 6th Gen aircraft concepts, and Weapons Data Link (WDL) radios.  Assess transferability of these improvements to other omni-directional TDLs, such as TTNT.  Begin establishing an improved enterprise governance model for Tactical Data Links.  Continue to perform oversight and joint acquisition integration of Service implementation of Congressionally directed (FY17 NDAA) focus on a modular open system approach (MOSA), to the maximum extent practicable for TDLs, in synchronization with CDL, and other appropriate capabilities.  Identify MADL evolution technology development needs for further funding to enable transition to F-35 and other platforms, and begin establishment of a Government Controlled Technical Baseline for MADL.  Assess modeling and simulation infrastructure and currency with adversary threat emitters to improve investment decisions on TDL improvements.\n\n- Space Ops: Conduct SATOPS Modernization technical assessments; provide technical Oversight\/AFSCN Modernization Implementation; conduct AFSCN Event Driven Net Centric Review\/Technical Assessment.\n\n- PNT Programs Technical Assessments:  Continue OIPT leadership role.  Develop and implement Annual GPS Enterprise Review to verify readiness of GPS III, MGUE, and OCX programs to progress to next phase of the acquisition process. Ensure synchronization of the three programs to meet the direction of the DAE.   Conduct deep dive technical analyses to understand all phases of the GPS enterprise programs and predecessor programs that are part of the GPS Enterprise. Review PNT programs for data strategies, systems engineering, risks and mitigations in support of milestone decisions. Initiate and conduct studies to expedite fielding and support of M Code capability for forces in the field. Conduct Nunn-McCurdy Reviews of program that have critically breached APB cost parameters and prepare for DAE Certification.  Report results to congress after DAE Certification and ensure regular reporting is conducted IEW public law.  Conduct reviews of innovative acquisition efforts intended to reduce overall satellite cost through payload and spacecraft competition.  Conduct Quarterly OCX Reviews at USD\/SECAF\/CEO level to ensure OCX maintains progress towards fielding user required capabilities.  Develop and implement contingency plans to ensure constellation command and control management and enable early M-Code availability.    \n\n- PNT Portfolio Management:  Continue implementation of GPSEM\/PNT Assurance Investment Strategy and Roadmap, ensuring AoA recommendations are addressed. Continue to support major program milestones and internal OSD reviews such as Strategic Portfolio Reviews, DMAGs, etc.\n\n- National Leadership Command Capability (NLCC):  Continue in lead role as primary action office for AT&L in his role as co-chair of the Council on Oversight of the National Leadership Command, Control, and Communications System (CONLC3S).  Work directly with the Executive Secretariat (DOD CIO) to oversee all aspects of preparation and conduct of CONLC3S meetings, as well as the EMB, SSG, and subordinate working groups that prepare\/tee up decisions for the CONLC3S and execute assigned actions.  Continue as primary AT&L action office to respond to congressionally-directed actions.  Continue as primary AT&L representative to NLCC-related studies, analysises, and policy updates.  Also lead review process for any NLCC related documents.\n- ISPAN Increment 4:  Continue to provide acquisition oversight to assure successful FDD.  Support Production & Deployment execution to assure successful Full Deployment.\n- ISPAN Increment 5:  Continue to provide acquisition oversight to support E&MD execution.\n\n-  Joint C2 Portfolio Management: Support development, integration and test activities across the Services, Agencies and Combatant Commands and deliver the FY17-21 version of the Joint C2 Sustainment and Modernization Plan.\n- C2 Data: Provide technical expertise for ensuring C2 data are visible, accessible, understandable, trustable and interoperable. Provide technical assessment and assistance for implementation of National Information Exchange Model (NIEM)-based information exchanges across the DoD. Update the C2 Authoritative Data Source roadmap and update C2 data architecture.\n- Joint C2 Architecture: Provided technical expertise for the update the Joint C2 Architecture to guide Joint C2 capability area development activities across the Services, Agencies and Combatant Commands. Refreshed the JC2 Terms of Reference to make it a viable and productive governance framework.\n- Conducted a successful Business Case Analysis (BCA) on the Global Command and Control System – Joint (GCCS-J) modernization program. The positive BCA Return on Investment influenced garnering critically needed modernization funding.\n- Friendly Force Tracking\/ Combat Identification: Continue to provide technical assessment, assistance and recommendations for achieving Mode 5 IFF IOC and FOC.  Provide technical support to DoD improvement of the Mode 5 IFF Standards and practices. Continue to engage the FAA and NTIA in developing an IFF impact prediction model to speed the platform certification and frequency process and reduce cost. Continue to engage with the FAA, NTIA, and Joint Staff in facilitating a demonstration of Reverse IFF (RIFF) during BOLD QUEST 18.2. Continue to engage with NATO to foster unity in certifying the interoperability of IFF equipment. Also to apply the technical expertise of the U.S. in improving the Combat Identification capability as the opportunity arises.\n- Continue Analysis of Alternatives on the Coalition Information Sharing Environment.  This AT&L-led independent 18-month study will analyze and recommend a preferred alternative to determine the most effective and efficient means for the Department of Defense to provide a coalition network and services in support of Mission Partner operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding impacts the DASDs ability to conduct  studies and analysis addressing complex command and communications issues."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In executing JTDL tasking, existing fixed-price and cost-plus contracts will be utilized.\n-  Program reviews in support of the JCIDS, acquisition and PPBE processes."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Alignment: Accelerate DoD information age transformation to increase the effectiveness and efficiency of the warfighting, intelligence and business missions.\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Instantiation of enterprise-wide system engineering for the Joint Information Environment (JIE)\n\nPortfolio Management:  Provide for the timely and effective delivery of key Net-Centric capabilities through portfolio management of associated technology development and Major Defense Acquisition Programs (MDAPS) and Major Automated Information Systems (MAIS).\nMeasures:\n-  Key milestones completed for major net-centric acquisitions \n-  Number of major systems successfully completing net-centric critical performance reviews"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "Resources will be used to provide technical, systems engineering and acquisition management oversight of programs, projects and activities to maximize the Department’s return on investment in information technology resources and to affect a comprehensive approach for assessing and procuring critical information systems from initial design, through development to capability delivery in support of improved weapons systems performance and military operations."
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "Remarks": {
                                        "val": "NA"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Link-16 Tactical Data Link (TDL) Transformation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD(AT&L)\/OASD(A)\/DASD(C3CB)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "81.454"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "11.196"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "12.358"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.503"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.503"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Link-16 Comm Tactical Data Link (TDL) Transformation"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "105"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Capability & Platform Resilience"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "3.925"
                        },
                        "PriorYear": {
                            "val": "4.495"
                        },
                        "CurrentYear": {
                            "val": "3.000"
                        },
                        "BudgetYearOne": {
                            "val": "10.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.574"
                        },
                        "BudgetYearThree": {
                            "val": "4.716"
                        },
                        "BudgetYearFour": {
                            "val": "3.000"
                        },
                        "BudgetYearFive": {
                            "val": "3.000"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Provides resources for developmental acquisition support and management (to include the Cyber Investment and Management Board (CIMB))  oversight of Cyber capabilities as the Department conceives, develops, and rapidly fields cyber capabilities for Cyberspace Operations and the instantiation of cyber resilient platforms and weapons systems for priority kinetic and non-kinetic missions. The CIMB was established in 2012 in response to the FY2011 NDAA Section 933, where DoD was directed to provide a “strategy for the rapid acquisition of cyber capabilities, for cyber warfare for USCC and the Cyber Service components of the military departments. USD(AT&L) is responsible for compliance with the FY2011 NDAA and Chairs the CIMB.\nFunds provide technical, systems engineering, trend analysis, and oversight of programs, projects and activities developing cyber capabilities to maximize the Department's return on investment of cyberspace resources and effect a comprehensive approach for assessing, procuring, and sustaining critical cyber capabilities and cyber resilient systems and platforms from initial design, through development to capability delivery in support of weapons systems performance and military operations.  Additionally, these funds will provide systems analyses, portfolio management, executive support of CIMB, enterprise wide systems engineering and operational impact analyses related to Cyber capabilities and ensuring cyber resilience within systems and platforms.  Resources will also be used to provide expertise required for exercising technical direction over design, performance, cost parameters, determining and mitigating cyber risks of key systems and their dependencies.  The goal of this funding is to assure capability advantage, reduce time to the field, evaluate projects and concepts, minimize cyber related performance and operational risk of developing and fielding complex systems, ensure program dependencies are documented and included in acquisition decisions and address cyber security requirements, gaps and required technical solutions."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Capability and Platform Resilience"
                                    },
                                    "Description": {
                                        "val": "Provides resources for developmental acquisition support and management (to include the Cyber Investment and Management Board (CIMB))  oversight of Cyber capabilities as the Department conceives, develops, and rapidly fields cyber capabilities for Cyberspace Operations and the instantiation of cyber resilient platforms and weapons systems for priority kinetic and non-kinetic missions. The CIMB was established in 2012 in response to the FY2011 NDAA Section 933, where DoD was directed to provide a “strategy for the rapid acquisition of cyber capabilities, for cyber warfare for USCC and the Cyber Service components of the military departments. USD(AT&L) is responsible for compliance with the FY2011 NDAA and Chairs the CIMB.  Funds provide technical, systems engineering, trend analysis, and oversight of programs, projects and activities developing cyber capabilities to maximize the Department's return on investment of cyberspace resources and effect a comprehensive approach for assessing, procuring, and sustaining critical cyber capabilities and cyber resilient systems and platforms from initial design, through development to capability delivery in support of weapons systems performance and military operations.  Additionally, these funds will provide systems analyses, portfolio management, executive support of CIMB, enterprise wide systems engineering and operational impact analyses related to Cyber capabilities and ensuring cyber resilience within systems and platforms.  Resources will also be used to provide expertise required for exercising technical direction over design, performance, cost parameters, determining and mitigating cyber risks of key systems and their dependencies.  The goal of this funding is to assure capability advantage, reduce time to the field, evaluate projects and concepts, minimize cyber related performance and operational risk of developing and fielding complex systems, ensure program dependencies are documented and included in acquisition decisions and address cyber security requirements, gaps and required technical solutions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.495"
                                            },
                                            "Text": {
                                                "val": "Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Utilize the results of the Cyber Rapid Acquisition Process Pilots to implement the new rapid cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Manage Cyber security Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cyber security within the Acquisition process.\n- Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations. \n- Initiate capability development of recommendations of the Unified Platform AoA.\n- Continue oversight of Joint Cyber Command and Control (C2) capability development. \n- Ensure Platform Resilience\/Mission Assurance (PR\/MA); Oversee implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Continue to synchronize and provide oversight for DoD Cyber Ranges that support Cyber Training and Testing & Evaluations through the Cyber Range Focal Point. \n- Implement DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conduct technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Oversee DoD efforts to equip the cyber mission force. Support developments of requirements documents and architectures as required in collaboration with USCYBERCOM."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction that provides strategic guidance and feedback to senior leaders.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio, review execution of cyber requirements and acquisition processes, and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Utilize the results of the Cyber Rapid Acquisition Process Pilots and continuing Responsive Cyber Acquisition quarterly stakeholders meetings with USCC, the Services, and Agencies to develop and implement the new foundational responsive cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Contribute to any follow on efforts to revise policy or guidance regarding Cyber security within the Acquisition process .\n- \n- Initiate capability development of recommendations of the Unified Platform AoA.\n- \n- Ensure Platform Resilience\/Mission Assurance (PR\/MA); Oversee implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Ensure execution of the evaluation of cyber vulnerabilities of DoD critical infrastructure plan.\n Conduct data gathering and technical assessments to support the development of meaningful acquisition requirements for the PCTE and other programs of interest as they relate to capabilities of diverse DoD cyber range capabilities.\n- Oversee the PCTE acquisition program. \n- Oversee DoD efforts to equip the cyber mission force. Support developments of requirements documents and architectures as required in collaboration with USCYBERCOM.\n- Joint Cyber C2:  Continue oversight of Joint Cyber Command and Control (C2) capability development. Provide technical and subject matter expertise support the Joint Cyber C2 Analysis of Alternatives.  Provide updates to the Combatant Command (CCMD) Cyberspace Operations Baseline Model.  Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations.  Provide a final draft of the Joint Cyber C2 and SA CONOPS to USCYBERCOM.  Provide an “As Is” Joint Cyber C2 Architecture.  Track the status and provide technical recommendations associated with piloting efforts associated with the recommendations from the Cyber SA Evaluations of Alternatives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "Cyber Investment Management: Synchronize and coordinate cyberspace acquisition activities, conduct quantitative assessments, and ensure cyberspace investments align with Department priorities, required capabilities and evolving cyber threats. Provide support of the Cyber Investment Management Board and develop implementation guidance and associated direction that provides strategic guidance and feedback to senior leaders.  Continue to plan and conduct CIMB\/CCT meetings to refine the cyber investment portfolio, review execution of cyber requirements and acquisition processes, and to identify strategic cyber issues the DoD will face in the future.\n- Refine the Cyber investment portfolio results, ensuring return on investment and risk ultimately leading to an optimization phase focusing on process improvement is included.\n- Conduct investment analysis of the DoD-wide Cyber Special Access Program (SAP) portfolio to include return on investment and risk analysis.\n- Utilize the results of the Cyber Rapid Acquisition Process Pilots to implement the new rapid cyber acquisition processes across DoD, ensuring DoD Acquisition Policy is updated to reflect processes.\n- Manage Cyber security Guidebook for Program Managers. Contribute to any follow on efforts to revise policy or guidance regarding Cyber security within the Acquisition process. \n- Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations. \n- Initiate capability development of recommendations of the Unified Platform AoA.\n- Continue oversight of Joint Cyber Command and Control (C2) capability development. \n- Ensure Platform Resilience\/Mission Assurance (PR\/MA); Oversee implementation of the recommendations on Cyber vulnerabilities of Department of Defense weapon systems and tactical communications systems.\n- Ensure execution of the evaluation of cyber vulnerabilities of DoD critical infrastructure plan.\n Conduct data gathering and technical assessments to support the development of meaningful acquisition requirements for the PCTE and other programs of interest as they relate to capabilities of diverse DoD cyber range capabilities.\n- Oversee the PCTE acquisition program. \n- Continue to synchronize and provide oversight for DoD Cyber Ranges that support Cyber Training and Testing & Evaluations through the Cyber Range Focal Point. \n- Implement DoD Cyber Range strategy, working with T&E and DOT&E and JS.\n- Conduct technical analysis to determine tools necessary to help collect, measure, assess DCO\/OCO effectiveness and suitability in a Cyber Range Environment. \n- Oversee DoD efforts to equip the cyber mission force. Support developments of requirements documents and architectures as required in collaboration with USCYBERCOM.\n- Joint Cyber C2:  Continue oversight of Joint Cyber Command and Control (C2) capability development.  Upon request, support implementation of the preferred alternative identified during the Joint Cyber C2 AoA.  Continue oversight of implementation of the Cyber Situational Awareness EoA (phase II) recommendations.  Track the status and provide technical recommendations associated with piloting efforts associated with the recommendations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase in funds for Cyber efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Existing firm fixed priced and cost plus contracts will be utilized."
                        },
                        "PerformanceMetrics": {
                            "val": "Enterprise-Wide Cyber Investments: instantiation of cyber capabilities for resilient systems include risk assessments, vulnerability assessments, mitigation plans, prototype architectures, investment strategies, trends analyses, Evaluation\/Analysis of Alternatives, integrated mission analyses, technical and policy guidance directives.\n\nMeasures:\n-  Timely development and issuance of policy and guidance\n-  Timely delivery and development of key investment strategies, trend analysis and outcomes of the Evaluation\/Analysis of Alternatives.\n\nPortfolio Management:  Provide for the timely and effective delivery of portfolio management support of associated with Cyber Security and Major Defense Acquisition Programs (MDAPS) and Major Automated Information Systems (MAIS).\nMeasures:\n-  Key milestones completed for major cyber related acquisitions"
                        }
                    },
                    "R3Exhibit": {
                        "Remarks": {
                            "val": "NA"
                        },
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "Remarks": {
                                        "val": "NA"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Contract awards"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "OUSD AT&L DASD C3CB"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Pentagon\/Mark Center"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "3.925"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "4.495"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-02"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-02"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "10.000"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2020-02"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Cyber Capability and Platform Resilience"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Contract Awards"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}