{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-5",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602234D8Z"
        },
        "ProgramElementTitle": {
            "val": "Lincoln Laboratory"
        },
        "R1LineNumber": {
            "val": "11"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "102.926"
            },
            "PriorYear": {
                "val": "46.500"
            },
            "CurrentYear": {
                "val": "49.748"
            },
            "BudgetYearOne": {
                "val": "51.596"
            },
            "BudgetYearOneBase": {
                "val": "51.596"
            },
            "BudgetYearTwo": {
                "val": "52.467"
            },
            "BudgetYearThree": {
                "val": "53.480"
            },
            "BudgetYearFour": {
                "val": "54.513"
            },
            "BudgetYearFive": {
                "val": "55.566"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The Lincoln Laboratory (LL) research line program is an advanced technology research and development effort conducted through a cost reimbursable contract with the Massachusetts Institute of Technology (MIT). The LL Program supports innovative, multi-disciplined research that addresses critical national security problems. The LL Program funds innovations that directly lead to the development of new system concepts, technologies, components and materials in support of Department of Defense (DoD) missions. Funding supports high-risk, high-payoff research, which provides unique and specialized capabilities for the current and emerging needs of the DoD.  The project funds ten technology project areas.  \n\nOf these, there are five core-technology areas:\n• Advanced Devices\n• Optical Systems and Technology\n• Information, Computation and Exploitation\n• Radio-Frequency (RF) Systems and Technology\n• Cyber Security, Science and Engineering\n\nThere are four emerging-technology initiatives:\n• Advanced Materials and Processes\n• Quantum System Sciences\n• Biomedical Sciences and Technology\n• Autonomous Systems\n\nThere is one Integrated Systems technology area, which focuses on combining novel component-level technologies to create system-level technology solutions for important DoD problems. \n\nThese ten technology areas provide critical capabilities that support all DoD mission areas pursued at the Laboratory. The categories are selected in consultation with the Office of the Under Secretary of Defense, Research and Engineering (OUSD(R&E)), are aligned with DoD Communities of Interest (CoI), and with guidance from other DoD agencies to address technology as well as system needs. The research in these categories adapts to solve emerging DoD problems as well as longstanding problems to which new technology advances can be applied. The individual projects in each area are selected with the goal of enhancing DoD capabilities significantly, rather than incrementally.\n\nSupporting these and other priority technology and capability areas are work efforts titled Technical Intelligence:\n• The Technical Intelligence Program provides global science and technology (S&T) awareness and context in order to assist the DoD decision-makers plan for an uncertain future. The program uses intelligence-based and open-source information to characterize today’s global S&T environment, exploiting novel technology watch and horizon scanning (TW\/HS) tools to identify nascent and disruptive technologies that will shape tomorrow’s future.  The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "48.269"
                },
                "CurrentYear": {
                    "val": "49.748"
                },
                "BudgetYearOne": {
                    "val": "55.971"
                },
                "BudgetYearOneBase": {
                    "val": "55.971"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "46.500"
                },
                "CurrentYear": {
                    "val": "49.748"
                },
                "BudgetYearOne": {
                    "val": "51.596"
                },
                "BudgetYearOneBase": {
                    "val": "51.596"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.769"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-4.375"
                },
                "BudgetYearOneBase": {
                    "val": "-4.375"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.709"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.007"
                                },
                                "BudgetYearOne": {
                                    "val": "-4.029"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.029"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.053"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.346"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.346"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments include realignment for higher priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "534"
                    },
                    "ProjectTitle": {
                        "val": "Lincoln Laboratory"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "85.021"
                        },
                        "PriorYear": {
                            "val": "38.126"
                        },
                        "CurrentYear": {
                            "val": "44.275"
                        },
                        "BudgetYearOne": {
                            "val": "41.359"
                        },
                        "BudgetYearOneBase": {
                            "val": "41.359"
                        },
                        "BudgetYearTwo": {
                            "val": "42.224"
                        },
                        "BudgetYearThree": {
                            "val": "43.141"
                        },
                        "BudgetYearFour": {
                            "val": "44.053"
                        },
                        "BudgetYearFive": {
                            "val": "44.974"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The ten Lincoln Laboratory research areas that comprise the overall research and development portfolio are described below:\n\nFive core-technology areas:\n• Advanced Devices emphasizes the development of devices and subsystems utilizing microelectronic, photonic, biological, and chemical technologies to enable new approaches to DoD systems. Projects include technologies for high power RF devices; multi-function, highly integrated lasers; fast and sensitive imagers; and mechanical microsystems for autonomous systems.\n• Optical Systems and Technology focuses on developing optical technologies for visible, infrared, and wide band spectroscopic sensing as well as communications systems. The projects areas include high energy lasers; scalable focal plane imaging technology; photonic integrated circuits; optical system prototypes; and associated phenomenology measurements. \n• Information, Computation and Exploitation develops novel architectures, tools, and techniques for the processing, fusion, interpretation, computation, and exploitation of multi-sensor, multi-intelligence data. Projects include innovative hardware and software technologies for graph processors and cloud computing; artificial intelligence and graph algorithms for analytics, including deep learning algorithms; multi-intelligence analytics, including open-source data processing techniques; and human-machine interfacing and automation technologies to enhance warfighter effectiveness and ability to work with advanced computing systems. \n• RF Systems and Technology focuses on RF technologies to enhance warfighting capabilities in radars, electronic warfare (EW), and communications. Projects include development of next generation phased arrays; ultra-wideband RF systems; compact RF systems; small satellite RF payload; and advanced algorithms for jammer mitigation and EW. \n• Cyber Security Science and Engineering Program focuses on the development of technologies and new techniques for the protection of systems against cyber-attack and exploitation. Projects include research into technologies for cyber situational awareness, command and control; technology to improve resilience of systems to cyber-attack; and technologies for system exploitation research.\n\nFour emerging-technology areas:\n• Advanced Materials and Processes (formerly Novel and Engineered Materials) emphasizes research in new materials for additive manufacturing and emerging nanoscale materials. Projects include research in microwave circuits built with 3D printing; other advanced 3D printing technologies; one-dimensional semiconductor materials; and microsystems using metamaterials.\n• Quantum System Sciences focuses on the development of quantum-based technologies that support sensing, communication, computation, and algorithms using quantum information. The projects include the demonstration of scalable computation platforms, demonstration of quantum protected communications and magnetic field sensing using highly-compact, atomic-like defects in diamond, prototyping revolutionary quantum networking systems and technology, and research into advanced quantum algorithms.\n• Biomedical Sciences and Technology supports the development of bio-engineered and biomedical technologies to aid the warfighter. Projects include brain imaging technologies; relevant research in brain and cognitive sciences; engineered biological systems to aid physiology understanding; and technologies to assess physical performance and enhance injury recovery. \n• Autonomous Systems has the objective of developing mobile, autonomous, robotic platforms, as well as sensors and algorithms that support key capabilities needed for a wide range of DoD applications. Projects span advanced artificial intelligence and processing; sensors and communications for unmanned platforms; platform designs and energy systems; human-machine interactions; and verification and validation of autonomous systems.\n\nOne system technology area:\n• Integrated Systems technology projects use multiple new technologies to solve important national problems. Projects selected for funding have an applied research component focused on integrated technology capability or technologies that facilitate greater levels of integrated capability. Projects target key DoD warfare domains, including space, air, land, sea surface, and undersea."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Devices"
                                    },
                                    "Description": {
                                        "val": "This project area targets the research and development of unique and innovative components, subsystems, and sensing concepts or methodologies that enable new solutions to important DoD problems. Activities under this technology area include specialized silicon and compound semiconductor-based devices for RF, analog, mixed-signal, and digital electronics; photonics, optoelectronics and laser technologies; novel devices and concepts for chemical, biological, and radiation sensing; and micro-hydraulic devices for motors and actuation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "For FY 2017, Advanced Devices has eight projects: (1) Digital CCD is a continuing effort that is combining the best attributes of CCD and CMOS-based imaging devices, including a massively parallel analog-to-digital converter architecture with scientific-grade CCD pixels and amplifier designs with sub-electron noise; (2) Diamond Power Transistors is a continuing effort that is developing high-performance power transistors for radar, electronic warfare, and communication applications; (3) Germanium CCDs is a continuing program to develop germanium-based CCDs for large-format, high-quality short-wave IR imaging; (4) Zero-Crosstalk IR Geiger-mode Avalanche Photodiodes (GmAPDs) for Multi-mode Imagers is a continuing project that focuses on the elimination of crosstalk between pixels in InGaAs-based GmAPD arrays to enable dramatically reduced spacing between pixels; (5) Photonic Integrated Navigation-Grade Gyroscope (PING) is a continuing effort that is developing environmentally stable optical sources to improve the long-term stability of interferometric fiber-optic gyroscopes (IFOGs); (6) Flexible Microhydraulically Actuated Fibers is a continuing effort that is developing of a liquid-solid scalable actuator that mimics biological muscle; (7) Scalable Silicon Geiger-mode APD Arrays is a new effort that is  developing novel crosstalk reduction techniques for silicon-based GmAPDs for lidar and passive-imaging applications; (8)   Multifunction Undersea Blue-Green Laser Transmitter is a new project that is developing gallium-nitride (GaN) based materials and photonic components (e.g., lasers, optical modulators) for high-power transmitters for underwater optical communications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.391"
                                            },
                                            "Text": {
                                                "val": "More sensitive prototypes of larger format imagers integrated with small-pitch read-out integrated circuits (ROICs) will be developed. Subsystem demonstrations of photonic-integrated gyroscopes will measure the gyroscope accuracy and reliability.  Prototype circuits of a new class of high-power, diamond-based wideband transistors will help evaluate the promise of this technology. Gallium nitride (Ga N)-based photonic components operating at blue-green wavelengths will be matured and demonstrated in system prototypes. Projects for FY 2018 include developing higher performing substrates for infrared devices; developing pixel arrays that integrate germanium detectors with silicon integrated circuits for more capability at each pixel; and prototyping a new, highly compact clock that will aid in navigation and timing for small platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.099"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.099"
                                            },
                                            "Text": {
                                                "val": "Chemical sensing technology and blue-green laser developments begun in FY 2017 will conclude in FY 2019 with the demonstration of technology prototypes. This project area expects new applied research in the areas of magnetic imaging for advanced microscopes, more flexible and higher performing optical sensors, superconducting electronics, and other advanced devices."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Systems and Technologies"
                                    },
                                    "Description": {
                                        "val": "This project area conducts applied research and develops novel concepts, technologies, and systems to be used in next-generation optical systems for the DoD. Investments in optical-based technologies can fill the critical technology gaps in emerging DoD threat areas, such as anti-access\/area denial (A2\/AD), counter–weapons of mass destruction (C-WMD), and asymmetric warfare. Optical systems and technologies will also improve capabilities using new tactics, techniques, and procedures (TTPs) in traditional DoD mission areas such as intelligence, surveillance, and reconnaissance (ISR), space control, communications, and ballistic missile defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.577"
                                            },
                                            "Text": {
                                                "val": "In FY 2017, Optical Systems and Technology is continuing to fund four previous-year projects in order to bring their efforts to successful demonstrations: DISCIT, MicroLADAR, Digital Coherent Aperture Combiner, and Panelized Laser Transceiver.  In FY 2017, five new projects have been initiated: (1) the Zero-Seam-Loss Large Format Tiled IR DFPA project, which  shows great promise to scale focal plane sizes for many different imaging detectors by orders of magnitude; (2) the Long-wave Infrared (LWIR) Coherent Laser Radar project, bringing to remote sensing methodologies orders of magnitude increase in sensitivity in tactically useful wavebands; (3) the Computational Reconfigurable Imaging Spectrometer project to extend the SEEIT methodology to hyperspectral imaging; (4) the On Orbit Sensor Test and UV Phenomenology for Space Situational Awareness Systems project, that is leveraging a Lincoln developed UV space sensor for an experiment on the International Space Station; and finally (5) an Integrated Planar-Lens Based Chip-Scale Lidar project that takes optical LADAR into the extremely small form factor, integrated photonics domain."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.540"
                                            },
                                            "Text": {
                                                "val": "Optical Systems and Technology will continue to develop technologies for high-energy lasers (HEL) that are finding many defensive and offensive DoD applications including blinding sensors and other countermeasures. Research in computing-intensive algorithms as well as more capable focal plane arrays will demonstrate higher resolution images. Until now, a laser radar on a large aircraft produced three-dimensional (3D) images only after hours of processing on the ground. Development of a small laser radar in FY 2018 will allow real-time 3D images on a small unmanned air vehicle. Microwave radars with multiple receivers have many advantages including multiple look angles, stealthy receivers, and higher resolution. Research with simultaneous microwave beams and optical beacons will explore techniques to overcome synchronization and coherent combining difficulties. The ability for wavelength agility will become as important in the optical domain as it is for microwave electronic warfare. So, development of multi-wavelength imaging spectrometers, long-wavelength infrared laser radars, and wavelength-agile short pulse lasers will provide continued capability growth while ensuring that deployed countermeasures in overused optical regions will not thwart DoD capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.600"
                                            },
                                            "Text": {
                                                "val": "Design will commence on integration of a 3D laser radar into an unmanned air vehicle. Continue development on optical coherent combining which will enable a wide variety of applications in areas of HELs, optical imaging, multi-wavelength signal processing, and communications. Although coherent combining of optical beams is many decades old, technology has only recently advanced enough to enable many DoD applications. The most promising of these will be developed in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency (RF) Systems and Technologies"
                                    },
                                    "Description": {
                                        "val": "This project area focuses on research, development, and evaluation of innovative RF technologies and system concepts for radar, signals intelligence, electronic warfare, and communications. Emerging national security challenges include a rapidly expanding threat spectrum, the increasing need to integrate sensors on platforms with severely constrained payloads, military operations in strong clutter and interference environments, detection and long duration tracking of difficult targets, and robustness against sophisticated electronic countermeasures. To address these new mission requirements, future RF systems will need to operate with increased bandwidth, higher dynamic range, higher-frequency bands, and lower size, weight and power (SWAP)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.661"
                                            },
                                            "Text": {
                                                "val": "In FY 2017, a number of projects are continuing in the areas of advanced RF electronics, including Aperture Level Simultaneous Transmit and Receive (STAR) for Phased Array Applications, Gallium Nitride (GaN) on Silicon for Next-Generation Phased Arrays, Embedded Microjets for high thermal power density cooling, and Lightweight Deployable Antenna arrays for small-satellite applications. Two new projects were started in FY 2017, including (1) the Jammer Mitigation and Jammer System Development project, which is developing uninterrupted wireless communication in realistic jammer environments enabled by Receiver processing mitigation (RPM) algorithms that require no additional antennas and no changes in the waveform; and (2) the Wideband RF Advanced Spectral Processor (WRASP) effort, which is developing new architectures for ultra-wideband receivers with high dynamic range and on-chip spectral power detection, digital cueing, and signal processing to minimize off-chip data transfer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.195"
                                            },
                                            "Text": {
                                                "val": "RF Systems and Technology will continue to focus research on advanced RF technologies in support of emerging needs for radar, electronic intelligence (ELINT) communications, and electronic warfare (EW) systems. The major research areas include: advanced RF arrays that deliver higher power and efficiency; wideband receivers for ELINT applications; simultaneous transmit and receive technology to enable multifunction RF systems; micro-hydraulic-jet technology for RF electronics cooling; and algorithm techniques for RF countermeasures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "The GaN on Si CMOS technology development will continue with an advanced prototype test. The wideband ELINT receiver development will continue, with a major intermediate milestone to demonstrate a prototype breadboard. The fiber-combining RF array project will develop critical enabling components. This project area expects new applied research in electronic warfare algorithms, transmit beam processing to increase RF system flexibility and performance, applications of 3D manufacturing to RF components, and other RF capability areas."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Information, Computation, and Exploitation Sciences"
                                    },
                                    "Description": {
                                        "val": "This project area achieves technical gains in data processing, computation, exploitation, and information visualization for DoD applications. The volume, velocity, and variety of information production and consumption are growing at exponential rates. Novel computing architectures, hardware and analytical techniques provide tools to process “big data”. These tools for high throughput processing, fusion, interpretation, and exploitation of “big data” are applied to both real-time and stored multi-sensor, multi-intelligence data sets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.089"
                                            },
                                            "Text": {
                                                "val": "The Graph Processor effort is completing its three-year development by executing multiple real-time graph analytics functions on a 64-node field-programmable gate array (FPGA) integrated into the Lincoln Laboratory Supercomputer Center (LLSC). Data sets of interest to the Department of Defense (DoD) and Intelligence Community are being benchmarked. Concepts for lower power application-specific integrated circuit (ASIC) systems are also being developed.The Massive Computation and Resiliency Internet of Things (IoT) project is exploring the use of advanced commercial compute devices to perform relevant mathematical and data storage\/access functions at high performance-to-power ratios as well as efficient approaches for secure multi-party computation on Big Data data-sets. Other efforts continue to focus on novel machine learning techniques.  The Dynamic Deep Learning (DDL) project is refining architectural optimization approaches while addressing its implementation on constrained low-power embedded systems. The Computer-on-Watch project is focusing on early warnings applications based on adaptive deep learning algorithms.  The new Adaptable, Interpretable Machine (AIM) learning project is providing analysts and decision makers with explanation and provenance of results obtained by machine learning techniques. This project is also developing new technologies to enhance system performance over time through user-feedback machine-learning techniques. The Open-source Data Initiative project continues to be upgraded to provide the needed foundation for future algorithm developments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.788"
                                            },
                                            "Text": {
                                                "val": "Several highly publicized attacks on computer networks were promulgated using unsecured Internet of Things (IoT). In FY 2018, an IoT project will prototype resilient cloud computing techniques in IoT networks to protect military systems. Advanced machine learning efforts will expand to national security environments where tagged training data are sparse. Sparse data introduces hurdles that are not being addressed in the commercial world. The new techniques will help the warfighter make better decisions based on current knowledge in a timely way. New real-time processing approaches such as the graph processor effort will reduce size, weight, and power (SWAP) to allow advanced analytics to be deployed at the tactical edge."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.860"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.860"
                                            },
                                            "Text": {
                                                "val": "Transition of the graph processor technology to use in the Supercomputing Center will be completed to test. Also, work will continue to focus on providing enough information for decision making at the tactical edge through increased efficiency of available information and machine learning techniques. Applied research will continue on the use of deep learning techniques for data exploitation, with an emphasis on designing algorithms that are both efficient and that can explain their decision processes to humans."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Biomedical Sciences and Technology"
                                    },
                                    "Description": {
                                        "val": "This project area develops advanced biomedical technology and systems to address health needs to enhance warfighter resilience and sustainability. The projects exploit expertise in advanced signal processing, optoelectronics, systems engineering and analysis, biology and chemistry, and other fields to develop novel methods and devices for interrogating and understanding physiological and cognitive aspects of the human domain. The overarching goal of these efforts is to increase human performance and prevent or predict injury through improved understanding of the biological mechanisms of disease and injury and through individualized biological monitoring, analysis, and interventions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.166"
                                            },
                                            "Text": {
                                                "val": "In FY 2017, ongoing projects include: (1) The ArtGut program is completing a functional ArtGut prototype system for use at Lincoln that can be transitioned to collaborators for future projects. The project is developing a demonstration of in-vitro sustained cultures of defined microbial communities. The project FY 2017 goals are to compare the metabolic activity of these microbial communities to more traditional benchtop culture results as well as to model predictions; (2) The NCLUS effort is completing development of full 3D imaging capability to support the fabrication of prosthetics for amputees; (3) A related project is focusing on automated bio image analysis; (4) The volumetric-muscle-loss project  is culminating this year with in vitro demonstrations of directed cell differentiation to restore muscle function; (5) The MIND project is  fabricating a neural sensor so small it can be inserted into the brain without damaging neurons; (6) Ultra-sensitive magnetic field measurement technology from the Quantum System Sciences project area is being used to build a better magnetoencephalograph for brain imaging; (7) The brain-mapping project is developing improved algorithms for neuron-tracing, leveraging software algorithms used in ballistic missile defense and other image-tracking applications. Finally (8) the neurocognitive project is modeling sensorimotor control to better understand experiments conducted in the newly-opened immersive virtual reality dome at Lincoln Laboratory."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.812"
                                            },
                                            "Text": {
                                                "val": "Advance understanding of the human brain, developing better diagnostics for cognitive load assessment and illnesses like mild Traumatic Brain Injury (mTBI), and improving field forward casualty care will facilitate diagnostics for and improvements in warfighter health and resilience. Several efforts are augmenting the Brain Research through Advancing Innovative Neuro-technologies (BRAIN) initiative being led by the Defense Advanced Research Projects Agency (DARPA) and The National Institutes of Health (NIH), and include the development of algorithms for cellular resolution brain mapping, the design and prototyping of neuron-size, biocompatible sensors for in-vivo neural monitoring, as well as the design and development of novel sensors for imaging systems to make them portable for use in the field and office to diagnose post-traumatic stress or brain injury, and to conduct real time cognitive load assessment for the warfighter. Sensorimotor tracking of neurological disorders in a large virtual reality environment is informing the detection of mTBI, with a focus on transitioning a simplified version of the capability to clinical settings. Other efforts are targeted at developing and implementing novel model systems and sensors, medical support tools, and the application of big data analytics to areas such as medical image analysis. Novel model systems and sensors include: the Lincoln Laboratory Artificial Gut that is helping to decipher the complex relationship between the nervous system and the microbiome, which has been correlated with depression and stress, as well as neuro-generative diseases including Parkinson’s Disease; and development, design and prototyping of an engineered sensor platform capable of real-time monitoring of health biomarkers in the body or in body fluids. Novel medical support tools include: a novel hearing aid design that uses deep neural networks to reduce the cognitive burden of isolating a single speaker in background noise, which is of relevance for normal and hearing impaired warfighters; and implementation of artificial intelligence to develop a system for field forward casualty care that reduces the burden on medics providing combat casualty care."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.100"
                                            },
                                            "Text": {
                                                "val": "Better understanding and harnessing of Human Machine Interfaces (HMI) will become increasingly important for the DoD. The Laboratory will incorporate results of the FY 2018 Laboratory HMI systems analysis study to chart a path forward to address identified knowledge and capability gaps aligned with DoD needs. Biomedical Sciences and Technology will continue to place an increasing emphasis on multimodal data collection and analysis in diverse application areas for example, cognitive and neuroscience, microbiome-related, tissue healing, in keeping with emergent science trends and anticipated DoD needs. The increased understanding will also aid in treatment of soldiers with traumatic brain and other battlefield injuries. This project area will continue to develop concepts and technologies in medical sensing, imaging, and diagnostics, cognitive analytics, and cellular and molecular engineering. Multimodal approaches to understanding physiological and psychological status will continue. Novel tool and platform development focused on accelerating and improving biotechnology research will also continue. Medical image processing and rehabilitation tools will be explored by leveraging existing Laboratory expertise in image processing, signal analysis, and decision support algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in funding will accommodate expected additional research, informed by the Laboratory’s HMI systems analysis study, as this is a significant growth area for the DoD, and ensure the successful continuation and continued results of ongoing projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "This project area addresses current and anticipated DoD mission needs in autonomous robotics. In DoD environments, unmanned systems must perform useful tasks as trusted, capable agents without continuous human operator control. Projects include development of autonomy algorithms and technologies, such as perception and world modeling, planning, human-robot interaction, manipulation, learning and adaptation, and robotic platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.401"
                                            },
                                            "Text": {
                                                "val": "Autonomous System projects are continuing in the hardware and algorithm development areas and are expanding to include key efforts to address autonomy in the face of uncertainty. A demonstration is being developed for a digital vision sensor for fast autonomous airborne navigation in a dynamic flight test. Coordination algorithms for multi-agent Unmanned Air Vehicles (UAVs) using decentralized planning algorithms are being developed and tested with real-world communication constraints. Development of size, weight and power (SWaP) constrained adaptive communication algorithms is continuing, with the goal of enabling large-scale multi-robot teams. A biomimetic sonar project is developing autonomous object detection, localization and classification. Simulations, experimental studies of ionized flow field and aerodynamic interactions, and field testing are taking place to improve silent UAV performance. Work to exploit common structures to describe environments with reduced parameter sets and optimize perception algorithms for low computation sparse sensing and explore the separation of sensing and computation to enable truly autonomous micro UAVs has begin. Development and extension of Petablox, which is a specification language that enables users to specify autonomous systems properties, for use in verification of tightly integrated autonomous systems has begin, and is being combined and compared with newly enhanced DRAKE verification algorithms utilizing complex dexterous manipulation testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.904"
                                            },
                                            "Text": {
                                                "val": "Coordination of robot swarms will continue to add features that allow optimization of goals even with a great deal of uncertainty for example, “the fog of war”. These improvements rely on continuing research in multi-agent coordination and machine learning algorithms. One learning algorithm project will emulate biological thinking for adapting to changing knowledge. Advances in autonomous systems rely not only on improved algorithms, but also better interfaces between hardware and algorithms, as well as more suitable hardware. This project area will conduct research into better tactile interfaces for grasping and manipulation, with an additional focus on building autonomous systems that will perform within prescribed performance bounds. These research thrusts will have important applications in autonomous robot augmentation for the warfighter. Also, being aware that the noise of an autonomous Unmanned Aerial Vehicle (UAV) can compromise its mission, work on an electroaerodynamic (EAD) propulsion system will lead to sustained noiseless flight. In addition, a study will provide an autonomous undersea mapping framework for future efforts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.100"
                                            },
                                            "Text": {
                                                "val": "As autonomous systems play an increasingly important role in the DoD, work in autonomous undersea mapping will rely on new algorithms, new autonomous undersea vehicles, and communications to interface between distributed sources of information and distributed, multiple agents. Research on EAD UAVs will continue to improve performance and make the system more robust. Incorporation of algorithms from the commercial world will hasten the development of autonomous systems for the DoD. Incorporation of technology improvements from the commercial world will lead to improvements in lower Size, Weight, Power and Cost (SWaP-C) systems. Novel energy harvesting strategies will be explored to support a variety of missions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quantum System Sciences"
                                    },
                                    "Description": {
                                        "val": "This project area develops methods for sensing, communicating, and processing information using quantum mechanical manipulation not possible with classical computing techniques. Collaborations with major university quantum system science efforts are establishing a robust scientific foundation. On this foundation, application-oriented developments important for national security are being fostered."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.437"
                                            },
                                            "Text": {
                                                "val": "Multi-qubit operations are being explored in both the trapped ion system, using the two ion species, and in the superconducting qubit system, using the recently fabricated chips and a new approach to 3D integration for enabling qubit coupling in a scalable array format. The work on simulation tools is being expanded, particularly in support of simulating the trapped ions, and the feasibility of implementing the quantum computing algorithm for exponential speedup of linear algebra is being evaluated in terms of the number of gates for problem sizes that cannot be addressed by classical supercomputing. The quantum communication entanglement distribution effort is being expanded to a three-node multi-span architecture that includes an investigation into photonic qubit quantum memory architectures based on defect-centers and ion traps. The sensitivity of the magnetometer using nitrogen-vacancy defect states in diamond is being further improved by using more optimized diamond samples and advanced pulse sequences."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.160"
                                            },
                                            "Text": {
                                                "val": "A unique feature of quantum mechanical manipulation is the correlation property, particularly for entangled states. Research takes advantage of these states to produce secure quantum networks and quantum computers, which, in principle, can do calculations far beyond the ability of any classical computer. A quantum communications system has been built over an in-ground fiber in the Boston metropolitan area. This system will continue to develop and test a robust and secure quantum network with applicability to a secure core network for the DoD. Quantum computing could have important implications for solving DoD problems that are intractable on classical computers. Multiple techniques for overcoming technical difficulties are being investigated. For example, advances in control and measurement of trapped ion and superconducting qubits will enable the development of noise correlation measurements and error correction techniques. These advances are a requirement for quantum computers. FY 2018 plans also include design of a fieldable, high-precision vector magnetometer based on advances in quantum magnetometry. This project area will also investigate electric field measurements that are based on the same physics and that employ much the same hardware as used for the magnetometer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.200"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.200"
                                            },
                                            "Text": {
                                                "val": "Research will place an emphasis on approaches to do quantum state transfer between a trapped ion and photon and leverage the ions for quantum sensing and quantum clocks. A linchpin for both quantum networks and quantum computers is the ability to manipulate robust quantum memories. Advances in quantum memories will build on the improved control and measurement techniques of FY 2018. Improved measurements based on sub-shot noise interferometry using entangled states will enhance microwave links over optical fiber, which has important applications for remoting of antennas. FY 2019 plans also include scaling quantum computer prototypes and investigating improved control and error correction mechanisms, as well as developing increased bandwidth quantum networking capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Materials and Processes"
                                    },
                                    "Description": {
                                        "val": "This project area (formerly named Novel and Engineered Materials) develops materials and processes that make a transformative impact on enduring national challenges. Areas of strategic focus are material property customization and material enablers for much lower SWaP systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Materials discovery using additive manufacturing continues in FY 2017, and is being expanded with the addition of a new effort to develop electronics-quality printable metal for non-planar substrates. The transition metal dichalcogenide (TMD) project continues to focus on growth of wafer-scale, device-quality materials. The project isdetermining electrical and optical properties relevant to computation. Advanced project work in designing and drawing of composite fibers is focused on developing novel sensing capability in textile form. Additionally, Lincoln Laboratory has launched an expanded effort in phase-change tunable metamaterials to enable ultra-low-SWaP imaging."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.075"
                                            },
                                            "Text": {
                                                "val": "Lincoln Laboratory leverages additive manufacturing for materials discovery and property customization. Research into multimaterial fibers showed in FY 2017 unique long-wavelength properties. When woven into cloth in FY 2018, the cloth should make soldiers significantly less visible to heat-sensing cameras. This project area recently developed materials with large optical property changes in sub-millisecond times. Lincoln Laboratory continues to FY 2018, we will develop prototypes to improve this capability. Further work in FY 2018 will apply these materials to DoD and IC applications. This project area will conduct research into ”valleytronic” materials, which have the potential  to deliver extremely low-power memory and computing capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "Gaining proper understanding of valleytronic materials will require several years of research. This project area will conduct research and development of new valleytronic materials and phenomenology. The project will also develop novel fibers with unique physical, chemical, or biological properties that can be integrated into fabric or other materials, which could revolutionize warfighter protection and capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Integrated Systems"
                                    },
                                    "Description": {
                                        "val": "This project area combines multiple new technologies to solve important national needs. Projects selected for funding have an applied research component focused on integrated technology capability or technologies that facilitate greater levels of integrated capability. Projects target key DoD warfare domains, including space, air, land, sea surface, and undersea. The intent is to support early work on systems that cut across the conventional categories."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.295"
                                            },
                                            "Text": {
                                                "val": "Integrated Systems projects are focusing in three main areas. One effort is developing an integrate Processing, Exploitation, and Dissemination (PED) capability at the tactical edge, by using cloud computing and robust, hierarchical communications technology. This project is designing a Cloud architecture for PED, which would be available at forward-deployed bases.  Another project is an Autonomous and Reconfigurable Maritime Networking Demonstration. This project builds on a recent underwater communication demonstration from the Optical Systems and Technology area. In FY 2017, active pointing and tracking of the terminals technology is being for adaptive communications between moving undersea objects.  The third effort is focused on risk reduction research and architectural design for a 3D imaging laser radar system to be deployed on a low earth orbit (LEO) satellite. This ladar has the potential to observe structures under foliage with global coverage."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.910"
                                            },
                                            "Text": {
                                                "val": "This project area will continue two projects from FY 2017 and evolve two projects from other technology areas. The undersea laser communications project will refine the pointing-and-tracking technology needed to accomplish narrow beam communications, and will do in-water testing of a communication network between multiple moving platforms. The 3D space-based ladar effort will continue with risk reduction in key areas, including data-registration for forming 3D image and space optics technology. The project will accelerate the design of a future generation micro-air vehicle (MAV) for integrating advanced power, guidance, control, and payloads. Maturation of wafer-scale integration processes will lead to development of designs for applying these processes to small satellite systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.100"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.100"
                                            },
                                            "Text": {
                                                "val": "The four efforts will continue in FY 2019. The undersea laser communication project will conclude with a multiple undersea vehicle communication demonstration. The 3D ladar project will complete risk reduction activities (described above) and will proceed to a preliminary design review for a critical space surveillance mission. The future generation MAV project will focus on integrating advanced sensing payloads and advanced autonomous system processing control algorithms. The plan is to develop a highly integrated wafer-scale small satellite bus with a basic payload. This satellite bus will be a highly integrated capability with embedded thrusters, control, and space for small form factor payloads."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in funding in FY 2019 will accommodate increased development costs of maturing projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber Security, Science and Engineering"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Science and Engineering Program focuses on the development of technologies and new techniques for the protection of systems against cyber-attack and exploitation. Projects include research into technologies for cyber situational awareness, command and control; technology to improve resilience of systems to cyber-attack; and technologies for system exploitation research."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Plans include advancing the capability to discover and rapidly respond to cyber vulnerabilities, as well as improving significantly the design and architecture of embedded computer systems and data management systems, which will facilitate improvements in DoD cyber security and resilience. Research into novel approaches for computer hardware\/software design will guide the design and development of a fundamentally new computing system that is inherently secure and can ensure mission success even when compromised. This effort will be complemented by developing a data-centric approach to ensuring self-protection of data throughout storage, computation and transit. Research into cyber resilient approaches for mission assurance includes the development and implementation of a secure processing engine for autonomous systems, and the development and validation of an automated capability for contested environments where a host may be disabled or compromised. Other cyber efforts include further developing the capability to automatically generate effective cyber courses of action for evolving threat environments such as damage by an attacker after network penetration, securing small satellites against the growing threat of cyber-attack, and securing the ability to compute on private data without revealing it and demonstrating this capability for a Department of Homeland Security (DHS) application."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Cyber efforts will move to an individual project code starting in FY 2019."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There are no notable changes between FY 2018 and FY 2019, where the latter is reported in an individual project code starting in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "535"
                    },
                    "ProjectTitle": {
                        "val": "Technical Intelligence"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.905"
                        },
                        "PriorYear": {
                            "val": "8.374"
                        },
                        "CurrentYear": {
                            "val": "5.473"
                        },
                        "BudgetYearOne": {
                            "val": "6.737"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.737"
                        },
                        "BudgetYearTwo": {
                            "val": "6.743"
                        },
                        "BudgetYearThree": {
                            "val": "6.839"
                        },
                        "BudgetYearFour": {
                            "val": "6.960"
                        },
                        "BudgetYearFive": {
                            "val": "7.092"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Technical Intelligence Program supports the strategic intelligence analysis through providing global science and technology (S&T) awareness and context in order to inform Defense technology, engineering & acquisition decision-makers planning for an uncertain future. The program exploits novel technology watch and horizon scanning (TW\/HS) tools to identify nascent and disruptive technologies that will shape tomorrow’s future by integrating intelligence-based and open-source information to characterize today’s global S&T environment, this characterization, in combination with other technical analysis, will inform strategic decisions for capability development. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technical Intelligence"
                                    },
                                    "Description": {
                                        "val": "The Technical Intelligence Program supports the strategic intelligence analysis through providing global S&T awareness and context in order to inform Defense technology, engineering & acquisition decision-makers planning for an uncertain future. The program exploits novel TW\/HS tools to identify nascent and disruptive technologies that will shape tomorrow’s future by integrating intelligence-based and open-source information to characterize today’s global S&T environment, this characterization, in combination with other technical analysis, will inform strategic decisions for capability development. The program complements this with tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations for emerging and disruptive technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.374"
                                            },
                                            "Text": {
                                                "val": "In FY 2017, the Technical Intelligence program will continue to support efforts characterizing today’s global S&T environment, exploiting novel TW\/HS tools to identify nascent and disruptive technologies that will shape tomorrow’s future, and developing tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations of emerging and disruptive technologies.  Specifically:\n- JASON Program: Will support focused technical assessments on defense relevant problems.  The potential topic areas include: advanced electronics, autonomy, electronic warfare and protection, energy and power technologies, engineered resilient systems, space, sensor and processing systems, and human systems. \n- Technology Watch and Horizon Scanning (TW\/HS) Tool Exploitation: Will continue to sponsor efforts on exploiting data analysis and TW\/HS tools with the goal of having an operational TW\/HS toolkit available to DoD researchers and scientists.  The program will identify outreach opportunities to inform and train DoD S&T organizations in the usage of analytical tools and methodologies to support “in-house” decision making and expand organizational knowledge into emerging technology areas of strategic interest.\n- Technical Assessment Program: Will sponsor multiple technical assessment activities that support the community of interest topic areas, which may include advanced computing, cognitive decision-support tools, and non-traditional sensing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.473"
                                            },
                                            "Text": {
                                                "val": "In FY 2018, the Technical Intelligence program will continue to support efforts characterizing today’s global S&T environment, exploiting novel TW\/HS tools to identify nascent and disruptive technologies that will shape tomorrow’s future, and developing tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations of emerging and disruptive technologies. Specifically:\n• TW\/HS Tool Exploitation: ($3.5M) will continue to support the operational TW\/HS toolkit, TechSight, which is available to DoD researchers and scientists, and focus on expanding it to provide quicker data analytics for TW\/HS to support decision making through the inclusion of DoD contract, small business innovation research (SBIR) and grant award information. These developments will allow for strategic analysis of S&T and acquisition investments to inform technology, engineering, & acquisition decisions. The program will identify outreach opportunities to inform and train DoD S&T organizations in the usage of analytical tools and methodologies to support “in-house” decision making and expand organizational knowledge into emerging technology areas of strategic interest.\n• Technical Assessment Program: ($0.5M) will sponsor multiple technical assessment activities that support the community of interest topic areas and more emphasis will be placed on conducting impact assessments of emerging technologies. These assessments will inform the S&T community on direction for future capabilities to support joint and cross domain missions. \n• Intel Support to S&T: ($1.0M) will provide a bridge between the intelligence community (IC) and the S&T community to access the most relevant intelligence analysis, coordinate integration of intelligence with capability development, and conduct Red Cell assessments to inform technology investment shaping and strategic direction. An additional function will be to produce an annual S&T Intelligence Needs Plan providing the IC a formal understanding of intelligence requirements for the R&D community. \n• Wargaming: ($0.5M) will integrate emerging threats from kill chain analysis and potentially disruptive technologies from horizon scanning efforts through the DoD wargaming community to better understand the potential of emerging technologies to better inform both the DoD requirements process and the technical capability development process."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.737"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.737"
                                            },
                                            "Text": {
                                                "val": "In FY 2019, the Technical Intelligence program will continue to support efforts characterizing today’s global S&T environment, exploiting novel TW\/HS tools to identify nascent and disruptive technologies that will shape tomorrow’s future, and developing tailored technical assessments that identify the military relevance, research opportunities, and policy recommendations of emerging and disruptive technologies. Specifically: \n• TW\/HS Tool Exploitation: ($4.7M – Additional Data sources) will continue to support the operational TW\/HS toolkit, TechSight, which is available to DoD researchers and scientists, and focus on developing data analytics on the commercial sector through analyzing venture capital, private equity and commercial investments in R&D.  \n• Technical Assessment Program: ($0.5M) will sponsor multiple technical assessment activities that support the community of interest topic areas and more emphasis will be placed on conducting impact assessments of emerging technologies. These assessments will inform the S&T community on direction for future capabilities to support joint and cross domain missions. \n• Intel Support to S&T: ($1.0M) will provide a bridge between the intelligence community (IC) and the S&T community to access the most relevant intelligence analysis, coordinate integration of intelligence with capability development, and conduct Red Cell assessments to inform technology investment shaping and strategic direction. An additional function will be to produce an annual S&T Intelligence Needs Plan providing the IC a formal understanding of intelligence requirements for the R&D community. \n• Wargaming: ($0.5M) will integrate emerging threats from kill chain analysis and potentially disruptive technologies from horizon scanning efforts through the DoD wargaming community to better understand the potential of emerging technologies to better inform both the DoD requirements process and the technical capability development process."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase resources to support technology watch and horizon scanning in order to inform the DoD R&D investments."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "815"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Security, Science and Engineering"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "3.500"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.500"
                        },
                        "BudgetYearTwo": {
                            "val": "3.500"
                        },
                        "BudgetYearThree": {
                            "val": "3.500"
                        },
                        "BudgetYearFour": {
                            "val": "3.500"
                        },
                        "BudgetYearFive": {
                            "val": "3.500"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Cyber Security Science and Engineering Program focuses on the development of technologies and new techniques for the protection of systems against cyber-attack and exploitation. Projects include research into technologies for cyber situational awareness, command and control; technology to improve resilience of systems to cyber-attack; and technologies for system exploitation research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "N\/A"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security, Science and Engineering"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security, Science and Engineering Program conducts research, development, evaluation, and deployment of prototype components and systems designed to improve the security of computer networks, hosts, and applications, thereby assuring the resilience of Department of Defense (DoD) missions against cyber-attack and exploitation. A particular focus is the overlap between the DoD mission areas and the cyber domain. Efforts include cyber analysis; creation and demonstration of robust architectures that can operate through cyber-attacks; development of prototypes that demonstrate the practicality and value of new techniques for cryptography, cyber sensing, automated threat analysis and course of action selection, anti-tamper systems, and malicious code detection; demonstrations of the impact of cyber on traditional kinetic systems; quantitative, repeatable evaluation of these prototypes; and, where appropriate, deployment of prototype technology to national- and international-level exercises and DoD and intelligence community operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Cyber efforts were previously funded under Project P534 in FY 2018 and prior."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Plan to improve the capability to rapidly respond to evolving cyber threats and new technology trends, and guide future plans for cyber security. Further develop the design and architecture of novel cyber resilient computer systems and data management systems, as well as capabilities and tools to support mission assurance. Plan is to focus on big data analytics in support of cyber situational understanding and effective, timely decision making; these capabilities will play a key role in future applied research. Continue to develop prototype cyber decision support systems that can automatically generate effective cyber security courses of action to protect systems under attack."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No notable change between FY 2018 (under Project P534) and FY 2019"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}