{
    "id": "2019-AirForce-PB-3600-MJBOOK-0-0-97d6524a8b4365a02b2dbc77b2fa917b042c190b20c34763a88a2f8d6691cc2d-27",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603788F"
        },
        "ProgramElementTitle": {
            "val": "Battlespace Knowledge Development and Demonstration"
        },
        "R1LineNumber": {
            "val": "28"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.274"
            },
            "CurrentYear": {
                "val": "49.011"
            },
            "BudgetYearOne": {
                "val": "51.064"
            },
            "BudgetYearOneBase": {
                "val": "51.064"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "56.961"
            },
            "BudgetYearThree": {
                "val": "58.628"
            },
            "BudgetYearFour": {
                "val": "61.775"
            },
            "BudgetYearFive": {
                "val": "63.025"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops and demonstrates Air Force enterprise-centric information technologies for the warfighter. The Anticipatory Operations Intent and Response project develops the technologies for dynamic planning and execution with the accuracy, fidelity, and timeliness needed to dominate the battlespace. The Assured Worldwide Connectivity project provides advanced net-enabled architectures and communications technologies in support of global military operations, including a secure information grid for worldwide information exchange of near-real-time multimedia (i.e., voice, data, video, and imagery) information. In addition, this project develops and demonstrates advanced optical networking and communications for Air Force air and space-based information exchange on and between platforms. These optical networks will be rapidly deployable, mobile, interoperable, and seamless between Air and Space Operations Centers (AOCs) and air and space- based platforms either en route or in theater. This project also provides tools and applications leading to the development and integration of cyber deterrence technologies resulting in a strategic capability of cyber dominance within the secure information grid. The Global Battlespace Awareness project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and total battlespace awareness by using and exploiting information from all sources. The Knowledge Management and Computing project develops the technology applications that will provide for a secure, tailored, seamless exchange of information among producers, consumers, and managers of information relevant to a particular community of interest (COI). The project also provides the development of interactive and real-time computing technologies that greatly improve the usability of high-performance computing for the exchange, utilization, and management of information in the enterprise. The Cyber Battlespace Development and Demonstration project develops the ability to deliver sovereign options in cyberspace through the development and integration of cyber attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance.\n\nThe Air Force Future Operating Concept established a science and technology challenge to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action by 2035. Operational agility will require flexibility (manifested as multi-domain operations), speed (manifested as superior decision speed), coordination (manifested as dynamic command and control), balance (manifested as presenting a balanced capability mix), and strength (manifested as performance-optimized teams). In order to enable operational agility, this program will begin to shape future research and development (R&D) to focus on technologies in support of operational agility through multi-domain command and control (MDC2) capabilities.\n\nThis program has been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems prototypes fro field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "58.110"
                },
                "CurrentYear": {
                    "val": "49.011"
                },
                "BudgetYearOne": {
                    "val": "52.995"
                },
                "BudgetYearOneBase": {
                    "val": "52.995"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.274"
                },
                "CurrentYear": {
                    "val": "49.011"
                },
                "BudgetYearOne": {
                    "val": "51.064"
                },
                "BudgetYearOneBase": {
                    "val": "51.064"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-5.836"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-1.931"
                },
                "BudgetYearOneBase": {
                    "val": "-1.931"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-3.900"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.936"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.931"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.931"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2017 due to reprogramming for Hypersonics Science and Technology activities. Decrease in FY 2019 due realignment of funds to focus on Directed Energy Game Changer efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "635319"
                    },
                    "ProjectTitle": {
                        "val": "Anticipatory OPS Intent and Response"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.000"
                        },
                        "CurrentYear": {
                            "val": "3.602"
                        },
                        "BudgetYearOne": {
                            "val": "6.099"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.099"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "6.221"
                        },
                        "BudgetYearThree": {
                            "val": "6.344"
                        },
                        "BudgetYearFour": {
                            "val": "6.473"
                        },
                        "BudgetYearFive": {
                            "val": "6.603"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "In order to achieve information dominance, the Air Force must be able to monitor, assess, plan, and execute missions rapidly across the full spectrum of operations (air, space, and cyberspace) at all levels of war (strategic, operational, and tactical) and during all phases of conflict (pre-conflict, conflict through stability operations). This project develops and integrates decision support technologies that will enhance the commander's ability to anticipate and dominate the future battlespace by more effectively forecasting the evolution of the battlespace and by more rapidly generating options to \"virtually checkmate\" the adversary. It develops the decision aid technologies and processes to plan the use of various assets and assess their effects in the battlespace. It provides a tailorable information environment to effectively portray complex data sets accurately in real-time.\n\nThe Air Force Future Operating Concept established a science and technology challenge to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action by 2035. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on cyber technologies in support of multi-domain command and control."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Planning and Decision Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate the integration of planning tools and information-based intelligent agents for adaptive replanning and decision support tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.366"
                                            },
                                            "Text": {
                                                "val": "Continue planned work in real-time course of action generation and prioritization, extensible command and control (C2) framework modernizing Joint Space Operations Center (JSpOC) operations, advanced indications and warning tipping C2 system for proactive countermeasure actions and visualization of the complete electromagnetic spectrum for enhancing JSpOC decision making. Initiate effort for Distributed Operations in a Contested Environment. Create and use scenarios and evaluation metrics for integrated demonstration and testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.520"
                                            },
                                            "Text": {
                                                "val": "Continue to execute experiments, based on operational scenarios, which demonstrate technologies that allow operators at tactical nodes to have the ability to conduct combat planning and tactical assessments of operations during periods of reduced communications with operational level nodes."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.739"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.739"
                                            },
                                            "Text": {
                                                "val": "Continue to execute experiments, based on operational scenarios, which incorporate process management execution into the extensible Space command and control framework, and which integrate disparate data and applications, providing a pedigree for proposed tasking options to decision makers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.781 million.  Justification for this decrease is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Next Generation Planning and Assessment Tools"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate an effects-based approach for the next generation of planning and assessment techniques that enable decision makers to determine operational effects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.634"
                                            },
                                            "Text": {
                                                "val": "Develop links and tools to effectively employ cyber, directed energy and electronic warfare weaponry within a target folder environment. Provide a set of models that will give targeteers greater comprehension of the second and third order effects of targeting actions. Initiate the subsequent development and demonstration of capabilities that utilize a mixture of analytics and visualization methods to determine progress relative to the achievement of objectives and end states. Initiate the development and demonstration of capabilities that provide ability to make actionable recommendations to assist the strategy division in identifying resource constraints, adversary actions, rules of engagement restrictions, and realignment of forces to assure commander's intent is met."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.082"
                                            },
                                            "Text": {
                                                "val": "Continue to develop software capabilities that employ cyber, directed energy, and electronic warfare weaponry. Refine previously developed models that will give operators and analysts an increased understanding of the second and third order effects of a set of targeting actions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.360"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.360"
                                            },
                                            "Text": {
                                                "val": "Continue to develop software capabilities that employ cyber, directed energy, and electronic warfare weaponry. Provide on-the-fly valuable quantitative evaluations of cyber assets to cyber operators, enabling them to present viable cyber options to commanders in multi-domain settings. Identify and implement state of the art learning models. Develop data-efficient learning.  Integrate within the StreamlinedML framework. Develop end-to-end baseline learning capability. Develop model recommendation & user workflow capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $3.278 million.  Justification for the increase is due to added emphasis in artificial intelligence and machine learning research to assist assessment and decision making in multiple domains."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635320"
                    },
                    "ProjectTitle": {
                        "val": "Assured Worldwide Connectivity"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "15.649"
                        },
                        "CurrentYear": {
                            "val": "12.813"
                        },
                        "BudgetYearOne": {
                            "val": "12.658"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.658"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "12.278"
                        },
                        "BudgetYearThree": {
                            "val": "14.190"
                        },
                        "BudgetYearFour": {
                            "val": "14.165"
                        },
                        "BudgetYearFive": {
                            "val": "14.454"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires advanced, net-enabled architectures and communications technologies in support of global kinetic and non-kinetic military operations, including a secure information grid for worldwide information delivery and exchange of near-real-time information including voice, data, video, and imagery.  This secure environment will be rapidly deployable, mobile, interoperable, and seamless between the Air Operations Center and aircraft, either en route or in theater.  This project provides secure information transmission capabilities for a persistent, global, survivable communications backbone network accessible for warfighters operating in all domains. It provides self-healing, self-configuration, anti-jam communication networking capabilities, and provides enterprise networking capabilities for agile, policy-based network management.  In addition, this project develops and demonstrates flight ready systems consisting of high capacity radio frequency (RF) and optical components and architectures for next generation communications."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Connectivity Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate intelligent networking transport and management technology to provide assured, seamless, battlespace connectivity to the Air Force tailored to anti-access\/area denial environments and contested operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.649"
                                            },
                                            "Text": {
                                                "val": "Continue to develop a Compact Rugged High assurance Crypto-Router with Network. Continue to develop a set of domain specific ontologies, extractors, relevancy assessment rule sets, mission templates and interfaces to support an operationally relevant Limited Technology Experiment (LTE). Demonstrate the next-generation wireless communications and networking technology. Demonstrate public key infrastructure (PKI)-enabled authentication services to enable task submission from authenticated enterprise consumers. Initiate the development and transition of a componentized building-block approach for a modular upgradable design for rapid waveform development of multi-mission RF capability. Support the development of a high-speed strike capability in line with higher Air Force emphasis areas."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.813"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of a componentized building-block approach for a modular upgradable design for rapid waveform development of multi-mission radio frequency capability. Continue the development and demonstration of a large area multiple-input and multiple-output antenna capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.658"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.658"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration for rapid waveform development of multi-mission radio frequency capability. Continue Wideband high frequency waveform development and testing. Investigate ionospheric research, propagation modeling and simulation. Perform beacon data collection on both the V and W frequency bands along with waveform development and simulation. Perform airborne testing of very low frequency software defined radio. Develop test platform for Common Very Low Frequency Receiver Increment Two. Demonstrate directional networking prototype. Demonstrate the Variable Rate - multiple-input and multiple-output clustered delay line technology and a targeting and force protection operational demonstration of integrated and field tested tactical-to-enterprise information management services."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.155 million.  Justification for this decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635321"
                    },
                    "ProjectTitle": {
                        "val": "Global Battlespace Awareness"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.600"
                        },
                        "CurrentYear": {
                            "val": "11.017"
                        },
                        "BudgetYearOne": {
                            "val": "11.242"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.242"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "14.507"
                        },
                        "BudgetYearThree": {
                            "val": "14.156"
                        },
                        "BudgetYearFour": {
                            "val": "15.096"
                        },
                        "BudgetYearFive": {
                            "val": "15.401"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force must be able to process and exploit data and information from a variety of sources and domains to create a common operating picture of the battlespace to allow commanders to maintain information dominance.  This project develops, integrates, and demonstrates advanced technologies to achieve comprehensive net-centric operations and Predictive Battlespace Awareness using information from all sources.  Technology development includes:  tasking information collectors, such as intelligence, surveillance, and reconnaissance (ISR) platforms, national intelligence sources, etc; correlating and geo-registering the collected data; exploiting the data to extract information of military significance; fusing information from multiple sources to create a digital-and-dimensional representation of the battlespace; assessing the situation; predicting adversary courses of action (COA); and archiving the results for ready use by decision-makers.  This is a dynamic, complex process that involves technologies for information exploitation, fusion, processing, storage, and retrieval, as well as technologies for machine reasoning, pattern recognition, and timeline analysis."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Signal and Data Exploitation Technologies"
                                    },
                                    "Description": {
                                        "val": "Demonstrate advanced signal and data exploitation technologies for detection, tracking, identification, and targeting of time-critical targets, and information extraction."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.424"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband ELINT signal detection and prosecution. Continue planned development of data association\/curation from historical analysis, multi-INT discovery, and entity resolution for contested environments. Develop and implement speaker similarity tagging to improve model generation, cohort detection methods, and prioritization methods based on acoustics, radio traffic, keywords, and metadata."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.049"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband electronics intelligence signal detection and prosecution. Continue to develop and implement speaker similarity tagging to improve model generation, cohort detection methods, and prioritization methods based on acoustics, radio traffic, keywords, and metadata."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.168"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.168"
                                            },
                                            "Text": {
                                                "val": "Continue to refine and test technologies for ultra-wideband electronics intelligence signal detection and prosecution. Demonstrate enhanced emitter feature extraction capabilities. Demonstrate automated electronics intelligence analysis tool sets. Complete development, integrate, and demonstrate cyber-physical measurement and signature intelligence capabilities with the Twenty-Fifth Air Force and United States Special Operations Command as transition partners."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $4.119 million.  Justification for the increase is due to additional work required for demonstration of capability in operational setting to Twenty-Fifth Air Force and Special Operations Command."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Data Handling, Visualization and Distributed Data Fusion"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate advanced data handling, event visualization technologies, and distributed data fusion to enable a more effective utilization of data available."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.525"
                                            },
                                            "Text": {
                                                "val": "Continue the planned development of automated detection and recognition of indicators that associate threats against blue forces in multiple domain. Continue to develop near real time data mining and analysis capabilities by incorporating automated knowledge discovery, modeling and reasoning, and data fusion, exploitation and processing. Plan for forthcoming delivery of baseline advanced ABI toolkit. Complete multi-source\/multi-INT raw data collection experiment at the Stockbridge Site in Rome, NY. Prepare to evaluate distributed multiple multi-INT Processing, Exploitation and Dissemination (PED) software framework capabilities compared to current methods for multi-INT data mining, correlation and fusion analytics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.829"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of Activity Based Intelligence analysis capabilities from multiple intelligence sources for both near-real time and post mission. Continue to develop near-real time data mining and analysis capabilities by incorporating automated knowledge discovery, pattern learning, modeling and reasoning, and data fusion, exploitation, and processing. Continue to demonstrate the distributed multi-node multi-source intelligence processing, exploitation, and dissemination software framework capabilities compared to current methods for multi-source intelligence data mining, correlation, and fusion analytics. Initiate the automation of collected audio data for enhanced exploitation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.363"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.363"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of intelligence analysis capabilities from multiple intelligence sources for both near-real time and post mission. Continue research and development in data analytics and strategic indications and warnings.  Demonstrate Seeded Language Modeling demonstration. Advance investigations of real-time deep learning algorithms. Perform service-based capability development. Complete cloud based data and information sharing environment.  Continue with Object Based Production optimized processing and automated-association capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $2.466 million.  Justification for the decrease is due to additional investment required within Advanced Signal and Data Exploitation demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Text Exploitation"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate capabilities for reasoning and learning, text understanding, link and group discovery, and advanced analysis for situational awareness and understanding."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.428"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop and transition end-to-end flexible and scalable technology transition platform enabling text exploitation and layered multi-intelligence network analysis and visualization in support of multi-source analysis. Continue research and development for plug and play modules for deeper text understanding and large scale, time dependent, network based analytics."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.982"
                                            },
                                            "Text": {
                                                "val": "Continue the development and demonstration of capabilities that enable automated text data extraction and exploitation. Continue development and demonstration of software tools and techniques that will fuse textual and non-textual information sources to increase semantic understanding. Continue research and development social media analytics tools and techniques for increased text understanding, as well as large scale, time dependent, network based analytics."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "For FY 2019 and beyond, work accomplished under this effort will be reported in Project 635321, Global Battlespace Awareness, under the Thrust \"Advanced Signal and Data Exploitation Technologies\"."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $1.982 million.  Justification for the decrease is due to additional investment required within Advanced Signal and Data Exploitation demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adversary Courses of Action"
                                    },
                                    "Description": {
                                        "val": "Develop models to provide detailed understanding of the adversary's probable intent and future strategy to identify adversary courses of action, the most likely course of action, and the course of action most dangerous to friendly forces and mission accomplishment."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.223"
                                            },
                                            "Text": {
                                                "val": "Continue developing kinetic and non-kinetic, full spectrum targeting tools to create a demonstrable concept where new batches of battlefield reports semi-automatically update the understanding of the target system analysis."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.157"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and demonstrate kinetic and non-kinetic, full-spectrum targeting software tools that will semi-automatically extract and visualize relationships within target system; automatically prioritize\/rank targets based on identified relationships; and semi-automatically update understanding of the target system analysis when new batches of reports arrive."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.711"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.711"
                                            },
                                            "Text": {
                                                "val": "Continue development and demonstration of full-spectrum targeting and intelligence software tools. Perform operational testing and experimentation on developed semantic capabilities and provide a cross-organization work-flow within intelligence and targeting software."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.554 million.  Justification for this increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635322"
                    },
                    "ProjectTitle": {
                        "val": "Knowledge Management and Computing"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.405"
                        },
                        "CurrentYear": {
                            "val": "3.369"
                        },
                        "BudgetYearOne": {
                            "val": "3.782"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.782"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "3.649"
                        },
                        "BudgetYearThree": {
                            "val": "2.054"
                        },
                        "BudgetYearFour": {
                            "val": "2.093"
                        },
                        "BudgetYearFive": {
                            "val": "2.136"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires technologies that will provide the decision maker and staff with seamless access to tailored information within a mobile, dynamic, and scalable, globally distributed Air Operations Center, as well as among other producers, consumers, and managers of information relevant to other particular Communities of Interest (COI).  This project demonstrates the enterprise management capabilities needed for the rapid distribution of actionable information, as well as the needed advances in high performance computing to ensure this complex capability.  This project develops an agile information environment that focuses on quality of service, transformation and brokering, a federated information environment focusing the relationship among the members of the environment, a secure cross-domain information sharing capability that focuses on the security layer and inter-COI information exchange in different security domains, and a collaboration environment focusing on the information workflow layer of the enterprise.\n\nThe Air Force Future Operating Concept established a science and technology challenge to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action by 2035. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on cyber technologies in support of multi-domain command and control."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Information Management"
                                    },
                                    "Description": {
                                        "val": "Demonstrate how a publish, subscribe, and query information management paradigm can enable vertical and horizontal integration of Air Force information systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.405"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop, demonstrate and transition information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared SA across the theater of war for targeting and force protection operations. Focus will be on the development of capabilities for disruption tolerant information delivery, data synchronization, and improved Quality of Service (QoS) in congested and contested tactical network environments. Continue the development, transition and delivery of new technologies in the form of plugins and include security for bulk data at rest to deliver full functionality for AFSOC Special Tactics mission sets so that ST operators can have superior SA and communications. Starting in FY 2017, the cyber activities within this effort (advanced cross-domain solution capabilities) will move to Project 635329, Cyber Battlespace Dev & Demo within the effort, Autonomous, Multi-level Access & Transfer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.369"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop, demonstrate and transition information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness across the theater of war for targeting and force protection operations. Focus will be on vulnerability assessments of the developed software, and, on field testing, technology integration, testing, and maturation. Continue the development, transition and delivery of new technologies in the form of plugins and include security for bulk data at rest to deliver full functionality for Air Force Special Operations Command Special Tactics mission sets so that special tactics operators can have superior situational awareness and communications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.782"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.782"
                                            },
                                            "Text": {
                                                "val": "Continue plans to develop, demonstrate and transition information management capabilities that securely bridge the gaps between enterprise and tactical domains for increased shared situational awareness across the theater of war for targeting and force protection operations. Continue with capability enhancements and technology hardening based on operational user assessments and collaboration. Execute a Technology Readiness Level 6 targeting and force protection operational demonstration of integrated and field tested tactical-to-enterprise information management services. Improve and update runway survey toolkit plug-in to aid aircraft runway surveys in austere locations. Spearhead geo-location capabilities in Global Positioning System denied environments using elevation, formations, and constellations. Ensure transition and hand-off special tactics plug-ins with Air Force Life Cycle Management Center support to the Battlefield Airman System Program Office."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.413 million.  Justification for this increase is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "635329"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Battlespace Dev & Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18.620"
                        },
                        "CurrentYear": {
                            "val": "18.210"
                        },
                        "BudgetYearOne": {
                            "val": "17.283"
                        },
                        "BudgetYearOneBase": {
                            "val": "17.283"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "20.306"
                        },
                        "BudgetYearThree": {
                            "val": "21.884"
                        },
                        "BudgetYearFour": {
                            "val": "23.948"
                        },
                        "BudgetYearFive": {
                            "val": "24.431"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The Air Force requires the ability to deliver sovereign options in cyberspace through the development and integration of cyber-attack, cyber defense, and cyber support technologies for a strategic capability of cyber dominance. This project develops the ability to deliver cyber-attack capabilities (access, stealth, persistence, intelligence, and weapons delivery), cyber defense capabilities (attack detection, attack attribution, and response automation) and cyber support capabilities (situation awareness and war gaming).  This project will also develop 1) a science and engineering capability demonstrating new models of computation, 2) novel approaches for high performance, interactive, net-centric, distributed and embedded computing systems, and 3) the technological tools enabling affordable, large-scale, and complex software-intensive systems.\n\nThe Air Force Future Operating Concept established a science and technology challenge to enable operational agility (the ability to rapidly generate and shift among multiple solutions for a given challenge) as a way to adapt swiftly to any situation or enemy action by 2035. In order to enable multi-domain operations, this project will begin to shape future research and development to focus on cyber technologies in support of multi-domain command and control.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 602298F."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Offense"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate offensive cyber operations capabilities in a series of experimental technology demonstrations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.132"
                                            },
                                            "Text": {
                                                "val": "Continue to research technologies that show maturation promise and enhance the capabilities to make it transitionable to the warfighter. Develop technologies to remain current with new waveforms and signals. Continue Service-Oriented Architecture (SOA) mission component development for use in the AFLCMC CMP. Transition components, including Cyber Time and Cyber Mission Planning, for use in CMP. Continue red-teaming new components to improve security."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.241"
                                            },
                                            "Text": {
                                                "val": "Adapt and demonstrate technologies to remain current with new waveforms and signals. Continue development and demonstration of software that holds adversary threats at risk by exploiting the electromagnetic spectrum, and other signals of interest, for access and mission effects. Continue performing cyber vulnerability assessments to strengthen the security of the developed software."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.928"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.928"
                                            },
                                            "Text": {
                                                "val": "Continue to develop systems to identify items of interest associated with the Internet of Things. Facilitate the development of a counter small unmanned aerial system open architecture specification to enable interoperability between disparate protection systems. Demonstrate ground-based and airborne delivery of mitigation (disrupt, deny, degrade, destroy, or deceive) effects, both cyber and physical\/kinetic. Integrate and transition multiple Air Force Research Laboratory and Air Force Lifecycle Management Center counter small unmanned aerial system capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.687 million.  Justification for this increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Effects-based Cyber Defense"
                                    },
                                    "Description": {
                                        "val": "Integrate technology to demonstrate an effects-based strategic approach to cyber defense that focuses on avoiding, deterring, and minimizing the threat, and rendering the adversary ineffective."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.029"
                                            },
                                            "Text": {
                                                "val": "Continue to develop technologies for the proactive control of cyber defenses, integrating with existing mission assurance framework(s). Develop and deliver cyber capabilities with transition to AFLCMC, National Security Agency and U.S. Special Operations Command customers. Research technologies to assist in educating and training the next generation of cyber leaders. Enhance, mature, test, and demonstrate Cyber Agility and defensive cyber deception technologies through exercises and other user-focused venues toward the objective of transition. Integrate new capabilities with existing Intelligence, Surveillance, and Reconnaissance (ISR) systems, and, progress testing with the Cyber Experimentation Environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.084"
                                            },
                                            "Text": {
                                                "val": "Complete development and demonstration of technologies for the proactive control of cyber defenses that integrate with existing mission assurance framework(s) in a relevant environment. Complete the integration of cyber capabilities with existing intelligence, surveillance, and reconnaissance systems in a relevant environment. Demonstrate these technologies in relevant environments, such as the Cyber Experimentation Environment. This technology thrust completes its capability development in FY 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "This technology thrust will have completed its capability development in FY 2018."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $4.084 million.  Justification for the decrease is due to the completion of capability development within this Thrust in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Resiliency"
                                    },
                                    "Description": {
                                        "val": "Integrate and demonstrate a resilient and self-generating information enterprise that dynamically recognizes, characterizes, and understands novel cyber attacks, and then reconfigures and self-optimizes itself to resist new attacks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.637"
                                            },
                                            "Text": {
                                                "val": "Develop effective red teaming techniques that sufficiently assess detection capabilities for mission-level critical events. Continue development of mission monitoring components, analytics engine, and C2 technology integration. Develop and rapidly evolve capabilities and Concept of Operations (CONOPS) for active guidance and automated processes addressing cyber survivability using an operational system laboratory to host of modular RDT&E, including autonomous cyber survivability capabilities and CONOPS. Schedule to complete advanced technology demonstration for cyber-based mission assurance on trust enhanced hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.997"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and evolve software capabilities and Concept of Operations for active guidance and automated processes addressing cyber resiliency and survivability using a relevant system laboratory. Continue to develop effective red teaming techniques that sufficiently assess detection capabilities for mission-level critical events. Continue to develop and demonstrate ground vehicle protection prototype for automotive cyber-security. Continue development of mission monitoring components, analytics engine, and command and control technology integration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.464"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.464"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and evolve software capabilities and Concept of Operations for active guidance and automated processes addressing cyber resiliency and survivability using a relevant system laboratory. Continue capability migration to form factors which more readily align with operational systems. Demonstrate automated cyber survivability using integrated cyber technologies within the operational system laboratory in the context of risk management framework requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.467 million.  Justification for this increase is described in the plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Game Changing Computing Power"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate computer architectures with greater capacity and sophistication to enable game-changing computing power to the warfighter anywhere, anytime."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.225"
                                            },
                                            "Text": {
                                                "val": "Test the Agile Condor embedded computing pod in the field on test platform with real-time processing and communication concepts. Develop a runtime environment that can monitor and maintain a trusted and resilient envelope of operation. This runtime environment may consist of monitors that are generated right along with formally verified code during the formal code generation process to monitor\/ensure that the high level specifications are maintained through execution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.663"
                                            },
                                            "Text": {
                                                "val": "Develop and demonstrate real-time neuromorphic computing architecture simulation framework. Conduct the first spiral demonstration of the inherently trusted and resilient architectures, mature for integration into a realistic operational environment. Continue development and demonstration of embedded computing pod in the field on a test platform with real-time processing and communication concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.779"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.779"
                                            },
                                            "Text": {
                                                "val": "Continue the development of inherently trusted and resilient embedded computing. Improve software specifications using evolutionary approaches and make them inherently tolerant to the unexpected or unforeseen. As part of a trusted and resilient architecture, test and document the secure processor (T-CORE) cyber defenses and other features. Provide support to transition partners and application programmers or the T-CORE specification. Release T-CORE version 2. Continue with Robust Machine Learning upgrades and development. Demonstrate a trusted and resilient embedded system (e.g. autonomous vehicle) that is capable of identifying, localizing and automatically repairing previously unknown or unintended vulnerabilities in the software that is used to support the mission and fight through zero day attacks that exploit these vulnerabilities to cause harm and\/or failure to the mission."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $2.116 million.  Justification for the increase is due to additional development work required for the secure processor release and autonomous vehicle demonstration."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous, Multi-level Access and Transfer"
                                    },
                                    "Description": {
                                        "val": "Develop autonomous, secure information access and sharing capabilities required by the Air Force net-centric information enterprise."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.597"
                                            },
                                            "Text": {
                                                "val": "Continue development and transition of advanced cross domain solutions (CDS). Demonstrate and integrate into CDS a virtual detonation chamber filter to detect malicious\/abnormal behavior. Demonstrate advanced CDS command and control capabilities to improve insight into cross domain service health and status and provide tools to manage CDS risk based upon changes in mission and threat. Continue robust protocol-to-CDS interfaces and techniques to enforce CDS compliance with machine to machine (M2M) interface specifications to make cross-domain enablement of M2M communications more robust and cost effective. Continue to improve the usability of multi-level security (MLS) access solutions with a focus on adding secure foundations to commercial-off-the-shelf mobile technologies as the basis for secure multi-level collaboration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.225"
                                            },
                                            "Text": {
                                                "val": "Continue development and prototype development of advanced cross domain solutions. Refine interfaces and techniques to enforce cross-domain solutions compliance with machine to machine interface specifications to enable cross-domain enablement of machine to machine communications more robust and effective. Demonstrate and prototype multi-level security access solutions, including commercial-off-the-shelf mobile technologies as the basis for secure multi-level collaboration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.112"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.112"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and integrate a polyglot file identification filter to mitigate data exfiltration risk.  Continue to develop a modularized filter store to maximize filter re-usability and increase the agility of cross-domain solutions to support new file types.  Demonstrate a Commercial Solution for Classified compliant secure mobile solution that can enforce security policies beyond commercial solutions to satisfy unique Air Force requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $0.113 million.  Justification for this decrease is described in the plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}