{
    "id": "2019-Army-PB-2040-JBOOK-50fbd0261a3655ea9f06b01dc4349c755f85c19c33affe9e3ab3b9417df4558d-10",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA4-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603779A"
        },
        "ProgramElementTitle": {
            "val": "Environmental Quality Technology Dem\/Val"
        },
        "R1LineNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "7.480"
            },
            "CurrentYear": {
                "val": "10.456"
            },
            "BudgetYearOne": {
                "val": "14.749"
            },
            "BudgetYearOneBase": {
                "val": "14.749"
            },
            "BudgetYearTwo": {
                "val": "14.979"
            },
            "BudgetYearThree": {
                "val": "16.133"
            },
            "BudgetYearFour": {
                "val": "15.182"
            },
            "BudgetYearFive": {
                "val": "14.843"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "93.822"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "There is a broad application potential for environmental quality technology (EQT) to be applied to multiple Army weapon systems and installations. However, technology must be demonstrated and validated (total ownership cost and performance data identified) before potential users will consider exploiting it. This Program Element (PE) includes Projects focused on validating the general military utility or cost reduction potential of technology when applied to different types of infrastructure, military equipment or techniques. It may include validations and proof-of-principle demonstrations in field exercises to evaluate upgrades or provide new operational capabilities. The validation of technologies will be in as realistic an operating environment as possible to assess performance or cost reduction potential. EQT demonstration\/validation is systemic, i.e. applies to a class of systems (e.g., vehicles or aircraft) or to a Department of Army-wide, multiple site\/installation problem (e.g. unexploded ordnance detection and discrimination). This PE will address, and eventually resource, programs in each of the Army environmental quality technology pillars (military materials in the environment, sustainable ranges and lands, compliance, and pollution prevention). All work must be endorsed by potential users and supported by a state-of-the-art assessment (i.e. \"technology is heading for user to implement\")."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "7.785"
                },
                "CurrentYear": {
                    "val": "10.456"
                },
                "BudgetYearOne": {
                    "val": "11.727"
                },
                "BudgetYearOneBase": {
                    "val": "11.727"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "7.48"
                },
                "CurrentYear": {
                    "val": "10.456"
                },
                "BudgetYearOne": {
                    "val": "14.749"
                },
                "BudgetYearOneBase": {
                    "val": "14.749"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.305"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "3.022"
                },
                "BudgetYearOneBase": {
                    "val": "3.022"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.004"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-0.004"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.297"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "3.022"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.022"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year 2019 increases support of National Defense Center for Environmental Excellence and Pollution Prevention Technology Dem\/Val efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "035"
                    },
                    "ProjectTitle": {
                        "val": "National Defense Cntr For Enviro Excellence"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.446"
                        },
                        "CurrentYear": {
                            "val": "3.779"
                        },
                        "BudgetYearOne": {
                            "val": "4.87"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.87"
                        },
                        "BudgetYearTwo": {
                            "val": "4.968"
                        },
                        "BudgetYearThree": {
                            "val": "5.075"
                        },
                        "BudgetYearFour": {
                            "val": "5.185"
                        },
                        "BudgetYearFive": {
                            "val": "5.3"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.623"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The National Defense Center for Environmental Excellence (NDCEE) was established by Congress in 1990 with a directive to \"serve as a national leadership organization to address high priority environmental problems for the Department of Defense (DoD), other government organizations, and the industrial community.\" The NDCEE Program is a national resource for developing and disseminating advanced environmental technologies. The NDCEE is used to: demonstrate environmentally acceptable technology to industry; validate new technology prior to transferring that technology; and assist in the training of potential users as part of that technology transfer process. The NDCEE is a DoD resource for environmental quality management and technology validation. This Project is managed by the Army on behalf of the Office of the Assistant Deputy Under Secretary of Defense for Installations & Environment. In May 2008, the Project name was re-designated from the National Defense Center for Environmental Excellence to the National Defense Center for Energy and Environment to ensure that the Center's mission recognizes and addresses the strategic interdependence of energy and environmental technology requirements within an overall sustainability framework in support of our installations, weapons systems and war fighters. This name change also directly supports the DoD's proactive implementation of Executive Order 13423, \"Strengthening Federal Environmental, Energy and Transportation Management.\"\n\nThe United States (U.S.) Army's broadly encompassing and growing mobile, personal and stationary advanced energy technology requirements include infrastructure, alternative and synthetic fuels, surety, renewables, storage, distribution, advanced power, micro-grids, transportation, systems integration and others. Further, to train as we fight, validated energy and environmental technologies need to be available and implemented at Army installations. The NDCEE will continue to demonstrate, validate, and transfer these technologies supporting our integrated environment, safety, occupational health and energy objectives with full consideration of the triple bottom line of mission, environment and community."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Conduct demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs."
                                    },
                                    "Description": {
                                        "val": "Supports the demonstration and validation of environmental, safety, occupational health, and energy technologies that support the Army's Environmental Quality Technology mission. The objective is to determine if the technology is ready for implementation that will enhance military readiness and reduce production, operating, and\/or disposal costs."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.276"
                                            },
                                            "Text": {
                                                "val": "Conduct demonstration\/validation of environmentally acceptable technologies that enhance military readiness and reduce production, operating, and\/or disposal costs.  Technologies to be demonstrated consist of technologies selected by the NDCEE Technical Working Group and approved by the NDCEE Executive Advisory Board."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.935"
                                            },
                                            "Text": {
                                                "val": "Conduct demonstration\/validation of environmental safety and occupational health (ESOH) and Energy technologies that enhance military readiness and reduce production, operating, and\/or disposal costs. Conduct project selection process for potential Fiscal Year (FY) 19 new starts. Technologies will be selected by the NDCEE Technical Working Group and approved by the NDCEE Executive Advisory Board."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.77"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.77"
                                            },
                                            "Text": {
                                                "val": "Will conduct demonstration\/validation of ESOH and Energy technologies that enhance military readiness and reduce production, operating, and\/or disposal costs. Will conduct project selection process for potential FY 2020 new starts. Technologies will be selected by the NDCEE Technical Working Group and approved by the NDCEE Executive Advisory Board."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding is based upon an established mechanism for project demonstrations and validations that support priority requirements, and a historical growth trend of mission essential requirements across the Services.  Total program costs include program operating and management expenses, and technology demonstration \/ validation of priority projects. Projects are typically two years in duration and funding is planned for year two of viable current year projects. There are 13 active projects (started in FY16 and 17).  Eight new start projects are anticipated for FY18 (final decision to be made in Dec 2017), out of 24 joint service prioritized and approved demonstration\/validation projects. The maximum number of projects will be funded, based on the budget received. It is anticipated 16 high-priority joint service demonstration\/validation projects will remain unfunded. Increase in FY19 funding recognizes that high-priority demonstration\/validation projects remain unfunded and additional dollars will be used to fund the remaining, outstanding FY18 projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "NDCEE Government program management during contract negotiations and during project formulation, execution, and technology transfer."
                                    },
                                    "Description": {
                                        "val": "Funds the government program management office for the NDCEE. This consists of personnel assisting in contract negotiations and during project formulation, execution, and technology transfer."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.17"
                                            },
                                            "Text": {
                                                "val": "Fund NDCEE Government program management during contract negotiations and during project formulation, execution, and technology transfer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.844"
                                            },
                                            "Text": {
                                                "val": "Fund NDCEE Government program management during contract negotiations and project formulation, execution, and technology transfer."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.1"
                                            },
                                            "Text": {
                                                "val": "Will fund NDCEE Government program management during contract negotiations and project formulation, execution, and technology transfer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in program management is a result of moving day-to-day operations of NDCEE from RDECOM to AEC. Program management transition occurred at the beginning of FY18."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The NDCEE is a national asset focused on DoD applications that include technology transfer to appropriate DoD organizations.  The NDCEE fosters an outreach program to describe its products and capabilities that include publication of results and participation in professional meetings, symposia, conferences, and appropriate coordination with industry.  The management strategy for the NDCEE centers on a DoD Executive Advisory Board (EAB) chaired by the DoD NDCEE Executive Agent on behalf of the Deputy Undersecretary of Defense for Installations and Environment and composed of senior DoD leadership to oversee NDCEE operations.  The EAB is supported by the NDCEE Technical Working Group (TWG) that includes senior level staff members from each of the offices represented on the EAB.  The NDCEE TWG coordinates all NDCEE activities, votes on proposed joint NDCEE projects, and reports back to the EAB Principals.  Working at the tactical levels, three Focus Groups (environment, safety\/occupational health, and energy) were established to develop joint projects.  The Army's Environmental Quality Technology Program participating in the Focus Groups also assists in the formulation of suggested environmental technology projects to be demonstrated within the NDCEE Program.  The contracting strategy of the NDCEE is based on using an NDCEE Contracting Officer's Representative to validate all the contractual portions of the NDCEE and by technical monitors (TM) to oversee the technical aspects of each contracted task.  A prime contractor operates NDCEE test facility to validate environmentally compatible technologies on a representative \"shop floor\".  The NDCEE accounts for and conducts work for: (1) direct funded Army tasks; (2) reimbursable tasks from within DoD and from other Government agencies; and (3) when applicable Congressionally directed and funded tasks."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "AEC"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "San Antonio, TX"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.706"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.17"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-01"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.844"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Product Development"
                                                },
                                                "FundingVehicle": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "8.797"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Technical Data"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "24.03"
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "Increase in FY19 funding reflects new requirements for additional technology demonstration\/validation projects. Current funding level is below requirement level."
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Development Testing and Evaluation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various."
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "29.76"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "2.276"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-03"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.935"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.77"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.77"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260712_035.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "NDCEE Management and Operations (Enduring)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "NDCEE Env, Safety, Occ Health, and Energy Technology Dem\/Val (Enduring)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2014"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "E21"
                    },
                    "ProjectTitle": {
                        "val": "Environmental Quality Technology Dem\/Val"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.034"
                        },
                        "CurrentYear": {
                            "val": "6.677"
                        },
                        "BudgetYearOne": {
                            "val": "9.879"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.879"
                        },
                        "BudgetYearTwo": {
                            "val": "10.011"
                        },
                        "BudgetYearThree": {
                            "val": "11.058"
                        },
                        "BudgetYearFour": {
                            "val": "9.997"
                        },
                        "BudgetYearFive": {
                            "val": "9.543"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "62.199"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports Advanced Component Development and Prototypes of environmental quality technologies developed within the Army Environmental Quality Technology program. The Project increases operational sustainment and warfighter training capabilities by reducing soldier and worker health risks and environmental quality impacts that would otherwise result in restoration needs and compliance enforcement actions against installations while simultaneously increasing performance and standardization across the Army. The Project expedites technology transition from the laboratory to operational use by demonstrating new materials and processes to fulfill the performance requirements outlined in Material Specifications, Depot Maintenance Work Requirements, Technical Manuals, Drawings and other technical data. Materials and processes demonstrated under this project are inherently more sustainable than the baseline with respect to environmental, safety and occupational health concerns, thereby reducing life cycle costs incurred by acquisition, industrial base and installation end users."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Toxic Metal Reduction in Surface Finishing of Army Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Increase readiness and environmental sustainability of Army depots and maintenance facilities by reducing or eliminating the use of hexavalent chromium, cadmium and associated toxic or carcinogenic materials used in surface finishing processes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.105"
                                            },
                                            "Text": {
                                                "val": "Conduct qualification testing for alternatives products in mixed metal pretreatment, conversion coating and surface activation applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.628"
                                            },
                                            "Text": {
                                                "val": "Establish hexavalent chromium-free pilot processes for depositing and repairing hard chrome surfaces; validate alternative products for sealing black oxide, hard anodize and zinc plated surfaces at Army depots."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.081"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.081"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate hexavalent chromium-free anodizing process on aluminum aircraft parts; establish test bed for cold spray repair of hard chrome-plated wear surfaces during depot maintenance; qualify hexavalent chromium-free alternatives for sealing heavy zinc phosphate surfaces on steel weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY18 funds higher than FY19 due to the purchase and installation of pilot process equipment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Airborne Lead Reduction from Army Weapon Systems"
                                    },
                                    "Description": {
                                        "val": "Sustain soldier training readiness and ensure compliance at Army installations by reducing or eliminating the use of lead compounds in rocket and missile propellants and primary explosives (primers\/detonators\/initiators)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a green, improved process for loading lead-free primers and will scale up formation of a reduced-lead alternative to current extruded rocket propellants."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.277"
                                            },
                                            "Text": {
                                                "val": "Load lead-free primers into relevant end items using new pilot-scale automated process and conduct initial performance testing; Conduct flight-weight motor testing for rocket systems utilizing reduced-lead extruded rocket propellants."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.105"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.105"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate lead-free primary explosive composition in stab detonator and electric detonator configurations; establish pilot-scale production of lead-free percussion primers and conduct first article testing in hand held signals."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 funding increase supports demonstration\/validation of lead-free alternatives in multiple items."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: ESOH Impacts of Short-Term Noise Assessment Procedures"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate the technologies, including the underlying computational algorithms, for the impact of short-term noise assessment procedures on environmental footprint and Soldier readiness. When completed the program will: 1) have validated short-term noise assessment procedures, including uncertainty metrics and 2) have on-line, self-guided training modules for Sustainable Range Program range officers on performing and interpreting short-term noise assessment results."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.586"
                                            },
                                            "Text": {
                                                "val": "Incorporate community response blast noise metrics into all short-term noise assessment tools.  Conduct comparisons and validation of models using installation validation sets (Ft. Sill and Ft. Knox).  Initiate comparisons and validations of models using additional installation dataset (Ft. AP Hill).  Design sampling protocols and methods."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.625"
                                            },
                                            "Text": {
                                                "val": "Complete analysis of all datasets including any updates indicated by the demonstration \/ validation results. Test model updates to ensure continued accuracy and document the updates  \/ validation results. Initiate developments of training modules for range managers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.25"
                                            },
                                            "Text": {
                                                "val": "Will provide a report that summarizes all results of the demonstration and validation study. Validation report will document assessment accuracy across a range of environmental conditions and assessment consistency across user applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19  funding decreased to the level required to provide the report of the demonstration and validation study."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate advanced water reuse technology for fixed installations and assess ESOH impacts. At the completion of this program, the following will be accomplished: 1) demonstration of energy efficient advanced water reuse technology at installations, 2) ESOH analysis of three water reuse technologies for installations including shower water recycling, distributed water reclamation, and centralized reclamation; 3) reports on best practices for permitting, design, and safe operation of advanced reuse technologies; and 4) marketing materials comparing quality of advanced reuse water to tap and bottled water to support technology adoption campaigns at installations and contingency bases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.843"
                                            },
                                            "Text": {
                                                "val": "Perform analysis of toxicity and full suite of potential water contaminants (Disinfection By-Products, Pentachlorophenol, viruses, Total Organic Carbon) at Technology Enabled Capabilities Demonstration sites and at active Environmental Security Technology Certification Program demonstration sites; support permitting of advanced water reuse technology demonstration; and develop a demonstration\/validation system prototype."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.572"
                                            },
                                            "Text": {
                                                "val": "Execute demonstration testing at Tobyhanna Weapons Depot, Fort Riley and Fort Carson. Demonstrations will include measurements of technology performance with a focus on removal of emerging micro-pollutants to guide ESOH analysis in coordination with Army Public Health Center (APHC)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Insensitive Munitions (IM) Wastewater Treatment"
                                    },
                                    "Description": {
                                        "val": "Demonstrate and validate optimized scalable wastewater treatment system basic technology for the destructive treatment of existing and emerging insensitive munitions (IM) contaminated production wastewater generated during Army ammunition plant munitions production."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.575"
                                            },
                                            "Text": {
                                                "val": "Demonstrate new IMX production process wastewater remediation technology to allow efficient, low cost destruction of harmful and regulated contaminates for increased surface water discharge. Technology will allow increased production rates of munitions compounds while meeting permit regulatory thresholds for wastewater discharge."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.805"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.805"
                                            },
                                            "Text": {
                                                "val": "Will transition IM wastewater treatment technologies from a prototype pilot scale system to an initial field-scale pilot system for demonstration and validation of cost effective treatment of IM wastewater."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 increase funds the transition to an initial field-scale pilot system for demonstration and validation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Environmental Toolkit for Expeditionary Operations"
                                    },
                                    "Description": {
                                        "val": "Conduct pilot-scale demonstration and validation studies to determine the effectiveness of basic technologies\/methods developed for rapidly collecting environmental data in the field for the purposes of siting bases in expeditionary and austere environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.275"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.275"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate software and sensors package for environmental baseline evaluation capabilities with engineer soldiers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 is the first year of transition from BA2\/BA3 research and development effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Fate and Risk Evaluation System for Contaminants"
                                    },
                                    "Description": {
                                        "val": "Validate computational capabilities for multi-purpose evaluation of Emerging Contaminants fate and transport as well as for human and ecosystem health risk management in multimedia environmental modeling system."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.254"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.254"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate software for environmental fate and transport data with user community for evaluation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 is the first year of transition from BA2\/BA3 research and development effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental quality technology demonstration and validation: Low Global Warming Potential (LGWP) Alternatives to Ozone Depleting Substances (ODS)"
                                    },
                                    "Description": {
                                        "val": "Evaluate low GWP ODS alternatives being developed by industry to assess their toxicity and flammability hazards adn verify their acceptability in military unique refrigeration and fire suppression applications."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.109"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate lower GWP, non-ODS fire suppression agent in handheld fire extinguishers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY19 is the first year of transition from BA2\/BA3 research and development efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "06I"
                                    },
                                    "Title": {
                                        "val": "POLLUTION PREVENTION TECH SUPPORT"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "0.105"
                                        },
                                        "CurrentYear": {
                                            "val": "0.71"
                                        },
                                        "BudgetYearOne": {
                                            "val": "0.923"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "0.923"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "0.562"
                                        },
                                        "BudgetYearThree": {
                                            "val": "0.605"
                                        },
                                        "BudgetYearFour": {
                                            "val": "0.614"
                                        },
                                        "BudgetYearFive": {
                                            "val": "0.651"
                                        },
                                        "CostToComplete": {
                                            "val": "0.000"
                                        },
                                        "TotalCost": {
                                            "val": "4.170"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The project ultimately transitions successfully demonstrated environmental quality technologies to Army acquisition, industrial base and installation end users.  As part of the Army's Environmental Quality Technology Program, all technology efforts address a valid Army Environmental Requirements and Technology Assessments (AERTA) requirement.  The Army's Environmental Technology Integrated Product Team conducts a thorough assessment and makes funding recommendations to senior Army environmental leadership.  Efforts approved by senior Army environmental leadership receive Advanced Component Development and Prototype funding to fully demonstrate and validate the technology for transition to end users for follow on implementation."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Conduct Demonstrations"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Varies"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Varies"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "10.847"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "5.034"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2016-10"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "6.677"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "9.879"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "9.879"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260712_E21.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Toxic Metals Reduction Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Airborne Lead Reduction Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2015"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "ESOH Impacts of Short-Term Noise Assessment Procedures Demonstration\/Validation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Advanced Water Reuse Technology for Fixed Installations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Insensitive Munitions (IM) Wastewater Treatment"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Fate and Risk Evaluation System for Contaminants"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Environmental Toolkit for Expeditionary Operations"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2022"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Low Global Warming Potential  Dem\/Val"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2023"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}