{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-8",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602308A"
        },
        "ProgramElementTitle": {
            "val": "Advanced Concepts and Simulation"
        },
        "R1LineNumber": {
            "val": "13"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "29.767"
            },
            "CurrentYear": {
                "val": "28.650"
            },
            "BudgetYearOne": {
                "val": "28.500"
            },
            "BudgetYearOneBase": {
                "val": "28.500"
            },
            "BudgetYearTwo": {
                "val": "28.765"
            },
            "BudgetYearThree": {
                "val": "34.334"
            },
            "BudgetYearFour": {
                "val": "36.313"
            },
            "BudgetYearFive": {
                "val": "36.189"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "222.518"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates and designs enabling technologies to create effective training capabilities for the Warfighter and  supports the underpinning technologies and understanding to establish architecture standards and interfaces necessary for realizing the Army vision of creating a realistic synthetic \"electronic battlefield\" environment for use across the spectrum of doctrine, organization, training, leader development, materiel, personnel, and facilities (DOTLM-PF).  Project C90 focuses on advancing component technologies required for real time interactive linking within and among constructive, virtual, and live simulation and training by refining technologies for advanced distributed interactive simulation.  Project D02  further develops concepts for immersive training and learning environments with the Institute for Creative Technologies (ICT) at the University of Southern California, Los Angeles, California. \n\nWork in this PE complements and is fully coordinated with PE 0601104A (University and Industry Research Centers), PE 0602785A (Manpower\/Personnel\/Training Technology), PE 0602786A (Clothing & Equipment Technology), PE 0602787A (Medical Technology), PE 0603001A (Future Warrior Technology Integration), PE 0603007A (Manpower, Personnel and Training Advance Technology), PE 0603015A (Next Generation Training & Simulation Systems) and PE 0603710A (Night Vision Advanced Technology).   \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy. \n \nWork in this PE is performed by the Army Research, Development, and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.688"
                },
                "CurrentYear": {
                    "val": "28.65"
                },
                "BudgetYearOne": {
                    "val": "35.1"
                },
                "BudgetYearOneBase": {
                    "val": "35.1"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "29.767"
                },
                "CurrentYear": {
                    "val": "28.65"
                },
                "BudgetYearOne": {
                    "val": "28.5"
                },
                "BudgetYearOneBase": {
                    "val": "28.5"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.079"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-6.6"
                },
                "BudgetYearOneBase": {
                    "val": "-6.6"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "3"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.91"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-6.6"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-6.6"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.011"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Congressional increase in D14 Advanced Modeling and Simulation Initiatives.\n\nThe FY19 funding reduction occurred to support funding shifts that impact higher priority efforts that align to senior leader priorities for Soldier Lethality and C3I\/Network."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "C90"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Distributed Simulation"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.94"
                        },
                        "CurrentYear": {
                            "val": "23.223"
                        },
                        "BudgetYearOne": {
                            "val": "26.869"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.869"
                        },
                        "BudgetYearTwo": {
                            "val": "27.102"
                        },
                        "BudgetYearThree": {
                            "val": "31.365"
                        },
                        "BudgetYearFour": {
                            "val": "30.655"
                        },
                        "BudgetYearFive": {
                            "val": "29.127"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "188.281"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs enabling technologies for advancing distributed simulation and training (live, virtual and constructive) environments. This includes networking of models representing complex human behavior, complex data interchange between simulations, synthetic natural environments, medical training simulations, ground platform training, adaptive tutoring for individuals and teams, and collaborative training. The Project researches the ability to create a virtual representation of combined arms environments, with the Warfighter-in-the-loop that constructive (event driven) simulations cannot simulate.  \n\nEfforts in this Project support the Army Science and Technology Soldier portfolio.\n    \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy.\n \n."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Live Virtual Constructive Sim & Training"
                                    },
                                    "Description": {
                                        "val": "This effort develops and investigates LVC training technologies (tools and methods) to inform an interactive, seamless training environment.  Live training refers to personnel and systems performing an exercise mission on real terrain; virtual training refers to personnel using simulators; and constructive training refers to computer based models representing real world behaviors that introduce a wider control of virtual forces.  This effort is coordinated with and complements Program Element (PE) 0603015A\/Project S29.  In Fiscal Year (FY) 18 this effort has been refocused and renamed to Synthetic Natural Environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.396"
                                            },
                                            "Text": {
                                                "val": "Will design and develop physics-based dynamic effect algorithms and synthetic terrain components to enable the Army's One World Environment for training; develop a cloud-based architecture to support adaptive training; develop prototype technologies, such as performance assessment, mobile application use, data analytics, and social media and assess impact on training and education for operational systems; validate methods to measure, track, and manage general learning outcomes that will feed a continuous adaptive learning model; and design and develop artificial intelligence algorithms to enable intelligent and believable behaviors of virtual characters that can be reused across virtual, constructive, virtual and gaming domains."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Live and Medical Training Technologies"
                                    },
                                    "Description": {
                                        "val": "Included in this effort will be the development of new medical training simulations to train medical personnel across all levels of care and the development of live training technology that can be applied across all military levels and training environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.6"
                                            },
                                            "Text": {
                                                "val": "Will design and develop sensors and communication components to refine laser component design for next generation MILES capabilities; conduct research to characterize diseased and injured tissues to inform development of synthetic tissue; conduct research to simulate and model tissues in LVC platforms; investigate methods and technologies to assess human performance during training using high fidelity tissue\/sensor solutions; and conduct research to assess human performance during medical training using various immersive hardware and software solutions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.738"
                                            },
                                            "Text": {
                                                "val": "Mature sensor and communication components of laser design for the next generation MILES in preparation to conduct experimentation. This research improves the soldier?s live training performance for readiness at Army home station and Combat Training Centers. Investigate accurate representation of simulation and training environments depicting the entire military medical population to include, female, pediatric, and elderly, with simulated tissues that change over time based on injury, disease and healing, as well as improving anatomical accuracy by modeling representative patient data."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.965"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.965"
                                            },
                                            "Text": {
                                                "val": "Will investigate components such as artificial intelligence algorithms to aid in target recognition, next generation magnetometers, high resolution simulated three dimension terrain and weapon orientation to enhance live training technology research; research in live training technologies will support the Army?s capability need to provide live simulations that accurately replicate and realistically represent the effects of current weapons systems during force-on-force and force-on-target training; design and develop capabilities to improve the accuracy and fidelity of medical simulations for training; investigate and characterize gross and subtle tissue behaviors necessary for higher levels of medical understanding; investigate and develop medical simulation environments that accurately represent the operational environment both inside and outside of the body."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction in funding as sensor and communication components for the next generation MILES has matured."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Tutoring"
                                    },
                                    "Description": {
                                        "val": "This effort investigates adaptive tutoring and immersive learning environments with social simulations to conduct kinetic and non-kinetic training for individuals and teams."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.744"
                                            },
                                            "Text": {
                                                "val": "Will investigate the effectiveness of using realistic human driven avatars (puppeteering) in training applications on improving human performance; investigate effectiveness of current Army applied virtual distributed learning training; identify capability gaps in small team training as it relates to the Army?s Synthetic Training Environment; develop automated authoring tools to supplement traditional classroom training with computer-guided tutoring per ALM; and mature intelligent tutoring system domain models to represent Army training domains; assess effectiveness of instructional models for unit-level team tutoring."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.495"
                                            },
                                            "Text": {
                                                "val": "Conduct experiments to identify opportunities to enhance the capabilities of authoring tools and assess their effectiveness with the goal of reducing authoring times and allowing non-computer programmers the capability to generate sophisticated ITSs; begin to mature and operationalize team tutoring concepts for the Synthetic Training Environments with respect to assessment and interaction between the team and the computer-based tutor."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.938"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.938"
                                            },
                                            "Text": {
                                                "val": "Will extend models for individual learners, instructional management, and Army task domains to increase the complexity of adaptive training for individuals to enable future adaptive training; validate a base authoring concept for individual adaptive training; expand concepts for authoring tools, team modeling, team instruction, and Army team domains to support development of team (unit level) tutoring systems; mature training strategies for autonomous software systems; develop recommended systems to reinforce experiential learning of autonomous systems via machine learning techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction in team tutoring efforts in order to support the acceleration of senior leader priorities for Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier System Architecture"
                                    },
                                    "Description": {
                                        "val": "Research and develop simulation architecture to represent the Soldier as a System considering physiological effects, cognitive load, and Soldier culture in the context of Soldier-materiel interactions supporting training effectiveness, experimentation, and materiel development.  The architecture will advance computational strategies to enable the integration and interaction of new and existing Soldier models into a seamless Soldier as a System simulation.  This effort is coordinated with and complements PE 0602785\/Project 790, PE 0602786\/Project H98, PE 0602787\/Project 869, PE 0603001\/J50, and PE 0603710\/Project K70."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.6"
                                            },
                                            "Text": {
                                                "val": "Will develop simulation components that link and synchronize models of human and system\/equipment components to enable analysis within Soldier Systems Engineering Architecture; and investigate modeling & simulation framework limitations and propose remediation activities to enable cross-community\/domain\/user accessibility and re-use of modeling and simulation architectures."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.301"
                                            },
                                            "Text": {
                                                "val": "Develop and mature enhanced simulation representations leveraging emerging Soldier Resilience and Effects of Stress on Shooter Performance study data supporting Soldier Systems Engineering Architecture (SSEA) use case analysis; conduct experiments using developed simulation components in a relevant SSEA operational scenario; and develop additional modeling and simulation (M&S) tools\/technologies and Systems Engineering Processes as recommended in the SSEA (M&S) Implementation Plan."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Training Effectiveness Research"
                                    },
                                    "Description": {
                                        "val": "This effort will research and develop simulation architectures, tools, and models that can represent current and future semi and fully autonomous systems.  The architecture, tools and models will enable the evaluation of the training impacts (i.e., cognitive, physiological, and team coordination) of future autonomous systems and technologies on individual, crew, and unit tasks.  The training demands of systems that are increasingly complex, intelligent, and self-adaptive far exceed those of legacy systems that require training of primarily procedural tasks.  This is compounded by parallel increases in autonomy and responsibility at lower echelons. This effort is coordinated with and complements PE 0603015A\/Project S29 and 0602716A\/Project H70."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.6"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to assess effectiveness of best practice training strategies for autonomous systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.301"
                                            },
                                            "Text": {
                                                "val": "Mature concepts to optimize training strategies for autonomous systems; and develop recommender system to reinforce experiential learning of autonomous systems via machine learning techniques."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.4"
                                            },
                                            "Text": {
                                                "val": "Will investigate methods and techniques to optimize individual and team training outcomes (cognitive, physiological, physical) for autonomous systems; will extend development of techniques to improve recommender systems that will maximize training for teams using complex, adaptive, and intelligent autonomous systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase in methods and techniques to optimize individual and team training to support senior leader priorities for Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Soldier Capability Enhancement - Training"
                                    },
                                    "Description": {
                                        "val": "Research the relationship of augmentation agents and Soldier performance & behavior.  Investigate the effects of augmentation agents (perceptual, cognitive, and\/or physical), used either individually or coupled as a system of agents, on Soldier performance, resilience, and training during operationally relevant tasks. Development of guidelines and models for designing and employing augmentation agents. Implementation of guidelines will enhance augmented Soldier performance. This research is coordinated with PE 0602716A\/Project H70."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.184"
                                            },
                                            "Text": {
                                                "val": "Investigate augmentation application, including timing, amplitude, and duration relative to biological and environmental signals, to understand functionality in varied and complex environments.  Model performance and adaptation to augmentation agents in order to predict capability enhancement; investigate individual variability and short and long term adaptation to augmentation agents. Explore the extension of methods and metrics developed for single augmentation agent to the quantification of Soldier performance while using a system of augmentation agents."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.178"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.178"
                                            },
                                            "Text": {
                                                "val": "Will explore augmentation technologies with potentially broad applications, to include adaptive training applications to increase Soldier performance and reduce time-to-proficiency in mounted and dismounted Soldier tasks; will investigate novel approaches for integrating advanced metrics of factors related to individual variability into adaptive training technologies to enable augmentation techniques in complex training applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding reduction to support other research investments supporting senior leader priorities for Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Natural Environments"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops tools and methods to improve the speed, fidelity and delivery of synthetic terrain and environmental data to support Training Aid Devices (TADs), simulation and mission rehearsal systems. This effort is coordinated with and complements PE 0603015A\/Project S28."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.204"
                                            },
                                            "Text": {
                                                "val": "Investigate physics-based dynamic algorithms and terrain components in a cloud based computing environment for the Army?s One World Terrain representation. This research provides environment representation in order to deliver training in mission rehearsal for soldiers at the point of need."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.26"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.26"
                                            },
                                            "Text": {
                                                "val": "Will research in synthetic natural environments supports the Army capability need to rapidly and accurately collect, develop, digitize, store, and access detailed terrain information from a single correlated terrain database that is easily scalable from soldier level to global level views of the world. This is part of the Army future synthetic training environment and One World Terrain representation;  will develop dynamic terrain \/updates that dynamically change the synthetic environment based on simulated and real world events; will investigate data exploitation and advanced rendering techniques for geospatial data at runtime to produce realistic human interactions; will research advanced synthetic generation techniques as to the scalability required for detail and quantity needed for complete data\/content coverage of the globe."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction in funding that supports rendering techniques for geospatial data in order to support the acceleration of Synthetic Training Environment efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mixed Reality Research"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops enabling virtual and augmented reality simulation and training technologies to support future training environments and U.S Army senior leader initiatives in Decide Faster, Asymmetric Vision, and Manned-Unmanned Teaming capabilities. These technologies support the Army capability needs for enhanced dismounted Soldier performance in complex urban environments. Identification of future technologies will be done in concurrence with the core modeling and simulation enablers for megacities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.146"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.146"
                                            },
                                            "Text": {
                                                "val": "Will examine how interfaces for virtual training systems affect user interactions with those systems and thereby impact training and performance outcomes; will examine how different interfaces for virtual training systems can be used to more seamlessly integrate live and virtual training to improve training transfer from virtual to live; will investigate and design the synthetic framework, architecture, and technologies to enable a manned\/unmanned teaming training and rehearsal simulation environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports senior leader priorities for Soldier Lethality and Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cyber for Training Simulations"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops analytical capabilities to more accurately characterize, model, and predict human behavior related to Cyber Electromagnetic Activities (CEMA) events from the tactical to the strategic level."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.8"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.8"
                                            },
                                            "Text": {
                                                "val": "Will investigate analytical capabilities and methodologies for generating models from empirical data and social and psychological theory to describe CEMA-related human attributes (e.g., intent, posture, and capability); and will design initial simulation environment integrating new human models with existing and developing CEMA representations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports senior leader priorities for Soldier Lethality and Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Artificial Intelligence"
                                    },
                                    "Description": {
                                        "val": "This effort investigates artificial intelligence techniques to develop intelligent, human-like, virtual characters to maximize and accelerate Soldier learning in future simulation and training applications. This effort also develops novel methods for joint human\/intelligent agent learning and decision making."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will investigate capabilities for data mining to better predict individualized degradation in task performance after completion of training; and design initial capabilities for identifying appropriate training resources to mitigate this degradation using individualized intelligent training technologies."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports senior leader priorities for Soldier Lethality and Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Synthetic Training Environment Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops technologies that will transition to advanced technology development in order to enable a Synthetic Training Environment which is a single, interconnected training system in which units from squad through ASCC can train in the most appropriate domain - live, virtual, constructive, and gaming, or in all four simultaneously."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.682"
                                            },
                                            "Text": {
                                                "val": "Will mature AI representation of simulated forces to model relevant aspects of the Multi Domain Battle (MDB), increase simulated entity scalability and increase concurrent role-players to enable synthetic collective training; investigate the automated generation of high fidelity synthetic natural environment data in support of the Army?s future synthetic training environment global terrain requirement; determine techniques to automate the attribution of terrain, procedurally extract building extents and apply surface features utilizing point cloud, texture, crowd-sourced and other emerging sources of data; design and develop terrain resolution algorithms which encompass the ability to embed Human Terrain (cultural attributes, infrastructure, social media) in the synthetic environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort will support the acceleration of Synthetic Training Environment efforts in support of senior leader priorities for Soldier Lethality."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D02"
                    },
                    "ProjectTitle": {
                        "val": "Modeling & Simulation For Training And Design"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.827"
                        },
                        "CurrentYear": {
                            "val": "5.427"
                        },
                        "BudgetYearOne": {
                            "val": "1.631"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.631"
                        },
                        "BudgetYearTwo": {
                            "val": "1.663"
                        },
                        "BudgetYearThree": {
                            "val": "2.969"
                        },
                        "BudgetYearFour": {
                            "val": "5.658"
                        },
                        "BudgetYearFive": {
                            "val": "7.062"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.237"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project transitions basic research into applied research.  This Project investigates and designs training applications to enable the Army to train any time and any place. Efforts include designing virtual humans that embody natural language, speech recognition in noisy environments, gesture, gaze, and conversational speech. Techniques and methods are assessed for integrating different sensory cues into virtual environments that result in enhanced training and leader development. The project leverages the capabilities of industry and the research and development community through the synthesis of creativity and technology, including work at the Army Research Institute and the Army Research Laboratory. \n\nEfforts in this Project support the Army Science and Technology Soldier portfolio.\n\nDeveloped technologies and techniques are transitioned for maturation and demonstration to Program Element (PE) 0603015A\/Project S28 (Immersive Learning Environments).     \n \nThe cited work is consistent with the S&T priorities of the U.S. Army Chief of Staff, Assistant Secretary of Defense for Research and Engineering priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Technology Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct applied research that enables responsive and reconfigurable environments that immerse human senses such as sight, sound, and touch in mixed reality environments to include physical elements providing touch and feel to simulate objects such as obstacles and walls."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.414"
                                            },
                                            "Text": {
                                                "val": "Will investigate the use of reinforcement learning to adapt, modify and improve engagement strategies for virtual learning environments; improve and extend capabilities of online virtual support agents so that they can respond appropriately even when user inputs are only partially understood and can be used via mobile phone applications; and develop tools for simulated crowd generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.714"
                                            },
                                            "Text": {
                                                "val": "Develop technologies that enable the study of learning and engagement on mobile devices (e.g., smartphones) which are a key platform for future learning technology; develop cloud-based toolkit for recording, analyzing, and adapting to learner engagement and other emotions for both web-based and mobile platforms; and develop tools and processes to ease the authoring and deployment of conversational virtual coaches across multiple computing platforms to include import\/export, integration, and debugging features."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.1"
                                            },
                                            "Text": {
                                                "val": "Will utilize brain imaging studies, such as MRI, to identify specific regions and networks of the brain affected by virtual reality, related to empathy and decision making which will help reveal neurological mechanisms of how virtual reality can aid military personnel in making better decisions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduction in cloud-based toolkit investments to support senior leader priorities for Soldier Lethality and Synthetic Training Environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Immersive Technology Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort develops tools, techniques and technologies for improving the immersion of human senses within simulation environments and therefore creating enhanced realism."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.413"
                                            },
                                            "Text": {
                                                "val": "Will advance research on autonomous agents for capturing training performance of users in indoor environments, and investigate the capture of three-dimensional (3D) geometry from the robotic platform; investigate how real-world data can be acquired and incorporated into simulated environments to increase the degree of user immersion; investigate the use of reinforcement learning to adapt, modify and improve engagement strategies for virtual learning environments; and develop authoring tools to allow virtual humans to be created and maintained by collaborators and other external sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.713"
                                            },
                                            "Text": {
                                                "val": "Conduct empirical studies to better understand perceptual mechanisms and design parameters that are important for multi-user virtual reality environments; and develop, integrate, and demonstrate enhanced automated language computer processing techniques for translating real-world narratives into authorable interactive narratives for immersive simulations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.531"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.531"
                                            },
                                            "Text": {
                                                "val": "Will conduct research to enable Soldiers to train in simulated environments using applied research to provide technology options for development and transition.  These technologies derived from this research will address the complex operational environment elements and multi-domain interactions in order to provide accelerated, adaptable, flexible, and sustained unit readiness for the full range of Army missions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduced investment in automated language computer processing techniques in order to support senior leader priorities for Soldier Lethality and Synthetic Training Environment."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "D14"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Modeling and Simulation Initiatives (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for applied research in Advanced Modeling and Simulation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "3"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}