{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-19",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603648D8Z"
        },
        "ProgramElementTitle": {
            "val": "Joint Capability Technology Demonstration (JCTD)"
        },
        "R1LineNumber": {
            "val": "45"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "731.504"
            },
            "PriorYear": {
                "val": "127.961"
            },
            "CurrentYear": {
                "val": "105.871"
            },
            "BudgetYearOne": {
                "val": "106.049"
            },
            "BudgetYearOneBase": {
                "val": "106.049"
            },
            "BudgetYearTwo": {
                "val": "107.666"
            },
            "BudgetYearThree": {
                "val": "110.260"
            },
            "BudgetYearFour": {
                "val": "112.417"
            },
            "BudgetYearFive": {
                "val": "114.595"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The Joint Capability Technology Demonstration (JCTD) program addresses Joint and Combatant Commands (CCMDs) warfighting needs through the execution and demonstration of prototypes within two to four years of the identification of a need.  The program delivers developmental and operational prototypes to the field for military utility assessment (MUA) to affordably operationalize technologies that enable warfighters to explore novel concepts and to facilitate informed transition to formal programs of record (PoR) when appropriate.  Based on the results of the assessments, performed under the cognizance of a CCMD sponsor, the products of a JCTD are either “left behind” for additional assessments or operational use, transition to a PoR, or returned to the technical baseline inventory.\n\nThe key tenets of the program are in alignment with the new Under Secretary of Defense for Research and Engineering USD(R&E) guiding principles to: shape major technology investments within DoD, focus on joint and cross-cutting missions, prove new concepts of operation, inform and or validate requirements, leverage open systems architectures, and identify accelerated paths to acquisition.    \n\nThe JCTD program achieves this by engaging the interagency, international, and non-governmental partners to expand the Department of Defense's (DoD) access to innovation.  It serves as the vehicle for CCMDs to address Joint strategic priority areas that present significant risk and suffer from inadequate investment, which often fall into the seams between the military Services and DoD agencies.  JCTD investments are informed by the CCMDs’ integrated priority list, the capability gaps assessment provided by the Joint Staff, and the Military Services' science and technology roadmaps.\n\nIn FY 2017, the JCTD program successfully completed the MUA and transition of several JCTD prototypes that fielded affordable and sustainable solutions to meet immediate operational needs.\n\nMEASURABLE OUTCOMES:\n•\tThe JCTD Program has executed 113 JCTDs from FY 2006 to present.  The data shows a transition rate for the program of 81 percent with 52 percent of capabilities transitioning to a PoR, 25 percent to operational fielding, and 4 percent to General Services Administration (GSA) schedule.  The remaining 19 percent were returned to the technical base for further development or were terminated.  Overall, the JCTD program has directly supported multiple key operations while rapidly accelerating game changing technology\/capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "148.184"
                },
                "CurrentYear": {
                    "val": "105.871"
                },
                "BudgetYearOne": {
                    "val": "106.798"
                },
                "BudgetYearOneBase": {
                    "val": "106.798"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "127.961"
                },
                "CurrentYear": {
                    "val": "105.871"
                },
                "BudgetYearOne": {
                    "val": "106.049"
                },
                "BudgetYearOneBase": {
                    "val": "106.049"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-20.223"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.749"
                },
                "BudgetYearOneBase": {
                    "val": "-0.749"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-16.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.056"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.145"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.022"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.037"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.037"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.712"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.712"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 congressional reduction of $16.000 million is to maintain program affordability.\n \nFY 2019 baseline decrease is being applied to fund other DoD requirements and priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "648"
                    },
                    "ProjectTitle": {
                        "val": "Joint Capability Technology Demonstration (JCTD)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "731.504"
                        },
                        "PriorYear": {
                            "val": "127.961"
                        },
                        "CurrentYear": {
                            "val": "105.871"
                        },
                        "BudgetYearOne": {
                            "val": "106.049"
                        },
                        "BudgetYearOneBase": {
                            "val": "106.049"
                        },
                        "BudgetYearTwo": {
                            "val": "107.666"
                        },
                        "BudgetYearThree": {
                            "val": "110.260"
                        },
                        "BudgetYearFour": {
                            "val": "112.417"
                        },
                        "BudgetYearFive": {
                            "val": "114.595"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "JCTD projects selection is driven by their ability to accelerate transition of new capabilities to the warfighter; strong Combatant Command and Joint Force interest; cost share commitments from the Military Services and Defense Agencies; mature technical readiness; and a well-defined and affordable transition path for long term sustainment.  Focus areas within the current selection cycle include: electromagnetic spectrum maneuver; intelligence, surveillance and reconnaissance (ISR) and counter-ISR; asymmetric force application; and, information operations and analytics.    \n\nThe final objective for the JCTD program is to maintain United States (U.S.) technological superiority across the range of military operations while reducing the cost of operations, facilitating joint interoperability, and allowing for the rapid insertion of new capabilities."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Low Cost Cruise Missile (LCCM)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  LCCM provides a decentralized autonomy capability for low-cost, conventional air-launched cruise missiles that will enable joint access and maneuver in the global commons.  It will be capable of conducting networked integrated attacks, in-flight dynamic retargeting\/reallocation and synchronized cooperative\/saturation attacks.  Flight demonstrations will be conducted using surrogate weapon platforms and will provide residual leave-behind payloads for transition to a full weapon system development program.  FY 2017 funds were used to begin production of LCCM air vehicles.  Additional resources were provided by the U.S. Air Force Research Laboratory and the Office of Naval Research."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Conduct autonomous vehicle selection to include key subsystems needed for autonomous operations and contract production of initial group of vehicles.  Develop the autonomy module's ability to sense the environment and execute counter measures based on Commander's intent type instructions or rules of engagement.  Complete required program management documentation and planning for the Operational Utility Assessment.  Coordinate IMT activities for initial delivery of six inch diameter vehicles in early FY 2018."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Continue producing prototype LCCM vehicles.  Develop and refine the autonomy module's ability to sense the environment and execute counter measures based on Commander's intent or rules of engagement.  Complete required program management documentation and planning for the joint military utility assessment (MUA).  Coordinate management activities for initial delivery of six-inch diameter vehicles in early FY 2019."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Conduct surrogate weapon operational demonstrations of ingress formations.  Pending successful operational demonstrations and military utility assessments (MUA), LCCM will provide residual leave-behind autonomy payloads for transition to a full weapon system development program under U.S. Air Force sponsorship."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "None"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Low Cost Missile Defeat (LCMD)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  Low Cost Missile Defeat (LCMD) is a ballistic missile defense system designed to counter current and emerging weapons of mass destruction (WMD) and anti-access\/area denial (A2\/AD) threats.  LCMD program execution has been structured using a building block approach; the FY 2015 step was a technology demonstration effort under the Deputy Assistant Secretary of Defense, Emerging Capability & Prototyping (DASD (EC&P)) to accelerate technology maturation.  The concept of operations (CONOPS) for the system has been formulated to integrate LCMD into the existing National Ballistic Missile Defense (BMD) architecture and will prioritize the use of existing components and systems already fielded.  LCMD is not designed as a replacement to existing BMD systems, but rather as a lower cost complementary\/augmentative component to forward-deployed BMD assets.  The LCMD capability would augment current BMD systems and mitigate threat vulnerabilities to U.S. personnel and strategic assets.  Funding was allocated for participation in the Missile Defense Agency (MDA) Low Cost Interceptor Study (LCIS) and risk reduction for key technologies, including the seeker and thrust vane subsystems, modeling and simulation of subsystem design capabilities, and limited prototyping for component flight boards and gimbals.  Results from the LCIS indicated there are more cost effective and viable options for a low cost interceptor.  Accordingly, DoD discontinued the LCMD program and saved the intellectual property and data package for future BMD development efforts.  The LCMD JCTD was closed out in late FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.400"
                                            },
                                            "Text": {
                                                "val": "Five million dollars will be allocated to support LCMD input into an Analysis of Alternatives (AoA) study for the BMD low cost interceptor and data archiving to provide the DoD the intellectual property and knowledge base through completion of the LCMD system requirements review.  The balance of FY 2017 funds are being held pending completion of the AoA.  Future LCMD development will be informed by the results of the AoA with funding for development in the out years coming from the JCTD Concept Development \/ Pre-EMD Prototypes."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Military Application of the Space Environment (MASE)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  MASE demonstrated mature space environment technology to improve combat operations.  The prototype provided weapons system specific visualizations that can be integrated into operational plans and tactics, techniques, and procedures as decision aids to assess their utility for mission operations.  Products were evaluated using quantitative standard measures of performance, effectiveness, and outcome against theater operational requirements.  In FY 2017, MASE completed the final military utility assessment and provided a leave behind residual capability to U.S. Pacific Command for operational use.  MASE transitioned to Air Force Space Command Program of Record for extensive distribution and technical advancements for the Combatant Commands.  The MASE JCTD was completed in FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.086"
                                            },
                                            "Text": {
                                                "val": "Complete the final operational utility assessment.  Finish end-to-end system\/mission engineering and development of mission planning tool.  Conduct final demonstration.  Transition to Air Force Space Command for an extensive period of testing.  Once the operational user requirement is tested and well understood, it will transition to combat air forces in Pacific Command.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Port Improvement via Exigent Repair (PIER)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  PIER will deliver a dynamic, agile, cost effective (non-military construction) expeditionary engineering solution to rapidly repair damaged or degraded ports to a minimum level of serviceability after an attack or natural disaster.  Agility is achieved through a smaller footprint, commercial off-the-shelf infusion, and quick reaction of theater-based repair assets (e.g., pre-packaged, pre-positioned).  The intent of PIER is to assure continued logistics resiliency and freedom for U.S. Forces to maneuver and conduct agile strategic sealift and logistics.  PIER will allow the Department of Defense to address the doctrine, organization, training, materiel, leadership, personnel, facility, and policy (DOTMLPF+P) concerns about its ability to conduct rapid port damage repair.  The plan is to transition to the U.S. Army, U.S. Navy, and U.S. Transportation Command in FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.608"
                                            },
                                            "Text": {
                                                "val": "Conduct the first limited operational utility assessment on the substructure technologies.  Design and validate the superstructure technologies to repair deck craters and holes and over-bridging of gaps using the pier over-decking system.  Conduct second technical demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.104"
                                            },
                                            "Text": {
                                                "val": "Conduct a limited operational demonstration of the pile bracing\/bridging and mooring technologies.  Conduct a technical demonstration on the Pier Overdecking System (PODS).  These technologies allow secondary components to strengthen the superstructure of the ports.  Refine and validate superstructure technologies based on lessons learned from earlier demonstrations: pile capacity upgrade, pile bracing, pile cap repair, beam replacement, beam and cap upgrade.  Continue to plan transition to U.S. Army, U.S. Navy, and the U.S. Transportation Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.500"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.500"
                                            },
                                            "Text": {
                                                "val": "Conduct final military utility assessment of PIER technologies in cooperation with U.S. Transportation Command, U.S. Navy, and U.S. Army.  Transition components to the U.S. Transportation Command, U.S. Navy, and U.S. Army.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreased in FY 2019 because the JCTD will be completed in FY 2019 and will transition to the U.S. Transportation Command, U.S. Navy, and U.S. Army."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Satellite Communications Network (SSCN)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  SSCN provides an adaptive, self-healing, full-mesh network for assured communications, using a proliferated constellation of low-earth orbit satellites and advanced software defined radios.  In FY 2017, SSCN completed a full system architecture design and initial laboratory testing of high risk subsystems.  SSCN conducted initial testing and demonstration readiness reviews and delivered design documentation to a classified user.  Details are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.000"
                                            },
                                            "Text": {
                                                "val": "Finish EMD, begin laboratory testing of selected designs and anechoic chamber tests.  Coordinate with launch share partner to ensure payload tests are conducted, evaluated and deficiencies resolved well in advance of launch date.  Conduct on-orbit test with single design and final demonstration.  The classified user will continue to use the system until it is no longer functional to explore large small satellites constellations for utility, resilience, reconstitution and technology adaptation.  Complete the JCTD."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ravenscraig"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  Ravenscraig will provide technical and operational characterization and countermeasures for a class of threat signals.  Details are classified.  Capability transitioned to the U.S. Air Force and the Defense Intelligence Agency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Additional enhancements, features and capabilities for experimentation\/demonstration.  Complete the JCTD and transition to multiple classified users.  Details are classified."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Combatant Commander (CCMD) Support, Transition Enabling and Strategic Project Operational Management"
                                    },
                                    "Description": {
                                        "val": "Previously funded effort.  This effort is comprised of three programs that support the entire JCTD Program, separate from the specific JCTD projects.  The three programs are (1) Unified CCMD Direct Support, (2) JCTD Pre-Transition and (3) Program Integration Office for execution of select, classified projects.  (1) CCMD Direct Support: The CCMDs are essential in specifying capability needs, project development, demonstration, military utility assessment, and transition of JCTDs.  The JCTD Program provides direct support to CCMDs enabling the CCMDs to provide an on-site JCTD operational manager.  (2) JCTD Pre-Transition:  In some cases, Service or Agency partner transition funding is not available for one to two years following the JCTD assessment phase.  In such cases, where there is a clear transition and the need to sustain the capability for a short time prior to availability of Service or Agency transition funds, the JCTD Pre-Transition fund may be used to meet that need.  (3) Program Integration Office:  Executes a select number of classified projects in areas such as electronic miniaturization, electronic countermeasures, advanced mobile ad hoc network communications, space situational awareness (SSA) intelligence surveillance and reconnaissance (ISR), sensor platforms and communications, and persistence surveillance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.000"
                                            },
                                            "Text": {
                                                "val": "Continue to provide CCMD direct participation to enable CCMD staff participation in developing and executing Pre-EMD prototypes.  Develop and execute projects selected as a result of the Technology Assessment Panels.  Sustain selected projects until program of record funds are received.  Execute a limited number of classified projects' military utility assessments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "Continue to provide CCMD direct participation to enable CCMD staff participation in developing and executing projects selected as a result of the technology assessment panels.  Sustain selected projects until program of record funds are received.  Execute a limited number of classified projects' military utility assessments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "Continue to provide CCMD direct participation to enable CCMD staff participation in developing and executing developmental and operational prototypes.  Develop and execute projects selected as a result of the technology assessment panels.  Sustain selected projects until program of record funds are received.  Execute a limited number of classified projects' military utility assessments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase reflects a modest adjustment for inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "JCTD Concept Development\/Developmental and Operational Prototypes"
                                    },
                                    "Description": {
                                        "val": "Previously funded effort.  The JCTD program will develop projects as operational prototypes to address broader Defense strategic initiatives in areas such as asymmetric force application, electromagnetic spectrum maneuver, information operations and analytics and intelligence, surveillance, and reconnaissance (ISR) and counter-ISR.  Selected projects will leverage networks within the global research and engineering enterprise to include government labs and integration facilities, depots, academia, as well as traditional and non-traditional providers.  Prototypes will utilize best practices to satisfy joint and cross-cutting needs.  The JCTD office will work with the Services to identify means to streamline prototype transition into the acquisition systems where appropriate."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.601"
                                            },
                                            "Text": {
                                                "val": "Conduct advanced prototyping activities focusing on:  information operations and analytics, asymmetric force applications, autonomy and electromagnetic spectrum agility.  Specific activities may include continued integration, subsystem and system level demonstrations and assessments for multi-vehicle expendable platform\/expendable payload concepts working collaboratively to deliver reconfigurable effects using non-traditional delivery methods, deployment of hybrid radio frequency-optical tactical communications and protected communications for small unmanned systems, automated and integrated space manufacturing capabilities, reconfigurable self-forming and self-healing space based communication networks, machine cognition to aid human task loading to deploy multiple platforms, sensors, and weapons in complex mission scenarios."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.327"
                                            },
                                            "Text": {
                                                "val": "Select advanced prototyping activities as new starts in FY 2018 in the following four (4) focus areas:\n- Asymmetric Force Application:  The use of non-traditional technologies and symmetric approaches to provide a clear military advantage in protection, maneuver, and engagement.\n- Electromagnetic Spectrum Maneuver:  The use of technologies to maneuver freely in the electromagnetic spectrum for offensive and defensive operations across multiple domains, e.g., air, maritime, land, and space.\n- Information Operations and Analytics:  Efficiently and accurately exploit information collection and analytics technologies for seamless processing, exploitation, and dissemination of all-source data and information as well as multi-domain command and control across Services, Combatant Commands, and partner forces.\n- Intelligence, Surveillance, and Reconnaissance (ISR) and Counter-ISR:   Enhance the effectiveness of strategic integration of ISR capabilities as a force multiplier to provide decision makers with fused, actionable data and intelligence, and to deny the adversary ISR capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "52.082"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "52.082"
                                            },
                                            "Text": {
                                                "val": "Fund the follow-on efforts for projects started in FY 2017 and new projects selected to start in FY 2018.  Select advanced prototyping activities as new starts in FY 2019 in the following four (4) focus areas:\n- Asymmetric Force Application: The use of nontraditional technologies and symmetric approaches to provide a clear military advantage in protection, maneuver, and engagement.\n- Electromagnetic Spectrum Maneuver: The use of technologies to maneuver freely in the electromagnetic spectrum for offensive and defensive operations across multiple domains, e.g. air, maritime, land, and space.\n- Information Operations & Analytics: Efficiently and accurately exploit information collection and analytics technologies for seamless processing, exploitation, and dissemination of all-source data and information as well as multi-domain command and control across Services, Combatant Commands (CCMD), and partner forces.\n- Intelligence, Surveillance, and Reconnaissance (ISR) and Counter-ISR: Enhance the effectiveness of strategic integration of ISR capabilities as a force multiplier to provide decision makers with fused, actionable data and intelligence, and to deny the adversary ISR capabilities.\nThese focus areas may be updated based on evolving CCMD needs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Element baseline increases from FY 2018 to FY 2019.  This project area shows a rise in funding from FY 2017\/FY 2018 into FY 2019.  The reason for the increase is because, during the years of execution (FY 2017\/FY 2018), projects are selected, funded and displayed separately in this R-2, thus reducing FY 2017\/2018 funding in this focus area.  The reality is that total funding supporting this focus area is level to slightly up."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enabling Technologies (ET)"
                                    },
                                    "Description": {
                                        "val": "The ET funds are used to assess or mature emerging capabilities that support the initiation of a developmental or operational prototype.  ET investments are small (average $0.500M), short (less than one year) efforts that may lead to a prototype, depending on the final assessment and determination of technical maturity.  Examples of ETs funding in FY 2017 include:  1) The Autonomous Mission Package Planning and Execution (AMPEE), a risk reduction effort for a FY 2017 autonomy focused JCTD.  AMPEE demonstrated a mission planning system and the ability to conduct cognitive netted distributed electronic warfare on multiple class unmanned aerial systems.  2) Scanning Infrared Sensor for Unmanned Air Vehicle Detection and Tracking (SISUDT), a prototype fixed-site, multi-sensor counter-unmanned aerial system (C-UAS) to detect, track, and identify group one and two UASs near forward operating bases.  One SISUDT prototype was deployed in support of Operation Inherent Resolve for an in-theater validation of infrared UAS detection.  3) Strike Awareness for Gray Zones (STAGE) a risk mitigation effort to address shortfalls in the STAGE JCTD proposal by defining a management structure, technical approach, and transition plan for the effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Projects will continue to be used to assess or mature emerging capabilities that support the initiation of a Pre-Engineering and Manufacturing Development Prototypes.  Selected efforts will be small, focused, and executable in less than one year and require a concrete deliverable prototype hardware and\/or software, integrated subsystem or technology assessment report.  ETs will be derived from the Emerging Capability and Prototyping Technical Assessment Panels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Projects will continue to be used to assess or mature emerging capabilities that support the initiation of developmental or operational prototypes.  Selected efforts will be small, focused, and executable in less than one year and require a concrete deliverable prototype hardware and\/or software, integrated subsystem or technology assessment report, etc.  ETs will be derived from the technical assessment panels that assess JCTD proposals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Projects will continue to be used to assess or mature emerging capabilities that support the initiation of developmental or operational prototypes.  Selected efforts will be small, focused, and executable in less than one year and require a concrete deliverable prototype hardware and\/or software, integrated subsystem or technology assessment report, etc.  ETs will be derived from the technical assessment panels."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change in funding profile."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Assured Command and Control using Emerging Nanosat Technology (ACCENT)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  ACCENT places an adaptive filter algorithm into a nano-satellite receiver to mitigate radio frequency interference.  ACCENT rapidly integrates the filter into a number of radios with an optional path to test in space using existing nano-satellite radios.  In FY 2017, ACCENT optimized adaptive algorithm and radios as needed to meet on-orbit performance goals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.850"
                                            },
                                            "Text": {
                                                "val": "Receive and review modeling and simulation and technical demonstrations reports.  Integrate designs for two different nano-satellites radios (Ultra High Frequency and S-Band).  Produce framework to allow quick integration of filter into additional radios.  Provide follow-up laboratory test results."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Text": {
                                                "val": "Incorporate and integrate adaptive algorithms and radio modifications to improve performance.  Test filter-algorithm in space with the integrated communications extension capability nano-satellite constellation.  Produce on-orbit test results and military utility assessment reports.  Plan to transition to Navy Program Executive Office for Space Systems Science and Technology.  The filters will be uploaded onto existing Prometheus satellites.  ACCENT receives partner funds from the Office of Naval Research.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project will complete in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-altitude Attritable Link Offset (HALO)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  HALO uses high altitude, low-cost balloons as communication relays in denied environments.  It accomplished this by using the ultra-high frequency (UHF) radio frequency spectrum and techniques that allow non-attribution to the source of the UHF signals.  The advanced technology resides at the user terminals on the ground, which receive data from the balloon-platforms, and subsequently perform the processing and communication receiver functions that allow effective two-way communication in a contested environment.  HALO received partner funds from U.S. Air Force Air Combat Command and U.S. Air Force Life Cycle Management Center.  In FY 2017, HALO completed the development of the hardware and software payloads for the balloons."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.910"
                                            },
                                            "Text": {
                                                "val": "Create and refine adaptive beam forming algorithm capable of handling doppler spread, delay spread, gain control, phase noise and computational complexity.  Conduct flight demonstration in a non-contested environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.340"
                                            },
                                            "Text": {
                                                "val": "Conduct laboratory testing of the payload and algorithms.  Complete the development of the ground control station.  Refine the adaptive beam-forming algorithm to enable handling of doppler radar spread, delay spread, gain control, phase noise, and computational complexity.  Conduct flight demonstrations in a non-contested environment.  Perform extended testing and military utility assessment.  Complete the concept of operations.  Successfully conduct a flight demonstration in a contested environment.  Transition to U.S. Marine Corps program office for production acquisition contracts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project will complete in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Gunsmoke-J (Note: Name changed from Jacob's Ladder)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  Name changed from Jacob's Ladder.  Gunsmoke-J uses emerging advanced electronics to allow the use of dedicated intelligence assets to provide tactically actionable targeting data to warfighters on a responsive and persistent timeline.  This significantly improved reaction times and provided greatly enhanced targeting information for warfighters.  In FY 2017, Gunsmoke-J completed development of system requirements and associated flow down to the component level, finalized the threat set, and developed a risk register."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.660"
                                            },
                                            "Text": {
                                                "val": "Receive and approve critical design review (CDR) data package for three flight units, one engineering development unit, one flight qualification unit and three ground stations.  Assemble, integrate and test flight units and ground stations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "Conduct mission performance analyses and develop cubic satellite (CubeSat) system designs.  Develop an initial data dissemination architecture.  Prepare a concept of operations and evaluation plan for a military utility assessment (MUA).  Complete CubeSat system assembly, integration and test work, and finalize the dissemination ground segment.  Conduct a critical design review, flight readiness review, and deliver three flight units to the launch provider for integration and launch.  Install three ground stations for the MUA to be conducted by U.S. Pacific Command (USPACOM).  Transition residuals to USPACOM for operational use and sustainment by U.S. Army Intelligence, Electronic Warfare and Sensors program office.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project will complete in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "India Science and Enabling Technology Focus Area"
                                    },
                                    "Description": {
                                        "val": "The India Science and Enabling Technology (S&T) Focus Area is a Secretary of Defense directed project designed to deepen and streamline defense cooperation between the U.S. and India.  By sharing research resources, capabilities, and expertise, the United States and India can jointly develop technological innovations needed to enable our defense industrial bases to support our militaries now and in the future.  Further, development of vibrant S&T cooperation is a key step in building an enduring partnership.  India Science & Technology baseline funding transfers to Emerging Capabilities Technology Development, Program Element 0603699D8Z in FY 2018 to enable proper alignment and execution of the effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.480"
                                            },
                                            "Text": {
                                                "val": "Continue to develop and execute cooperative S&T projects initiated in FY 2015 and FY 2016.  Additional cooperative S&T areas targeted include: munitions development, advanced manufacturing, micro-power grids, and other identified project areas.  In FY 2018, the India Science and Technology Focus project and related funding will be transferred to Emerging Capabilities Technology Development (Program Element 0603699D8Z) to enable proper alignment and execution of the allocated funds."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Atmospheric Propagation of High Energy Lasers (APHL)"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  APHL is a joint U.S. - India JCTD that developed new atmospheric propagation models and compensation techniques to maximize high energy laser propagation in urban atmospheric conditions.  It characterized the atmosphere in five categories: aerosol scattering, molecular absorption, thermal blooming, deep turbulence, and refraction.  These characteristics of the atmosphere are important in urban environments due to the effects they will have on laser propagation and power on target for military applications.  The U.S. Navy also contributed funds to support APHL activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.260"
                                            },
                                            "Text": {
                                                "val": "Validate propagation models by performing outdoor laser propagation experiments by measuring laser characteristics such as laser wave front, turbulence, thermal blooming and power in the bucket.  Experiments will be conducted through non-invasive technology (i.e. cameras and algorithms to determine the levels of energy propagated through urban environments at different distances).  Develop and validate the atmospheric compensation models for beam control technology to maximize laser propagation in urban environments.  Complete the JCTD and transition data, models, and database to the DoD High Energy Laser-Joint Technology Office and the India Defence Research Development Organisation."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Improving Cognitive Models and Artificial Cognition"
                                    },
                                    "Description": {
                                        "val": "Previously funded JCTD.  This project is a joint U.S. - India JCTD that will create architectures and modules that monitor and predict fatigue, provide new interaction capabilities, and allow autonomous systems to learn through interactive tasks.  The overall architecture, which will use a combination of adaptive control of thought—rational and logic architecture will be demonstrated on two separate tasks:  finding people and finding objects.  The goal is to build the basic level architecture to learn how to find people and objects by improving embodied cognition, human robot interaction, and interactive task learning.  In FY 2017 computational cognitive models for embodied cognition, human-robot interaction, and interactive task learning were developed.  Experiments were conducted on autonomous systems to find people and objects in different environments.  Transition is targeted for the U.S. Marine Corps Warfighting Lab, U.S. Navy Explosive Ordinance Disposal Technology Division, U.S. Special Operations Command, U.S. Border Protection, and the India Defense Research Development Organization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.260"
                                            },
                                            "Text": {
                                                "val": "Create task learning modules and teach the system how to look for people and objects with task learning modules.  Create a computational system based on logic architecture.  Develop mechanisms reflecting degradation in perceptual and motor deficits associated with the vigilance decrement."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Brilliant Effects Employment Shadow (BEES)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  BEES will demonstrate finding, fixing, tracking, and targeting of mobile targets using cooperative, multi-modal intelligence surveillance and reconnaissance (ISR) and electronic warfare (EW) sensors on autonomous, unmanned aerial systems (UAS).  BEES will demonstrate autonomous behaviors to synchronize multiple ISR and EW platforms that responsively find and track moving high value targets, and update manned strike\/command and control platforms operating out of threat range.  In FY 2017, BEES produced key project management documents, operational scenarios, and readied vehicles and components to support project goals."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Begin flight demonstrations of UAS required behaviors.  Fight demonstrations of EW and ISR autonomous actions.  Continue laboratory testing of integrated EW and ISR payloads to include cooperative autonomous behaviors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Conduct a joint military utility assessment of autonomous EW and ISR behaviors as part of an integrated mission package in an operationally representative environment.  Transition the capability in coordination with the Air Force Life Cycle Management Center (AFLCMC) Fighter Bomber Program Office to a Service program of record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "JCTD provided BEES $6.000 million in the first year to accelerate development followed by a decrease to $5.000 million per year in FY 2018 and FY 2019.  This is a planned decrease in funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Unmanned Air Vehicle Distributed Lethality Airborne Network (MUDLAN)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  MUDLAN will augment current military communication systems by enabling persistent, networked battlespace using airborne high data rate nodes that provide robust air, land, and sea connectivity in contested environments.  MUDLAN networks will support over-the-horizon coordinated command and control, voice communication, and intelligence, surveillance, and reconnaissance for air and surface forces.  In FY 2017, MUDLAN conducted a communications requirements study to determine network connectivity needs and completed a modeling and simulation study of tactical connections between air, ground, and seaborne assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.800"
                                            },
                                            "Text": {
                                                "val": "Complete detailed design of communications nodes for air, land, and sea platforms and conduct critical design reviews.  Integrate communications systems into host platforms and develop initial flight test plans.  Target transition to the U.S. Air Force Air Combat Command."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.600"
                                            },
                                            "Text": {
                                                "val": "Perform flight testing on air, land, and sea platforms to demonstrate military utility of high data rate communications nodes.  Incorporate test platforms in additional operational experiments to demonstrate over-the-horizon, distributed communications capabilities at scale.  Transition the technologies to a U.S. Air Force Air Combat Command Program of Record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decreases in FY 2019 because the primary design, testing, and integration will have concluded.  Operational testing and transition efforts will be supported by increased partner organization funding."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Pseudolite Synthetic Aperture Radar (PSAR)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  PSAR will develop a small form-factor synthetic aperture radar (SAR) to provide all weather intelligence, surveillance, and reconnaissance (ISR) from a high altitude (pseudolite) platform.  The system will provide high ground resolution, while minimizing size, weight (7 pounds objective) and power (less than 200 watts objective).  The capability will be demonstrated on the high altitude long endurance (HALE) unmanned aerial system (UAS), a surrogate pseudolite to be loaned by the United Kingdom Ministry of Defense (UK MoD).  In FY 2017, PSAR designed and fabricated antennas and power amplifiers for two SAR prototypes."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.050"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.150"
                                            },
                                            "Text": {
                                                "val": "Fly prototypes on surrogate manned aircraft.  Repackage prototypes to meet pseudolite platform space, weight, power and cooling constraints.  Integrate a down-link communications system for transfer of SAR data.  Complete integration of SAR prototypes on pseudolite aircraft.  Perform operational demonstration and military utility assessment.  Transition to U.S. Navy Program Executive Office, Space.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project completed in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Predictive Human Intelligence (HUMINT) Crisis Model (PICK’EM)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  PICK'EM will provide U.S. Special Operations Command, U.S. Africa Command, and the Defense Intelligence Agency the capability to identify crisis events and provide countermeasures that will inform U.S. policy makers.  In FY 2017, PICK'EM specified the system design and built an experimental test bed utilizing live data processing to solve critical DoD missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.200"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Deliver a prototype test-bed, source code, and data sets.  Ingest live data from multiple sources.  Conduct system level testing, security validation, and system accreditation.  Deliver live operational prototype that use live scenarios."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.800"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.800"
                                            },
                                            "Text": {
                                                "val": "Validate prototype using live scenarios.  Deliver PICK'EM capability.  Conduct operational demonstrations and the military utility assessment.  Transition PICK'EM to the Intelligence Community, U.S. Special Operations Command, and U.S. Africa Command."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2018 to FY 2019 increase is based on additional capabilities being added to the live operational prototype prior to the military utility assessment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Quickstrike MK64 – Extended Range (QS64-ER)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  QS64-ER will integrate the in-service 2,000 pound Mark 64 maritime mine, the in-service KMU-55 guidance kit, a prototype wing kit, and guidance software to allow maritime mines to be deployed from a B-52 aircraft to a precise location, in a single pass, from a safe stand-off distance.  In FY 2017, QS64-ER developed guidance software and demonstrated aircraft integration and verification of airworthiness on a B-52 aircraft."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.771"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.750"
                                            },
                                            "Text": {
                                                "val": "Demonstrate external release of QS64-ER from a B-52.  Demonstrate glide performance of wing kit and accuracy of guidance unit.  Perform a military utility assessment of hydrodynamic effects on mine placement accuracy and survivability of water impact."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.067"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.067"
                                            },
                                            "Text": {
                                                "val": "Perform analysis of results, transition planning, and produce final report. Transition to U.S. Navy joint direct attack munition program of record."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding decrease for FY 2019 due to aircraft integration, hydrodynamic analysis, and weapon demonstration being completed in 2017 and 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Talon Tactical Mobile Over-the-Horizon Radar (TACMOR)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  TACMOR will support air domain awareness and maritime domain awareness requirements over the Western Pacific region.  The project will demonstrate a sub-scaled over-the-horizon radar (OTHR) that is one quarter the size of traditional OTHR systems.  In FY 2017, TACMOR designed and fabricated transmit\/receive enclosures, fabricated transmit\/receive arrays, and integrated system components with partner nations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "Conduct critical design reviews, factory tests, and a military utility assessment of the system.  Install the OTHR system at the site using partner funding.  Integrate the system with other intelligence, surveillance, and reconnaissance assets.  Develop system and training documentation.  Transition the system to the U.S. Air Force and complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project will complete in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Semi-Automated Counter-Propaganda Platform (SCP)"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  SCP will provide U.S. Central Command, U.S. Special Operations Command, U.S. Southern Command, and U.S. Pacific Command the ability conduct critical Military Information Support Operations (MISO) at an unparalleled scale."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.325"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "Deliver two technical demonstrations, initial concept of operation, and training.  Deliver SCP capability.  Conduct the military utility assessment and transition SCP to U.S. Special Operations Command's Media Production Center family of systems.  The MISO Operations Command under the control of the U.S. Special Operations Command's provide MISO support functions to all Combatant Commanders.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project completed in FY 2018"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Wingman"
                                    },
                                    "Description": {
                                        "val": "FY 2017 new start.  Wingman will utilize unmanned ground vehicles (UGV) to project lethality that can maneuver effectively with a mounted formation and engage ahead of and along with manned platforms.  The integration of weaponized UGVs into combat elements will provide initial operational stand-off for manned vehicles, enhanced situational awareness, and mitigate the risk of casualties at first contact.  In FY 2017, Wingman conducted an initial operational demonstration with live-fire testing, and drafted Wingman concept of operations and tactics, techniques, and procedures."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Demonstrate the first unmanned system certified on the U.S. Army table VI scout gunnery course and refinement of the Wingman operating system."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.000"
                                            },
                                            "Text": {
                                                "val": "Conduct final Military Utility Assessment (MUA) of maneuver operations and Wingman technologies in cooperation with U.S. Central Command and U.S. Army.  Transition components to Product Manager, U.S. Army Applique and Large Unmanned Ground Systems (PM USA ALUGS); Program Executive Officer, U.S. Marine Corps Land Systems; and U.S. Army Research, Development, Engineering Command.  Complete the JCTD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "No change in funding profile."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Scanning Infra-Red (IR) Sensor for Unmanned Aerial Vehicle (UAV) Detection and Tracking (SISUDT)"
                                    },
                                    "Description": {
                                        "val": "Previously funded as an enabling technology within the JCTD program.  SISUDT responds to a Joint Urgent Operational Need request to detect, track, identify and evaluate threats by unmanned aerial systems (UAS) at forward operating bases (FOB).  Partners involved in SISUDT include U.S. Central Command, U.S. Navy, and Massachusetts Institute of Technology Lincoln Labs (MIT-LL).  The SISUDT Counter-Unmanned Aerial System (C-UAS) is managed by the U.S. Central Command’s Technology Tiger Team to develop a multi-sensor C-UAS to detect, track, and identify UAS in the vicinity of a forward operating base (FOB).  Conducted a six month assessment at a FOB in the U.S. Central Command area of responsibility.  At the end of the assessment, SISUDT transitioned to U.S. Forces Afghanistan for continued operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.500"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Successful JCTDs can transition to acquisition via one of several methods:\n-  The JCTD addresses a documented capability gap in an existing program of record (PoR).  The existing PoR can acquire, further develop, sustain, and provide the capability under existing program documentation.\n-  The capabilities address capability gaps that naturally fit with an existing PoR, but program documentation addressing the new capabilities does not exist.  In these cases, existing PoR documentation (such as the Capabilities Development Document or Capabilities Production Document) is revised to include the new capabilities from the JCTD, and the JCTD capabilities transition to the PoR.\n-  The capabilities address a current operational need without requiring PoR changes.  In these cases, the JCTD capabilities may transition directly to operational use, with sustainment (operations and maintenance) funding arranged through the gaining command.  \n-  The capabilities may be widely applicable commodity products, useful to many commands.  In these cases, the commodity products listed on General Services Administration schedule, and made available for purchase by any commands needing the capability, using procurement funds.\n-  Results of JCTD can be used to inform the research and engineering, acquisition, or requirements process."
                        },
                        "PerformanceMetrics": {
                            "val": "Strategic Goals Supported:\n-  Develop and demonstrate a prototype that fills a joint capability gap. \n-  Demonstrate a capability to address a DoD key strategic gap. \n-  Develop a prototype that informs the acquisition and requirements process. \n-  Independent Assessment Capability.\n-  Successful military utility assessment (MUA).\n\nMEASURABLE OUTCOMES:  \n• JCTDs will demonstrate capability objectives within 24-48 months: \n• The JCTD program will continue to achieve high transition rates.  In FY 2017, 50 percent of completed JCTDs successfully transitioned and exceeded the DoD Strategic Performance goal of 40 percent.  Two of six completed JCTDs transitioned to a new or existing Program(s) of Record.  One transitioned to fieldable-prototypes (residual capabilities) sustained by non-JCTD funds in direct support of operations in theater.  Three were returned to the technology base for further analysis and\/or future use."
                        }
                    }
                }
            ]
        }
    }
}