{
    "id": "2019-Navy-PB-1319-JBOOK-acd04f4d9735e80412f4a8ec0a89d7f055132a6f39299672558b4188f84667ad-69",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA4-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0304240M"
        },
        "ProgramElementTitle": {
            "val": "(U)Advanced Tactical Unmanned Aircraft System"
        },
        "R1LineNumber": {
            "val": "100"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "4"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Component Development & Prototypes (ACD&P)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "0.000"
            },
            "CurrentYear": {
                "val": "7.979"
            },
            "BudgetYearOne": {
                "val": "25.291"
            },
            "BudgetYearOneBase": {
                "val": "25.291"
            },
            "BudgetYearTwo": {
                "val": "26.770"
            },
            "BudgetYearThree": {
                "val": "26.066"
            },
            "BudgetYearFour": {
                "val": "24.125"
            },
            "BudgetYearFive": {
                "val": "61.741"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program element provides for development and capability requirements for Advanced Tactical Unmanned Aerial Vehicles in support of expeditionary efforts  Projects are Joint Military Intelligence Programs.  \n\nProject 3135 - This project provides for the early trade studies, analysis, experimentation, and concept refinement for the Marine Air Ground Task Force (MAGTF) Unmanned Aircraft System (UAS) Expeditionary (MUX) with Vertical\/Short Take-Off and Vertical Landing (V\/STOVL) capability. These MUX efforts will include maturing key technologies and rapid prototyping to inform a future MUX program of record.  Objective capabilities will include strike and cargo resupply.  Provides USMC with MUX operational capability in FY26.   \n\nProject 3427 - This project provides for experimentation and support of the CQ-24A Cargo UAS (commonly referred to as KMAX).  CQ-24A will be used to specifically inform the unmanned cargo resupply requirements of future programs of record, to include MUX.  Experimentation includes payloads\/sensor integration, control station integration, Concept of Operations (CONOPS) and Tactics, Techniques, and Procedures (TTP) development. These experimentation efforts inform program capability documents and support other military exercises, and advance technologies needed for the future MUX POR.\n\nCost estimate for Cost to Complete and Total Cost for both project units are being developed and will be promulgated in a future budget request."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "7.979"
                },
                "BudgetYearOne": {
                    "val": "10.385"
                },
                "BudgetYearOneBase": {
                    "val": "10.385"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "7.979"
                },
                "BudgetYearOne": {
                    "val": "25.291"
                },
                "BudgetYearOneBase": {
                    "val": "25.291"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "14.906"
                },
                "BudgetYearOneBase": {
                    "val": "14.906"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "14.906"
                                },
                                "BudgetYearOneBase": {
                                    "val": "14.906"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Schedule: \nProject 3135 - Updated to reflect MUX experimentation requirements.  \nProject 3427 - Not applicable  \n\nTechnical: Not applicable"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "3135"
                    },
                    "ProjectTitle": {
                        "val": "USMC MUX Medium Altitude - Long Endurance (MALE) Group 5 UAV"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "4.978"
                        },
                        "BudgetYearOne": {
                            "val": "20.438"
                        },
                        "BudgetYearOneBase": {
                            "val": "20.438"
                        },
                        "BudgetYearTwo": {
                            "val": "26.768"
                        },
                        "BudgetYearThree": {
                            "val": "26.066"
                        },
                        "BudgetYearFour": {
                            "val": "24.125"
                        },
                        "BudgetYearFive": {
                            "val": "61.741"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding provides for the early trade studies, analysis, experimentation, key technology maturation, rapid prototyping, and concept refinement for the Marine Air Ground Task Force (MAGTF) Unmanned Aircraft System (UAS) Expeditionary (MUX) with Vertical\/Short Take-Off and Vertical Landing (V\/STOVL) capability. The MUX UAV supports Expeditionary Force 21 Operating Concepts and the 2017 Marine Aviation Plan (AvPlan) requires an advanced, multi-mission ship-based Group 5 UAS in support of Marine Expeditionary Force\/Marine Expeditionary Brigade-sized MAGTF to address future capability gaps. The future MUX UAV system will provide a weaponized, payload flexible, shipboard capable\/expeditionary system that is runway independent for all weather, long range\/persistence, operations from the sea in a contested environment. This next generation UAV capability will have far greater range, endurance, altitude, and payload capability than the current conventional VTOL technology can provide from air capable ships. The MUX system Initial Capabilities Document (ICD) was approved in Oct 2016. The Material Development Decision and Analysis of Alternatives (AOA) is planned to start in FY18. Rapid prototyping strategies are also being pursued by the USMC to meet an early operational need date. \n\nThis effort will continue to inform program scope, phasing, and cost for development of the MUX capability. Funding in FY19 will also be used to reduce overall MUX program cost by leveraging other technology demonstrator developmental programs; such as the US Army Aviation and Missile Research, Development, and Engineering Center (AMRDEC) Joint Multi-Role Technology Demonstrator (JMR-TD) and Defense Advanced Research Project Agency (DARPA) TERN which both end in FY18, allowing for continued technical maturation effort, rapid prototyping, and smooth transition to a MUX POR."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "MUX Studies, Analysis, Experimentation and Concept Refinement"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.650"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides funding for Government and industry teams for pre-Milestone A activities including industry inquiries, aircraft trade studies, concept refinement, requirements\/payload analysis for meeting mission requirements to inform the MUX POR. Supports development of the MUX Concept of Operations and draft Capability Development Document (CDD).  Provides funding for experimentation with advanced concept demonstrator UAVs such as USMC CQ-24A Cargo UAS and DARPA\/ONR developed Tern Medium Altitude Long Endurance (MALE) UAS, along with other tactical UAV\/payload\/control station demonstrator efforts to help inform performance requirements, initial Key Performance Parameters (KPP), CONOPS, concepts, tactics, doctrine, and the future MUX program of record. Provides funding for engineering architecture assessments (aircraft and payloads) to establish specific areas the government will function as the systems integrator.  This will inform a future POR in order to reduce life cycle costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides funding for Government and industry teams for acquisition activities including industry inquiries, aircraft trade studies, concept refinement, requirements\/payload analysis, and rapid prototyping efforts related to the MUX POR. Supports continued development of the MUX Concept of Operations and draft CDD.  Provides funding for experimentation with advanced concept demonstrator UAVs such as USMC CQ-24A Cargo UAS, DARPA\/ONR developed Tern UAS, and US Army AMRDEC JMR-TD aircraft projects, along with other tactical UAV\/payload\/control station demonstrator efforts, to help inform tactical unmanned system performance requirements, initial KPP, CONOPS, concepts, tactics, doctrine, the future MUX program of record, and support rapid prototyping efforts. Provides funding for engineering architecture assessments (aircraft and payloads) to establish specific areas where the government will function as the systems integrator."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from $3.650M to $18.274M results from additional industry capability RFIs and trade studies to support a future program of record."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical and Engineering Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.328"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate and provide Government Engineering support, Contractor support, Program support and travel for execution of\nMUX studies, experimentation, and concept refinement and for pre-MS A related acquisition activities to support the\nfuture MUX program of record."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.164"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide Government Engineering support, Contractor support, Program support and travel for execution of\nMUX studies, experimentation, rapid prototyping, and concept refinement and for pre-MS A related acquisition activities to support the future MUX program of record."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase of $1.328M to $2.164M results from increased support for government engineering and industry developmental oversight."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "A Material Development Decision is anticipated in FY18. The MUX program will leverage technology of unmanned tactical aviation programs, including DARPA\/ONR concept demonstrator UAV S&T programs, US Army AMRDEC JMR-TD aircraft projects, OEM internally funded UAV prototypes when available, existing tactical unmanned technologies, and promising new industry design concepts that result from industry trade studies. The government will develop and award study contracts as required to support program activities and analysis efforts. Assessment of available technology from existing S&T efforts and review of industry inquiries \/ study contracts will be used to determine the optimum MUX strategy to meet the Initial Operational Capability needs, as well as, a potentially Early Operational Capability which may be met through available rapid prototyping processes. The MUX POR intends to have the Government functioning as the system integrator for the development and sustainment of the program to reduce life cycle costs."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics include successful completion of Trade Studies; successful development of a CONOPS and draft CDD, identification of material solutions for concept refinement, and analysis of architectures."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MUX Studies and Experimentation"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TBD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TBD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.500"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "15.599"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "15.599"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements Analysis and Engineering Assessments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.150"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.675"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.675"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.635"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.034"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.034"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.669"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.600"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "1.050"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "1.050"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.650"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.093"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.173"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_0304240M_3135_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 3135"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Analysis of Alternatives and Material Development Decision (AoA & MDD)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone:  Industry Inquiries for MUX Capability (RFIs)"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "3"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone: Initial Trade Studies"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2019"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone: Detailed Trade Studies\/Conceptional Design Refinement"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone:  Early Design Phase"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone:  Initial Design Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone: CDD CONOPS Development"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acqusition Milestone:  Engineering Manufacturing & Developoment"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2022"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone: Milestone A Review"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2021"
                                                        }
                                                    }
                                                }
                                            },
                                            {
                                                "EventTitle": {
                                                    "val": "USMC MUX UAS: Acquisition Milestone: Technical Maturation,UAV Experimentation, Rapid Prototyping"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "2"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "4"
                                                        },
                                                        "Year": {
                                                            "val": "2023"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "3427"
                    },
                    "ProjectTitle": {
                        "val": "KMAX Experimentation and Support"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "3.001"
                        },
                        "BudgetYearOne": {
                            "val": "4.853"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.853"
                        },
                        "BudgetYearTwo": {
                            "val": "0.002"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.856"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Funding provides for experimentation for unmanned cargo operations and includes complementary Intelligence, Surveillance, and Reconnaissance (ISR), payloads, advanced sensors, autonomy; efforts to refine requirements and concept of operations (CONOPS); and support of future unmanned programs of record, such as Marine Air Ground Task Force (MAGTF) Unmanned Aircraft System (UAS) Expeditionary (MUX).      \n\nThe CQ-24A Cargo UAS is a unique, unmanned, sling-load capable aircraft that has had demand signals including moving cargo in permissive environments (e.g. food, fuel, medicine), combatting forest fires in the United States (specifically at night) when manned aircraft don't fly due to safety restrictions, and flying to locations that present dangerous or deadly conditions to humans (such as biological threats or radiation hazards).\n\nThe program's 2 Marine Corps CQ-24A were successfully utilized in Afghanistan to support urgent operational needs in that theater of operations.  The 2 CQ-24A aircraft and ground control system require contractor services to operate.  Utilization of existing CQ-24A systems is an efficient risk reduction method."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CQ-24A Cargo UAS Experimentation and Support Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.091"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides funding for government and industry teams to operate aircraft in support of tactics development and fleet experimentation and modify aircraft with payloads to support requirements refinement, to include future MUX requirements.  Payloads may include sensors, weapons, and systems to support extended range operations.  Provides funding for engineering architecture assessments (aircraft and payloads) to establish areas where the government will function as the systems integrator for a program of record, in order to reduce life cycle costs."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.849"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provides funding for government and industry teams to operate aircraft in support of tactics development and fleet experimentation and modify aircraft with payloads to support requirements refinement, to include future MUX requirements.  Payloads may include sensors, weapons, autonomy, and systems to support unique cargo requirements envisioned for MUX or other specialty mission areas that this unique CQ-24A DOD high-value asset can provide."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from $2.091M to $3.849M results from additional tactics development and experimentation flight hours for the program."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Technical and Engineering Services"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.910"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Initiate and provide government engineering support, contractor support, program support and travel for execution of CQ-24A Cargo UAS experimentation and concept refinement for study products and acquisition activities to support future programs of record, to include MUX."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Provide government engineering support, contractor support, program support and travel for execution of CQ-24A Cargo UAS experimentation and concept refinement for study products and acquisition activities to support future programs of record, to include MUX."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase from $0.910M to $1.004M results from engineering and technical requirements to support experimentation and developmental oversight."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "The CQ-24A Cargo UAS experimentation and support activities will be contracted through a sole source contract with the aircraft prime vendor in order to support continued experimentation through FY19.  It is envisioned that support will continue beyond FY19\/20 to align with the MUX program of record concept refinement phase. Other U.S. Government agencies have expressed interest in using these CQ-24A Cargo UAS assets to fight forest fires (at night) in the Midwest. CQ-24A can be made available for experimentation of autonomous fire-fighting through other agency funding (if available)."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics include successful completion of technical demonstration with published reports and CONOPS updates, along with inputs to unmanned cargo re-supply requirements for capability documents and performance specifications."
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "CQ-24A Cargo UAS Experimentation"
                                                },
                                                "ContractMethod": {
                                                    "val": "C"
                                                },
                                                "ContractType": {
                                                    "val": "CPFF"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Lockheed Martin"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "MCAS Yuma, AZ"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.511"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "3.239"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "3.239"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "4.750"
                                                    },
                                                    "TargetValue": {
                                                        "val": "4.750"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Requirements and Analysis, and Engineering Assessments"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.580"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.610"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.610"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-03"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "1.190"
                                                    },
                                                    "TargetValue": {
                                                        "val": "1.190"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Govt Engineering Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.410"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.474"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.474"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.884"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Program Management Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.445"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.450"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.895"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Travel"
                                                },
                                                "FundingVehicle": {
                                                    "val": "WR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "NAWCAD"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Patuxent River, MD"
                                                },
                                                "Cost": {
                                                    "TotalPreviousYears": {
                                                        "val": "0.000"
                                                    },
                                                    "PriorYear": {
                                                        "Amount": {
                                                            "val": "0.000"
                                                        }
                                                    },
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "0.055"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "0.080"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "0.135"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "R4_2019PB_0304240M_3427_FILE1.PNG"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "SubProjectScheduleList": {
                            "SubProjectSchedule": [
                                {
                                    "Title": {
                                        "val": "Proj 3427"
                                    },
                                    "ScheduleDetailList": {
                                        "ScheduleDetail": [
                                            {
                                                "EventTitle": {
                                                    "val": "Acquisition Milestones: Experimentation and concept refinement of USMC CONOPS, tactics, and doctrine"
                                                },
                                                "Schedule": {
                                                    "Start": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2018"
                                                        }
                                                    },
                                                    "End": {
                                                        "Quarter": {
                                                            "val": "1"
                                                        },
                                                        "Year": {
                                                            "val": "2020"
                                                        }
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}