{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-13",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603270A"
        },
        "ProgramElementTitle": {
            "val": "Electronic Warfare Technology"
        },
        "R1LineNumber": {
            "val": "43"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.819"
            },
            "CurrentYear": {
                "val": "31.296"
            },
            "BudgetYearOne": {
                "val": "31.491"
            },
            "BudgetYearOneBase": {
                "val": "31.491"
            },
            "BudgetYearTwo": {
                "val": "35.317"
            },
            "BudgetYearThree": {
                "val": "37.360"
            },
            "BudgetYearFour": {
                "val": "38.469"
            },
            "BudgetYearFive": {
                "val": "39.262"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "254.014"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates electronic warfare (EW) sensors and software intended to deny, disrupt, locate or destroy the enemy's command, control and communications (C3) systems and intelligence, surveillance and reconnaissance assets. This PE matures both countermeasures (CM) and counter-countermeasures (CCM) to deny the enemy the use of their systems while protecting United States (U.S.) assets from enemy deception and jamming. Project CY3 matures and demonstrates architecture, sensor and software techniques to provide operationally relevant capabilities for cyber support at Corps level and below and enables cyber situational awareness, command and control, mission rehearsal, observable reporting, and framework to incrementally advance cyber tool development. Project K15 matures and demonstrates capabilities to locate and exploit enemy communication systems including computer networks. Project K16 matures and demonstrates multifunctional EW capabilities (jamming) to enhance platform survivability and provide near real-time situational awareness to the Commander through the detection, identification and geo-location of emitters of interest.\n\nWork in this PE complements PE 0602120A (Sensors and Electronic Survivability), PE 0602782A (Command, Control, Communications Technology), PE 0602270A (Electronic Warfare Technology), PE 0603772A (Advanced Tactical Computer Science) and PE 0603794A (Command, Control and Communications Advanced Technology), and is coordinated with PE 0602601A (Combat Vehicle and Automotive Technology), PE 0602618A (Ballistics Technology), PE 0603003A (Aviation Advanced Technology), PE 0603004A (Weapons and Munitions Advanced Technology), PE 0603005A (Combat Vehicle and Automotive Advanced Technology), PE 0603313A (Missile and Rocket Advanced Technology) and PE 0603794A (Command, Control and Communications Advanced Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the Research, Development, and Engineering Command (RDECOM), Aberdeen Proving Ground, MD."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "27.893"
                },
                "CurrentYear": {
                    "val": "31.296"
                },
                "BudgetYearOne": {
                    "val": "34.241"
                },
                "BudgetYearOneBase": {
                    "val": "34.241"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.819"
                },
                "CurrentYear": {
                    "val": "31.296"
                },
                "BudgetYearOne": {
                    "val": "31.491"
                },
                "BudgetYearOneBase": {
                    "val": "31.491"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "12.926"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-2.75"
                },
                "BudgetYearOneBase": {
                    "val": "-2.75"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "14"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.06"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-2.75"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.75"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.014"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "In Fiscal Year 2018 funding increased to support needed aircraft survivability and Multifunction Electronic Warfare efforts.\nFY17 Congressional increase $14M"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "CY3"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "6.483"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.483"
                        },
                        "BudgetYearTwo": {
                            "val": "6.531"
                        },
                        "BudgetYearThree": {
                            "val": "6.511"
                        },
                        "BudgetYearFour": {
                            "val": "6.607"
                        },
                        "BudgetYearFive": {
                            "val": "6.739"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "32.871"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This Project was funded previously to FY19 as part of Project K15.  Funding was realigned in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates architecture, sensor and software techniques to provide operationally relevant capabilities for cyber support at Corps and Below. This Project enables cyber situational awareness, command and control, mission rehearsal, observable reporting, and framework to incrementally advance cyber tool development to realize the desired intent against any threat, to perform Cyber\/EW\/SIGINT operations and to assist in answering the commanders understanding of the battlespace in a hostile electromagnetic and cyber environment.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated electronic attack (EA) and cyberspace electromagnetic activities (CEMA) hardware and software to execute force protection (FP), EA, electronic surveillance (ES), signals intelligence (SIGINT), electronic warfare (EW) and cyber missions in a dynamic, distributed and coordinated fashion. This results in the capability to engage a multitude of diverse multi-node, multi-waveform, multi-platform and cyber (internetworked computers) targets while maximizing overall network efficiency and effectiveness, and preserving Blue Force and non-combatant communications. Work being accomplished under Program Element (PE) 0603270A\/Projects K15 and K16 and PE 0602270A\/Projects CYB and 906 complement this effort. In FY 2019 this effort was moved from Project K15 per an Office of the Secretary of Defense directive to identify cyber investments in cyber unique Projects."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.483"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.483"
                                            },
                                            "Text": {
                                                "val": "Will mature CEMA mission management software to augment the Commander's ability to build courses of action that achieve desired intent by allowing the Commander to choose the right cyber toolset for the mission based on availability of tools and computing resources on Blue Force platforms; will optimize methods to employ tactical cyber\/EW\/SIGINT platforms as sensors to ascertain sufficient situational understanding of the mission space; will demonstrate mature cyber and EW techniques against validated threats in support of and for transition to Programs of Record; will use Modeling and Simulation to demonstrate how machine learning can be used to overcome technology hurdles, operational complexities, and enable timely Blue Force response; and use software and subsystem improvements to mature a simulated laboratory-based offensive cyber infrastructure for advanced EW\/cyber development, tactical rehearsal, and training capabilities."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19 this Project was created per an Office of the Secretary of Defense directive to identify cyber investments in cyber unique Projects."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K12"
                    },
                    "ProjectTitle": {
                        "val": "EW Demonstrations (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "14.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Program Increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Electronic Warfare Demonstrations."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "14"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K15"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Comm Ecm Demo"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "7.791"
                        },
                        "CurrentYear": {
                            "val": "9.288"
                        },
                        "BudgetYearOne": {
                            "val": "2.439"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.439"
                        },
                        "BudgetYearTwo": {
                            "val": "4.7"
                        },
                        "BudgetYearThree": {
                            "val": "6.339"
                        },
                        "BudgetYearFour": {
                            "val": "6.549"
                        },
                        "BudgetYearFive": {
                            "val": "6.681"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "43.787"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates sensor and software technologies to locate and identify modern tactical enemy and blue force (friendly) radio frequency (RF) communications, radars, signals of interest (SOI) and computer networks\/nodes. This Project enables uninterrupted air and ground based intelligence collection and long range targeting operations in a hostile electromagnetic and cyber environment, and enables communications countermeasures (CM) and counter-countermeasures (CCM) to first intercept, identify and locate tactical communications; then degrade threat-computer networks and their components.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Offensive Operations"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated electronic attack (EA) and cyberspace electromagnetic activities (CEMA) hardware and software to execute force protection (FP), EA, electronic surveillance (ES), signals intelligence (SIGINT), electronic warfare (EW) and cyber missions in a dynamic, distributed and coordinated fashion. This results in the capability to engage a multitude of diverse multi-node, multi-waveform, multi-platform and cyber (internetworked computers) targets while maximizing overall network efficiency and effectiveness, and preserving blue force and non-combatant communications. Work being accomplished under Program Element (PE) 0603270A\/Projects CY3 and K16 and PE 0602270A\/Projects CYB and 906 complement this effort. In FY 2019 this effort was moved to Project CY3 in accordance with Volume 2B, Chapter 18, of the DoD Financial Management Regulation (FMR), requiring all \"cyberspace activities\" funding move into pure budget Projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.523"
                                            },
                                            "Text": {
                                                "val": "Will mature interface definitions and data transfer protocol for the inclusion of tactical cyber capability on a single board computer in a common RF chassis as part of an open, modular converged RF architecture to employ multiple electronic support and electronic attack techniques simultaneously; continue to mature and integrate advanced techniques against SOIs onto representative software defined radio platforms and demonstrate the effectiveness of tactical cyber capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.177"
                                            },
                                            "Text": {
                                                "val": "Finalize interface definitions for advanced techniques to perform various cyber and EW functions (locate, degrade, disrupt, deny) against identified SOIs; mature and demonstrate techniques to perform command & control (C2) cyber functions from EW and SIGINT platforms across\/within security domains; mature data models (structure and method for ingest and relational analysis of data) necessary for the delivery of data products to the intelligence enterprise that provide the tactical commander with a better CEMA situational awareness (SA) and understanding (SU); mature and conduct modeling and simulation (M&S) within the laboratory to replicate next generation CEMA architecture and mature analytic tools to inform\/develop the commander's SU; and replicate the current offensive cyber operation (OCO) operational state within a simulated laboratory environment to facilitate an EW\/cyber tactical rehearsal and training capability."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY19 this effort was moved to Project CY2 per an Office of the Secretary of Defense directive to identify cyber investments in cyber unique Projects."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Stand-off Non-Cooperative Multi-Intelligence (Multi-INT) Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to conduct standoff electronic warfare (EW) intelligence, surveillance reconnaissance, planning and effects in a three dimensional urban battlespace. Work being accomplished under Program Element (PE) 0603270A\/Project K16 and PE 0602270\/Project 906 complement this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.268"
                                            },
                                            "Text": {
                                                "val": "Will design, mature, fabricate and program a circuit card to employ viable EW techniques to counter identified UAS threats and integrate it into an open, modular converged RF architecture and demonstrate the effectiveness of the capability in a laboratory environment; assess requirement to coordinate data exchange between national and tactical assets to achieve desired, coordinated effects on designated threat systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.111"
                                            },
                                            "Text": {
                                                "val": "Mature and develop techniques focused on executing electronic surveillance (ES) (sense\/detect\/identify\/geolocate) and electronic attack (EA) (deny\/degrade\/disrupt) capabilities against peer\/near peer threat systems and networks operating within congested and contested environments; begin identification of measurable characteristics for EW system effects (i.e. battle damage assessment) commensurate with and to be integrated with kinetic effect characteristics in support of mission planning and employment capabilities; and extend and demonstrate EW Planning and Management Tool (EWPMT) Program of Record (POR) interfaces supporting data fusion and analysis for the Distributed Common Ground Station ? Army (DCGS-A) POR and remote C2\/coordination of EW assets and effects for the Multi-Function EW (MFEW) POR and defensive electronic attack (DEA) capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.439"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.439"
                                            },
                                            "Text": {
                                                "val": "Will mature modeling & simulation (M&S) capabilities to analyze advanced threat scenarios to optimize future Blue Force multi-function EW sensor employment; will conduct a laboratory demonstration of EW operations coordinated with other Warfighting functions (Fires, Maneuver, etc.) within the context of the EWPMT POR; demonstrate the implementation of ES and EA C2 functions in a laboratory environment to support future Terrestrial Layer Intelligence. Will support requirements development using EWPMT and\/or surrogate sensors\/systems; and will mature and demonstrate software algorithms that optimize the planning of coordinated disparate airborne EW (i.e. the Air large increment of the Multifunction EW POR) and Intel assets (i.e. Enhanced Medium Altitude Reconnaissance and Surveillance System and Tactical SIGINT Payload PORs) with ground-based multi-function assets (i.e. dismounted\/mounted Intel\/EW systems) to illustrate the value of a combined Intel and CEMA common operating picture for enhanced situational understanding."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease to completions of demonstrations of the ability to extend and demonstrate EW Planning and Management Tool (EWPMT) Program of Record (POR) interfaces."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "K16"
                    },
                    "ProjectTitle": {
                        "val": "Non-Commo Ecm Tech Dem"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "19.028"
                        },
                        "CurrentYear": {
                            "val": "22.008"
                        },
                        "BudgetYearOne": {
                            "val": "22.569"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.569"
                        },
                        "BudgetYearTwo": {
                            "val": "24.086"
                        },
                        "BudgetYearThree": {
                            "val": "24.51"
                        },
                        "BudgetYearFour": {
                            "val": "25.313"
                        },
                        "BudgetYearFive": {
                            "val": "25.842"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "163.356"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates non-communication, multi-functional electronic warfare (EW) capabilities that enhance the survivability of Army air and ground platforms and dismounted Soldiers. This Project matures and demonstrates radio frequency (RF), infrared (IR) and electro-optical (EO) sensors and jamming sources to detect, locate, deceive, and neutralize (jam) booby traps, radar-directed target acquisition systems, target-tracking sensors, surface-to-air missiles (SAMs), air-to-air missiles (AAMs), and top-attack and electronically-fuzed munitions. This Project also enables electronic support (ES) hardware and software to detect, identify and geolocate emitters of interest from an effective standoff distance to provide near real-time situational awareness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Multispectral Threat Detection and Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates countermeasure technologies that provide platform protection and integrated cueing against electro-optical (EO), infrared (IR) and radio frequency (RF) guided threats. Work accomplished under Program Element (PE) 0602270A\/Project 906 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.045"
                                            },
                                            "Text": {
                                                "val": "Will finish requirements and interface definitions for integration of a 2 channel digital RF receiver on a single circuit card assembly for use in modern radar warning receivers, capable of identifying advanced radar threat systems into an open, modular, converged RF architecture; demonstrate system functionality in a representative hardware platform."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.447"
                                            },
                                            "Text": {
                                                "val": "Mature and demonstrate cognitive and adaptive threat agnostic (functional against unknown threats to the area) detection and countermeasure algorithms using statistics-based machine learning techniques as part of an integrated survivability suite; use modeling and simulation (M&S) to ensure the modular architecture framework supports rapid updates for algorithm maturation and assessment; design, code and integrate a new class of warning algorithms to operate against unknown\/unexploited low signature and emerging threats; mature and fabricate digital readout integrated circuit specifically for threat warning applications; and mature and validate an integrated software framework that utilizes cognitive controls to select the best countermeasure given the information the integrated survivability suite provides."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.5"
                                            },
                                            "Text": {
                                                "val": "Will develop demonstrator sensor system leveraging previously developed digital readout integrated circuit for threat warning, advanced focal plane array, and processing; will use demonstrator sensor to collect threat signatures and background data; will integrate new sensor model into the M&S environment; will assess algorithm performance with prior data sets and additionally with newly collected data from demonstrator sensor system; will evaluate algorithm performance using models of projected threats with modified signature characteristics; and will analyze function and capability of demonstrator sensor system as part of an integrated survivability suite and demonstrate end-to-end functionality of demonstrator sensor system in laboratory environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned increase of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Tactical EW Countermeasure Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates integrated electronic warfare (EW)\/direction finding technologies that provide protection of ground and dismounts from emerging radio frequency (RF) threats at standoff distances. Work accomplished under Program Element (PE) 0602270A\/Project 906 and PE 0603270A\/Project K15 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.546"
                                            },
                                            "Text": {
                                                "val": "Will use converged RF architecture to mature and integrate EW techniques to determine the utility of sharing data between components, such as software defined radios, sensors, electronic support and countermeasures to identify, geo-locate and neutralize RF threats for platform survivability, and demonstrate in a relevant environment; assess types of data that can be collected from different components to improve platform survivability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.056"
                                            },
                                            "Text": {
                                                "val": "Mature processing and learning algorithms that go beyond traditional detection and countermeasure for ground based threats by exploiting unused embedded features within sensor data sets to increase the probability of neutralizing the threat through improved identification,  classification, direction finding and countermeasure effectiveness; use modeling and simulation (M&S) to assess the ability of learning algorithms to improve platform survivability; and demonstrate capability in a relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.099"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.099"
                                            },
                                            "Text": {
                                                "val": "Will develop functions to intelligently identify threat, assess effectiveness, and optimize soft-kill (SK) countermeasure response for Homing and Laser Beam Rider threat variants; will refine threat and system models that enable training of cognitive algorithms; will conduct hardware breadboarding and techniques development of advanced SK countermeasure system; will provide feedback to Open Standards Community of Interest on EW requirements; will demonstrate integrated SK countermeasure hardware and intelligent software in simulation environment; will perform technology assessment of the advanced SK countermeasure performance in the areas of identification, effectiveness assessment, optimization, improvements to total survivability, and extensibility to unknown threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "EW Counter Countermeasures"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware and software to counter emerging electronic warfare threats to command, control, communications, computers, intelligence, surveillance and reconnaissance (C4ISR) platforms.  Work being accomplished under PE 0603772\/Project 243 and 0602270A\/Project 906 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.5"
                                            },
                                            "Text": {
                                                "val": "Will utilize current capability to simulate real world effects of red force jamming in complex (multi-path) environments; conduct hardware in the loop analysis of prioritized emerging threat interference techniques; replicate potential interactions on emerging blue force systems, (i.e. communication, radar) to understand and mitigate the electromagnetic interference caused by these effects; develop, mature and assess advanced signal\/data processing algorithms and cancellation techniques to mitigate the effects of the threat; begin hardware in the loop analysis of the effectiveness of these techniques against red force jamming."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.502"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate electronic protection (EP) software and algorithms in an open standards and open architecture design; conduct hardware in the loop analysis of prioritized emerging threat interference techniques; assess potential interactions on emerging blue force systems, (i.e. communication, radar) and apply EP algorithms to mitigate the electromagnetic interference caused by these effects; mature EP algorithms for detection, localization and neutralization of electronic interference, and demonstrate their performance; and enhance hardware in the loop testing capabilities to support a future threat analysis to achieve full closed loop capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.504"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.504"
                                            },
                                            "Text": {
                                                "val": "Will continue maturation and integration of EP software and algorithms in open standards and open architecture designs with a focus on different classes of radar systems across the Army portfolio; will continue to conduct hardware in the loop (HWIL) analysis of prioritized emerging threat interference techniques; will assess potential interactions on emerging Blue Force systems, (i.e. communication, radar) and apply EP algorithms to mitigate the electromagnetic interference caused by these effects; will mature and complete EP algorithms for detection, localization and neutralization of electronic interference, and will demonstrate their performance against a current threat; leverage HWIL assessment capabilities to support a future threat analysis and develop techniques for mitigating future threats; and will expand efforts into developing advanced EA capabilities based on predicted future threats to create a red-team \/ blue-team EA\/EP optimization loop for development of more advanced EP techniques."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned increase of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System (APS) Soft Kill (SK)\/Hard Kill (HK) Sensors (formerly titled Active Protection System (APS) Soft Kill)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates hardware, software and techniques to provide an electronic warfare (EW) soft kill, and cueing\/tracking capability to the APS suite. This effort supports the Army's APS program to mature and demonstrate technologies to reduce vehicle weight by reducing reliance on armor through the use of other means such as sensing, warning, hostile fire detection, and active countermeasures to achieve increased protection against current and emerging threats. Work being accomplished under PE 0602601A\/Project C05, PE 0602618A\/Project H80, PE 0603004A\/Project 232, PE 0603005A\/Project 221 and PE 0603313A\/Project 263 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.25"
                                            },
                                            "Text": {
                                                "val": "Will complete sensor design, fabrication, and physical interface designs and begin integration onto a demonstration platform; conduct live fire data collection utilizing the sensor that has been integrated into the MAPS framework; characterize data collected to assess sensor performance within the MAPS framework; continue to assist in the development of MAPS framework interface definitions, protocols and requirements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.251"
                                            },
                                            "Text": {
                                                "val": "Complete soft-kill (SK) demonstration and system analysis of sensors, SK countermeasure (SKCM) and brassboard controller on MAPS platform demonstrator; verify sensor interface designs with modular active protection framework by demonstrating real time cueing and handoff of the threat message to the SKCM; continue integration of cueing sensor into the hard-kill (HK) demonstration, as well as integrating new SK techniques into the SKCM demonstration hardware to address a wider list of current and emerging threats; continue tracking sensor development, demonstrate the integration and threat message pass through of multiple subsystems (cueing and tracking sensors, controller and SKCM); and integrate tracking sensor into the controller to prepare for the HK\/SK demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.466"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.466"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate soft-kill (SK) and hard-kill (HK) capability and perform system analysis of their respective passive electro-optic\/infrared and active radar sensors, SKCM, and Modular APS (MAPS) Controller on the MAPS platform demonstrator and MAPS Virtual software and hardware integration laboratories; passive and active sensor interface designs will be verified with modular active protection framework by demonstrating real time cueing, tracking and handoff of the threat message to the SKCM and hard-kill countermeasure (HKCM); will develop, integrate and demonstrate the message pass through of multiple subsystems (cueing and tracking sensors, controller, SKCM and HKCM); will continue integration of the passive and active sensors into the additional SK and HK APS; and integrate new passive and active sensor techniques into the SKCM and HKCM software\/hardware to address a wider list of current and emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Modeling Simulation and Technique Maturation for Integrated RF Operations (formerly titled Integrated RF Operations)"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates a capability to perform modeling and simulation (M&S) of geographically dispersed radio frequency (RF) systems to provide a coordinated, collaborative and interoperable suite of electronic warfare (EW) capabilities. A modular software architecture will allow for rapid, cost effective technique development and integration of new EW capabilities, target signals of interest and environmental simulations. Work being accomplished under PE 0602270A\/Project 906 and PE 0603794A\/Project EL4 complements this effort."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.687"
                                            },
                                            "Text": {
                                                "val": "Will continue to improve RF M&S capabilities to accurately model complex urban environments, system performance in those environments and interactions with relevant SOIs common to urban environment; optimize methods to conduct M&S of complex environments with multiple geographically dispersed SOIs and blue force systems in a timely manner with sufficient fidelity to provide validated performance estimates to system developers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.751"
                                            },
                                            "Text": {
                                                "val": "Continued to improve RF M&S capabilities to accurately model complex urban environments, system performance in those environments and interactions with relevant SOIs common to urban environment; and optimized methods to conduct M&S of complex environments with multiple geographically dispersed SOIs and blue force systems in a timely manner with sufficient fidelity to provide validated performance estimates to system developers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.25"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.25"
                                            },
                                            "Text": {
                                                "val": "Will mature and extend the collaborative sensor M&S environment to be capable of assessing system of systems performance for EW and other sensors across various scenarios to support analysis of performance requirements and development of concepts of employment; will mature EW techniques and methods (i.e. active, reactive, surgical and protocol based software) developed in FY18 under the Multi-Function Electronic Warfare (MFEW) Technique Development effort."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reduced to support Army Modernization Priorities."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Intelligence Processing and Architecture Modernization"
                                    },
                                    "Description": {
                                        "val": "This effort will leverage Intelligence Community investments in software frameworks and exploits against threat SOIs to develop a library of open, modular, and scalable software solutions to address identified capability gaps and to provide the commander with electronic situational awareness while at the same time protecting his assets from enemy deception and jamming. Work accomplished under PE 0602270A\/Project 906 and PE 0603772A\/Project 243 complements this effort."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.001"
                                            },
                                            "Text": {
                                                "val": "Demonstrate a reference design of a multi-channel electronic support receiver designed according to the Modular Open Radio Frequency Architecture to conduct access and effects operations against regional threats to blue force Programs of Record; and develop and demonstrate an open architecture transmit capability that supports multiple mission spaces."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.75"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.75"
                                            },
                                            "Text": {
                                                "val": "Will integrate electronic situational awareness assets into a multifunction system capable of demonstrating integrated  intelligence, surveillance and reconnaissance (ISR)\/electronic warfare (EW) enabling enhanced performance through sensor fusion and agility to changing threat environments; will integrate distributed sensing algorithms with the high frequency (HF) software defined radio within a modular multifunction open radio frequency (RF) architecture and will demonstrate single sensor geolocation techniques in a laboratory environment for use within existing ES and EW sensors; and demonstrate mitigation techniques for noise within the HF frequency band from small unmanned air systems to facilitate deployment of HF applications on platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}