{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604258A"
        },
        "ProgramElementTitle": {
            "val": "Target Systems Development"
        },
        "R1LineNumber": {
            "val": "153"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "18.518"
            },
            "CurrentYear": {
                "val": "13.902"
            },
            "BudgetYearOne": {
                "val": "12.135"
            },
            "BudgetYearOneBase": {
                "val": "12.135"
            },
            "BudgetYearTwo": {
                "val": "9.344"
            },
            "BudgetYearThree": {
                "val": "10.099"
            },
            "BudgetYearFour": {
                "val": "9.587"
            },
            "BudgetYearFive": {
                "val": "13.462"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element funds aerial and ground target hardware and software development, maintenance, and upgrades. The overall objective is to ensure validation of weapon system accuracy and reliability by developing aerial and ground targets essential for test and evaluation (T&E). These targets are economical and expendable, remotely controlled or stationary, and often destroyed in use. The Army is the Tri-Service lead under the Secretariat Reliance panel for providing rotary wing, mobile ground, towed, and designated targets for T&E. The Army executes development of some service-peculiar target requirements in support of quality assurance, lot acceptance, and training and continues development of service-peculiar and on-going target materiel upgrades to maintain continuity with current weapons technology and trends in modern and evolving Army weapons."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "19.122"
                },
                "CurrentYear": {
                    "val": "13.902"
                },
                "BudgetYearOne": {
                    "val": "12.508"
                },
                "BudgetYearOneBase": {
                    "val": "12.508"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "18.518"
                },
                "CurrentYear": {
                    "val": "13.902"
                },
                "BudgetYearOne": {
                    "val": "12.135"
                },
                "BudgetYearOneBase": {
                    "val": "12.135"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.604"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.373"
                },
                "BudgetYearOneBase": {
                    "val": "-0.373"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.596"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.373"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.373"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "238"
                    },
                    "ProjectTitle": {
                        "val": "Aerial Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "13.245"
                        },
                        "CurrentYear": {
                            "val": "9.963"
                        },
                        "BudgetYearOne": {
                            "val": "9.82"
                        },
                        "BudgetYearOneBase": {
                            "val": "9.82"
                        },
                        "BudgetYearTwo": {
                            "val": "7.523"
                        },
                        "BudgetYearThree": {
                            "val": "8.573"
                        },
                        "BudgetYearFour": {
                            "val": "8.984"
                        },
                        "BudgetYearFive": {
                            "val": "10.859"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Aerial Targets Project supports Army readiness through development, acquisition, operation and modernization of aerial targets. Multi-spectral Aerial Targets include realistic surrogates, actual high performance threat aircraft, and virtual target computer models. Current and emerging weapons systems require test, evaluation, and training using threat representative aerial targets to assess weapons systems effectiveness in the operational environment. This program encompasses a portfolio of full-scale, miniature, and subscale fixed wing\/rotary wing targets, virtual targets, ancillary devices, and associated control systems. For accurate threat portrayal that properly stresses weapons systems during test and evaluation aerial targets must exhibit the flight characteristics, threat signatures, and other performance factors to represent or emulate relevant and validated threats. This Project resources the long-range planning to determine future target needs and development of coordinated requirements; the management of target research, development, test and evaluation, production, and modernization; execution of the validation process to ensure that aerial targets accurately represent the threat; as well as storage and repair parts. The Army is the Test Enterprise Reliance lead for Rotary Wing Targets and Towed Target development and the Tri-Service lead for procurement and enhancement of the MQM-107 fixed wing High Speed Aerial Target."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Target Control Systems (TCS) and aerial target control."
                                    },
                                    "Description": {
                                        "val": "Engineering and Manufacturing Development (EMD) phase contract activities for TCS and aerial target control components."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.674"
                                            },
                                            "Text": {
                                                "val": "Will continue Engineering and Manufacturing Development (EMD) for the aerial target test sets, relays, avionics components, and other aerial ancillary equipment. Will continue to provide for design modifications to solve obsolescence problems and update software to correct anomalies and provide for software performance enhancement modifications to support T&E missions and upgrade test sets and other aerial ancillary equipment. Will continue to update documentation of the system as well as operations and maintenance manuals. Will continue to support operational repair and maintenance with engineering analysis of target control system performance.."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Towed Targets\/Ancillary devices."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase activities for the Towed Targets\/Ancillary devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.746"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the Towed Targets\/Ancillary devices. Will continue development, enhancement, maintenance, and storage for all RDT&E aerial targets, towed targets, and ancillary devices. Continuation of development and testing of Low Cost Towed target systems (Cruise Missile Tow Target and Reduced Radar Tow Target) emulating current threats at a very low cost to Patriot, JLENS and classified customers.  Signature modification and performance enhancement efforts for these targets is ongoing. Investigates\/tests other cost-saving towed systems (Glide-Tow, Towed Spheres, Height-Keeping-Tow, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.557"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for Towed Targets\/Ancillary devices, to include development, enhancement, maintenance, and storage for aerial targets, towed targets, and ancillary devices as needed. Continued development and testing of Low Cost Towed target systems (Sphere Tow, Reduced Radar Tow Target, and the Glide Tow Target) emulating current threats at a very low cost to Patriot, Indirect Fires Protection Capability (IFPC), United States Army Center for Countermeasures\/Office of the Secretary of Defense, and classified customers. Continue signature modification and performance enhancement efforts for these targets. Investigates and tests other cost-saving towed systems (Glide-Tow, Cruise Missile Tow Target, Towed Spheres, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.272"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.272"
                                            },
                                            "Text": {
                                                "val": "Continues EMD for Towed Targets\/Ancillary devices, to include development, enhancement, maintenance, and storage for aerial targets, towed targets, and ancillary devices as needed. Continued development and testing of Low Cost Towed target systems (Sphere Tow, Reduced Radar Tow Target, and the Glide Tow Target) emulating current threats at a very low cost to Patriot, Indirect Fires Protection Capability (IFPC), United States Army Center for Countermeasures\/Office of the Secretary of Defense, and classified customers. Signature modification and performance enhancement efforts for these targets is ongoing. Investigates and tests other cost-saving towed systems (Glide-Tow, Cruise Missile Tow Target, Towed Spheres, and Tow Test Bed) for Air Defense Weapons System customers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Aerial Virtual Targets."
                                    },
                                    "Description": {
                                        "val": "Continue EMD phase activities for Aerial Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.211"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for developmental testing (DT) and operational testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.791"
                                            },
                                            "Text": {
                                                "val": "Will continue engineering and manufacturing for Aerial Virtual Targets for evolving Army and Department of Defense (DoD) simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD Test and Evaluation (T&E) communities. Simulation target models are employed to facilitate simulations for Developmental Testing (DT) and Operational Testing (OT) test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as Close Combat Weapon System (CCWS), Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.426"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.426"
                                            },
                                            "Text": {
                                                "val": "Will continue engineering and manufacturing for Aerial Virtual Targets for evolving Army and DoD simulation standards and evolving implementation techniques; focuses on simulation target models of airplanes, helicopters, missiles, unmanned aerial vehicles, and aerial targets in commonly used formats to support visualization, infrared analysis, and radar analysis simulations; will support verification and validation of models, will provide archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models are employed to facilitate simulations for DT and OT test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will be used by multiple DoD agencies and multiple weapon systems such as, but not limited to CCWS, Unmanned Aerial System, Lower Tier Program offices, and Longbow Hellfire."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Ground Aerial Target Control System (AGATCS)."
                                    },
                                    "Description": {
                                        "val": "EMD phase activities for the AGATCS in support of a modern current technology target control system for control of both aerial and ground targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.614"
                                            },
                                            "Text": {
                                                "val": "Will Continue EMD for AGATCS which provides remote control of aerial (both fixed and Rotary Wing), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness. Complies with DODI 8510.01 mandate \/ DOD Information Assurance Certification and Accreditation Process (DIACAP\/RMF) on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Develops and maintains a small fleet of seaborne and UHV-T assets for use by the T&E community. Provides Test Centers and the T&E community with a  versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation. Acquires and sustains STI to support all test ranges critical to ATEC's requirement for threat representative surface targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.893"
                                            },
                                            "Text": {
                                                "val": "Will continue AGATCS engineering, manufacturing and development to provide remote control of aerial (both fixed and rotary wing), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness. Complies with DoD Instruction (DODI) 8510.01 mandate \/ DOD Risk Management Framework on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for United States (U.S.) Army test ranges. Develops and maintains a small fleet of seaborne and rotary unmanned helicopter vehicle target (UHV-T) assets for use by the Test & Evaluation community. Provides Test Centers and the T&E community with a versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation. Acquires Service Target Instrumentation (STI) to support all test ranges critical to Army Test and Evaluation Command's (ATEC's) requirement for threat representative surface targets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.673"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.673"
                                            },
                                            "Text": {
                                                "val": "AGATCS engineering and manufacturing to provide remote control of aerial (both fixed and rotary wing), ground (heavy, medium, and light vehicles), and seaborne targets with a single control system in support of live fire testing necessary for lethality evaluation and sensor package testing for evaluation of suitability and effectiveness. Complies with DODI 8510.01 mandate \/ DOD Risk Management Framework on all target control systems to ensure a secure operating posture. Meets surface target testing requirements to include formation, collision avoidance, and swarming capabilities for U.S. Army test ranges. Provides Test Centers and the T&E community with a versatile seaborne and rotary wing resource for use in conducting tests to include live fire testing, observation, signal repeater and cargo transportation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unmanned Aerial System - Target (UAS-T)."
                                    },
                                    "Description": {
                                        "val": "Technical updates and life cycle management activities for the UAS-T to provide Threat representative support for test and experimentation missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.597"
                                            },
                                            "Text": {
                                                "val": "Will continue EMD for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions.  Projects to be supported include the Space and Missile Defense Command High Energy Laser project, the JIAMDO sponsored Black Dart 2015, Littoral Combat Ship operational and live fire testing, and a variety of research and development efforts.  Funds will continue to enable the identification and correction of anomalies identified during flight operations and the flight demonstration of the corrective actions.  Funds will continue to provide for limited engineering capability to address minor enhancements to the basic target system to meet shortcomings identified during operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.361"
                                            },
                                            "Text": {
                                                "val": "Will continue technical and life cycle management for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions. Projects to be supported include the Space and Missile Defense Command High Energy Laser Project, the Joint Integrated Air and Missile Defense Organization (JIAMDO) sponsored Black Dart 2018, Littoral Combat Ship operational and live fire testing. This activity will continue to require technical support for investigation, demonstration, and integration of a more economical target, to include technical oversight of the targets' acquisition and ground support equipment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.253"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.253"
                                            },
                                            "Text": {
                                                "val": "Technical and life cycle management for the UAS-T to operate and maintain a generic, tactical class unmanned aircraft system target to support a variety of test requirements by providing a generic threat representative aerial target to support test and experimentation missions. Projects to be supported include the Space and Missile Defense Command and the JIAMDO live fire testing. This activity will continue to require technical support for investigation, demonstration, and integration of a more economical target, to include technical oversight of the targets' acquisition and ground support equipment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Speed Aerial Target (HSAT)."
                                    },
                                    "Description": {
                                        "val": "EMD phase for the replacement of aging HSAT, MQM-107 to provide a realistic aerial target capable of simulating the performance of enemy aircraft; technical and life cycle management activities for equipment, to include engineering change proposals, technology obsolescence, and safety and system data documentation for the HSAT Target. Program requires technical support for investigation, demonstration, and integration of a more economical target. Technical oversight of the replacement targets' acquisition along with Ground Support Equipment (GSE) and other activities related to getting it operational is essential; provides a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the research, development, test, and evaluation of weapons systems and aid in training operational units employing production missile systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.403"
                                            },
                                            "Text": {
                                                "val": "Will continue the EMD for the replacement of aging High Speed Aerial Target (HSAT, MQM-107) that will provide a realistic aerial target capable of simulating the performance of enemy aircraft to aid in the research, development, test, and evaluation of weapons systems and to aid in training operational units employing production missile systems. Funds are required for the replacement HSAT system that will need to be cost effective and able to meet capabilities currently supported by the MQM-107. This program will continue to require technical support for investigation, demonstration, and integration of a more economical target. Technical oversight of the replacement targets' acquisition along with ground support equipment and other activities related to getting it operational is essential. This target will continue to support T&E programs such as Patriot, Stinger, IAMD, Sentinel Radar, CMDS and classified programs for Army and Tri-Service customers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.361"
                                            },
                                            "Text": {
                                                "val": "Funds EMD phase for replacement of mission-essential HSAT system that will be cost effective and meet capabilities currently supported by the MQM-107. Continue life cycle management for the aging HSAT MQM-107. Targets will continue to support T&E programs such as Patriot, Stinger, Integrated Air and Missile Defense (IAMD), Sentinel Radar, Cruise Missile Defense system (CMDS) and classified programs for Army and Tri-Service customers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.196"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.196"
                                            },
                                            "Text": {
                                                "val": "Funds EMD phase for replacement of mission-essential HSAT system that will be cost effective and meet capabilities currently supported by the MQM-107. Will continue life cycle management for the aging HSAT MQM-107. Targets will continue to support T&E programs such as Patriot, Stinger, IAMD, Sentinel Radar, CMDS and classified programs for Army and Tri-Service customers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased developmental effort for replacement of MQM-107 target."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "459"
                    },
                    "ProjectTitle": {
                        "val": "Ground Targets"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.273"
                        },
                        "CurrentYear": {
                            "val": "3.939"
                        },
                        "BudgetYearOne": {
                            "val": "2.315"
                        },
                        "BudgetYearOneBase": {
                            "val": "2.315"
                        },
                        "BudgetYearTwo": {
                            "val": "1.821"
                        },
                        "BudgetYearThree": {
                            "val": "1.526"
                        },
                        "BudgetYearFour": {
                            "val": "0.603"
                        },
                        "BudgetYearFive": {
                            "val": "2.603"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds Army efforts to support test and evaluation (T&E) of advanced weapon systems and supports Army Transformation by developing surrogates, acquiring foreign equipment and developing virtual target computer models of ground vehicle targets. These products are required to adequately stress weapon systems undergoing T&E. This tasking includes long-range planning to determine future target needs and development of coordinated requirement documents; the centralized management of the ground target research, development, test and evaluation processes; execution of the validation process; acquisition of foreign equipment; and continuing maintenance, storage, and development\/enhancement\/update via engineering services of developed and acquired targets to ensure availability for T&E customers. This Project also manages use of current assets and operates a centralized spare parts program. The U.S. Army is the Tri-Service lead for providing mobile ground targets for T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Mobile Ground Target Operations (MGTO)"
                                    },
                                    "Description": {
                                        "val": "MGTO provides oversight of five Primary Operating Centers to include operation, storage, maintenance, repair, safety and configuration management."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.302"
                                            },
                                            "Text": {
                                                "val": "Maintains a fleet of reusable ground targets emulating relevant, current, and emerging threats which provides cost effective solutions for T&E. The objective of the Mobile Ground Target Operations (MGTO) effort is to support the testing community as fully, efficiently and effectively as possible.  The MGTO centrally manages a fleet of foreign threat ground vehicles while maintaining the foreign integrity of the assets.  The MGTO provides support and oversight for actual threat foreign ground vehicles and mobile ground target surrogate vehicles for use as threat targets by the T&E community for destructive and non-destructive scenarios. Efforts will support users such as ATEC, Apache 64E, GMLRS, Brigade Modernization Command, KIOWA, JAGM, Gray Eagle, Add PM Future Fighting Vehicle (FFV), and others."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.216"
                                            },
                                            "Text": {
                                                "val": "Will maintain a fleet of reusable ground targets emulating relevant, current, and emerging threats which provides cost effective solutions for T&E. The objective of the MGTO effort is to support the testing community as fully, efficiently and effectively as possible. The MGTO centrally manages a fleet of foreign threat ground vehicles while maintaining the foreign integrity of the assets.  The MGTO will provide support and oversight for actual threat foreign ground vehicles and mobile ground target surrogate vehicles for use as threat targets by the T&E community for destructive and non-destructive scenarios. Efforts will support users such as Army Test and Evaluation Command (ATEC), Apache 64E, Guided Multiple Launch Rocket System (GMLRS), Brigade Modernization Command, Joint Air to Ground Missile (JAGM), Gray Eagle, and Future fighting Vehicle (FFV)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.257"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.257"
                                            },
                                            "Text": {
                                                "val": "Will maintain a fleet of reusable ground targets emulating relevant, current, and emerging threats which provides cost effective solutions for T&E. The objective of the MGTO effort is to support the testing community as fully, efficiently and effectively as possible.  The MGTO centrally manages a fleet of foreign threat ground vehicles while maintaining the foreign integrity of the assets.  The MGTO will provide support and oversight for actual threat foreign ground vehicles and mobile ground target surrogate vehicles for use as threat targets by the T&E community for destructive and non-destructive scenarios. Efforts will support users such as, but not limited to ATEC, Apache 64E, GMLRS, Brigade Modernization Command, JAGM, Gray Eagle, and FFV."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Ground Targets Hardware (MGTH)"
                                    },
                                    "Description": {
                                        "val": "MGTH provides a mix of actual threat assets and surrogate targets to support Army T&E events."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.005"
                                            },
                                            "Text": {
                                                "val": "Continuing to provide an optimized mix of varying fidelity ground targets to cost-effectively meet the functionality and signature fidelity requirements of the objective force. Will continue to initiate analysis and design efforts to address specific capability shortfalls that include the T-90 and Armata Main Battle Tank signatures and the ability to develop surrogates.  Additionally, the development of air defense artillery (ADA) surrogates are critical to meet the current emerging threat. The acquisition and\/or development of insurgent vehicles is also essential capabilities that are required to defeat emerging threat forces from particular regions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.892"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide an optimized mix of varying fidelity ground targets to cost-effectively meet the functionality and signature fidelity requirements of the objective force. Will continue to initiate analysis and design efforts to address specific capability shortfalls and the ability to develop surrogates. The development of air defense artillery (ADA) surrogates are critical to meet the current emerging threat. The acquisition and development of insurgent vehicles is also an essential capability required to defeat emerging threat forces from particular regions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.682"
                                            },
                                            "Text": {
                                                "val": "Will continue to provide ground targets to meet the functionality and signature fidelity requirements of the objective force. Will continue to initiate analysis and design efforts to address specific capability shortfalls and the ability to develop surrogates. The acquisition and development of insurgent vehicles is an essential capability required to defeat emerging threat forces from particular regions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Ground Virtual Targets"
                                    },
                                    "Description": {
                                        "val": "Government System T&E to support the research and development of Ground Virtual Targets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.966"
                                            },
                                            "Text": {
                                                "val": "Continuing Government System Test and Evaluation to fund the research and development of Ground Virtual Targets for evolving Army and DoD simulation standards and implementation techniques.  Will continue to focus on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; will continue to develop simulation target models visualization simulations, IR analysis simulations, and RF analysis simulations; will continue to support verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models will continue to be employed to facilitate simulations for both DT and OT; Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will continue to be used by multiple DoD agencies and multiple weapon systems such as the JAGM and Longbow Hellfire offices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.831"
                                            },
                                            "Text": {
                                                "val": "Will continue Government System T&E for evolving Army and DoD simulation standards and implementation techniques for Ground Virtual Targets. The focus is on simulation target models of wheeled and tracked ground vehicles in commonly used model formats; will continue to develop simulation target models visualization simulations, infrared analysis simulations, and radio frequency analysis simulations. Will support verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities. Simulation target models will continue to be employed to facilitate simulations for both developmental and operational testing; Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will continue to be used by multiple DoD agencies and multiple weapon systems such as the JAGM and Longbow Hellfire offices."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.376"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.376"
                                            },
                                            "Text": {
                                                "val": "Will support verification and validation of models, and provides archiving and distribution of simulation target models to simulation developers throughout the Army and DoD T&E communities.  Simulation target models will continue to be employed to facilitate simulations for both developmental and operational testing; Virtual Targets support test planning, test rehearsal, post-test analysis, hardware-in-the-loop testing, and execution of test events that are too costly or difficult to be conducted under actual field conditions. These models will continue to be used by multiple DoD agencies and Army weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Realignment of civilian pay to the Operations and Maintenance, Army (OMA) appropriation in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}