{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-21",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602784A"
        },
        "ProgramElementTitle": {
            "val": "Military Engineering Technology"
        },
        "R1LineNumber": {
            "val": "26"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "92.140"
            },
            "CurrentYear": {
                "val": "67.720"
            },
            "BudgetYearOne": {
                "val": "78.159"
            },
            "BudgetYearOneBase": {
                "val": "78.159"
            },
            "BudgetYearTwo": {
                "val": "80.145"
            },
            "BudgetYearThree": {
                "val": "82.085"
            },
            "BudgetYearFour": {
                "val": "83.807"
            },
            "BudgetYearFive": {
                "val": "85.486"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "569.542"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates and advances technologies, techniques, and tools for representation of the physical and human environment for use in military planning and operations; for characterizing geospatial, atmospheric, and weather conditions and impacts on systems and military missions; for conducting mobility, counter-mobility, survivability, and force protection planning and operations; and for enabling secure, sustainable, energy efficient facilities. Research focuses on special requirements for battlefield visualization, tactical decision aids, weather intelligence products, and capabilities to exploit space assets. Project 855 conducts geospatial research and development supporting a standard sharable geospatial foundation enabling a common operating environment across mission and command systems. Project H71 supports the materiel development, testing, and operations communities in evaluating the impacts of weather and atmospheric obscurants on military materiel and operations. Project T40 advances force protection technologies across the range of military operations, including expedient protection and hardened construction to defeat complex threats. This Project also designs and develops software and hardware to identify and mitigate ground obstacles for manned and unmanned vehicles; characterizes austere navigation environments, including complex urban environments, and designs and develops materiel solutions, including rapidly emplaced bridging and expedient repair technologies, to allow austere port and airfield entry of forces; and builds and uses modeling and simulation tools to advance understanding of the interactions of weapons\/munitions and novel defeat methodologies with protective construction and critical infrastructure. Project T41 investigates application of technologies to enable garrison\/post commanders to plan, monitor, and operate facilities more efficiently, cost-effectively, securely, and sustainably; creates tools (including advanced models and simulations) that provide a framework for making trades and decisions; and supports research to assess non-combat population characteristics and status from social and cultural perspectives to achieve mission objectives. Project T42 develops and validates models and simulations to understand the impacts of the physical environment on the performance of forces, ground and air vehicles, and sensors; as well as the impact of natural and man-made changes in the environment on military operations. Project T45 investigates materials, components, and systems that have potential to reduce energy losses in buildings and shelters; and potential to detect and mitigate consequences of contaminants, such as bacteria and molds, in air handling equipment and building materials.  \n \nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy. The Ground Portfolio technology investments are enabling Power Projection. \n\nResearch is transitioned to PE 0603734A (Military Engineering Advanced Technology).  \n\nWork in this PE is performed by the Army Engineer Research and Development Center (ERDC) and the Army Research, Development and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "67.416"
                },
                "CurrentYear": {
                    "val": "67.72"
                },
                "BudgetYearOne": {
                    "val": "72.097"
                },
                "BudgetYearOneBase": {
                    "val": "72.097"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "92.14"
                },
                "CurrentYear": {
                    "val": "67.72"
                },
                "BudgetYearOne": {
                    "val": "78.159"
                },
                "BudgetYearOneBase": {
                    "val": "78.159"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "24.724"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "6.062"
                },
                "BudgetYearOneBase": {
                    "val": "6.062"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "23"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.767"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "6.062"
                                },
                                "BudgetYearOneBase": {
                                    "val": "6.062"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY17 Congressional increase of $23M in T53 Military Engineering Applied Research."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "855"
                    },
                    "ProjectTitle": {
                        "val": "Topographical, Image Intel & Space"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "17.771"
                        },
                        "CurrentYear": {
                            "val": "18.09"
                        },
                        "BudgetYearOne": {
                            "val": "18.181"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.181"
                        },
                        "BudgetYearTwo": {
                            "val": "18.564"
                        },
                        "BudgetYearThree": {
                            "val": "18.946"
                        },
                        "BudgetYearFour": {
                            "val": "19.344"
                        },
                        "BudgetYearFive": {
                            "val": "19.731"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "130.627"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and advances capabilities for collection, processing, and creation of data and information depicting physical and human terrain, environmental conditions, and relationships in time and space; digital map creation, transmission, and dissemination; and map-based analytics for planning, decision making, and execution. This Project uses non-traditional methods that exploit existing open source text, multi-media, and cartographic materials addressing social, cultural, and economic geography to advance the capability to produce and transmit high fidelity digital maps depicting the physical terrain, human terrain, and environmental conditions. This Project also develops software tools and methods for map-based analytics that allow deeper insights into the effects of the physical terrain, human terrain, and environmental conditions on military operations, to include tactics and effects upon equipment and Soldier performance. This Project explores and advances components and methods that optimize the utility of the Army Geospatial Enterprise (AGE) to the total Army, which provides map and geospatial data, information, and software services to the total force.\n\nWork in this Project complements efforts in Program Element (PE) 0602784A, Project H71.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Geospatial Data Collection, Processing, and Decision Support (Previously titled GeoIntelligence - Geospatial Data Generation and Decision Support)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates novel map content generation and geo-temporal analytics for the development of geospatially-based decision support tools.  This research focuses on automatic inference and the correlation between events and objects (i.e., people, places) through space and time from massive data sets developed in the Geoenabled Computing Environments effort. In addition, the effort investigates advanced models to forecast effects of the physical terrain, human terrain, and environment for applications to the Military Decision Making Process, an analysis that informs course of action development and evaluation of tactics, equipment, and mission risk."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.118"
                                            },
                                            "Text": {
                                                "val": "Will complete development of a new algorithm suite to enable rapid processing and searching of high volume multi-modal spatiotemporal datasets for revealing and illuminating relevant embedded relationships, spatiotemporal threads, and discoverable meaningful patterns associated with human geography (e.g., actors, places, events, and time); research new terrain analytics and tactical decision aids supporting Warfighter tactical operations in 3D dense urban terrain environments by providing hazard identification and mitigation, remote feature classification, and 3D terrain analysis techniques; and develop rapid tools for characterization of hazardous urban terrain effects, the detection and identification of urban and peri-urban feature classes using remotely sensed data, and input layers for geospatial analytics enabling multi-source, urban-relevant data enterprise integration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.769"
                                            },
                                            "Text": {
                                                "val": "Investigate advanced analytical and streaming methods for geo-registering and provisioning critical infrastructure symbology to system displays supporting mounted and dismounted Warfighter situation awareness."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.101"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.101"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging computational models to increase the tempo of small unit tactical decision making through spatial reasoning, analysis, and multi-domain information and data fusion toward narrative information packages aligned with the current mission and situation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase to meet Army priority for Network\/C3I."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Geospatial Data Analysis and Decision Support"
                                    },
                                    "Description": {
                                        "val": "This effort develops means to collect, process, and visualize very high-fidelity data and information to capture the dynamic effects of the physical and human terrain impacting military ground operations. The research focuses on tactical, rather than national or commercial, remote sensing of physical terrain to achieve the fidelity required for current and future operations. Research includes investigating new methods for effective sensor systems and materials to 'tag' features, items, and people of interest based upon novel and emerging Light Detection and Ranging (LiDAR) sensor systems, innovative LiDAR collection and analysis techniques, and an array of other sensor systems for intermittent and persistent optimal data collection, object identification, and classification for ground operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.43"
                                            },
                                            "Text": {
                                                "val": "Will conduct research on terrain feature extraction important to mission planning to provide the terrain and image analyst access to surface roughness, vegetation density, characterization of built-up areas, and near ground obstacles; investigate laser detection and ranging (LADAR) sensors for base force protection through physical mounting integration, mast stabilization optimization, and software techniques enabling anomaly detection, change assessment, and sensor cueing capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.686"
                                            },
                                            "Text": {
                                                "val": "Investigate new capabilities to characterize and extract (identify and map) features of interest under forest canopies such as encampments, small buildings, trails, etc. at high fidelity; develop algorithms and workflows to generate critical and accurate mapping data for units at the tactical level; and integrate frequency-modulated, continuous wave (FMCW) laser scanner into base security and defense sensor suite for 3D terrain rendition and persistent surveillance and target identification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.015"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.015"
                                            },
                                            "Text": {
                                                "val": "Will investigate enhanced utility and quality of 3D imagery for wide area mapping and surveillance of dense urban areas; will assess utility and sufficiency of Geiger mode LiDAR prototype for wide area mapping at increasingly higher altitudes and increasing area coverage rates; and will research emerging remote sensing technologies for a multi-modal, tiered sensing approach to rapidly increase density and quality of 3D urban environment data, merging exterior, interior and below ground geospatial information."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increase  to meet Army priority for Network\/C3I."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Geography - Spatial Reasoning, Analysis, and Visualization"
                                    },
                                    "Description": {
                                        "val": "This effort investigates integration of behavior and population dynamics research and analysis into geospatial frameworks to depict the operational environment including culture, demographics, terrain, climate, and infrastructure. Research exploits existing open source text, leverages multi-media and cartographic materials, and investigates data collection methods to ingest geospatial data directly from the tactical edge to characterize parameters of social, cultural, and economic geography. Results of this research augment existing conventional geospatial datasets by providing the rich context of the human aspects of the operational environment, which offers a holistic understanding of the operational environment for the Warfighter. This item complements the work in PE 0602784A\/Project T41."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.007"
                                            },
                                            "Text": {
                                                "val": "Will research and design a framework to investigate the impacts of environmental stressors (e.g. water security) on populations and military operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.06"
                                            },
                                            "Text": {
                                                "val": "Investigate means for a repeatable methodology to incorporate social-cultural influences (e.g., civil considerations) into the military decision making process by identifying the critical conduits through which actors exercise power; and research existing authoritative data sources and potential new sources for factoring environmental and climate-related risks into long range military planning scenarios supporting theater engagement plans."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.065"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.065"
                                            },
                                            "Text": {
                                                "val": "Will develop beta model for estimating future risks and impacts of extreme weather and climate variability on water, energy and food systems to inform the Joint Preparation of the Operational Environment; and will develop critical enhancements to the suite of methods and tools supporting mission analysis for civil-military operations to enhance stability and mitigate threats to the civilian population."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decrease due to progression of effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Weather and Terrain Integration"
                                    },
                                    "Description": {
                                        "val": "This effort investigates innovative methods for integrating weather and physical terrain applications with geospatial systems compliant with the Army?s Common Operating Environment approach to the Army Geospatial Enterprise thereby providing significant advancement to fused all-weather and all-season tactical decision aids supporting risk-based assessments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.455"
                                            },
                                            "Text": {
                                                "val": "Will complete uncertainty and sensitivity analysis of stand-off soil moisture assessments and comparisons to further mature real-time mapping of moisture levels and develop improved tactical mobility forecasts; and investigate new visibility algorithms based on dust, aerosol, and humidity fields for line of sight representation in a Situationally Aware Geospatially Enabled (SAGE) terrain analysis decision aid."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.59"
                                            },
                                            "Text": {
                                                "val": "Investigate a risk-based, geospatially grounded decision support tool using multi-criteria decision analysis to facilitate a modeling environment that enables risk-informed mission decisions based on criteria including time available, physical distance, terrain or infrastructure requirement, and acceptable mission risk; and provide analytical tools that seamlessly integrate changes in the physical battlespace in near-real time with terrain based tactical decision aids, such as mounted and dismounted mobility, line of sight, and potential choke points."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Map-Based Planning Services (MBPS)"
                                    },
                                    "Description": {
                                        "val": "This effort develops geospatially-enabled, collaborative mission planning capabilities providing services, data, and information to Army planners, staffs, and leaders. These mission planning capabilities will allow collecting, processing, storing, displaying, and sharing of authoritative data and information in a geo-temporal context. Work will leverage Army Geospatial Enterprise standard data sets and incorporate Geo-Enabled Mission Command tools and analytical capabilities. Resultant work products proceed into Program Element 0603734A, Project T08."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.761"
                                            },
                                            "Text": {
                                                "val": "Will develop approaches to enable Army planners at multiple echelons and at distributed locations to exploit a common geospatial framework within the planner enclave for concurrent planning; and investigate migration of planners? tools and services to a web-based capability"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.985"
                                            },
                                            "Text": {
                                                "val": "Develop a geospatially enabled collaborative mission planning environment that provides services, authoritative data access, and information to distributed Army planners, staffs, and leaders, to enable the collection, processing, storing, displaying, and sharing of authoritative data\/information in a geo-temporal context; and investigate adaptation of existing and developed intelligence preparation of the battlefield and military decision making process capabilities into the digital planning process."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completes in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geo-enable Computing Environments"
                                    },
                                    "Description": {
                                        "val": "This effort develops geospatially-enabled, collaborative mission planning capabilities providing services, data, and information to Army planners, staffs, and leaders. Work leverages Army geospatial enterprise standard data sets and incorporate geo-enabled mission command tools and analytical capabilities."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4"
                                            },
                                            "Text": {
                                                "val": "Will investigate a compatible framework for sharing a relevant and focused geospatially enabled visualization of the operational environment within the command post computing environment; investigation will focus on geospatial-enabled collaborative mission planning capabilities providing services, data, and information to the Army planners, staffs, and leadership."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New effort begins in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H71"
                    },
                    "ProjectTitle": {
                        "val": "Meteorological Research For Battle Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.47"
                        },
                        "CurrentYear": {
                            "val": "6.628"
                        },
                        "BudgetYearOne": {
                            "val": "5.676"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.676"
                        },
                        "BudgetYearTwo": {
                            "val": "5.812"
                        },
                        "BudgetYearThree": {
                            "val": "5.95"
                        },
                        "BudgetYearFour": {
                            "val": "6.07"
                        },
                        "BudgetYearFive": {
                            "val": "6.192"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.798"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project develops tactical weather and atmospheric effects\/impacts algorithms for their integration into battlefield information products. Efforts include high-resolution, local assessments and forecasts of meteorological conditions in near real time including effects of urban and mountainous terrain; analytical tools to assess the impact of the atmosphere to optimize system performance and operations planning and advanced atmospheric sensing applications to characterize and mitigate wind and turbulence in complex terrain. It provides detailed model applications for various effects of the atmosphere on electro-optical and acoustic target detection, location, and identification. This Project develops both physics-based decision aids and rule-based decision support systems for assessing the impacts of weather\/atmosphere across a spectrum of friendly and threat weapons systems, sensors, platforms, and operations. Information can be applied to mission planning and execution, battlefield visualization, reconnaissance surveillance and target acquisition, route planning to maximize stealth and efficiency, web enabled tactical decision aids, and also modeling of environmental impacts for combat simulations and war games.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThis work transitions technologies to the Department of Defense weather and operations modeling community, the US Air Force 557th Weather Wing to improve their operational weather support to the Army Project Leader-Fire Support Command and Control and Marine Corps Systems Command (MCSC) for field artillery systems, the Project Manager, Distributed Common Ground System-Army (DCGS-A), the Joint Improvised Threat Defeat Agency, the Program Executive Office Aviation\/Tactical Airspace Integration System (TAIS)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Atmospheric Characterization, Modeling, and Impacts (formerly Atmospheric Modeling)"
                                    },
                                    "Description": {
                                        "val": "This effort develops high resolution, short-range forecasting, and high resolution atmospheric modeling capabilities for mountainous, urban, and forest complex terrain."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.12"
                                            },
                                            "Text": {
                                                "val": "Will refine and mature Meteorological Sensor Array (MSA) computer applications that provide non-standard sensing capabilities for the atmospheric boundary layer, including novel employment of weather sensing small unmanned aircraft systems (UAS) vehicles; develop MSA systems at multiple sites to study atmospheric characteristics in different microclimate\/terrain regimes; conduct research to quantify climate and weather impacts on the design and deployment of renewable energy systems that are operationally relevant to the Army; conduct research, analysis, and software development to quantify the effects of weather on systems and operations; complete initial studies addressing integration of probabilistic and uncertainty forecasts into decision support tools (DSTs); fully-integrate various sources of observational data into the forecast model assessment processes, utilizing Geographic Information System-based and other advanced assessment techniques; fully evaluate the benefits of assimilated Doppler wind LIDAR data into microscale models to improve predictions of winds in the atmospheric boundary layer over complex terrain; conduct initial capability studies addressing high-resolution atmospheric model performance as related to sensor performance; conduct applied research to better characterize the impact of airborne aerosols on electro-optical propagation; apply appropriate techniques to the mitigation of atmospheric turbulence on the propagation of electro-optical signals; and improve the performance of DSTs for acoustics propagation and characterizing the state of the atmosphere."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.622"
                                            },
                                            "Text": {
                                                "val": "Fully adapt a hybrid assimilation methodology by which meteorological data types representative of battlefield conditions may be ingested into numerical weather prediction models for enhanced forecast accuracy; demonstrate the efficacy of Geographic Information System (GIS) analytical techniques for forecast model accuracy assessments; apply intuitive, qualitative indicators of forecast confidence to meteorological data output and weather impacts displays; establish quantified performance criteria for an optical imaging system that mitigates image degradation due to atmospheric optical turbulence; enhance capabilities of route optimization tactical decision aid to minimize aircraft acoustic signatures and to account for soil type and terrain steepness affecting ground vehicle mobility and maneuver; and, implement parallel processing architectures in Personal Electronic Devices (PEDs) to allow mobile execution of weather forecast models; develop initial forward-deployed capability to integrate atmospheric prediction\/weather decision aid applications into unified environmental awareness system supporting robotics and autonomous systems; and refine atmospheric acoustic signal propagation models with data collected at the MSA."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.676"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.676"
                                            },
                                            "Text": {
                                                "val": "Will research and develop decision support technology, including characterizing atmospheric impacts on and optimized paths for hypersonic munitions; will research and develop enhancements to automated routing capabilities to include accounting for acoustic signatures of air\/ground platforms in varying environments (e.g. complex terrain and dense urban environments); will develop and implement methods for decision support tools to ingest and represent probabilistic components and forecast certainty\/uncertainty of atmospheric prediction models; will develop a densely-instrumented urban environmental testbed with the MSA to characterize urban flow processes under varied background meteorological conditions; develop system for optimizing Weather Running Estimate-Nowcast (WRE-N) configuration based on geographical characteristics including system verification and validation; will optimize the atmospheric boundary layer environment using Lattice Boltzman method (ABLE-LBM) dynamical core for use on small platforms with accelerator cards; will demonstrate capability of incorporating unmanned aerial systems (UAS) and other local data sources into a networked- constrained Nowcast model; will develop tailored model for improved autonomous system performance; will refine of next generation atmospheric acoustic decision support tool used to determine the detection footprint of small UAS by investigating physics constrained machine learning"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Slight increase to advance modeling capability."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Local Area Atmospheric Prediction for Geospatial Applications (formerly Atmospheric Prediction for Local Areas)"
                                    },
                                    "Description": {
                                        "val": "This effort designs and determines software models and sensors to improve local characterization and prediction of atmospheric conditions in urban and complex terrain by directly integrating atmospheric boundary layer (the lowest part of the atmosphere in contact with the surface) meteorological measurements into high resolution models and decision aids and validates these improvements with field measurements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.35"
                                            },
                                            "Text": {
                                                "val": "Will conduct very fine-scale nowcast modeling research using the Weather Research and Forecasting (WRF) model, the WRF coupled with atmospheric chemistry (WRF-Chem) model, and other appropriate models to address dust lofting and model coupling to terrain\/trafficability models; complete model resolution tests of acoustic sensor performance to determine optimized model configurations and resolutions for operational use; configure and complete acoustic sensor\/atmospheric modeling field experiments to validate the model resolution conclusions; and design and complete sub-kilometer atmospheric modeling studies linking land surface models with WRF to improve soil strength and terrain trafficability models."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.006"
                                            },
                                            "Text": {
                                                "val": "Conduct acoustic sensor\/atmospheric modeling field experiments to validate model resolution results; assess validity of foundation model for use in elevated dust events; and deliver sub-kilometer model configuration options to effectively link coupled land-surface and atmospheric models for improved vehicle trafficability and routing models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This effort was deemphasized to support other programs that more closely align to Army priorities."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T40"
                    },
                    "ProjectTitle": {
                        "val": "Mob\/Wpns Eff Tech"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "27.827"
                        },
                        "CurrentYear": {
                            "val": "27.955"
                        },
                        "BudgetYearOne": {
                            "val": "32.567"
                        },
                        "BudgetYearOneBase": {
                            "val": "32.567"
                        },
                        "BudgetYearTwo": {
                            "val": "33.768"
                        },
                        "BudgetYearThree": {
                            "val": "34.556"
                        },
                        "BudgetYearFour": {
                            "val": "35.29"
                        },
                        "BudgetYearFive": {
                            "val": "35.997"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "227.960"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates, designs, and develops technologies for adaptive and expedient force protection and projection across the range of military operations.  Focus areas include force projection and maneuver, including austere port and airfield entry; prediction, definition, avoidance, or defeat of natural and manmade gaps and obstacles to support ground force operations; scalable weapons effects; and high-resolution representation of near-surface terrain and environment for use with sensor models for target detection and unmanned ground systems (UGS) navigation. This research also provides physics-based representations of ground vehicle mobility, obstacle and barrier placement, survivability, and weapons effects in complex and urban terrain modeling and simulation. Work in this Project increases the protection of soldiers and critical assets from conventional, unconventional, and emerging threats and enables maneuver support of ground forces, while reducing their logistical footprint. This Project supports efforts for overcoming critical capability gaps for operations in a number of environments including dismounted Soldiers conducting missions in urban and subterranean environments, distributed small units, and projection and sustainment of forces across an increasing large battlefield.      \n\nWork in this Project supports the Army Science and Technology Ground Maneuver, Command, Control, Communications, and Intelligence (C3I), Environment and Terrain, and Soldier Portfolios.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priorities for Air Missile Defense and Next Generation Combat Vehicle.\n\nThis work is fully coordinated with and complementary to Program Element (PE) 0603734A (Military Engineering Advanced Technology). Autonomous ground resupply activities are coordinated in collaboration with the Tank and Automotive Research, Development and Engineering Center (TARDEC) through PE 0603005A (Combat Vehicle and Automotive Advanced Tech) \/ Project 515 (Robotic Ground Systems), PE 0602601A (Combat Vehicle and Automotive Technology) \/ Project H77 (National Automotive Center), and PE 0602601A (Combat Vehicle and Automotive Technology) \/ Project H91 (Ground Vehicle Technology). Autonomous Ground Resupply activities are also coordinated in collaboration with the Armament Research Development and Engineering Center (ARDEC) through PEs 0603001A (Warfighter Advanced Technology) \/ Project 543 (Ammunition Logistics), PE 0604639A (Weapons and Munitions - Advanced Development) \/ EC3 (Ammunition Logistics Prototyping), and 0605805A (Munitions Standardization, Effectiveness and Safety) \/ Project 297 (Mun Survivability & Log). Unconventional Countermeasure activities are coordinated with PE 0602720A (Environmental Quality Technology) \/ Project 835 (Mil Med Environ Crit) and PE 0603728 (Environmental Quality Technology Demonstrations) \/ Project 03E (Environmental Restoration Technology)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Adaptive Protection"
                                    },
                                    "Description": {
                                        "val": "This effort develops new analytical techniques, advanced materials, and integrated protection systems to support the protection of critical assets on the battlefield. Technology development efforts include techniques and materials to protect fixed and semi-fixed assets and soldiers in complex, urban and contested environments; techniques to increase survivability through unconventional means and advanced hardening material solutions; and techniques to identify subterranean threats against forces and critical assets."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "11.058"
                                            },
                                            "Text": {
                                                "val": "Will conduct experiments to determine the blast and penetration performance of cast-in-place protective structural components made with indigenous materials. Will develop geophysical linear sensor systems in support of tactical security systems. Will increase and refine blast prediction M&S capabilities of HMEs and expand soil and condition databases. Will develop technologies to detect tunnels and subterranean activities for protection of forces and critical assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.988"
                                            },
                                            "Text": {
                                                "val": "Develop modeling and simulation (M&S) tools to predict structural response\/damage to support regional tradespace analysis; develop and improve the adaptive capabilities to rapidly and comprehensively model the blast from a wide-range of recent and emerging non-ideal HMEs in a variety of soil types and conditions; develop materials and advanced force protection decision support tools for use in complex and dense urban environments; develop advanced integrated unconventional countermeasure methods and materials to enhance survivability against advanced and emerging threats; and develop technologies to more accurately detect subterranean threats for protection of small distributed units and urban and critical assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.834"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.834"
                                            },
                                            "Text": {
                                                "val": "Will develop algorithms to predict a range of threat weapon effects on relevant urban construction types and design an assessment tool to ensure safe building occupation decisions; will develop and examine rapid signature reduction materials and methods to increase critical asset survivability; will develop perimeter security and surveillance technologies and algorithms to detect, track, and classify surface, maritime, and subterranean threat activities; will design and develop new protective technologies to defeat future near-peer adversarial threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased investment in unconventional countermeasures and protective technologies to defeat future near-peer adversarial threats."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Austere Entry and Maneuver"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates tools and technologies that identify, assess, and monitor structural and functional suitability of theater access points and infrastructure. This effort investigates materials and models to rapidly repair or construct infrastructure to support power projection and maneuver. This effort creates tools that allow planning of distributed sustainment nodes and tactical logistics resupply networks across the complex, contested battlefield. This effort, investigates techniques and creates tools to simulate manned\/unmanned tactical maneuver and mobility of small disbursed units in complex and urban terrains."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.566"
                                            },
                                            "Text": {
                                                "val": "Will continue development of dynamic environmental vehicle simulation tools to support autonomous ground resupply operations. Will complete development of a planning tool for comparing early entry alternative courses of action for a logistics distribution network. Will continue refinement of remote and standoff assessment techniques for airports and seaports of debarkation for austere entry assessment. Will begin an effort to predict vehicle movement in complex and urban environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.956"
                                            },
                                            "Text": {
                                                "val": "Complete development of technologies for planning and conducting Anti-Access\/Area Denial (A2\/AD) entry operations without airfields\/ports and with damaged\/destroyed airfields\/ports; develop a fused multi-component imagery and infrasound data method for persistent critical infrastructure modeling in dynamic environments; and develop baseline model and simulation tools for autonomous ground resupply operations; and continue development of mobility decision support tools."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.377"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.377"
                                            },
                                            "Text": {
                                                "val": "Will provide an updated version of a real-time hardware-in-the-loop simulation environment to investigate autonomous vehicle maneuver; will develop software to automatically detect mobility obstacles in near-real time; will develop algorithms and begin interface design to automate analyses of seismic-infrasound-acoustic-meteorological (SIAM) data for non-subject matter expert use while monitoring infrastructure; will identify materials and technologies for modeling efforts to assess and plan projection and protection for dispersed small units in extreme, constantly evolving, and complex environments; will begin physics-based modeling efforts to predict projection material performance under repetitive loading during projection operations; will identify and examine new materials to reduce weight, increase durability, and enable rapid constructability during force projection and sustainment operations."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased investment in materials modeling for force projection."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Environmental Impacts on Sensor Performance"
                                    },
                                    "Description": {
                                        "val": "This effort investigates, designs, and creates physics-based, multiscale numerical models of the geo-environment and synthetic environments representing geo-environment impacts on various sensor modalities and systems. These enable the development of sensors and sensor algorithms for object or target detection, sensor-target pairing, unconventional countermeasures experiments, and autonomous navigation and tactical behaviors in unmanned ground systems. This effort further investigates the design of non-line-of-sight sensors for remote areas, including the investigation of coupling between sensors and their environment for understanding surface and subsurface activities. This effort supports persistent surveillance and detection capabilities and air missile defense."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.965"
                                            },
                                            "Text": {
                                                "val": "Will integrate HPC-enabled models with Night Vision and Electronic Sensors Directorate?s hyperspectral sensors to simulate the geo-environmental impact on performance of multi-modal imaging sensor combinations for threat scenarios. Will continue development of advanced analytic tools to determine detection performance of multi-modal and spectral sensor combinations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.745"
                                            },
                                            "Text": {
                                                "val": "Complete development of HPC-enabled models and advanced analytic tools combined in a simulation workflow manager; and investigate fusion of multi-sensor performance predictions and use of a tradespace framework to compare performance, cost, and availability for specific geo-environmental settings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.943"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.943"
                                            },
                                            "Text": {
                                                "val": "Will develop computational capabilities to investigate unconventional countermeasures to enhance the protection of critical assets;  and will develop new and expand current computational test bed capabilities to simulate dynamic adaptive sensing technologies in emerging threat environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials Modeling"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and leverages physics-based computational models and laboratory experiments to understand the relationships between the chemical and micro-structural composition of materials and their performance characteristics when used in protecting facilities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.238"
                                            },
                                            "Text": {
                                                "val": "Will continue to develop and validate multi-scale high performance protective materials, predictive design tools, and material models; will continue to develop methods to predict constituent material properties of cementitious and polymeric materials at multiple scales to optimize performance; will continue to integrate novel processing and additive manufacturing methodologies into material system design and fabrication methods to support the maturation of advanced protective solutions; these efforts support the development of the next generation of high performance materials for force and critical asset protection against advanced threats."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.266"
                                            },
                                            "Text": {
                                                "val": "Develop and validate advanced protective material solutions including novel composites, lightweight metals, ceramics, coatings, polymers, and other non-cementitious materials; continue virtual material by design development and advanced mico- and meso-scale simulations to predict engineering properties in the resultant macro-scale materials; and investigate material fabrication and manufacturing methods for layered protective systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.413"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.413"
                                            },
                                            "Text": {
                                                "val": "Will provide the first spiral of a virtual material by design procedure to predict engineering properties for force protection material performance; and will continue laboratory investigations of novel composites, ceramics, polymers, and other non-cementitious materials for layered force protection methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Planned progression of the effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T41"
                    },
                    "ProjectTitle": {
                        "val": "Mil Facilities Eng Tec"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.104"
                        },
                        "CurrentYear": {
                            "val": "6.457"
                        },
                        "BudgetYearOne": {
                            "val": "10.699"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.699"
                        },
                        "BudgetYearTwo": {
                            "val": "10.893"
                        },
                        "BudgetYearThree": {
                            "val": "11.113"
                        },
                        "BudgetYearFour": {
                            "val": "11.344"
                        },
                        "BudgetYearFive": {
                            "val": "11.571"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "68.181"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and develops technologies and techniques to support robotic and autonomous operations capabilities, ensure sustainable, cost efficient, and effective facilities, and to achieve resilient and sustainable installation and expeditionary operations. The project focuses on facilities and operations technologies directly supporting training, readiness, force projection, force protection, and homeland security. Facility enhancement technologies contribute to cost reductions in the Army facility life cycle process (infrastructure planning, assessment, design, construction, revitalization, sustainment, and disposal), and the supporting installation operations. This work improves the capability of autonomous engineering during combat operations to perform construction and supporting tasks in high risk\/threat and dynamic environments, enables installations to support forces to meet transformation goals, improves designs for close battle training facilities, and enhances security of Soldiers, families, and civilians. Technologies evolving from this work include integrated planning and design tools for United States (U.S.) facilities and on-demand expeditionary structures, models predicting water dispersed contaminant effects on facilities and occupants; sustainable facility and base management; collaborative decision support tools; and advanced materials. In addition, technologies from this work will support analysis of socio-cultural and facility issues in contingency operations, including urban environments.  \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priority for Next Generation Combat Vehicle."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrastructure for Combat Operations (Previously titled Adaptive and Resilient Installations)"
                                    },
                                    "Description": {
                                        "val": "The Army requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This effort provides tools for the assessment of physical and ecological impacts on operations, agile infrastructure modification, and custom?designed construction for expeditionary structures on?demand."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.62"
                                            },
                                            "Text": {
                                                "val": "Will develop a suite of physics-based models and simulations to perform structural, energy, and protection analysis of digital designs used for automated construction of expeditionary structures. Will conduct simulations to generate tradespace analyses for prototype model development. Will develop a prototype tool to assess the impact of physical, ecological, and sociocultural environments relative to contingency base site selection, design, operations, and maintenance to support operational planning."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.814"
                                            },
                                            "Text": {
                                                "val": "Investigate potential impacts to contingency basing operational effectiveness due to location, duration, size (area and population), effects on sociocultural context, and changes in mission; and investigate and design a systematic approach to identify and model current and future permafrost and ground ice impacts on built infrastructure, operational training, and deployment design considerations in arctic and sub-arctic environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.999"
                                            },
                                            "Text": {
                                                "val": "Will design and develop a prototype decision tool to identify types of additional design scenario variables that relate to the social, cultural, economic and political conditions that impact operational planning; and will investigate approaches to fully integrate enterprise business processes and information infrastructure across Army power projection platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decreased investment to accelerate Robotics for Engineering Operations"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Human Geography ? Fundamentals of Behavior and Population Dynamics"
                                    },
                                    "Description": {
                                        "val": "This effort researches population dynamics including physical, cultural, psychological, and behavioral attributes critical to United States Army engagement activities in an area of operations, including urban environments. Technology development efforts include means to identify dynamic indicators in the socio-cultural realm to assist in estimating or predicting behavioral response to operations and to display indicators in spatial-temporal views for the Warfighter. This effort complements the work in Program Element 0602784A (Military Engineering Technology) \/ Project 855 (Topographical, Image Intel & Space)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.484"
                                            },
                                            "Text": {
                                                "val": "Will investigate and design a framework for integrating social-cultural dynamics (human aspects of the operational environment) encountered in dense urban environments into mission planning and execution.."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.643"
                                            },
                                            "Text": {
                                                "val": "Investigate methods for military assessment of population vulnerability and resilience disruptors as a result of combat, disasters, disease, etc., within dense urban and complex environments; research computational models to support a federated model approach for complex urban systems; and develop methodologies to support the military decision making process addressing the impacts of the physical, ecological, and sociocultural environments relative to contingency base site selection, design, operations and maintenance."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.659"
                                            },
                                            "Text": {
                                                "val": "Will develop a workflow and methodology to incorporate key authoritative Civil Affairs sociocultural datasets into the Army?s military decision making process for informing intelligence preparation of battlefield products for civil considerations and the commander?s critical information requirements; and will develop a computational framework to integrate multi-scale computational models of environmental, infrastructural, and social systems, enabling information support to the Joint Intelligence Preparation of the Operational Environment (JIPOE) within complex environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate robotic engineer construction equipment capability allowing Engineers to conduct autonomous and semi-autonomous Mobility, Countermobility and Construction missions. This effort supports the Army?s Modernization Priority Next Generation Combat Vehicle (NGCV), Maneuver Robotics and Autonomous Systems, and is intended to provide capabilities that enable and increase the effectiveness of future maneuver formations with extended reach (area and time), by enabling increased force survivability by combining manned and robotic teaming in the conduct of cross-domain maneuver in complex terrain while reducing risk to Soldier and units."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.041"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.041"
                                            },
                                            "Text": {
                                                "val": "Will develop robotic construction equipment capabilities allowing Engineers to conduct autonomous and semi-autonomous mobility, countermobility and construction missions. Design proof of concept for a prototype robotic obstacle-removal platform, and develop advanced construction methods for deployed forces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start program in FY19"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T42"
                    },
                    "ProjectTitle": {
                        "val": "Terrestrial Science Applied Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.693"
                        },
                        "CurrentYear": {
                            "val": "5.12"
                        },
                        "BudgetYearOne": {
                            "val": "5.127"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.127"
                        },
                        "BudgetYearTwo": {
                            "val": "5.232"
                        },
                        "BudgetYearThree": {
                            "val": "5.371"
                        },
                        "BudgetYearFour": {
                            "val": "5.483"
                        },
                        "BudgetYearFive": {
                            "val": "5.593"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "37.619"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and advances technologies to characterize and respond to impacts of the terrestrial environment on the performance of emerging and deployed Army systems, as well as the impact of natural and man-made changes in the environment on all phases of unified land operations. Research efforts model the dynamics of electromagnetic, acoustic, and seismic propagation in response to changing terrain state and complex terrain features and geometry, and their depiction in geospatial information and mission command systems. Numerical modeling of weather effects on terrain properties supports intelligence preparation of the battlefield products including mobility estimates and intelligence, surveillance, and reconnaissance planning. This effort integrates terrain knowledge and weather forecast in a mission context to provide geospatial information and mission command-delivered solutions to the Soldier. The understanding gained and products developed improve the ability to predict signature (emitter) behavior and sensor performance in complex operational environments, and support materiel development, sensor performance products for tactical decision-making, and visualization for mission command.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priority for Network\/C3I."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Terrestrial Environmental Modeling & Intelligence System (ARTEMIS)"
                                    },
                                    "Description": {
                                        "val": "This effort integrates terrain knowledge and the dynamic effects of weather and mission to provide geospatial reasoning solutions to the Soldier. The understanding gained and products developed improve the ability to predict signature behavior and sensor performance in complex operational environments, improve sensor performance products for tactical decision-making, and improve visualization for mission command.  In Fiscal Year (FY)19, funds from this effort are realigned to Geospatial Analytics for High Resolution Enriched Terrain in support of the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.476"
                                            },
                                            "Text": {
                                                "val": "Will complete development of remote assessment of landing zones and drop zones capability for Intelligence Preparation of the Battlefield products; integrate and validate the utility of high resolution weather data in signal propagation prediction software; complete initial development of a fused and synchronized dynamic geospatial framework for understanding, through risk-based applications, the effect of weather-impacted terrestrial processes on military operations at all echelons."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.619"
                                            },
                                            "Text": {
                                                "val": "Mature a dynamic, coupled land-atmosphere modeling and simulation capability to inform military mission planning by providing fused all-weather and all-season tactical decision aids, delivering risk-based assessments for mission specific terrain analysis, tactical movement and maneuver, and sensor planning."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program transitioned to PEO IEW&S."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "GeoIntelligence - Terrestrial Phenomenology Characterization for Geospatial Applications (Previously Titled Analysis for Signal & Signature Phenomenology)"
                                    },
                                    "Description": {
                                        "val": "This effort investigates the dynamics of electromagnetic, acoustic, and seismic signatures in response to changing terrain state and complex terrain geometry. Research results improve sensor employment tactics, techniques and procedures, and numerical modeling of terrain properties for tactical advantage and geospatial tactical decision aids.  In FY19, funds from this effort are realigned to Geospatial Representation of Dynamic Phenomena in support of the Army science and technology (S&T) priorities as identified at the December 2016 S&T Army Requirements Oversight Council by the Chief of Staff of the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.217"
                                            },
                                            "Text": {
                                                "val": "Will research web-based three-dimensional (3D) visualization of tactical decision aids to enhance point cloud analytics in bandwidth limited environments and mobile applications; investigate utility of LiDAR and terrain based 3D products through new algorithms and processes to access and reuse level zero (raw) data collections preserving sensor calibration and error meta-data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.501"
                                            },
                                            "Text": {
                                                "val": "Develop algorithms for rapidly indexing and provisioning very large Light Detection and Ranging (LiDAR) point cloud collections, greatly simplifying the analyst's access to three-dimensional (3D) terrain data; and mature new web based 3D point cloud visualization and analysis capability greatly extending the data utility to the terrain analyst and image analyst."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tactical Augmented Reality for Operational Technologies - 3D Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort partnered with Communications - Electronics Research, Development, and Engineering Center, designs and exploits an innovative geospatial framework for storage, extraction, processing and visualization of high-resolution 3D terrain data for tactical visualization systems, helmet-mounted, and other displays. Research results will mature technological components to enable a leap ahead in Soldier situational awareness by introducing geo-registered geospatial cues with military symbology on the Soldier?s view of the real world, enabling more rapid decision making by the mounted and dismounted Warfighters."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Will develop advanced algorithms for the detection and delineation of edges, sides, and corners of built infrastructure within collected 3D urban data, and export results as light-weight wireframe or mesh to augment the Soldier?s situational awareness in dense and congested urban and complex terrain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start for FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Analytics for High Resolution Enriched Terrain"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops enhanced and automated analytical capabilities to update, revise and complete 3D high-resolution geospatial representations of the time-stable objects and geometries of complex and urban terrain (e.g. buildings) for the common operating picture. Research results, a new and innovative set of geospatial models, apply to a variety of planning and visualization capabilities for enabling the Soldier to effectively operate with greater situational awareness in complex terrain and dense urban environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Will investigate emerging man\/machine learning algorithms to automate production processes, to enable change detection, and to support learning by manned and autonomous systems with the capability to collect and\/or complete 3D high-resolution common operating picture of complex and urban terrain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Geospatial Representation of Dynamic Phenomena"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops capabilities for automated techniques and tools to identify, characterize, and visualize dynamic geospatial features (e.g., non-combatant clutter) to selectively overlay on high-resolution 3D geospatial representations of infrastructure and terrain surfaces for the Common Operating Picture and tactical displays. These dynamic geospatial features include natural and man-made ephemeral conditions affecting military operations (e.g., obstacles, traffic, population, degraded visual environment, snow, ephemeral water bodies, etc.), such as movement and maneuver, and sensor performance."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.127"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.127"
                                            },
                                            "Text": {
                                                "val": "Will investigate new methods to identify, characterize, track and visualize battlespace objects that change with time (examples include rubble, bridge damage, vehicles, street markets, flooding and other weather induced effects) impacting Soldier and unmanned systems movement and maneuver in complex terrain."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T45"
                    },
                    "ProjectTitle": {
                        "val": "Energy Tec Apl Mil Fac"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.275"
                        },
                        "CurrentYear": {
                            "val": "3.47"
                        },
                        "BudgetYearOne": {
                            "val": "5.909"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.909"
                        },
                        "BudgetYearTwo": {
                            "val": "5.876"
                        },
                        "BudgetYearThree": {
                            "val": "6.149"
                        },
                        "BudgetYearFour": {
                            "val": "6.276"
                        },
                        "BudgetYearFive": {
                            "val": "6.402"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "39.357"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and evaluates technologies necessary for secure, efficient, sustainable military installations and expeditionary structures, emphasizing systems protection in response to evolving needs, including autonomous and semi-autonomous mobility, countermobility and construction. Technologies and processes are also applied to the Army's industrial base to maintain its cost-effective readiness for munitions production and training, and in the theater of operations to reduce logistical footprint. This effort investigates technologies to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations, develops methods to optimize sustainable operations and maintenance to minimize lifecycle costs, and provides capabilities that enable future maneuver formations. In addition, technologies from this work mature a better understanding of critical infrastructure interdependencies to support sustainable and flexible facility operations and evolving mission requirements.  \n\nWork in this Project supports the Army Science and Technology Environment and Terrain Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology priority focus areas and the Army Modernization Priority for Next Generation Combat Vehicle."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Infrastructure for Combat Operations (Previously titled Adaptive and Resilient Installations)"
                                    },
                                    "Description": {
                                        "val": "The Army requires the ability to assess, establish, upgrade, and secure infrastructure while in theatre to enable deployed force operations. This effort provides tools for the assessment of physical and ecological impacts on operations, agile infrastructure modification, and custom?designed construction for expeditionary structures on?demand"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.275"
                                            },
                                            "Text": {
                                                "val": "Will validate simulations for a prototype automated construction capability for expeditionary structures and assess modified designs to allow for improved thermal characteristics and structural integrity. Will investigate methods for rapid and automated acquisition of existing facility information in remote environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.47"
                                            },
                                            "Text": {
                                                "val": "Develop a tool for efficient siting of contingency bases, informing real estate decisions made between the United States (U.S.) and a host nation during Phase Zero operations to inform military planners of potential impacts to operational effectiveness due to location, duration, size (area and population), effects on sociocultural context, and changes in mission; and assess the relative risk associated with contingency construction activities and investigate risk mitigation frameworks through the employment of autonomous construction methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Robotics for Engineer Operations"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate robotic engineer construction equipment capability allowing Engineers to conduct autonomous and semi-autonomous Mobility, Countermobility and Construction missions. This effort supports the Army?s Modernization Priority Next Generation Combat Vehicle (NGCV), Maneuver Robotics and Autonomous Systems, and is intended to provide capabilities that enable and increase the effectiveness of future maneuver formations with extended reach (area and time), enabling increased force survivability by combining manned and robotic teaming in the conduct of cross-domain maneuver in complex terrain while reducing risk to Soldier and units."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.909"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.909"
                                            },
                                            "Text": {
                                                "val": "Develop robotic construction capabilities for forward deployed Engineers.  This includes autonomous site characterization for construction; debris and obstacle removal; horizontal infrastructure repair; obstacle emplacement; control methodologies for multiple robotic construction equipment to work collaboratively and cooperatively, and additive printing using concrete or other cementitious materials for onsite implementation and use."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort initiates in FY19"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "T53"
                    },
                    "ProjectTitle": {
                        "val": "Military Engineering Applied Research (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "23"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increases for Program increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Military Engineering applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "23"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}