{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c6d4730c5f45a9998742a765fe5a52840fa01fae9e79d847b7e2f989ef6d2407-16",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_A-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603375D8Z"
        },
        "ProgramElementTitle": {
            "val": "Technology Innovation"
        },
        "R1LineNumber": {
            "val": "41"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "35.000"
            },
            "PriorYear": {
                "val": "24.895"
            },
            "CurrentYear": {
                "val": "64.863"
            },
            "BudgetYearOne": {
                "val": "83.143"
            },
            "BudgetYearOneBase": {
                "val": "83.143"
            },
            "BudgetYearTwo": {
                "val": "96.256"
            },
            "BudgetYearThree": {
                "val": "97.223"
            },
            "BudgetYearFour": {
                "val": "98.153"
            },
            "BudgetYearFive": {
                "val": "99.369"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "Service Requirements Review Board (SRRB) efficiencies are included."
        },
        "ProgramElementMissionDescription": {
            "val": "The Department of Defense (DoD) has a long history of technological breakthroughs and innovations originating from within the Department.  In order to sustain technological superiority, the Department must take advantage of the rapid evolution of emerging commercial technologies that will be a source of battlefield advantage, when integrated with military systems and novel concepts of operation.  \n\nLeveraging innovative technologies from commercial startup companies has the potential to rapidly address warfighter problem sets in areas where commercial innovation outstrips government investment in the same technology areas. Through a unique partnership with other government agencies, we gain access to and vetting of innovative technologies from commercial startup companies where much of the research and development (R&D) funds are provided by the venture capital community.  Small DoD investments in these companies, often in partnership with other U.S. Government agencies, further leveraging the dollars spent, provides short work programs to adapt the commercial technologies for warfighter applications. The deliverables from the work program allow the warfighters to rapidly pilot technology and concepts, with the ability to fail early and cheaply, and provide the avenue to refine warfighter requirements and transition technology from successful pilots to traditional DoD activities for integration into broader R&D efforts or acquisition programs of record."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "39.923"
                },
                "CurrentYear": {
                    "val": "59.863"
                },
                "BudgetYearOne": {
                    "val": "79.749"
                },
                "BudgetYearOneBase": {
                    "val": "79.749"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "24.895"
                },
                "CurrentYear": {
                    "val": "64.863"
                },
                "BudgetYearOne": {
                    "val": "83.143"
                },
                "BudgetYearOneBase": {
                    "val": "83.143"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.028"
                },
                "CurrentYear": {
                    "val": "5.000"
                },
                "BudgetYearOne": {
                    "val": "3.394"
                },
                "BudgetYearOneBase": {
                    "val": "3.394"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Congressional Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-20.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                },
                                "BudgetYearOne": {
                                    "val": "3.952"
                                },
                                "BudgetYearOneBase": {
                                    "val": "3.952"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.022"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.558"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.558"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Prior Approval Reprogramming Action"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "5.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FY 2018 Missile Defeat and Defense Enhancements"
                            },
                            "Funding": {
                                "CurrentYear": {
                                    "val": "5.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 Missile Defeat Enhancements Reprogramming (FY 17-26 PA): $+5.000 million was required to address emergency warfighting requirements in support of various classified projects.  Additional details are available at a higher classification level.\n\nFY 2018 Missile Defeat and Defense Enhancements (MDDE) Budget Amendment: $+5.000 million is required to address emergency warfighting requirements in support of various classified projects.  Additional details are available at a higher classification level."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "375"
                    },
                    "ProjectTitle": {
                        "val": "Technology Innovation"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "35.000"
                        },
                        "PriorYear": {
                            "val": "24.895"
                        },
                        "CurrentYear": {
                            "val": "64.863"
                        },
                        "BudgetYearOne": {
                            "val": "83.143"
                        },
                        "BudgetYearOneBase": {
                            "val": "83.143"
                        },
                        "BudgetYearTwo": {
                            "val": "96.256"
                        },
                        "BudgetYearThree": {
                            "val": "97.223"
                        },
                        "BudgetYearFour": {
                            "val": "98.153"
                        },
                        "BudgetYearFive": {
                            "val": "99.369"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Program focuses on three main areas: 1) Core Datahub pilot program; 2) Expansion of the Datahub pilot program to address the issues in the rest of the DoD 4+1 problem sets; and 3) Further innovation across other warfighter problem sets. \n\nCore Datahub pilot program.  This effort focuses on maturing and demonstrating the automated processing of  space-based Intelligence, Surveillance, and Reconnaissance (ISR), Artificial Intelligence-driven Geospatial Intelligence (GEOINT), and Fix-Find-Finish-Exploit-Assess (F3EA) into an integrated capability to aid the Combatant Commander and Component forces in defeating threats posed by nuclear-capable, mobile missile - a problem set often plagued by sparse data.  The approach is composed of three innovative building blocks:  1)  Machine learning techniques applied to commercial GEOINT and other commercial data sources for automated country-wide anomaly and change detection - crucial element for enhancing  indications and warnings required for precision strikes; 2)  Machine-Human collaboration architecture to accelerate the F3EA joint forces targeting and decision-making cycle; and 3)  Autonomous weaponeering demonstration - Exercise secure (C2S) cloud for timely precision strikes to hold mobile missile systems at risk.\n\nExpansion of the Datahub Pilot Program.  Following a successful demonstration of Datahub and its leverage of commercial data sources and automation in early 2017, the team was directed to expand Datahub to address applicable issues in the remainder of the DoD 4+1 problem sets.  Some of these problem sets may leverage similar technologies to the pilot program, with data coverage for different parts of the world and algorithms tuned for different targets of interest, while other problem sets may require completely different data, algorithms, and\/or technologies.  Although FY 2017 funding was only 50% of what was expected, the team is executing preliminary efforts to execute the expansion when FY 2018 funds become fully available. \n\nInnovation for other warfighter problem sets:  Through the unique partnership in place for this effort, DoD is exposed to a wide variety of emerging commercial technologies which have potential applicability to a wide spectrum of DoD problem sets.  Enabling the warfighter to execute short duration pilots with these evolving technologies provides a cost effective way to leverage commercial investment for DoD purposes, informing warfighter requirements for follow-on acquisition through traditional DoD channels, and allowing DoD R&D organizations to focus their resources on both the integration of commercial technologies showing promise in these warfighter pilots, and on traditional R&D in technologies not well served by the commercial start-up companies."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Technology Innovation"
                                    },
                                    "Description": {
                                        "val": "The Program focuses on developing space-based Intelligence, Surveillance, and Reconnaissance (ISR), Artificial Intelligence-driven Geospatial Intelligence (GEOINT), and Fix-Find-Finish-Exploit-Assess (F3EA) into an integrated capability for defeating threats posed by nuclear-capable, mobile missile - a problem set often plagued by sparse data."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.895"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "64.863"
                                            },
                                            "Text": {
                                                "val": "- Finalize unclassified user-based training\n- Test\/Validate ML algorithms in Secure C2S Cloud\n- Transition initial prototype (UNCLAS\/CLAS) to user\n- Test\/Validate SAR ML algorithms for Airborne Assets\n- Demonstrate integration and validation of SAR data from airborne assets within Secure (C2C) Cloud\n- Development of SAR ML for space-based imagery\n- Test\/Validate micro-SAR space assets"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "83.143"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "83.143"
                                            },
                                            "Text": {
                                                "val": "- Continue Datahub expansion into the DoD 4+1 problem sets\n- Integrate additional commercial data sources into Core datahub and datahub expansion, as they become available.\n- Expand non-Datahub innovation into other warfighter problem sets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- This project is on a planned ramp up from ~$60M in FY 2018 to ~$80M in FY 2019 to allow this innovative approach to address a greater number of DoD problem sets."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}