{
    "id": "2019-Navy-PB-1319-JBOOK-d4028cfc347373f894e741f0ef44baac41c8b52c4128dfd2dc1f305018c1279e-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604256N"
        },
        "ProgramElementTitle": {
            "val": "Threat Simulator Development"
        },
        "R1LineNumber": {
            "val": "183"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "16.581"
            },
            "CurrentYear": {
                "val": "91.819"
            },
            "BudgetYearOne": {
                "val": "94.576"
            },
            "BudgetYearOneBase": {
                "val": "94.576"
            },
            "BudgetYearTwo": {
                "val": "69.602"
            },
            "BudgetYearThree": {
                "val": "30.049"
            },
            "BudgetYearFour": {
                "val": "29.339"
            },
            "BudgetYearFive": {
                "val": "30.238"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This is a continuing program that consolidates the design, fabrication and integration of Naval Electronic Warfare (EW) threat simulators for increased managerial emphasis and coordination. These simulator development efforts provide realistic Developmental and Operational Test and Evaluation environments to test EW systems and defensive tactics. These projects develop threat Anti-Air and Anti-Ship weapon system simulators in accordance with the Services' requirements.\n\nThe 0602 Project, Electronic Warfare Environment Simulation, directly supports the Test and Evaluation resource requirements for all Naval Air EW development programs to include multi-spectral situational awareness and countermeasures. Programs in development and future programs include: ALR-67(v)3 Radar Warning Receiver, ALQ-214 Integrated Defensive Electronic Countermeasures Suite,  AAR-47 Missile Approach Warning System, AVR-2 Laser Warning System, ALQ-144A Infrared Countermeasure System, Joint Strike Fighter, EA-18G, LR700 Low Band Transmitter, P-8A and the Next Generation Jammer.\n\nJUSTIFICATION FOR BUDGET ACTIVITY: This program is funded under RESEARCH, DEVELOPMENT, TEST and EVALUATION MANAGEMENT SUPPORT because it supports efforts directed toward sustaining or modernizing installations or operations required for general research, development, test and evaluation."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "16.633"
                },
                "CurrentYear": {
                    "val": "91.819"
                },
                "BudgetYearOne": {
                    "val": "98.492"
                },
                "BudgetYearOneBase": {
                    "val": "98.492"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.581"
                },
                "CurrentYear": {
                    "val": "91.819"
                },
                "BudgetYearOne": {
                    "val": "94.576"
                },
                "BudgetYearOneBase": {
                    "val": "94.576"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.052"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-3.916"
                },
                "BudgetYearOneBase": {
                    "val": "-3.916"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.052"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.282"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.282"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.634"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.634"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increase from FY 2018 to FY 2019 supports the procurement of the first two of three signal detection and location systems, two additional passive radar systems, and an additional L-Band radar signal emulator for the Naval Air Warfare Center Weapon Division (NAWC WD) Land Range and Sea Range.  The FY 2018 and FY 2019 investments will provide capabilities that do not currently exist on any Department of Defense open air range.\n\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0602"
                    },
                    "ProjectTitle": {
                        "val": "Eletronics W\/F Env Simulation (ECHO)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "3.426"
                        },
                        "CurrentYear": {
                            "val": "76.886"
                        },
                        "BudgetYearOne": {
                            "val": "80.936"
                        },
                        "BudgetYearOneBase": {
                            "val": "80.936"
                        },
                        "BudgetYearTwo": {
                            "val": "54.241"
                        },
                        "BudgetYearThree": {
                            "val": "14.430"
                        },
                        "BudgetYearFour": {
                            "val": "13.901"
                        },
                        "BudgetYearFive": {
                            "val": "14.339"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of this project is development of necessary simulation facilities and approaches to allow determination of the effectiveness of Electronic Warfare (EW) in real world engagement situations and to support the introduction of modern, effective systems into Naval Aviation. The heavy use of test resources by all Services demonstrates the importance of these assets. \n\nThe Electronic Warfare Environment Simulation project is unique because it is the only program within the Department of Defense which develops and provides Naval anti-air warfare threat assets for Test and Evaluation (T&E).\n\nThis project directly supports the T&E resource requirements for all Naval Air EW development programs, to include multi-spectral situational awareness and countermeasures. Programs in development and future programs include: :  ALR-67(v)3 Radar Warning Receiver, ALQ-214 Integrated Defensive Electronic Countermeasures Suite,  AAR-47 Missile Approach Warning System, AVR-2 Laser Warning System, ALQ-144A Infrared Countermeasure System, Joint Strike Fighter, EA-18G, LR700 Low Band Transmitter, P-8A and the Next Generation Jammer.\n\nThis project provides for the development of an Integrated Air Defense T&E capability to be fielded at each of the three sites comprising the Navy's Tri-Center complex: Naval Air Warfare Center Weapons Division, China Lake and Point Mugu in CA, and Naval Air Warfare Center Aircraft Division, Patuxent River, MD."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "ACQUISITION AND MEASUREMENT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with modern threat target acquisition and engagement systems and effective measurement systems necessary for Test and Evaluation of airborne early warning, situational awareness, detection and targeting systems and airborne response systems.   Project investments in FY18 and FY19 support procurement of  advanced, threat representative electronic warfare (EW) target acquisition and engagement radars to establish a frequency diverse, dense and geographically dispersed threat integrated air defense system to support operationally realistic testing of F-35, Next Generation Jammer, EA-18G and Triton in a threat representative multi-axis anti-access area denial environment that does not currently exist on any Department of Defense open air range."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.400"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the development of an open air radio frequency beam measurement capability."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "66.062"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue development of an open air radio frequency beam measurement capability.\n- Initiate upgrades to the Naval Air Warfare Center ranges to support OT of the JSF.\n- Initiate the site preparation and integration of radar signal emulators at the Electronic Combat Range.\n- Initiate the development of a threat signal augmentation capability.  \n- Initiate the procurement of three L-Band radar signal emulators for Naval Air Warfare Center Weapons Division (NAWCWD).\n- Initiate and complete the upgrade of two S-Band radar signal emulators for NAWCWD.\n- Initiate the procurement of three passive radar systems for NAWCWD.\n- Initiate the procurement of three early warning radar systems for NAWCWD."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "71.491"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "71.491"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete development of an open air radio frequency beam measurement capability.\n- Continue upgrades to the Naval Air Warfare Center ranges to support OT of the JSF by preparing sites for L-Band radar signal emulators, passive radar systems, early warning radar systems and signal detection and location systems.\n- Continue the site preparation and integration of radar signal emulators at the Electronic Combat Range.\n- Continue the development of two threat signal augmentation simulators for NAWCWD.\n- Continue the procurement of three L-Band radar signal emulators for NAWCWD by procuring the second system.\n- Continue the procurement of three passive radar systems for NAWCWD by procuring the second and third systems.\n- Continue the procurement of three early warning radar systems for NAWCWD by procuring the first system.\n- Initiate the procurement of three signal detection and location systems for NAWCWD by procuring the first two systems."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding increase from FY 2018 to FY 2019 supports the procurement of the first two of three signal detection and location systems, two additional passive radar systems, and an additional L-Band radar signal emulator for the Naval Air Warfare Center Weapon Division (NAWC WD) Land Range and Sea Range. The requirement is based on Department of Defense direction to improve the Electronic Warfare test infrastructure at the NAWC WD.  The investment supports procurement of threat emulators that are representative of capabilities possessed by near peer adversaries. These threat emulators will support evaluation of the electronic warfare capabilities of the Joint Strike Fighter Block IV.  Additional programs that will benefit from this capability include the Next Generation Jammer which begins Initial Operational Test and Evaluation in 2021, EA-18G and Triton.  The systems planned for procurement will provide the necessary frequency diversity, density and geographic dispersion to present a stressing, operationally realistic, threat environment to evaluate the performance of the JSF Block IV, Next Generation Jammer, the EA-18G and Triton, as well as other electronic warfare, electronic attack and electronic protection systems."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "REQUIREMENTS AND VALIDATION"
                                    },
                                    "Description": {
                                        "val": "Validate and track intel updates of the threat systems necessary for the operation and continuous improvement of Navy laboratories and ranges which provide engineering support, testing and analysis to the developers, integrators, testers and users of systems and technologies that counter or penetrate air defenses."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.602"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.775"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.590"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to provide program management, systems engineering, and requirements identification for the development of simulators and foreign material acquisition.\n- Continue to validate simulators and stimulators at the Navy tri-lab centers."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 reflects lower validation requirements because of the completion of a closed-loop threat surface to air missile system simulator and the integration of a threat engagement system at ECR, both projects from the Engagement Capabilities accomplishment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ENGAGEMENT CAPABILITIES"
                                    },
                                    "Description": {
                                        "val": "Provide the test community with the modern threat engagement systems necessary for Test and Evaluation of airborne alert, Situation Awareness, targeting systems and airborne response systems. \nThe funding decrease from FY 2018 to FY 2019 due to the completion of the closed-loop threat surface to air missile system simulator during FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.424"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the upgrade and integration of missile simulation models.\n- Continue the development of a closed-loop threat surface to air missile system simulator.\n- Continue the conversion of a threat system.\n- Continue the minor upgrades to open air and laboratory threat systems.\n- Initiate the integration of a threat engagement system at Electronic Combat Range (ECR)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.049"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue the upgrade and integration of missile simulation models.\n- Continue the development of a closed-loop threat surface to air missile system simulator.\n- Continue the conversion of a threat system.\n- Continue the minor upgrades to open air and laboratory threat systems.\n- Continue the integration of a threat engagement system at ECR.\n- Initiate the development of a naval based threat radar closed-loop simulator for installation in  laboratories at Naval Air Warfare Center Weapons Division and Naval Air Warfare Center Aircraft Division and designed for open air range implementation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.855"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.855"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Complete the development of a closed-loop threat surface to air missile system simulator.\n- Complete the integration of a threat engagement system at ECR.\n- Continue the upgrade and integration of missile simulation models.\n- Continue the conversion of a threat system.\n- Continue the minor upgrades to open air and laboratory threat systems.\n- Continue the development of a naval based threat radar closed-loop simulator for installation in laboratories at Naval Air Warfare Center Weapons Division and Naval Air Warfare Center Aircraft Division and designed for open air range implementation."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The funding decrease from FY 2018 to FY 2019 due to the completion of the closed-loop threat surface to air missile system simulator during FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Successfully achieve Initial Operational Capability of Navy Threat Simulation projects within 60 days of approved schedule and have test capabilities scheduled in support of Navy test programs within 180 days."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "0672"
                    },
                    "ProjectTitle": {
                        "val": "Effect Nav E\/W (ENEWS)"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "13.155"
                        },
                        "CurrentYear": {
                            "val": "14.933"
                        },
                        "BudgetYearOne": {
                            "val": "13.640"
                        },
                        "BudgetYearOneBase": {
                            "val": "13.640"
                        },
                        "BudgetYearTwo": {
                            "val": "15.361"
                        },
                        "BudgetYearThree": {
                            "val": "15.619"
                        },
                        "BudgetYearFour": {
                            "val": "15.438"
                        },
                        "BudgetYearFive": {
                            "val": "15.899"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The objective of the Effectiveness of Navy Electronic Warfare (EW) Systems (ENEWS) Project is the development and application of necessary simulation assets to determine the effectiveness of Electronic Warfare for Navy ships in simulated real-world engagement situations.  The project primarily supports the introduction of modern, effective shipboard and off-board Electronic Warfare systems, and tactics for the Surface Navy.  The heavy use of Effectiveness of Navy Electronic Warfare Systems resources by Naval Sea Systems Command, Operational Test and Evaluation (OT&E) Force, Special Operations, and other Electronic Warfare Research, Development, Test and Evaluation (T&E) agencies speaks to the overall importance of this project.  The project provides support for Electronic Warfare system design, Engineering Test (ET), Development Test (DT), Operational Test (OT), and the development of utilization tactics.  In the past Effectiveness of Navy Electronic Warfare Systems quick reaction capabilities have had great impact on crisis situations such as the Libyan crises, Iran threat, Persian Gulf crisis, and Operation Desert Shield\/Storm.  Simulation Display (SIMDIS) is an Effectiveness of Navy Electronic Warfare Systems modeling tool that was developed to support Testing and Evaluation.  Simulation Display has been adopted by most Department of Defense (DoD) Testing and Evaluation and training ranges to provide visualization of Testing and Evaluation and training scenarios.  One of the primary threats to surface ships is Anti-Ship Capable Missile systems.  The Effectiveness of Navy Electronic Warfare Systems Project is unique in that it is the only project within the Department of Defense dedicated to developing and providing realistic Anti-Ship Capable Missile assets to test and evaluate the effectiveness of shipboard Electronic Warfare systems and tactics against these type threats.  The Effectiveness of Navy Electronic Warfare Systems Project is a critical part of the Office of the Secretary of Defense Test Resource Master Plan.  This plan employs many of the Effectiveness of Navy Electronic Warfare Systems assets for planning, analysis, testing, and verification of shipboard and off-board Electronic Warfare systems techniques and tactics.  As part of its normal activities, Effectiveness of Navy Electronic Warfare Systems provides Development Test and Evaluation (DT&E), Operational Test and Evaluation (OT&E), and Follow-on Operational Test and Evaluation (FOT&E) support to the surface Navy for all ship classes.  Development Test, Operational Test and Follow-on Operational Test and Evaluation support includes AN\/SLQ-32 Surface Electronic Warfare Improvement Program (SEWIP), Nulka, Rapid Anti-ship Integrated Defense System, all MK245 Giant tests, advanced InfraRed (IR) decoys, decoy placement, ship InfraRed signature and radar cross section measurement of DDG-51, LPD-17, DD-21 and Patrol Craft class ships, High Power Microwave program, and other ship self-defense initiatives, including Test and Evaluation of Future Naval Capability process.  In addition, Effectiveness of Navy Electronic Warfare Systems assets are regularly employed to test the effectiveness of North Atlantic Treaty Organization (NATO) ships' Electronic Warfare systems in joint allied exercises. Effectiveness of Navy Electronic Warfare Systems assets also support Joint Electronic Warfare exercises that are conducted with Rim of the Pacific (RIMPAC) nations."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "CLASSIFIED PROGRAM"
                                    },
                                    "Description": {
                                        "val": "Details about this program are classified.\n\nDetails about this program and any changes are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.100"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.200"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Details are of a higher classification."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.139"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.139"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "- Details are of a higher classification."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "HARDWARE SIMULATION SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Maintain and perform Hardware and Software Upgrades to the inventory of Effectiveness of Navy Electronic Warfare Systems flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators.  Perform characterization of Infrared and Radio Frequency simulators as part of the periodic evaluation of simulation performance and collect performance data for comparison with previously recorded data.  Also includes development and maintenance of all simulator control panels.\n\nThe increase between FY 2017 and FY 2018 is due to the addition of one hardware simulator to the Effectiveness of Navy Electronic Warfare Systems inventory and the requirement for Effectiveness of Navy Electronic Warfare Systems  hardware simulators to support the Surface Electronic Warfare Improvement Program (SEWIP) Block 3. These requirements include Operational Assessment (OA) and Factory Qualification Tests (FQT) in FY 2018 and preparing hardware simulators to support Developmental Testing (DT) and First Article Qualification Test (FAQT) scheduled for FY 2019."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.201"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued annual maintenance of Effectiveness of Navy Electronic Warfare Systems simulators to support flight\/shore based tests.\n- Continued hardware upgrades to the SUMMIT Simulator.\n- Continued software upgrades to the VICTOR Standard Instrumentation Pod (SIP).\n- Continued hardware upgrades to the FOXTROT 3 TOWSIM(IOTA).\n- Completed software upgrades for ASPIL\n- Completed software upgrades for the MEIR 3, MIKE 3, NU and VICTOR 1 Standard Instrumentation Pod (SIP) simulators\n- Completed IOTA hardware upgrades\n- Initiated hardware upgrades for VICTOR 1 SIP and Anti-Ship Imaging Missile (AIMS) simulators\n- Initiated software upgrade for FOXTROT 1 Sim 1 simulator\n- Maintain and upgrade 20 simulators and the Antenna Test Rig to support the Surface Electronic Warfare Improvement Program (SEWIP) Block 3 and Advanced Offboard Electronic Warfare (AOEW) effectiveness evaluations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.564"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue hardware upgrades to the SUMMIT Simulator.\n- Continue software upgrades to the VICTOR Standard Instrumentation Pod (SIP).\n- Continue hardware upgrades to the FOXTROT 3 TOWSIM(IOTA).\n- Continue hardware upgrades for VICTOR 1 SIP and Anti-Ship Imaging Missile (AIMS) simulators\n- Continue software upgrade for FOXTROT 1 Sim 1 simulator\n- Continue to maintain and perform hardware and software upgrades to the inventory of Effectiveness of Navy Electronic Warfare Systems flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators and simulator control panels.\n- Complete software upgrade for the FOXTROT 1 Sim 1 simulator \n- Initiate hardware upgrades for the EPSILON, FOXTROT 1 (ground based) and FOXTROT 1 SIP simulators \n- Initiate software upgrades for the FOXTROT 1 (ground based), FOXTROT SIP simulators \n- Maintain and upgrade 21 hardware simulators, 5 programmable simulators and the Antenna Test Rig to support the SEWIP Block 3 and AOEW effectiveness evaluations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.538"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2018 less those noted as completed above.\n- Continue to maintain and perform hardware and software upgrades to the inventory of Effectiveness of Navy Electronic Warfare Systems flyable and shore based Anti-Ship Capable Missile (ASCM) Electro-Optic\/Infrared (EO\/IR), Visible and Radio Frequency (RF) Simulators and simulator control panels.\n- Complete hardware upgrades for the EPSILON, FOXTROT 1 (ground based) and FOXTROT 1 SIP simulators\n- Complete software upgrades for the FOXTROT 1 (ground based) and FOXTROT 1 SIP simulators\n- Initiate hardware upgrades for the NU (towed configuration) and VICTOR 1 SIP simulators\n- Introduce and initiate flight certification of one new simulator into the ENEWS inventor\n- Initiate software upgrades for the IOTA (towed configuration), VICTOR 1 SIP simulators\n- Maintain and upgrade 22 hardware simulators, 5 programmable simulators and the Antenna Test Rig to support the SEWIP Block 3 and AOEW effectiveness evaluations."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SIMULATION CHARACTERIZATION, VERIFICATION AND REQUIREMENTS"
                                    },
                                    "Description": {
                                        "val": "Provides for the documentation of Anti-Ship Capable Missile (ASMC) threat simulators. Develops reports that contain detailed descriptions and parametric data of the Anti-Ship Capable Missile threat simulators and compares the simulator's parametric data to the actual threat's parametric data.  Provide technical management functions in support of the Effectiveness of Navy Electronic Warfare Systems project; engineering and technical support requirements for the Anti-Ship Capable Missile simulators and upgrades to meet DT\/ OT testing requirements, development of detailed test resource requirements and provides an interface between OPNAV N2\/N6, Office of Naval Research, and Effectiveness of Navy Electronic Warfare Systems oversight activities.\n\nFormerly know as \"SIMULATION VALIDATION AND REQUIREMENTS\" is now titled \"SIMULATION CHARACTERIZATION, VERIFICATION AND REQUIREMENTS\" effective FY 2017."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.580"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued BETA hardware simulator documentation report.\n- Continued LAMBDA simulator hardware validation report.\n- Initiated and completed the FY 2017 ENEWS Program Management Plan.\n- Initiated and completed the FY 2017 monthly reports, performance based management and analysis, financial execution reporting and assessment.\n- Initiated and completed the BETA simulator characterization assessment.\n- Completed the BETA hardware simulator documentation report."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.691"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue BETA hardware simulator documentation report.\n- Continue LAMBDA simulator hardware validation report.\n- Continue to develop reports that compare the parametric data of the Anti-Ship Capable Missile (ASCM) threat simulators to the parametric data of the actual threat and provide technical management functions in support of the Effectiveness of Navy Electronic Warfare Systems project.\n- Initiate and complete the FY 2018 ENEWS Program Management Plan. \n- Initiate and complete FY 2018 status reviews, performance based management and analysis, financial execution reporting and assessment. \n- Initiate characterization assessment and hardware simulator documentation report for upgraded OMEGA simulator."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.632"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to develop reports that compare the parametric data of the Anti-Ship Capable Missile (ASCM) threat simulators\nto the parametric data of the actual threat and provide technical management functions in support of the Effectiveness of Navy Electronic Warfare Systems project.\n- Initiate and complete the FY 2019 ENEWS Program Management Plan.\n- Initiate and complete FY 2019 status reviews, monthly reports, performance based management and analysis, financial execution reporting and assessment.\n- Complete characterization and hardware simulator documentation report for the upgraded OMEGA simulator."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SUPPORT AND COMPUTERS SIMULATION SYSTEMS"
                                    },
                                    "Description": {
                                        "val": "Perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation Testing facilities and flight support equipment based on existing and emerging complex threat systems.  Development of Testing & Evaluation scenarios and environmental modeling to support electronic support (ES) and electronic attack (EA) testing; modify Anti-ship Cruise Missile (ASCM) threat simulators based on the latest intelligence data obtained from threat databases."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.274"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued target models to support Surface Electronic Warfare Improvement Program Block 3 and Advanced Offboard Electronic Warfare (AOEW) effectiveness assessments.\n- Continued update to the Scenario and Environmental Model used to support open and closed loop simulations.\n- Continued maintenance and upgrades to shore-based test facilities and mobile test vans as required to conduct testing in support of Surface Electronic Warfare Improvement Program, Nulka and multi-function Electronic Warfare programs.\n- Continued to transition environmental, threat and platform simulations from Subversion to Mercurial Distributed Version Control System.\n- Continued upgrades to configuration control software library as new releases became available.\n- Continued to develop new digital models of Anti-ship Cruise Missile (ASCM) threats as they became available.\n- Continued upgrades and maintenance of flight support systems as necessary to support the infrared \/ radio frequency Effectiveness of Navy Electronic Warfare Systems simulators.\n- Continued upgrades and user friendly enhancements to the Simulation Display (SIMDIS) toolset\n- Continued development of LIMA III and LIMA IV digital models\n- Continued digital model upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation.\n-Continued simulator upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation.\n- Completed update to the Scenario and Environment Model used to support open and closed loop simulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.478"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation testing facilities and flight support equipment and provide electronic support (ES) and electronic attack (EA) test support.\n- Continue target models to support Surface Electronic Warfare Improvement Program Block 3 and Advanced Offboard Electronic Warfare (AOEW) effectiveness assessments.\n- Continue update to the Scenario and Environmental Model used to support open and closed loop simulations.\n- Continue maintenance and upgrades to shore-based test facilities and mobile test vans as required to conduct testing in support of Surface Electronic Warfare Improvement Program, Nulka and multi-function Electronic Warfare programs.\n- Continue to transition environmental, threat and platform simulations from Subversion to Mercurial Distributed Version Control System.\n- Continue upgrades to configuration control software library as new releases became available.\n- Continue to develop new digital models of Anti-ship Cruise Missile (ASCM) threats as they became available.\n- Continue upgrades and maintenance of flight support systems as necessary to support the infrared \/ radio frequency Effectiveness of Navy Electronic Warfare Systems simulators.\n- Continue upgrades and user friendly enhancements to the Simulation Display (SIMDIS) toolset\n- Continue development of LIMA III and LIMA IV digital models\n- Continue digital model upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation.\n- Continue simulator upgrades to support Surface Electronic Warfare Improvement Program (SEWIP) Block 3 test and evaluation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.331"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.331"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue all efforts of FY 2018 less those noted as completed above. \n- Continue to perform maintenance and intelligence upgrades to Electro-Optic\/Infrared, Digital, and Radio Frequency Laboratory Simulation testing facilities and flight support equipment and provide electronic support (ES) and electronic attack (EA) test support.\n- Update and install new ship models into database and evaluate performance.\n- Initiate hardware-in-the-loop (HWIL) capability update."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not applicable."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics are discussed within each project (R2a)."
                        }
                    }
                }
            ]
        }
    }
}