{
    "id": "2019-AirForce-PB-3600-MJBOOK-0-0-c3a203aa28182b60f61dc370dc004d262f4542c92e834cf238859eb5ffc78d51-24",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V2-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603601F"
        },
        "ProgramElementTitle": {
            "val": "Conventional Weapons Technology"
        },
        "R1LineNumber": {
            "val": "25"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "105.487"
            },
            "CurrentYear": {
                "val": "167.415"
            },
            "BudgetYearOne": {
                "val": "194.981"
            },
            "BudgetYearOneBase": {
                "val": "194.981"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "231.292"
            },
            "BudgetYearThree": {
                "val": "209.642"
            },
            "BudgetYearFour": {
                "val": "223.712"
            },
            "BudgetYearFive": {
                "val": "228.334"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program develops, integrates, and demonstrates advance ordnance and guidance technologies for air-launched conventional weapons.  The effort focuses on conventional ordnance component technologies such as war-heads, fuzes, and explosives, as well as munition guidance component technologies such as navigation and control systems and seekers.  Technologies to be developed, demonstrated, and integrated into system concepts will address blast, fragmentation, penetration, low collateral damage, variable depth\/location fuzing, precise guidance, and high-performance and insensitive explosives.  Efforts in this program have been coordinated through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602605F, 0602788F, 1206601F, and 0602298F.\n\nThis program is in Budget Activity 3, Advanced Technology Development because this budget activity includes development of subsystems and components and efforts to integrate subsystems and components into system prototypes for field experiments and\/or tests in a simulated environment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "102.009"
                },
                "CurrentYear": {
                    "val": "167.415"
                },
                "BudgetYearOne": {
                    "val": "197.001"
                },
                "BudgetYearOneBase": {
                    "val": "197.001"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "105.487"
                },
                "CurrentYear": {
                    "val": "167.415"
                },
                "BudgetYearOne": {
                    "val": "194.981"
                },
                "BudgetYearOneBase": {
                    "val": "194.981"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.478"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.020"
                },
                "BudgetYearOneBase": {
                    "val": "-2.020"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "5.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.596"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.118"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.020"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.020"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Decrease in FY 2019 due to Department of Defense (DoD) deflation adjustment."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "63670A"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Technology Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "71.709"
                        },
                        "CurrentYear": {
                            "val": "87.215"
                        },
                        "BudgetYearOne": {
                            "val": "95.132"
                        },
                        "BudgetYearOneBase": {
                            "val": "95.132"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "57.895"
                        },
                        "BudgetYearThree": {
                            "val": "51.830"
                        },
                        "BudgetYearFour": {
                            "val": "74.854"
                        },
                        "BudgetYearFive": {
                            "val": "76.367"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, matures, assesses, and demonstrates advanced\/innovative ordnance and guidance component and subsystem technologies for air-launched conventional weapons.  The project focuses on maturation of advanced explosives, fuzes, warheads, sub-munitions, and weapon airframes, carriage and dispensing; as well as innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.898"
                                        },
                                        "Text": {
                                            "val": "Conducted Congressionally-directed efforts."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ordnance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate integrated ordnance technologies to improve conventional air-delivered munitions.  Specific technical areas of focus include energetic materials, fuze technology, warhead sciences, and modeling and simulation tools."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "34.871"
                                            },
                                            "Text": {
                                                "val": "Continue to mature distributed fuzing concepts for close-controlled strike, area attack, and penetration applications, including assessing long term safety, survivability and functionality.  Continue to research ordnance technologies to allow tailored lethality by controlling weapon fragmentation.  Continue to mature ordnance technologies for rapid transition into high-speed strike weapon concepts.  Continue to develop test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Continue to develop ordnance technologies\/methodologies for high-speed impact and functional defeat. Continue research for distributed and multi-point fuzing concepts to reduce the logistics tail necessary for future and fielded munitions systems, as well as safe and arm functions.  Initiate research into armament systems for Special Operations applications.  Conduct lethality analyses for air-to-air weaponry.  Research distributed, collaborative, cooperative effects munitions technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.817"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate distributed, embedded fuzing concepts for close-controlled strike, area attack, and penetration applications (layer counting at high speed), including assessing long-term safety, survivability, and functionality.  Continue development of ordnance technologies to allow tailored lethality by controlling weapon fragmentation.  Continue to mature ordnance technologies for rapid transition into high-speed strike weapon concepts, collecting complex arena test data for implementation into lethality modeling and simulation tools.  Continue to develop test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Continue to develop ordnance technologies\/methodologies for high-speed impact and functional defeat.  Continue research for distributed and multi-point fuzing concepts to reduce the logistics tail necessary for future and fielded munitions systems, as well as safe and arm functions.  Continue research into armament systems for Special Operations applications.  Continue to conduct lethality analyses for air-to-air weaponry.  Continue to mature research on distributed, collaborative, cooperative effects munitions technologies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "53.125"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "53.125"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate distributed, embedded fuzing concepts for close-controlled strike, area attack, and penetration applications (layer counting at high speed), including assessing long-term safety, survivability, and functionality.  Continue development of ordnance technologies to allow tailored lethality by controlling weapon fragmentation.  Continue to mature ordnance technologies for rapid transition into high-speed strike weapon concepts, collecting complex arena test data for implementation into lethality modeling and simulation tools.  Continue to develop test capabilities and high fidelity analysis tools into higher level engineering and fast-running models to enable the war-fighter to make more accurate weaponnering choices.  Continue to develop ordnance technologies\/methodologies for high-speed impact and functional defeat.  Continue research for distributed and multi-point fuzing concepts to reduce the logistics tail necessary for future and fielded munitions systems, as well as safe and arm functions.  Continue research into armament systems for Special Operations applications.  Continue to conduct lethality analyses for air-to-air weaponry, and improve lethality and survivability tools at the meso-scale and micro-scale.  Continue to mature research on distributed, collaborative, cooperative effects munitions technologies.\n\nInitiate the development high fidelity test capabilities and analysis tools to evaluate ordnance technologies in relevant environments.  Initiate the incorporation of better material models and develop further joint kinetic\/directed energy common target models.  Initiate the incorporation of models for progressive collapse, multiple point initiation, secondary debris and others."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $3.308 million.  Justification for this increase is due to an increased emphasis in ordnance technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guidance Technologies"
                                    },
                                    "Description": {
                                        "val": "Develop guidance technologies to improve the precision, controlled lethality, and flexibility of conventional, air-delivered munitions.  Specific technical areas include precision navigation and terminal seekers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "31.940"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct wind-tunnel and limited flight experiments to characterize air-to-air guidance and control.  Continue to conduct research on integrated hardware and software-in-the-loop demonstrations of high speed weapon technologies.  Continue to develop advanced modular and service oriented weapon architectures.  Continue design and development of seeker subsystem prototypes for platform self-defense.  Continue to develop projector and common scene generator technologies for design, development, and analysis of advanced weapon concepts in representative environments for assets networked and operating in future battle spaces. Develop technologies for precision navigation of weapons in global Positioning System (GPS)-denied scenarios.  Continue to develop technologies for precision navigation of weapons.  Evaluate and categorize multiple advanced carriage and release concepts, conduct design reviews and begin construction of new systems.    Continue M&S center design to enable simultaneous, multi-level security M&S activities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "37.398"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct hardware-in-the-loop and software-in-the-loop to characterize air-to-air and air-to-ground guidance and control technologies.  Continue increased emphasis on integrated hardware-in-the-loop, software-in-the-loop, and other Modeling and Simulation technologies for the demonstration of open architecture and modular weapon munition concepts.  Continue development of advanced, high-resolution infrared scene projectors, distributed simulation concepts, software defined Radio Frequency test chamber, scene generation, mission, engagement, campaign level simulations, and panoramic infrared dome technologies.  Continue to develop technologies for precision navigation of weapons in Global Positioning System-denied scenarios.  Continue to mature and integrate advanced carriage and release concepts and sub-systems.  Complete design of Modeling and Simulation capability and initiate approval processes to permit simultaneous multi-level security Modeling and Simulation activities.  Complete Modeling and Simulation center design and security approval processes to enable simultaneous, multi-level security Modeling and Simulation activities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "42.007"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "42.007"
                                            },
                                            "Text": {
                                                "val": "Complete hardware-in-the-loop and software-in-the-loop characterization air-to-air and air-to-ground guidance and control technologies.  Continue integration of hardware-in-the-loop, software-in-the-loop, and other Modeling and Simulation technologies for the demonstration of open architecture, high-speed, cooperative, and modular weapon munition concepts.  Initiate the development of advanced modular and service oriented weapon architectures.  Initiate the design and development of seeker subsystem prototypes for platform self-defense.  Continue development of advanced, high-resolution infrared scene projectors, distributed simulation concepts, software defined Radio Frequency test chamber, scene generation, mission, engagement, campaign level simulations, and panoramic infrared dome technologies.  Continue to develop technologies for precision navigation of weapons in Global Positioning System-denied scenarios.  Continue to mature and integrate advanced carriage and release concepts and sub-systems.  Continue to refine and complete fabrication of Modeling and Simulation center and initiate processes to enable simultaneous multi-level security Modeling and Simulation activities.\n\nInitiate launch to lethality analyses of in-house and Air Force weapon concepts.  Initiate the design of hotter\/faster Infrared panoramic projector for advanced seeker testing.  Initiate the integration of higher fidelity constructive analysis tools with engagement and mission level Modeling and Simulation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased as compared to FY 2018 by $4.609 million.  Justification for this increase is due to an increased emphasis in guidance technologies."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "63670B"
                    },
                    "ProjectTitle": {
                        "val": "Weapon Concept Development"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "33.778"
                        },
                        "CurrentYear": {
                            "val": "80.200"
                        },
                        "BudgetYearOne": {
                            "val": "99.849"
                        },
                        "BudgetYearOneBase": {
                            "val": "99.849"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "173.397"
                        },
                        "BudgetYearThree": {
                            "val": "157.812"
                        },
                        "BudgetYearFour": {
                            "val": "148.858"
                        },
                        "BudgetYearFive": {
                            "val": "151.967"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project develops, refines, integrates, demonstrates, and assesses ordnance and guidance technologies to reduce risk for potential air-launched conventional weapons acquisitions.  The project concentrates in two effort areas, Air-to-Air Concept Development and Air-to-Ground Concept Development.  The project focuses on risk reduction of advanced explosives, fuzes, warheads, sub-munitions, and weapon airframes, carriage and dispensing; as well as innovative munition seekers, weapon aerodynamics, navigation and control, and guidance subsystem integration\/simulation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Air-to-Air Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-air weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate war-fighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.718"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort was performed under Project 63670A, Weapon Technology Development, in the effort, Advanced Munition Concept Technologies.\n\nContinue to demonstrate weapon integration concept for air target engagement. Continue planning and technology risk reduction for weapon concepts responsive to the 2030 timeframe threat environment (including air-to-air weapons for both offensive and defensive purposes). Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons. Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30.220"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate weapon integration concept for air target engagement.  Continue planning and technology risk reduction for weapon concepts responsive to the 2030 time-frame threat environment (including air-to-air weapons for both offensive and defensive purposes).  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems-level analysis, including joint weapons effectiveness.  Continue to test prototype propulsion systems to demonstrate attributes to meet next-generation air-to-air weapon requirements.  Continue to conduct lethality studies to enable design of small form factor self-defense of an air platform.  Continue to develop preliminary design of weapon concept for sixth generation platform.  Continue to conduct wind-tunnel and limited flight experiments to characterize air-to-air maneuverability, range, and guidance and control for sixth generation weapon concept.  Continue to conduct ground and arena tests of advanced weapons experimental-carriages for sixth generation weapon concept and prepare for flight worthiness testing."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.809"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.809"
                                            },
                                            "Text": {
                                                "val": "Continue to demonstrate weapon integration concept for air target engagement.  Continue planning and technology risk reduction for weapon concepts responsive to the 2030 time-frame threat environment (including air-to-air weapons for both offensive and defensive purposes).  Continue to test prototype propulsion systems to demonstrate attributes to meet next-generation air-to-air weapon requirements.  Continue to conduct lethality studies to enable design of small form factor self-defense of an air platform.  Continue to develop preliminary design of weapon concept for sixth generation platform.  Continue to conduct wind-tunnel and limited flight experiments to characterize air-to-air maneuverability, range, and guidance and control for sixth generation weapon concept.  Continue to conduct ground and arena tests of advanced weapons experimental-carriages for sixth generation weapon concept and prepare for flight worthiness testing.  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $10.589 million.  Justification for this increase is due to an increased emphasis in air-to-air concept development efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Air-to-Ground Concept Development"
                                    },
                                    "Description": {
                                        "val": "Mature, integrate, and demonstrate air-to-ground weapon components and systems (ordnance, guidance, and carriage and release technologies) to demonstrate war-fighter capability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.060"
                                            },
                                            "Text": {
                                                "val": "For FY 2016, the work for this effort was performed under Project 63670A, Weapon Technology Development, in the effort, Advanced Munition Concept Technologies.\n\nIncrease emphasis in conducting relevant long range strike weapon technology demonstrations to reduce risk for potential follow on acquisition programs. Continue the development of munition concepts to incorporate technologies for carriage and terminal impact at high speed. Increase emphasis in investigating concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of fifth generation aircraft. Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the 2030 timeframe threat environment (including hypersonic and cooperative\/collaborative concepts). Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons. Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "49.980"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct relevant long-range strike weapon technology demonstrations to reduce risk for potential follow-on acquisition programs, and finalize system detailed design for flying hypersonic munition demonstrator.  Continue the development of munition concepts to incorporate technologies for carriage and terminal impact at high speed.  Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the 2030 time-frame threat environment (including hypersonic and cooperative\/collaborative concepts).  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems-level analysis, including joint weapons effectiveness and to apply methodology to support future air dominance analysis.  Continue to investigate concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of fifth generation aircraft.  Continue to refine competitive contractor processes to develop flying experimental concepts of the subsonic, standoff, low-cost cruise missile capability.  Continue to develop kinetic\/non-kinetic payloads, networking, seeker, fuze, and defense countermeasures technology for hypersonic applications."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "59.040"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "59.040"
                                            },
                                            "Text": {
                                                "val": "Continue to conduct relevant long range strike weapon technology demonstrations to reduce risk for potential follow-on acquisition programs, and finalize system detailed design for flying hypersonic monition demonstrator flight.  Continue the development of monition concepts to incorporate technologies for carriage and terminal impact at high speed.  Continue to investigate concepts for cooperative control of small weapons to produce scalable effects to increase the capacity and capability of fifth generation aircraft.  Continue planning and technology risk reduction including demonstration and initial flight testing for weapons concepts responsive to the 2030 time-frame threat environment (including hypersonic and cooperative\/collaborative concepts).  Continue to mature simulation architectures to assess the trades and synergies between kinetic and directed energy weapons.  Continue to incorporate higher fidelity methodologies into systems level analysis including joint weapons effectiveness and to apply methodology to support future air dominance analysis.  Continue to refine competitive contractor processes to develop flying experimental concepts of the subsonic, standoff, low cost cruise missile capability.  Continue to develop kinetic\/non-kinetic payloads, networking, seeker, fuze, and defense countermeasures technology for hypersonic applications."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $9.060 million.  Justification for this increase is due to an increased emphasis in air-to-ground concept development efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "Not Applicable"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}