{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-10",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0603122D8Z"
        },
        "ProgramElementTitle": {
            "val": "Combating Terrorism Technology Support"
        },
        "R1LineNumber": {
            "val": "24"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "526.241"
            },
            "PriorYear": {
                "val": "113.366"
            },
            "CurrentYear": {
                "val": "101.230"
            },
            "BudgetYearOne": {
                "val": "150.271"
            },
            "BudgetYearOneBase": {
                "val": "125.271"
            },
            "BudgetYearOneOCO": {
                "val": "25.000"
            },
            "BudgetYearTwo": {
                "val": "75.517"
            },
            "BudgetYearThree": {
                "val": "76.766"
            },
            "BudgetYearFour": {
                "val": "78.379"
            },
            "BudgetYearFive": {
                "val": "79.275"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "73.002"
                },
                "CurrentYear": {
                    "val": "101.230"
                },
                "BudgetYearOne": {
                    "val": "79.902"
                },
                "BudgetYearOneBase": {
                    "val": "79.902"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "113.366"
                },
                "CurrentYear": {
                    "val": "101.230"
                },
                "BudgetYearOne": {
                    "val": "150.271"
                },
                "BudgetYearOneBase": {
                    "val": "125.271"
                },
                "BudgetYearOneOCO": {
                    "val": "25.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "40.364"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "70.369"
                },
                "BudgetYearOneBase": {
                    "val": "45.369"
                },
                "BudgetYearOneOCO": {
                    "val": "25.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "42.500"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "General Provisions (FFRDC) Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.127"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Adjustment - Funds realigned to O&M"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-4.631"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-4.631"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "OCO Request"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "25.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "0.000"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "25.000"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Internal Adjustment"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-2.009"
                                },
                                "BudgetYearOne": {
                                    "val": "50.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "50.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017 Additional funds received from Congress for the Anti-Tunnel project under Physical Security.\nFY 2017 Reductions were in support of Departmental efficiencies and economic assumptions. \nFY 2018 - The Department added additional OCO funds to support the Anti-Tunnel project under Physical Security\nFY 2019 - The budget was reduced to fiscal constraints and higher priorities within the Department.\nFY 2019 OCO request of 25.000 million\nFY 2019 The budget was increased for small unmanned aerial system"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "484"
                    },
                    "ProjectTitle": {
                        "val": "Combating Terrorism Technology Support (CTTS)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "526.241"
                        },
                        "PriorYear": {
                            "val": "113.366"
                        },
                        "CurrentYear": {
                            "val": "101.230"
                        },
                        "BudgetYearOne": {
                            "val": "150.271"
                        },
                        "BudgetYearOneBase": {
                            "val": "125.271"
                        },
                        "BudgetYearOneOCO": {
                            "val": "25.000"
                        },
                        "BudgetYearTwo": {
                            "val": "75.517"
                        },
                        "BudgetYearThree": {
                            "val": "76.766"
                        },
                        "BudgetYearFour": {
                            "val": "78.379"
                        },
                        "BudgetYearFive": {
                            "val": "79.275"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Combating Terrorism Technical Support (CTTS) program identifies capabilities to combat terrorism and irregular adversaries and delivers these capabilities to U.S. Defense and interagency users, as well as international partners through rapid research and development, advanced studies, and technical innovation. CTTS is expanding its partnerships with other Defense rapid development and acquisition organizations to leverage their expertise and prevent duplication as it tries to expedite and transition new and innovative capabilities for Defense and interagency users. \nCTTS major area of emphasis during FY18 and FY19 will be projects to Counter-ISIL.  Projects are distributed among 10 mission categories, in line with the interagency Technical Support Working Group (TSWG): Advanced Analytic Capabilities; Chemical, Biological, Radiological, Nuclear, and Explosives; Improvised Device Defeat\/Explosives Countermeasures; Investigative and Forensic Science; Irregular Warfare and Evolving Threats; Personnel Protection; Physical Security; Surveillance, Collection, and Operations Support; Tactical Operations Support; and Training Technology Development.\nSpecific CTTS areas of emphasis in FY18 and FY19 include Counter-tunnel, Countering-sUAVs, improving digital operations at the tactical level, increasing lethality of small weapons and ammunition, and addressing threats to commercial aviation.  The CTTS program is a diverse, advanced technology development effort that capitalizes on interagency and international participation to demonstrate the utility and effectiveness of technology when applied to combating terrorism requirements. It includes technology capability development, proof-of-concept demonstrations in field applications, and coordination to transition from development to operational use. CTTS manages approximately 250 individual projects in support of Defense, federal, state, local, and international customers and partners. \nThe CTTS program justified in the R-2 exhibit identifies the projects fully or partially funded by Congressional appropriations for the CTTS program. However, the Combating Terrorism Technical Support also develops technology and provides support using external funds provided by other DoD and other federal departments and international partnerships. These projects and support activities are not necessarily reflected in this justification R-2; but the number of activities do reflect positively on the trust and competence that CTTSO has earned throughout the Department and interagency to rapidly conduct critical RDT&E and provide innovative products."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Analytic Capabilities (AAC)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Analytic Capabilities (AAC) Subgroup's objective is to develop and deploy integrated analytic capabilities; enabling Commanders, Warfighters, and Mission Partners to share information and make better\/faster decisions at the Strategic, Operational, and Tactical levels. AAC projects improve sense- making, decision-making, and data management across a range of mission areas."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.054"
                                            },
                                            "Text": {
                                                "val": "Complete development, assessments, and support transition of a secure multi-intelligence collection and distributed processing and sensor fusion platform with an open Application Programming Interface architecture. Complete development of a machine learning lab to predict location of relevant assets. Continue prototyping of Model-enabled Analysis, Design, and Execution (MEADE) to include the Military Decision-making Process (MDMP).  Continue development, integration, evaluation, and field testing required to apply Operate to Know CONOPS and tools necessary to create a continuous receive-respond and collect-pulse connection between intelligence and operations to investigate, test, and understand the environment in order to take decisive action to field operations. Continue development of anticipatory analytic tools that will enable military analysts, government analysts, and decision makers to anticipate force activity consequences; discern potential outcomes; and compare\/contrast multiple courses of action simultaneously. Continue development of a prototype system that exploits video, images, and social media based on analyst’s task and creates entity, site, and event dossiers by creating advanced tagging, filtering, and fusion. Initiate development of a Tactical Micro Cloud Server (T-MCS) that will be a secure, rugged, man-packable or fixed mount data server that connects to tactical network devices. Initiate development of analytic methodologies to detect, locate, classify, and geo-spatially portray tunnels or tunneling activity by assessing the threat as a network. Initiate research and development of new capabilities for mission planning and battle management using advanced geographic information systems (GIS) tools on Android based platforms; specifically, the capability to augment geographic information in the field. Initiate development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition (OCR) processing so that the images can be used in commercial Arabic translation software. Initiate drone based analytics for in-field mission planning support."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.384"
                                            },
                                            "Text": {
                                                "val": "Complete the development of an enhanced Critical Thinking Tool that supports the application of evidence- based reasoning for intelligence questions and captures analytic problem-solving approaches. Complete enhancement of the Model Enabled Analysis, Design, and Execution (MEADE) system to include the Military Decision-making Process (MDMP) by identifying and assessing indirect strategies as well as developing response options against associated types of Gray Zone conflicts. Complete development, integration, evaluation, and field testing of Operate to Know (OtK) CONOPS and tools to establish a capability that streamlines multi-modal situational awareness across the spectrum of military operations in emergent theatres of operation. Complete development of a machine learning lab to predict location of relevant assets. Continue development of new capabilities for mission planning and battle management using advanced geographic information systems (GIS) tools on Android based platforms; specifically, the capability to augment geographic information in the field. Continue development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition (OCR) processing so that the images can be used in commercial Arabic translation software. Initiate drone based analytics for in-field mission planning support. Initiate development and apply a deterministic open source information prototype that uses current anticipatory analytic approaches to enable forecasting over three to five years to better forecast and project geopolitical turmoil that will drive future Title 10 requirements.  Initiate testing of a hardware\/software solution that supports two-way intelligence and combat information data flows, in near real-time, between command elements, deployed sensors\/collectors, and individual warfighters in both low latency\/high bandwidth and high latency\/low bandwidth environments with a man-portable form factor.  Initiate use of state of the art machine learning predictive data mining tool to detect anomalous activities for C-WMD proliferation. Initiate development of new supercomputer chip applications that can be used for complex calculations, be forward deployed, hosted locally with concealment to facilitate increased targeting, enemy situational awareness, and that can support increased trans-regional understanding of transnational extremist group threat networks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.316"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.316"
                                            },
                                            "Text": {
                                                "val": "Complete development of new capabilities for mission planning and battle management using advanced geographic information systems (GIS) tools on Android based platforms; specifically, the capability to augment geographic information in the field. Complete development of an ability to extract images from the field and make them useable for digital processing using Optical Character Recognition (OCR) processing so that the images can be used in commercial Arabic translation software. Complete testing and deployment of a hardware\/software solution that supports two-way intelligence and combat information data flows, in near real-time, between command elements, deployed sensors\/collectors, and individual warfighters in both low latency\/high bandwidth and high latency\/low bandwidth environments with a man-portable form factor. Complete use of state of the art machine learning predictive data mining tool to detect anomalous activities for C-WMD proliferation. Continue drone based analytics for in-field mission planning support. Continue development of a deterministic open source information prototype that uses current anticipatory analytic approaches to enable forecasting over three to five years to better forecast and project geopolitical turmoil that will drive future Title 10 requirements. Continue development of new supercomputer chips that can be used for complex calculations to facilitate increased targeting, enemy situational awareness, and that can support increased trans-regional understanding of transnational extremist group threat networks. Continue development for new supercomputer chips that can be used for complex calculations, be forward deployed , hosted locally with concealment to facilitate increased targeting, enemy situational awareness, and that can support increased trans-regional understanding of transnational extremist group threat networks. Initiate Cognitive Sensing capabilities that will develop an understanding of an operational area, the local dynamics, and identify the disruptive trends that could affect that environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2018 Additional funds received in support of the Anti-Tunnel project under Physical Security. Funding for FY 2019 will be budgeted in OCO."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "CHEMICAL, BIOLOGICAL, RADIOLOGICAL, NUCLEAR, AND EXPLOSIVES (CBRNE)"
                                    },
                                    "Description": {
                                        "val": "The CBRNE subgroup’s objective is to improve defense capabilities to meet tomorrow’s CBRNE threats. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation on threat characterization; materials attribution; personal protective equipment; detection of CBRNE materials at trace and bulk levels at point, proximity and stand-off distances; development of information resources and decision support tools to assist response elements with risk-based decision making; and consequence management for post-event activities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.984"
                                            },
                                            "Text": {
                                                "val": "Complete development of four additional sizes of a next generation CB Glove and initiate NFPA 1994 Class 3 certification testing. Complete development of an unobtrusive, colorimetric system for the detection of CWAs and TICs of concern. Complete development and commercialize a novel, miniaturized chemiresistor wearable sensor which enables detection of low concentrations of chemicals in an urban environment. Complete development of a novel bio-sensor based upon pyroelectric transducer technology for the detection of biological warfare agents. Complete development of an advanced analytical database for the analysis of improvised CB agent production methods. Complete evaluation of potential methods of production of threat materials, and identify key indicators and warnings for response personnel. Complete field evaluations and certify a ruggedized garment which provides NFPA 1994 Class 3 and NFPA 1992 protection. Complete development of new algorithms that increase the specificity and improve the overall utility of commercial Raman explosive detection systems. Complete development of a flexible, versatile, and easily transportable platform for detection of small amounts of explosive materials hidden inside of portable electronic devices using a combination of passive and active technologies. Complete development of a modular computer\/web-based training package for hand-held explosive detection technologies. Complete development of a scalable vacuum evidentiary collection device for the collection and preservation of known or suspected biological agent powders. Complete source term development for urban dispersion models to improve the ability to characterize deposition patterns in realistic RDD events. Complete best practices for clean-up procedures for contaminated areas after an RDD event. Complete evaluation of SRMs. Continue to conduct verification and validation testing of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments. Continue testing and evaluation of optimized sampling media for the collection of trace explosive materials. Continue testing and evaluation of next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats. Continue evaluation of enhanced sampling materials and systems for CBRNE threats. Complete development of a risk-based decision support model for skin decontamination in the case of dermal exposures to CWAs. Complete NIOSH certification of a 15-min CBRN protection escape hood capable of fitting in the pocket of a suit jacket that also passes the flammability, heat resistance and CO protection requirements for a combination CBRN\/CO capability. Complete field testing of wireless communications that provide the ability to communicate without breaching the CBRN suit integrity or requiring an electrical pass-through. Complete NFPA 1994 Class 2 certification testing of a ruggedized one-piece garment which provides protection from exposure to the harmful effects of all traditional CB warfare agents and TICs listed in NFPA 1994 while allowing for communication and interoperability with tactical equipment. Complete development of new hardware and software solutions for a broad range of popular handheld detectors, enabling the real-time connectivity of handheld detectors from remote sites to a central location utilizing the First Responder Sensor Protocol. Continue support of the Quadrilateral Group on CBR Counterterrorism. Continue testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices. Continue CBRN respirator testing against additional TICs representative of the current threats encountered. Continue development of multiple use biological PPE which provides NFPA 1999, Standards on Protective Clothing for Emergency Medical Operations, protection, and NFPA 1994, Standard on Protective Ensembles for First Responders to CBRN Terrorism Incidents, Class 4 protection. Complete development of a hazmat technician level, skills-based training program to prepare hazmat operators to use risk-based selection mechanisms to determine the appropriate level of personal protective equipment. Complete development of a hazmat technician level, skills-based training program to prepare hazmat operators to use evidence-based selection mechanisms to develop and\/or choose the appropriate mass decontamination protocols for a given situation. Complete development of assessment tools and criteria to properly rank and qualify commercial cooling systems to use with CBRNE PPE. Continue development of a small, low-cost, disposable sampler, containment vessel, and adapter to be used in sampling of broad spectrum chemical residues on operational surfaces. Complete development of next generation evidence packaging for the safe transport of CBRN materials. Continue assessment of novel genomic sequencing standards for forensics DNA metagenomics. Continue development of a next generation sequencing technology for potential applications in field deployed laboratories. Continue development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping. Continue development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening. Initiate an effort to develop an integrated light-weight inhalation hazard detection system capable of signaling a combination unit respirator (CUR) switching-mechanism to change operating modes of a CUR between filtered air and supplied air. Initiate development of a low profile tactical self-contained breathing apparatus (SCBA) to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air. Initiate development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives. Initiate an effort to modify currently fielded ion mobility spectroscopy systems to expand the list of threats detectable to include compounds from emerging military explosives and compounds used in gun powder formulations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.575"
                                            },
                                            "Text": {
                                                "val": "Complete development of next generation evidence packaging for the safe transport of CBRN materials. Complete evaluation of potential methods of production of threat materials, and identify key indicators and warnings for response personnel. Complete a report on integrated lightweight inhalation hazard detection system capable of signaling a combination unite respirator (CUR) switching- mechanism to change operating modes of a CUR between filtered air and supplied air. Complete development of a low profile tactical SCBA to allow for working in confined spaces, tunnels, and similar access denied environments while providing high quality breathing air.  Complete modification of currently fielded ion mobility spectroscopy systems to expand the list of threats detectable to include compounds from emerging military explosives and compounds used in gun powder formulations.  Complete assessment of novel genomic sequencing standards for forensics DNA metagenomics.  Complete development of a next generation sequencing technology for potential applications in field deployed laboratories.  Complete development of a test bed for the evaluation of cargo for contraband including special nuclear materials, explosives, drugs, and other potential materials of interest, utilizing muon tomography and electron stopping.  Complete development of a research and development test bed for the evaluation of high volume explosive sampling devices with a focus on cargo\/container screening.  Complete development of assessment tools and criteria to properly rank and qualify commercial cooling systems to use with CBRNE PPE.  Complete development of a risk-based decision support model for skin decontamination in the case of dermal exposures to CWAs.  Complete the systematic evaluation of gas forming reactions that could be used in improvised chemical devices.  Complete field evaluations and certify a ruggedized garment which provides NFPA 1994 Class 3 and NFPA 1992 protection.  Complete development of a modular computer\/web-based training package for hand-held explosive detection technologies.  Complete NIOSH certification of a new CB protective mask capable of interoperability with tactical equipment for use in tactical environments.  Complete NIOSH certification of a 15-min CBRN protection escape hood capable of fitting in the pocket of a suit jacket that also passes the flammability, heat resistance and CO protection requirements for a combination CBRN\/CO capability.  Complete field testing of wireless communications that provide the ability to communicate without breaching the CBRN suit integrity or requiring an electrical pass-through.  Complete testing new methods to more effectively and efficiently collect nanogram quantities of commercial, military, and homemade explosives that are present near improvised explosive devices.  Complete development of new hardware and software solutions for a broad range of popular handheld detectors, enabling the real-time connectivity of handheld detectors from remote sites to a central location utilizing the First Responder Sensor Protocol.  Complete CBRN respirator testing against additional TICs representative of the current threats encountered.  Complete certification of multiple use biological PPE to NFPA 1999, Standards on Protective Clothing for Emergency Medical Operations, protection, and NFPA 1994, Standard on Protective Ensembles for First Responders to CBRN Terrorism Incidents, Class 4.  Continue source term development for urban dispersion models to improve the ability to characterize deposition patterns in realistic RDD events. Continue best practices for clean-up procedures for contaminated areas after an RDD event. Continue testing and evaluation of a next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats.  Continue evaluation of enhanced sampling materials and systems for CBRNE threats.  Continue support of the Quadrilateral Group on CBR Counterterrorism.  Continue development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives.  Initiate development of a hyperspectral rapid, large area survey instrument that guides activities ranging from contaminant avoidance to decontamination.  Initiate the development of cheap, disposable multi agent detection paper (MADP) for the rapid, selective, and low cost detection of H, G, and V chemical warfare agents.  The MADPs shall be able to detect HD, HN, GA, GB, GD, GF, VX, VR, and VS.  Initiate the development of a novel, innovative non-encapsulating NFPA 1994 Class 1 protective ensemble that will provide Class 1 protection in a low-profile, tactical ensemble.  Initiate the development of a decontamination solution that can be used on skin and wounds and effectively decontaminate chemical and biological warfare agents.  Initiate development of a low-cost detect-to-identify wearable sensing technology to inform chemical-specialist first responders and warfighters of the presence of a broad range of TIC and CWA vapors. Initiate efforts to enhance mitigation techniques for threat releases in transportation platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.455"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.455"
                                            },
                                            "Text": {
                                                "val": "Complete source term development for urban dispersion models to improve the ability to characterize deposition patterns in realistic RDD events. Complete best practices for clean-up procedures for contaminated areas after an RDD event. Complete testing and evaluation of a next generation sensors for use in trace, bulk, proximity, and stand-off detection of explosives-based threats.  Complete evaluation of enhanced sampling materials and systems for CBRNE threats.  Complete support of the Quadrilateral Group on CBR Counterterrorism.  Complete development of an explosive trace detector with a limit of detection less than ten picograms for military and common homemade explosives.  Complete development of a hyperspectral rapid, large area survey instrument that guides activities ranging from contaminant avoidance to decontamination.  Complete the development of cheap, disposable multi agent detection paper (MADP) for the rapid, selective, and low cost detection of H, G, and V chemical warfare agents.  The MADPs shall be able to detect HD, HN, GA, GB, GD, GF, VX, VR, and VS.  Complete the development of a novel, innovative non-encapsulating NFPA 1994 Class 1 protective ensemble that will provide Class 1 protection in a low-profile, tactical ensemble.  Complete the development of a decontamination solution that can be used on skin and wounds and effectively decontaminate chemical and biological warfare agents.  Continue development of a low-cost detect-to-identify wearable sensing technology to inform chemical-specialist first responders and warfighters of the presence of a broad range of TIC and CWA vapors.  Continue efforts to enhance mitigation techniques for threat releases in transportation platforms. Initiate synthetic biology efforts that encompass biotechnology, nanotechnology, genomics, medicine, computing, microbiology, and\/or engineering.  Initiate efforts to better understand microbial associations within complex microbial communities. Initiate an online database containing feedback on field performance of CBRNE detector systems, test data on a detector performance, and where or who can be contacted to receive a report depending on the data's sensitivity. Initiate a man-portable systems that can reliably detect explosives through continuous monitoring of the gas phase. Initiate a lightweight, portable passive system for the detection of biological warfare agents. Initiate a field dispersible, short-lived, alpha radiation training aid for a variety of training application. Initiate a container capable of retaining shelf life and efficacy when mask and filter are assembled together. Initiate an online database to automatically ingest open source information to identify and characterize chemical and biological facilities worldwide."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Minor changes and reductions were in support of Departmental efficiencies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "IMPROVISED DEVICE DEFEAT (IDD)"
                                    },
                                    "Description": {
                                        "val": "The IDD\/EC Subgroup’s objective is to deliver capabilities to defeat or neutralize the continuum of terrorist improvised weapons and explosive devices. IDD\/EC improves the operational capabilities of the bomb disposal community, consisting of military Explosive Ordnance Disposal (EOD), and federal, state, and local bomb squads, by developing and delivering advanced tools and technologies, and decision support information to defeat improvised terrorist devices. The IDD\/EC Subgroup identifies and prioritizes multi-agency end-user requirements in collaboration with military units, and federal, state, and local agencies. IDD\/EC actively works with vendors and end-users to deliver advanced prototype systems that provide greater efficiency and increased safety for bomb technicians who investigate, access, evaluate, and if needed, render safe or dispose of suspect devices. All development efforts undertaken are in support Presidential Policy Directive 17 (PPD-17), Countering Improvised Explosive Devices, and the National Bomb Squad Commanders Advisory Board (NBSCAB) National Strategic Plan."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.363"
                                            },
                                            "Text": {
                                                "val": "Complete development and delivery of a compact, high-power next generation X-ray generator for EOD use. Complete development of a system that can employ X-ray image analytics at the scene of a bomb or IED incident to instantly and automatically identify bomb or IED components from a database of exemplars. Continue development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Complete development of a low cost, disposable Radio Frequency (RF) firing system for firing commercial blasting caps. Continue development of a lightweight IED protective suit and ballistic helmet to allow increased freedom of movement during counter-IED operations. Continue development of a scalable 3D Computer Assisted Design (CAD) models on non-patented bomb squad render safe tools. Continue an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Complete develop of common standards of characterization, analysis and facsimile devices methods for Radio Controlled Improvised Explosive Devices. Continue development and testing of highly intelligent and power efficient advanced communications ECM techniques that are fully capable of defeating the environmentally adaptive communications capabilities embedded in most advanced wireless systems and networks. Continue development of common test standards and assessment methods for the full spectrum of EOD disruptors to facilitate the exchange of reliable data. Continue research, information sharing, and joint peer review of methods for Electromagnetic and Electrostatic Discharge mechanisms for counter-IED applications in support of Directed Energy neutralize capabilities. Continue development of an HME neutralization field reference for use by Military EOD and Public Safety Bomb Technicians. Initiate and complete development of an IED Instant Notification System. Initiate development of enhanced capabilities for a submersible remotely operated vehicle to counter water borne IEDs based on operational capability assessment. Initiate development of a hands-free Bomb Suit Heads up Display. Initiate development of a Multi-Fit Inflatable Bomb Suit Helmet Liner capable of being retrofitted to the Med-Eng EOD 9, EOD 9A, and SRS 5 model helmets.  Initiate development of a 3D X-ray Imaging System to interrogate a suspected improvised explosive device (IED) and locate critical components."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.222"
                                            },
                                            "Text": {
                                                "val": "Complete an East Coast-based technology requirement gathering capability exercise (TRG CAPEX) to develop and test advanced skills to maneuver hazardous duty robots in challenging, real-world scenarios. Complete development of a lightweight IED protective suit and ballistic helmet to allow increased freedom of movement during counter-IED operations. Complete development of power efficient advanced communications ECM techniques that are fully capable of defeating the environmentally adaptive communications capabilities embedded in most advanced wireless systems and networks. Complete research of methods for electromagnetic and electrostatic discharge mechanisms for counter-IED applications in support of directed energy neutralize capabilities. Complete development of an HME neutralization field reference for use by military EOD and public safety bomb technicians. Complete development of common test standards and assessment methods for the full spectrum of EOD disruptors to facilitate the exchange of reliable data. Complete development of a device defeat application that allows bomb technicians to select disruption tools based on automated X-ray diagnostics. Complete development of a robot-mounted X-ray Backscatter system for VBIED diagnostics. Complete development of a hands-free bomb suit heads-up display that projects mission and sensor data onto a bomb suit helmet screen. Complete development of a multi-fit inflatable bomb suit helmet liner capable of being retrofitted to the Med-Eng™ EOD 9, EOD 9A, and SRS 5 model helmets. Continue development of a 3D X-ray Imaging System to interrogate a suspected IED and locate critical components. Conduct a workshop that integrates EOD and Public Safety Bomb Technicians with engineers and roboticists to collaboratively design and develop new capabilities for VBIED response. Initiate development of a humanoid robot for use in IED Defeat operations in urban environments. Initiate development of a small, high definition, live-streaming camera that displays images onto a wearable screen or integrates into a bomb suit heads-up display. Initiate development of a mixed-reality visualization system for command post\/up-range support that will allow bomb technicians and support personnel to see what is transpiring downrange and assist the bomb technician with on-scene analysis. Initiate the development of an enhanced spatial awareness capability for robotic platforms that can maintain 360-degree awareness of the platform's surrounding environment. Initiate the development of a library of CAD files that can be printed with an inexpensive 3D printer at the bomb squad location or sourced to outside parties for printing. Initiate research to produce customizable energetic tools to disrupt explosive devices in high-risk environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.131"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.131"
                                            },
                                            "Text": {
                                                "val": "Complete development of a 3D X-ray Imaging System to interrogate a suspected IED and locate critical components. Conduct a workshop that integrates EOD and public safety bomb technicians with engineers and roboticists to collaboratively design and develop new capabilities for VBIED response. Continue development of a humanoid robot for use in IED Defeat operations in urban environments. Continue development of a small, high definition, live-streaming camera that displays images onto a wearable screen or integrates into a bomb suit heads-up display. Continue development of a mixed-reality visualization system for command post\/up-range support that will allow bomb technicians and support personnel to see what is transpiring downrange and assist the bomb technician with on-scene analysis. Continue the development of an enhanced spatial awareness capability for robotic platforms that can maintain 360-degree awareness of the platform's surrounding environment. Continue the development of a library of CAD files that can be printed with an inexpensive 3D printer at the bomb squad location or sourced to outside parties for printing. Continue research to produce customizable energetic tools to disrupt explosive devices in high risk environments. Initiate development of a smartphone or tablet-based application that will allow bomb technicians to relay IED and IED incident information graphically to fellow bomb technicians in real-time. Initiate development of bomb disposal tools for deployment on, or by, small UAS-based platforms. Initiate development of a searchable library of IED circuits that will allow bomb technicians to quickly compare and identify known IED circuits. Initiate development of a low cost obstruction avoidance and proximity alert system for robotic platforms. Initiate development of an electronic, user-updatable UAS Guidebook that can be used as a quick reference during response operations for identification and analysis of downed UAS platforms. Initiate development of a rapidly mountable backscatter X-ray system for small to medium sized robotic platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "INVESTIGATIVE AND FORENSICS SCIENCE"
                                    },
                                    "Description": {
                                        "val": "The IFS subgroup’s objective is to advance combating terrorism capabilities in investigative and forensic science. IFS supports joint, interagency, and other partners who apply investigative and forensic science methods, means, or practices to forensic intelligence or investigations. To meet this objective, the subgroup focuses on rapid research, development, test and evaluation of new and advanced technology, equipment, forensic techniques, and investigative tools, as well as development of information resources and on support tools for risk-based decision-making and rapid exploitation of evidence. Projects emphasize rapid and field deoxyribonucleic acid (DNA) analysis, identification of insider threat within agencies, pre-blast and post- blast forensic examination, electronic evidence data acquisition and analysis, sensitive site exploitation, forensic intelligence, and criminalistics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.420"
                                            },
                                            "Text": {
                                                "val": "Complete development of an advanced and improved system that analyzes, stores, and links data and traits from fraudulent identification and travel documents. Complete development of forensically validated procedures using high resolution mass spectrometry to determine the geographic source of cultivation and processing of heroin and related opium substances. Complete development of the best forensic methodologies to analyze 3-D printed firearms made with non-metallic materials. Complete development of a forensic software application that performs searches, matches, and exclusions of vehicle images in still image or video databases. Complete development of an integrated device for rapid collection and analysis of forensic and biometric data most frequently found at crime scenes and sensitive sites. Complete development of training procedures to educate and motivate employees at a worksite to report observations indicating other workers may be a potential insider threat to commit espionage or workplace violence. Initiate development of a software tool that detects and extracts any type of handwritten content on digitized documents. Initiate development of an automated mobile latent fingerprint processing device that enables non-experts to develop searchable quality prints on all types of objects.  Initiate development of a tool that will locate and collect digital data and information from cloud-based sites when the user name and password is known."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.374"
                                            },
                                            "Text": {
                                                "val": "Complete the development of latent print lifters based on antigenic reagents that can be used without detection. Complete development of a tool that can search the internet, find data associated with a user name and password and then collect and store the data. Complete development of a forensic tool that can detect handwriting on digitized documents regardless of the language and then extract it for later analysis. Complete development of a new collection device of trace DNA and new procedures to determine more advanced data from it. Complete the development of electronic transmission protocols for fingerprints and palm prints. Complete the research to determine the best credibility assessment techniques and procedures to be used on persons living in the regions around Israel and distribute the results. Continue the development of a handheld device that can document incident scenes, collect fingerprint images, and can make comparisons at the scene with outside databases. Initiate development of an intelligence focused facial recognition system that analyzes streaming or multiplexing images and videos sources of large volumes. Initiate development of an unconstrained face recognition system for intelligence community to process relevant streaming or multiplexed image and video sources that are too labor intensive for manual review due to their volume. Initiate development of an advanced scalable facial recognition system based on the government developed model. Initiate the research and production of a field handbook describing the procedures used by the Five Eyes nations in exploiting tactical and sensitive site for forensic and investigative information. Initiate development of standard protocols, procedures, and best practices for forensic speaker comparison examiners to accomplish their analyses and examinations. Initiate the development of a miniature concealable body worn audio-video transmitter for law enforcement and tactical personnel. Initiate the development of algorithms that increase the accuracy of NCCA's Avatar and thermal imaging credibility assessment systems. Initiate the development of automated methods to convert foreign fingerprint files into US compatible electronic files and anonymous the source."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.306"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.306"
                                            },
                                            "Text": {
                                                "val": "Complete the development of a handheld device that can document incident scenes, collect fingerprint images, and can make comparisons that scene with outside databases. Complete the development of an intelligence focused facial recognition system that analyzes streaming or multiplexing images and videos sources of large volumes. Complete the development of an unconstrained face recognition system for intelligence community to process relevant streaming or multiplexed image and video sources that are too labor intensive for manual review due to their volume. Complete the development of an advanced scalable facial recognition system based on the government developed model. Complete the research of a field handbook describing the procedures used by the Five Eyes nations in exploiting tactical and sensitive site for forensic and investigative information. Complete the development of standard protocols, procedures, and best practices for forensic speaker comparison examiners to accomplish their analyses and examinations. Complete the development of a miniature concealable body worn audio-video transmitter for law enforcement and tactical personnel. Complete the development of algorithms that increase the accuracy of NCCA's Avatar and thermal imaging credibility assessment systems. Initiate development of DNA collection and analysis procedures usable in sensitive sites and restricted areas without leaving any trace. Initiate the development of an instrument that visualizes fingerprints from a distance using ultraviolet light and does not leave any traces. Initiate development of an application that can search for vehicles in digital files and learn new vehicles from inserted images. Initiate development of an application that can search video files for specified objects through the use of artificial intelligence."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental efficiencies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Irregular Warfare and Evolving Threats (IW\/ET)"
                                    },
                                    "Description": {
                                        "val": "The IW\/ET subgroup develops new concepts and capabilities for warfighters and inter-agency partners who are confronting the complexity of the current operational environment, while simultaneously looking outward rather than inward to appropriately size, shape and develop their forces. In accordance with the Quadrennial Defense Review’s (QDR) emphasis on preparation to defeat adversaries and succeed in a wide range of contingencies, IW\/ET will engage in operational assessment, concept development, and independent validation of unique prototype capabilities to identify, confront, and defeat evolving threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.285"
                                            },
                                            "Text": {
                                                "val": "Complete the Behavioral Influence Assessment effort in partnership with the UK’s DSTL to enable analysts to assess higher-order cascading influences and reactions to events, as well as determine the uncertainty that the event will produce the desired results over time. Complete the Peer-2-Peer effort to challenge university students from the U.S. and abroad to create an online community to counter a common enemy of violent extremists wherever they might exist, and transition the effort to the Department of Homeland Security, U.S. State Department, and Facebook. Complete the analysis and advancement of IO as a valid and critical element of combined arms by supporting the development and dissemination of operational art of IO, the composition of information related capabilities, and training for IO throughout the U.S. Marine Corps. Complete development and operational deployment of the Nightingale effort to deploy digital workflow, approval, and archival processes in support of the counter-violent extremism mission. Complete the design of a holistic common interagency analytical and planning approach that better identifies capabilities authorities and funding, links U.S., Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions. Complete an operational test of the NEC Clever Enabler project with Special Operations Command Africa. Final deliverable will be an exportable all source intelligence training curriculum for use with partner nations. Upon completion of the curriculum and a brief test, the contract will transition to U.S. Africa Command for continued use. Complete the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information and provide the capability to conduct facial, object and ISIL branded recognition. Complete initial development and delivery of SUNet, which provides a unique virtualization of a single hardware suite of servers and software that will provide protected dynamic enclaves of capability for multi-agency users (law enforcement, interagency, coalition, and foreign nationals). Complete research and development of a low-cost, effective and efficient method of extending or creating local security, sustainable governance, and protection from terrorism in small and large urban environments through relevant doctrine, training, technology and innovative partnerships. Utilizing SUNet architecture, this effort facilitates dialogue and information sharing among entities involved in developing community resilience\/resistance in the face of armed violence and creates a platform to test and evaluate tools and TTPs for use in the \"ungoverned\" or \"under-governed\" urban environment. Complete development of CZTK which resides on a secure, unclassified network and empowers analysts and operators with leading edge analytical tools and expert instruction, to enable near-real time situational awareness from host-nation perspective (‘green lens’), related to activities and actors of concern. This platform focuses exclusively on publicly available information accessible on the internet to enhance the ability of analysts and operators to develop and maintain a real time pulse of how terrorist groups make use of open source messaging to recruit, train, and fundraise. Continue the development and test of an exportable IO capability that legitimate governments’ can use to counter violent extremist messaging. Conduct testing and evaluation by delivering training and periodic evaluation through the use of mobile advise and assist training teams in three select countries. Complete development of the Social Networking Terrain Analysis effort, a web-based software application framework that can visualize and monitor online social network terrain using publicly available information and will be integrated into CZTK. Complete a new effort implementing advanced information exchange tools and training to help build partner nation collaborative capacity. Complete evaluation study on a new technology that 1) detects real-time cases of Da’esh’s recruitment on social media and 2) in an automated fashion, engages and disrupts extremist recruitment and provide information on current and developing technology, as well as advice on opportunities and risks in developing a program to support this new capability. Complete an effort that will address a gap in understanding the strategy and concepts of how to foster effective Counter Unconventional Warfare (UW) in the modern age and inform strategy and concepts focused on how a country prepares itself to conduct resistance against an occupying aggressor and what measures and actions a country can take prior to occupation. Initiate an effort to define the information environment in 2025, outline potential capability gaps, and describe necessary actions in order to gain and maintain information dominance. In addition, this effort will explore information-related capabilities of defense agencies, emerging technologies, and will recommend implementation considerations based on current budget concerns. Initiate development of a capability to simultaneously engage populations across numerous modalities such as social media, web, voice, SMS, MMS, and paper-to-digital, in order to reach disconnected populations around the globe. This effort will enable wide-scale two-way communications in a variety of geopolitical environments, to include those areas with and without internet connectivity. Initiate a Remote Advise and Assist (RAA) project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely and be able to significantly enhance time with their partners when physical access is severely restricted. Initiate the development of a database containing relevant foreign criminal statutes\/regulations translated into English and searchable against identified behaviors\/activities to compare relevant foreign criminal statutes\/regulations as well as the willingness\/capability of partner nations to take action against identified threat networks and help operationalize law as another non-kinetic tool for commanders. Initiate the development of a tool to support decision makers managing digital operations with predictive advice as to how people will respond to a choice of different types of interventions and improved decision making not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Initiate an effort to manage, develop, enhance, integrate, test, deploy, and maintain a SUNet enterprise system that allows users the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.199"
                                            },
                                            "Text": {
                                                "val": "Complete the design of a holistic common interagency analytical and planning approach that better identifies capabilities, authorities and funding, links US, Allied and partner nation objectives and builds synergy when conducting partner nation capacity building missions.  The analytical and planning approach is available for use in interagency and allied nation training curriculum. Complete the development of a platform to collect and analyze photographs, videos, audio recordings, and general text-based information via precise crowd sourcing techniques. The technical approach will provide the capability to conduct facial, object and ISIL branded content recognition.  An Android-based application will also be available that can be customized for a specific region, language, and purpose to use for crowd source media collection. Upon completion, the project will immediately enhance the ability of information communicators to collect, search, retrieve, view and analyze photos, audio, and video for use. Complete the transition of the Nightingale effort to deploy digital workflow, approval, and archival processes in support of the CVE mission. This project will provide enhanced coordination, information sharing, and messaging capabilities in support of countering violent extremism. Complete the Western Hemisphere Illicit Pathways effort implementing advanced information exchange tools and training to help build partner nation collaborative capacity among critical U.S. southern borders and approaches. Complete OCONUS operational test and evaluation (OT&E) to provide forward deployed units with access to PAINT. This project will provide teams operating in high threat areas with real-time indications and warnings for blue force protection using social media and other publicly available information (PAI). OT&E will conclude in June 2018. Complete development of an improved capability to conduct multi-layered analysis of the Information Environment using publicly available information and display relevant data and product views in a Common Operating Picture to facilitate Phase 0 planning of Information Environment shaping activities to effectively compete in the environment against state and non-state actors. Complete report that defines the information environment in 2025, outline potential capability gaps, and describe necessary actions in order to gain and maintain information dominance. In addition, this effort will explore information-related capabilities of defense agencies, emerging technologies, and will recommend implementation considerations based on current budget concerns. Upon completion, this project will help prepare the USG for evolving challenges in hybrid-warfare. Complete development of a capability to simultaneously engage populations across numerous modalities such as social media, web, voice, SMS, MMS, and paper-to-digital, in order to reach disconnected populations around the globe. This effort will enable wide-scale two-way communications in a variety of geopolitical environments, to include those areas with and without internet connectivity. Complete development of a database containing relevant foreign criminal statutes\/regulations translated into English and searchable against identified behaviors\/activities. This will enable users to compare and search for relevant foreign criminal statutes\/regulations as well as the willingness\/capability of partner nations to take action against identified threat networks. While this approach will initially focus on violent extremist organizations and their supporting networks, it can be applied across a wide-range of non-State, unconventional, and hybrid threats, to include counter-proliferation networks and transnational criminal organizations. This project will help operationalize law as another non-kinetic tool for commanders. Complete the development and test of an exportable information operations capability that legitimate governments’ can use to counter violent extremist messaging. Conduct testing and evaluation by delivering training and periodic evaluation through the use of mobile advise and assist training teams. Continue a Remote Advise and Assist (RAA) project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely. By having a robust RAA capability, advisors will be able to significantly enhance time with their partners when physical access is severely restricted. By being able to advise partners in a real time operational environment, the time-period needed to enhance that partner’s capacity can be significantly reduced. Observations will examine how to advance virtual communications between advisors and partners during operations. Continue the development of a tool to support decision makers managing digital operations with some form of predictive advice as to how people will respond to a choice of different types of interventions. In this way, decision-making will be improved not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Continue an effort to manage, enhance, and maintain a SUNet enterprise system that allows the user the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells). Initiate and complete a simplified Full Spectrum Remote Advise and Assist (FS-RAA) project to simplify current RAA prototypes in order to test the ability of advisors to continue mentoring poorly educated and minimally vetted partners. By having a simplified FS-RAA capability, advisors will be able to enhance time with their partners when physical access is severely restricted.  By being able to advise poorly educated and minimally vetted partners in a real time operational environment, the time period needed to enhance that partner’s capacity can be significantly reduced while still protecting advanced tactics, techniques and procedures reserved for closely vetted partners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.109"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.109"
                                            },
                                            "Text": {
                                                "val": "Complete a Remote Advise and Assist (RAA) project to examine conditions that would lead to successful RAA operations in a full spectrum environment and then develop and field advanced RAA prototypes in order to test the ability of advisors to continue mentoring partners remotely. By having a robust RAA capability, advisors will be able to significantly enhance time with their partners when physical access is severely restricted.  By being able to advise partners in a real time operational environment, the time-period needed to enhance that partner’s capacity can be significantly reduced. Observations will examine how to advance virtual communications between advisors and partners during operations. Continue the development of a tool to support decision makers managing digital operations with some form of predictive advice as to how people will respond to a choice of different types of interventions. In this way decision-making will be improved not only for planning purposes but also for the development of capability underpinned by a behavioral science evidence base. Continue an effort to manage,  enhance, and maintain a SUNet enterprise system that allows the user the ability to detect, monitor, understand, and act in the information environment through mission specific enclaves (partitioned mission or function information cells). Initiate an effort to conduct research to determine how, when, and why adversary narratives reach and influence people online. Once defined, a prototype will be built to provide a comprehensive view of actors and narratives within social media ecosystems. The solution will consider 1) relevant behavioral science, psychology, and cognitive frameworks for explaining and detecting digital message resonance, and ultimately behavior shifts, 2) variations in audience responses based on demographics and psychographics. Initiate an effort to develop the capability for Military Information Support Operations operators to deliver small electronic media devices that contain pertinent content that can be safely air dropped and gain the attention to various target audiences on the ground. This effort will augment existing capabilities with more advanced technology. Initiate an effort to develop a comprehensive operational level planning and Command, Control, Communications, Computers, Intelligence tool within the Android Tactical Assault Kit (ATAK). ATAK’s use in the Joint, Interagency, Intergovernmental and Multinational environment is limited to a common operational picture and communications platform. ATAK currently integrates ad-hoc mission command systems by end users linking ATAK with other commercial-off-the-shelf and government-off-the-shelf applications such as mIRC chat, Easy TV, RaptorX, and google earth with varying levels of effectiveness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental efficiencies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PERSONNEL PROTECTION"
                                    },
                                    "Description": {
                                        "val": "The Personnel Protection Subgroup’s objective is to develop new equipment, reference tools, and standards to improve the protection of personnel. Projects focus on putting innovative tools such as automated information management systems, communication devices, tagging, tracking and locating devices, mobile surveillance systems, as well as personal and vehicle protection equipment in the hands of personnel."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.895"
                                            },
                                            "Text": {
                                                "val": "Complete development of a wireless tactical communications headset. Complete development of counter unmanned aerial vehicle capabilities. Complete development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury. Complete development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor. Complete a performance analysis of environmental, storage, duty, and geographic region parameters on the degradation and life cycle of body armor. Complete development of an imminent danger notification system that immediately alerts building occupants to a perceived or actual threat. Complete development of an event pin detection system to mitigate the risk of adversaries, including insider threats, gaining unauthorized access to event sites. Complete development of an enhanced vehicle tracking system to operate in urban and GPS denied areas. Complete development of a multi-radio device that combines multiple radios, GSM and Iridium communication capabilities into one device. Continue development of a system to detect magnetically attached explosive devices placed on vehicles and research and provide proof of concepts to detach the devices. Initiate and complete development of a small lightweight wearable device that securely transmits biometric and geolocation data to a common operating picture. Initiate development of a multifunctional head protection system that provides ballistic protection, and incorporates communication and data display capabilities. Initiate development of a standalone personal armor plated for high power, armor piercing projectile threats using advanced materials. Initiate development of a helmet system to protect against common high power rifle projectile threats. Initiate development of a test apparatus that serves to measure dynamic and static events during and after the course of a ballistic impact. Initiate development of a female body armor ballistic validation protocol through the development of a female backing system and female armor test protocol to ensure female body armor performs to the same standards as male body armor. Initiate development of a mobile sensor suite that can detect subsonic and supersonic rounds that are fired at a convoy and display it on a real time map to provide situational awareness to the operator. Initiate development of appropriately sized armor plates for use in a concealable carrier system to provide rifle threat protection."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.588"
                                            },
                                            "Text": {
                                                "val": "Complete development of systems to enhance situational awareness, intelligence collection capabilities, and personnel recovery efforts. Complete development of counter unmanned aerial vehicle capabilities.  Complete development of a novel material for ballistic and blast protection that utilizes fiber optics to enable visibility with opaque armor.  Complete development of a stand standalone personal armor plate for high power, armor piercing projectile threats using advanced materials.  Complete development of a helmet system to protect against common high power rifle projectile threats.  Complete the development of a test apparatus that serves to measure dynamic and static events during and after the course of a ballistic impact.  Complete development of a small lightweight wearable device that securely transmits biometric and geolocation data to a common operating picture. Complete development of a mobile sensor suite that can detect subsonic and supersonic rounds that are fired at a convoy and display the round’s origin, heading and range on a real time map to provide situational awareness to the operator.  Continue development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury.  Continue development of a man packable system that reduces or eliminates the radar, electronic, thermal, infrared, visual or acoustic signatures of a dismounted soldier. Continue the development of a multi-modal system to detect, identify and mitigate unmanned aerial threats to tactile vehicles and other mobile platforms in terrestrial and maritime environments.  Initiate development of standalone armor plates to defeat the 7.62 X 39mm, 124 grain, mild steel core (MSC) projectile.  Initiate development of an air deployable unmanned aerial system that is capable of dashing ahead of the V-22 and providing at least 8.5 minutes of overhead intelligence, surveillance and reconnaissance (ISR) at the landing zone or drop zone prior to the force arrival.  Initiate development of a robust Electromyography (EMG) sensor system comprised of electrodes, sampling electronics and processing electronics capable of integration into a robotic\/human augmentation platform.  Initiate the development of advanced systems to detect and mitigate unmanned aerial threats using novel detection and mitigation modalities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.479"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.479"
                                            },
                                            "Text": {
                                                "val": "Complete development of biomarker identification for brain injury using magnetic resonance imaging (MRI) and magnetic resonance spectroscopy (MRS) to monitor neurochemical biomarkers for post-traumatic stress disorder and mild traumatic brain injury.  Complete development of a man packable system that reduces or eliminates the radar, electronic, thermal, infrared, visual or acoustic signatures of a dismounted soldier. Complete the development of a multi-modal system to detect, identify and mitigate unmanned aerial threats to tactile vehicles and other mobile platforms in terrestrial and maritime environments. Continue development of standalone armor plates to defeat the 7.62 X 39mm, 124 grain, mild steel core (MSC) projectile.  Continue development of an air deployable unmanned aerial system that is capable of dashing ahead of the V-22 and providing at least 8.5 minutes of overhead intelligence, surveillance and reconnaissance (ISR) at the landing zone or drop zone prior to the force arrival.  Continue development of a robust Electromyography (EMG) sensor system comprised of electrodes, sampling electronics and processing electronics capable of integration into a robotic\/human augmentation platform.  Continue the development of advanced systems to detect and mitigate unmanned aerial threats using novel detection and mitigation modalities.  Initiate the investigation of the root causes of poor armor fit among U.S law enforcement agencies. Identify corrective actions and standard procedures to ensure proper fit to body armor users across the anthropometric spectrum of law enforcement professionals.  Initiate the development of a vehicle mounted, tethered aerial platform capable of carrying a wide variety of payloads to fill various mission needs.  Initiate the development of a test fixture to validate the performance of non-pneumatic limb tourniquets.  Initiate the development of a heads up display unit to be integrated into an existing helmet system and provide day and night display of data elements of interest to the operator.  Initiate the development of advanced, novel armor materials to provide next generation ballistic personal protection systems to military and law enforcement professionals. CUAS On the Move (MACE)\/MAFIA Integration\/BEAM, MACE, CORIAN Integration - Develop a system to provide a mobile platform to precisely detect, identify and mitigate sUAS threats; integrate the system into an existing command\/control system; and ensure compliance with other systems. Soldier Worn CUAS\/Single Node Capability - Develop a system to provide a dismounted squad with the ability to precisely detect, identify and mitigate sUAS threats by reducing the size and increasing the capability of a single node minimal degradation to operational performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental efficiencies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PHYSICAL SECURITY"
                                    },
                                    "Description": {
                                        "val": "Rapidly develop and transition physical security\/force protection capabilities and technologies to support forward deployed and domestic first responders, military, interagency, and international partners in the focus areas of Blast Effects and Mitigation; Maritime Security; Screening, Observation, Detection, and Protection; and, Subterranean Activities. Emphasize these technology development efforts primarily at U.S. embassies and consulates, forward operating bases, along the U.S. borders, at mass transportation and commerce nodes, in maritime port and littoral environments, and in support of large scale public venues."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "48.375"
                                            },
                                            "Text": {
                                                "val": "Complete development of forced-entry, ballistic and blast resistant doors to support US facilities abroad.  Complete development of an automatic target recognition system for on-the-move, standoff IED detection.  Complete development of an Advanced Diver Data Display System final prototype for combat swimmers.  Complete development and upgrade of a tactical compact aerostat surveillance system for ground and maritime intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces.  Complete development of an in-tunnel unmanned aerial vehicle (UAV) that will provide the ability to safely conduct reconnaissance of discovered illicit tunnels and\/or scheduled inspections of underground municipal infrastructures (UMIs) for evidence of interconnecting tunnel activity.  Complete development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the force in tactical combat outposts.  Complete test program to determine the smallest booster size needed to initiate detonation of Ammonium Nitrate Prill in shipping configuration.  Complete development of materials and mechanisms for tactical delivery of novel non-lethal solutions for maritime vessel disablement.  Complete development of a mobile application to enhance and host the Vehicle Explosion Analysis Software.  Complete testing, characterization and modeling of a novel propane tank Vehicle Borne Improvised Explosive Device (VBIED) threat.  Complete development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system.  Complete development of a system for mapping particular geophysical phenomena.  Complete development and evaluation of a scanning system which will be able to maneuver independently inside specified geophysical target areas and provide situational awareness.  Complete development of a joint multi-disciplinary geophysical survey kit, comprised of distinct tools.  Complete development of a system for detection of unique geophysical phenomena, and testing and evaluation of the prototypes’ performance in representative sites.  Complete the design and characterization of a test site for testing emerging technologies for unique operational missions.    Continue development of an advanced active diver thermal protection system for long exposure dives.  Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures.  Continue testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests.  Continue development and evaluation of two versions of a unique geophysical mapping capability.  Continue development of a prototype communications system for special missions in specified environments.  Continue testing and evaluating the integration of proven land-based sensors into a novel platform for the purpose of conducting advanced geophysical surveys.  Continue development of a set of guidelines and certifications that can be used by public, private, academic, and government entities to support the qualification of engineers and architects capable of characterizing and mitigating explosive effects.  Continue development of a mobile system for stand-off detection and mapping of specified geophysical phenomena.  Continue development and integration of an extended coverage system for novel border protection applications and test and evaluate the integrated system in different terrain\/geophysical conditions.  Continue development of a prototype system and concept of operations to detect a particular geophysical phenomenon.  Initiate development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving targets.  Initiate development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments.  Initiate development of a set of handcuffs that are able to withstand specific physical defeat techniques employed by a detained individual or individuals without the appropriate key, while maintaining the basic design and functionality of currently used handcuffs.  Initiate development of a software tool associated with a comprehensive evaluation of horizontal directional drilling (HDD) equipment that can be used to focus intelligence collection and threat assessments.  Initiate development of a Compact Wireless Surveillance System to safely conduct ground reconnaissance within specific geophysical environments with limited access points.  Initiate development of a remote activation device for tactical arresting systems designed to stop vehicles over a short distance.  Initiate the testing and evaluation of the use of binary explosives for unique applications in specific environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "31.631"
                                            },
                                            "Text": {
                                                "val": "Complete development of an automatic target recognition system for on-the-move, standoff IED detection. Complete development of an Advanced Diver Data Display System final prototype for combat swimmers. Complete development and upgrade of a tactical compact aerostat surveillance system for ground and maritime intelligence, surveillance and reconnaissance, as well as communication between non-line-of-sight (NLOS) forces. Complete development of computer modeling and simulation program to determine the smallest booster size needed to initiate detonation of Ammonium Nitrate prill in shipping configuration to determine screening and detection capability needed to prevent the weaponization of fertilizer being transported in public areas.  Complete joint work between U.S. and Australia to test, characterize and model a novel propane tank Vehicle Borne Improvised Explosive Device (VBIED) threat. Complete development of a portable and ruggedized body scanner for personnel protection missions based on the existing AIT stationary body scanner system developed by Tek84. Complete development and evaluation of a scanning system able to maneuver independently inside specified geophysical target areas and provide situational awareness. Complete the design and characterization of a test site for testing emerging technologies for unique operational missions. Complete development of a surveillance system with automated 360-degree long range scanning capability (optical radar) to protect the Force in tactical combat outposts. Complete development of a set of guidelines and certifications that can be used by public, private, academic, and government entities to support the qualification of engineers and architects capable of characterizing and mitigating explosive effects.  Complete testing on localized responses from facades to quantify the effects of responding components on blast propagation through a new series of controlled explosive tests at the Urban Canyon Test facility. Complete development of a joint multi-disciplinary geophysical survey kit, comprised of distinct tools.  Continue construction of a test site in a specific geographic region for testing emerging technologies for unique operational missions.  Complete development of a set of handcuffs that are able to withstand specific physical defeat techniques employed by a detained individual or individuals without the appropriate key, while maintaining the basic design and functionality of currently used handcuffs. Complete development of a software tool associated with a comprehensive evaluation of horizontal directional drilling (HDD) equipment that can be used to focus intelligence collection and threat assessments, providing leadership with enhanced situational awareness and directing the allocation of limited resources to areas of highest risk.  Complete the design and installation of a novel concept for an underground training and tactical test site in the United States, for training operators and testing and evaluating tactical technologies.  Complete development of a larger version of a technology used to block entrances or doorways with time delay and cart for system transport.      Continue development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations.  Continue development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures. Continue development of a prototype communications system for special missions in specified environments.  Continue development of a system for detection of unique geophysical phenomena and testing and evaluation of the prototypes’ performance in representative sites. Continue development of a mobile system for stand-off detection and mapping of specified geophysical phenomena using technology developed under previous bilateral tasks. Continue development, integration and T&E of an extended coverage system for novel border protection applications in different terrain\/geophysical conditions.  Continue development of additional mission capabilities to the Sappheiros unattended ground sensor system to enable deployment, detection and tracking of targets in various geophysical environments. Continue development of a prototype system and concept of operations to detect a particular geophysical phenomenon. Continue development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving target.  Continue development of an algorithm for detecting weapons in baggage that will be integrating into existing baggage x-ray systems. Continue development of a roller door that is forced-entry (FE) resistant and capable of meeting the State Department 15-Minute FE performance criteria.  Initiate the testing and evaluation of the use of binary explosives for unique applications in specific environments. Initiate development of a remote activation device for tactical arresting systems designed to stop vehicles over a short distance.  Initiate development of an in-depth guide of best practices for rescuing tunnel collapse victims inside OSHA-compliant and non-compliant tunnels to enhance survivability.  Initiate development of a novel ship-to-shore fuel transport system in an amphibious towable container that mitigates risk to personnel and fuel loss in the event of an attack. Initiate development of a long-term sensor system incorporated during the tunnel remediation process that will detect tampering, motion, and tunneling activity and provide an alert to a remote monitoring station. Initiate adaptation of a proven land system to a novel type of detection platform. Initiate modification of the Dialogue system to enable communication among a network of multiple users and at longer ranges.  Initiate development of a tactical spray-on reinforcement kit for potentially dangerous structures. Initiate development of a self-positioning personnel tracking system. Initiate development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments. Initiate development of a compact, user-friendly tool for measuring the azimuth and range of a below ground structure from above ground that provides the measurements in real-time. Initiate development of a tactical and easy-to-use tool that will enable an operator to see behind obstacles (e.g. brick walls, sandbags, doors, etc.), from a safe distance, in underground confined structures. Initiate development of a new capability for the modeling of tunnel IED effects within the Vulnerability Assessment and Protection Option (VAPO) software tool and for rendering tactical tunnels unusable through predictive blast modeling."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "31.547"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.547"
                                            },
                                            "Text": {
                                                "val": "Complete construction of a test site in a specific geographic region for testing emerging technologies for unique operational missions.  Complete development of an advanced active diver thermal protection system for long exposure dives, including SEAL Delivery Vehicle (SDV) operations. Complete development of decision aids for first responders and military engineers by testing explosives effects in an urban environment, to include Historic Masonry and frangible front structures. Complete development of a prototype communications system for special missions in specified environments.  Complete development of a system for detection of unique geophysical phenomena and testing and evaluation of the prototypes’ performance in representative sites. Complete testing and evaluating the integration of proven land-based sensors into a novel platform for conducting advanced geophysical surveys. Complete development of a mobile system for stand-off detection and mapping of specified geophysical phenomena using technology developed under previous bilateral tasks. Complete development, integration and T&E of an extended coverage system for novel border protection applications in different terrain\/geophysical conditions. Complete development of a prototype system and concept of operations based on a particular geophysical phenomenon. Complete the testing and evaluation of the use of binary explosives for unique applications in specific environments.  Complete development of a remote activation device for tactical arresting systems designed to stop vehicles over a short distance. Complete development of an algorithm for detecting weapons in baggage that will be integrating into existing baggage x-ray systems.  Complete development of a roller door that is forced-entry (FE) resistant and capable of meeting the State Department 15-Minute FE performance criteria. Complete the development of an in-depth guide of best practices for rescuing tunnel collapse victims inside OSHA-compliant and non-compliant tunnels to enhance survivability. Complete development of a long-term sensor system incorporated during the tunnel remediation process that will detect tampering, motion, and tunneling activity and provide an alert to a remote monitoring station. Complete modification of the Dialogue system to enable communication among a network of multiple users and at longer ranges.  Continue development of a tactical spray-on reinforcement kit for potentially dangerous structures. Continue development of a self-positioning personnel tracking system. Continue development of additional mission capabilities to the Sappheiros unattended ground sensor system to enable deployment, detection and tracking of targets in various geophysical environments. Continue development of improved, cost-effective High Power Radio Frequency (HPRF) sources for nonlethal vessel and vehicle stopping that achieve militarily useful effective ranges against fast moving targets.  Continue development of a novel ship-to-shore fuel transport system in an amphibious towable container that mitigates risk to personnel and fuel loss in the event of an attack. Continue development of adapting a proven land system to a new type of platform detection. Continue development of a fast-running ultra-high performance concrete slab model, WAC-U, and improve tools for design, protective use, and vulnerability assessments. Continue development of a compact, user-friendly tool for measuring the azimuth and range of a below ground structure from above ground that provides the measurements in real-time. Continue development of a tactical and easy-to-use tool that will enable an operator to see behind obstacles (e.g. brick walls, sandbags, doors, etc.), from a safe distance, in underground confined structures. Continue development of a new capability for the modeling of tunnel IED effects within the Vulnerability Assessment and Protection Option (VAPO) software tool and for rendering tactical tunnels unusable through predictive blast modeling."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "25.000"
                                            },
                                            "Text": {
                                                "val": "Funding request supports the Anti-Tunnel project.."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "In FY 2018 the Department added additional OCO funds to support the Anti-Tunnel project. In FY 2019 funding in the amount of $25.000 will be requested in OCO."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "SURVEILLANCE, COLLECTION AND OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "Identify high-priority user requirements and special technology initiatives focused primarily on countering terrorism through offensive operations.  Enhance US intelligence capabilities to conduct retaliatory or preemptive operations and reduce the capabilities and support available to terrorists."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.076"
                                            },
                                            "Text": {
                                                "val": "Continuing development and integration of Unmanned Aircraft Systems (UAS) and subsystems to improve the effectiveness and efficiency of communication relays to counter ISIL. Initiating new capabilities focused on Human Language Technology and multimedia exploitation in critical languages for operational use against ISIL at the strategic and tactical levels. Continuing development of enhanced capabilities to facilitate Computer Network Operations against ISIL. Continuing development of enhanced capabilities against vehicular signals of interest to counter ISIL. Continuing deployment of field technical surveillance capabilities against ISIL and enhanced custom force tagging, tracking and locating capabilities. Continuing the development of convergence solutions to support sustained operations by deployed elements combating ISIL through enhanced layered capabilities.  Continuing the development of non-standard and specialized communications capabilities to combat ISIL and other highly technical adversaries.  Initiate development of unique biometric capabilities to target ISIL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.535"
                                            },
                                            "Text": {
                                                "val": "Complete the critical design, development, and initial production of the CALYPSO RFIC and initial transceiver devices with integrated CALYPSO chips resulting from the Atlas Enhancement Study. Complete Classified Technical Collection Project. Complete Madonna Classified Social Media Project.  Complete Scorpion Classified Telematics Project and delivery of tools and training.  Complete Integration of voice identification technologies onto the ROVER signal intercepts capability.  The effort shall support integration and correlation of voice capabilities as well as future, optional features including analysis of social media and activity pattern analysis. Complete development of a Biometric System for identifying Cardiological Signatures.  Complete developmental effort of a small, stand-alone tracking device capable of obtaining position location information (PLI) in the presence of high powered jamming\/spoofing or in areas of weak GPS signals.  Complete project that leverages of assets and capabilities to support United States and United Kingdom’s research and development efforts in the areas of audio, video, image and text processing from (primarily, but not constrained to) open data sources.  Complete development of an automated software-based tool that will extract face and hand related data from video streams and fuse the results to present the strongest possible measure of identity from available data. This effort shall provide a functional platform that can be expanded to include other biometric factors found in video such as voice, gait, movements and gestures. Complete Dragonfly Classified Technical Collection Project.  Complete development to integrate the capabilities necessary to receive and process the Iridium GDB service into a custom version of Qualcomm's SirfstarVXP, an application specific integrated circuit (ASIC).  Continue development of new or improved technologies pertaining to non-standard, secure communications.  Continue Cattledog Classified Surveillance Project.  Continue development to deliver novel and high-performance noise reduction and speaker TTL software, based on cochlear and auditory cortex models.  The effort shall support the delivery and integration of two software packages to support military operations and to enhance DOD capabilities.  The technologies must provide near real-time situational awareness of incoming signals, filtering speakers, messages, languages, and location.  Continue development of High Altitude Pseudo Satellite payloads in support of the Coalition Warfare Joint Capabilities Demonstration to develop the Pseudo Synthetic Aperture Radar for airborne persistent surveillance systems.  Continue development and demonstration of a low profile tactical radio system with optimized performance.  The system will enable ready exchange of information between mobile tactical users in a form factor that provides the flexibility to customize the configuration and achieve communications without or in an area with degraded infrastructure.  Continue project to support information sharing and testing of newly developed EW capabilities with the United Kingdom.  Initiate development of a single compact, gimbaled next generation Hyperspectral Imagery (HSI) aerial sensor in both SWIR and LWIR wavebands and provide industry standard data outputs. \nInitiate development of a KA band small form factor electronically steerable array antenna system for maritime and mobile operations.  Initiate Othello Classified Technical Collection Project.  Initiate development of the Carthage Classified Project to develop an Emergency Notification and Tracking communications capability.   Initiate development of Cajamarca, a classified cyber enabled capability.  Initiate development of project Crossfire, a classified special communications and technical collection capability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.415"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.415"
                                            },
                                            "Text": {
                                                "val": "Complete development of new or improved technologies pertaining to non-standard, secure communications.  Complete Cattledog Classified Surveillance Project.  Complete development to deliver novel and high-performance noise reduction and speaker TTL software, based on cochlear and auditory cortex models.  The effort shall support the delivery and integration of two software packages to support military operations and to enhance DOD capabilities.  The technologies must provide near real-time situational awareness of incoming signals, filtering speakers, messages, languages, and location. Complete development and demonstration of a low profile tactical radio system with optimized performance.  The system will enable ready exchange of information between mobile tactical users in a form factor that provides the flexibility to customize the configuration and achieve communications without or in an area with degraded infrastructure.  Complete project to support information sharing and testing of newly developed EW capabilities with the United Kingdom.  Complete development of a KA band small form factor electronically steerable array antenna system for maritime and mobile operations.  Complete Othello Classified Technical Collection Project.  Complete development of the Carthage classified project to develop an Emergency Notification and Tracking communications capability.  Continue spiral development of the CALYPSO RFIC and update to the initial transceiver devices with integrated CALYPSO chips providing an enhanced programmable waveform integration capability.  Continue development of High Altitude Pseudo Satellite payloads in support of the Coalition Warfare Joint Capabilities Demonstration to develop the Pseudo Synthetic Aperture Radar for airborne persistent surveillance systems.  Continue development of a single compact, gimbaled next generation Hyperspectral Imagery (HSI) aerial sensor in both SWIR and LWIR wavebands and provide industry standard data outputs.  Continue development of Cajamarca, a classified cyber enabled capability. Continue development of project Crossfire, a classified special communications and technical collection capability.  Initiate classified feasibility assessment to design and develop a new Cube Satellite Communications System.  Initiate classified project to develop a new Personal Electronic Device Secured Note taking application.  Initiate development of a new miniaturized Ultra High Frequency Band antenna or family of antennas.  Initiate classified project to develop a specialized antenna system.  Initiate classified project to develop wave form identification system.  Initiate classified feasibility assessment resulting in an initial design for a new Mesh Enabled Communication System.  Initiate classified project to develop a Media Exploitation capability.  Initiate classified project to develop a Technical Assessment Capability.  Initiate classified project to develop Encrypt and Wipe application."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental efficiencies and economic assumptions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL OPERATIONS SUPPORT"
                                    },
                                    "Description": {
                                        "val": "The Tactical Operations Support subgroup’s mission is to execute rapid research and development projects that enhance capabilities of DoD and Interagency special operations tactical teams engaged in finding, fixing, and finishing terrorists. This includes support to state and local law enforcement agencies to combat domestic terrorism.  The development focus is enabling small tactical units by providing state of the art overmatch capabilities in: Offensive Systems; Unconventional Warfare, Counter-Insurgency Support; Tactical Communications; Tactical Reconnaissance, Surveillance, and Target Acquisition Systems; Specialized Infiltration, Access and Exfiltration Systems; and Survivability Systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "13.047"
                                            },
                                            "Text": {
                                                "val": "Complete development and delivery of an acoustic tooth communicator system for low-visibility operations. Complete development and delivery of a tactical communications capability that provides small tactical teams the ability to utilize cutting edge software applications and smartphone hardware over an untrusted host-nation cellular\/internet infrastructure that also includes integration with the Android Tactical Assault Kit (ATAK) and secure forward operational logistics. Complete development and delivery of a non-pyrotechnic diversionary device that will mitigate collateral damage in confined spaces. Complete development and delivery of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long range target acquisition in challenging environments. Complete development and delivery of a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities. Complete development and delivery of a lethal miniature aerial munition system (LMAMS) with substantially improved maneuverability, attack angle, loiter time, and lethality with a full mission profile flight training variant. Complete development and delivery of an unclassified, open source digital operations technical course tailored to train tactical operators in a digital dojo environment to understand the cyber domain and to identify and mitigate cyber threats, while also providing tactical operators the ability to conduct sustainment training on a digital sandbox range. Complete development and delivery of a tactical level training course that teaches operationally relevant capabilities to execute digital force protection and operational security for Publically Available Information (PAI). Complete development and delivery of a next-generation small unmanned aircraft system stabilized gimbal that integrates laser target designation technologies. Complete development of a state‐of‐the‐art amplified transceiver speaker unit to work with a number of military and commercial radio devices. Complete development of an increased field of view night vision device for Special Operations Forces (SOF). Continue development and delivery of capabilities for next generation specialized access breaching capabilities involving explosives and hand-held devices. Complete development of a capability to self-geolocate without causing an RF signature and without relying on GPS capabilities. Continue development of a next generation Lightweight Medium Machine Gun (MMG) and polymer .338 Norma Magnum ammunition to give operators a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Continue development and delivery of a modular multi-ability rapidly reconfigurable hand launched small unmanned aircraft system with a common controller that is capable of being re-configured in the field for mission specific tasks. Complete development of a 7.62x51mm Subsonic round optimized to address powder sensitivity issues in order to improve consistency, range, and accuracy. Initiate development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Initiate development of an augmented reality navigation system capability that fuses and overlays a tablet camera’s live footage, navigation instructions, and targeting information for an operator to utilize while operating a vehicle. Initiate development of a man-portable (dismounted\/static) and on-the-move (vehicle mounted) anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.505"
                                            },
                                            "Text": {
                                                "val": "Complete spiral development to improve form factor, interoperability, and battery life of a state‐of‐the‐art amplified transceiver speaker unit to work with a number of military and commercial radio devices. Complete development of an augmented reality navigation system capability that fuses and overlays a tablet camera’s live footage, navigation instructions, and targeting information for an operator to utilize while operating a vehicle. Complete development and delivery of a modular multi-ability rapidly reconfigurable hand launched small unmanned aircraft system with a common controller that is capable of being re-configured in the field for mission specific tasks. Complete development of a 7.62x51mm subsonic round optimized to address powder sensitivity issues in order to improve consistency, range, and accuracy. Complete development and delivery of a tactical communications capability that provides small tactical teams the ability to utilize cutting edge software applications and smartphone hardware over an untrusted host-nation cellular\/internet infrastructure that also includes integration with the Android Tactical Assault Kit (ATAK) and secure forward operational logistics. Complete development and delivery of a multispectral augmented visually enhanced reality imaging capability that provides a significant advantage for long-range target acquisition in challenging environments. Complete development and delivery of a maritime canister launched small unmanned aerial system for amphibious and maritime operations requiring overhead aerial ISR capabilities. Complete development and delivery of a next-generation small unmanned aircraft system stabilized gimbal that integrates laser target designation technologies. Complete development of an increased field of view night vision device for Special Operations Forces (SOF). Complete development of a capability to self-geolocate without causing an RF signature and without relying on GPS capabilities. Complete test and evaluation of next generation tooth acoustic communications system for low-profile operations. Continue development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Continue development of a man-portable (dismounted\/static), on-the-move (vehicle mounted), and kinetic kill anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS). Continue development of an accurized 120mm mortar system with an advanced targeting system for installation and employment on a 5-ton Medium Tactical Vehicle (MTV) capable of lethal target engagement from a short halt out to 7 kilometers. Continue testing and optimization of barrel length, rifling twist rate, and suppression of the .300 Blackout rifle platform in conjunction with an underwater supercavitating ammunition. Continue spiral development of a next generation Lightweight Medium Machine Gun (LWMMG) and polymer .338 Norma Magnum ammunition to give operators a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Initiate development of a High Frequency (HF) radio integrated into a cellular phone for use in low-profile operations. Initiate development of a new ballistic algorithm, projectile drag coefficient, and weapon system for lethal target engagement beyond 2,500 meters."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "52.373"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "52.373"
                                            },
                                            "Text": {
                                                "val": "Complete development of an Air to Surface Employment Kit (A2SEEK), for the already developed Micro Weather Sensor (MWS), to be packaged into a complete system that will be air dropped out of military aircraft to support operators and C2 elements to receive sensed weather elements and formulate aviation reports in deep battlespace or denied areas. Complete development of a man-portable (dismounted\/static), on-the-move (vehicle mounted), and kinetic kill anti-drone system kit that is capable of detection, tracking, identification, and defeating a small Unmanned Aircraft System (sUAS). Complete development of an accurized 120mm mortar system with an advanced targeting system for installation and employment on a 5-ton Medium Tactical Vehicle (MTV) capable of lethal target engagement from a short halt out to 7 kilometers. Complete testing and optimization of barrel length, rifling twist rate, and suppression of the .300 Blackout rifle platform in conjunction with an underwater supercavitating ammunition. Complete spiral development of a next generation Lightweight Medium Machine Gun (LWMMG) and polymer .338 Norma Magnum ammunition to give operators a distinct advantage in both the extended and close-in fight and be able to transition rapidly from mounted operations to dismounted operations. Complete development of a High Frequency (HF) radio integrated into a cellular phone for use in low-profile operations. Continue development of a new ballistic algorithm, projectile drag coefficient, and weapon system for lethal target engagement beyond 2,500 meters. Continue development of a small unmanned aerial system (sUAS) to safely conduct reconnaissance of discovered illicit tunnels and routine inspections of underground municipal infrastructure (UMI)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental efficiencies and economic assumptions."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TRAINING TECHNOLOGY DEVELOPMENT"
                                    },
                                    "Description": {
                                        "val": "The TTD Subgroup’s objective is to provide SOF, DoD, and the interagency community with agile, rapid response, R&D capabilities for optimizing performance in the operational environment while increasing readiness for tomorrow’s threats.  To meet this objective, the subgroup develops training technologies that are performance outcome focused in the areas of immersive and adaptive learning environments; human performance tools and techniques; mobile learning solutions; and advanced education and technical skill enhancement methods. TTD’s innovative training capabilities are implemented globally to prepare for critical missions in any operational environment to identify, disrupt, and defeat terrorist threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.867"
                                            },
                                            "Text": {
                                                "val": "Complete the development and delivery of four low-cost robotic targets that move autonomously on a live-fire training range to enhance marksmanship skills and decision making. Complete the development and evaluation of a multi-week special warfare commercial communications course. Complete the design and development of Task Force Officer verification and refresher training for delivery on a mobile device. Complete the implementation, evaluation, and refinement of a program and next generation technology designed to enhance visual acuity and improve operational visual task performance. Complete the design and development of training software for officers to accomplish immersive use of force decision-making training from a desktop computer or tablet. Continue the development of a virtual reality part task trainer for pre-mission tasks associated with AC-130 operations. Initiate the development of a virtual reality simulated city environment where students will be immersed into realistic training scenarios, such as surveillance, with representative quantities and behaviors of non-player characters including people and vehicles. Initiate the design and development of Remotely Operated Vehicle (ROV) training simulator incorporating the use of the ROV’s cameras, sonar, and navigation software. Initiate the development and evaluation of an automated capability to diagnose shooter performance and problems based on data from an iron sight camera, trigger force sensors, hand grip pressure sensors, and an accelerometer. Initiate the development of a system for snipers to enhance marksmanship skills and receive ballistically accurate feedback in a role-player training environment where live-fire is not available or feasible."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.217"
                                            },
                                            "Text": {
                                                "val": "Complete an evaluation of tools and techniques used by Special Operations to optimize and maintain cognitive performance through a comprehensive literature review and controlled study. Complete the implementation refinement of a program and next generation technology designed to enhance visual acuity and improve operational visual task performance. Complete the development of task force officer verification and refresher training accessible via a mobile device application. Complete the development of a virtual reality training part task trainer capability for pre-mission tasks associated with AC-130 operations. Complete the evaluation of a reactive shooter course incorporating wearable device human performance measures and training simulation technology. Complete the development of training software for officers to accomplish immersive use of force decision-making training from a desktop computer. Complete the development of an automated capability to automatically diagnose shooter performance. A full analysis of data collected from sight alignment, breathing, trigger process, and shot placement will be provided to coaches and instructors to enhance individual fundamental shooting skills. Continue the development of a Virtual Reality (VR) simulated city environment where students will be immersed into realistic training scenarios, such as surveillance, with representative quantities and behaviors of non-player characters (NPCs) including people and vehicles. Initiate the development of interactive instructional videos consisting of human like avatars demonstrating applied Explosive Ordnance Disposal skills for use as instructional aids in the classroom and student independent study. Initiate the development and evaluation of a synthetic intelligence, surveillance, and reconnaissance (ISR) system to train Full Motion Video (FMV) ISR operational knowledge, skills, and abilities without incurring the costs of utilizing live ISR platforms. Initiate the enhancement of an existing human performance application to incorporate the recording and analysis of mental performance indicators such as stress, motivation, and fatigue thereby providing a common language for instructors, psychologists, and human performance coaches to understand and make decisions about training. Initiate the development and evaluation of an immersive virtual reality training and exercise environment integrated with tools and techniques, such as heart rate monitoring and brain imaging, to objectively assess training effectiveness based on human performance research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.140"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.140"
                                            },
                                            "Text": {
                                                "val": "Complete the development of a Virtual Reality (VR) simulated city environment where students will be immersed into realistic training scenarios, such as surveillance, with representative quantities and behaviors of non-player characters (NPCs) including people and vehicles. Complete the development of interactive instructional videos consisting of human like avatars demonstrating applied Explosive Ordnance Disposal skills for use as instructional aids in the classroom and student independent study.  Continue the development and evaluation of a synthetic Internet sandbox to enable intelligence analysts and information operations personnel to train on tools and methodologies for the collection, analysis, and exploitation of adversary’s publicly available information (PAI), as well as engaging in large-scale Information Operations (IO) exercises, while mitigating the challenges and risks associated with training on the open, publicly visible Internet. Continue the development of a synthetic intelligence, surveillance, and reconnaissance (ISR) system to train Full Motion Video (FMV) ISR operational knowledge, skills, and abilities without incurring the costs of utilizing live ISR platforms. Continue the enhancement of an existing human performance application to incorporate the recording and analysis of mental performance indicators such as stress, motivation, and fatigue thereby providing a common language for instructors, psychologists, and human performance coaches to understand and make decisions about training. Continue the development of an immersive virtual reality training and exercise environment integrated with tools and techniques, such as heart rate monitoring and brain imaging, to objectively assess training effectiveness based on human performance research. Initiate the development of a synthetic Internet sandbox to enable intelligence analysts and information operations personnel to train on tools and methodologies for the collection, analysis, and exploitation of adversary’s publicly available information (PAI), as well as engaging in large-scale Information Operations (IO) exercises, while mitigating the challenges and risks associated with training on the open, publicly visible Internet. Initiate the development of a tactical decision making training system that is visually and auditorily immersive with realistic character representation and interaction, responds completely to all force application devices and methods, allows for unhindered use of tactical positioning, and is portable. Initiate the development of an MK-16 underwater breathing apparatus training capability consisting of an immersive mixed reality simulator focusing on scenarios to train emergency procedures. Initiate the development of a full motion video processing, exploitation and dissemination desktop training simulation that replicates a real world system along with a program of instruction for instructor-led training."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Reductions were in support of Departmental efficiencies and economic assumptions."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "N\/A"
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}