{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-JBOOK-3aa5750205815470029d4902e3ab7fe43a356ab3f6d3326908075a172dae75b4-1",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "@format": "R2Long",
        "ProgramElementNumber": {
            "val": "0601117E"
        },
        "ProgramElementTitle": {
            "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "42.250"
            },
            "CurrentYear": {
                "val": "43.126"
            },
            "BudgetYearOne": {
                "val": "47.825"
            },
            "BudgetYearOneBase": {
                "val": "47.825"
            },
            "BudgetYearTwo": {
                "val": "44.771"
            },
            "BudgetYearThree": {
                "val": "47.456"
            },
            "BudgetYearFour": {
                "val": "47.456"
            },
            "BudgetYearFive": {
                "val": "47.456"
            }
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "57.791"
                },
                "CurrentYear": {
                    "val": "43.126"
                },
                "BudgetYearOne": {
                    "val": "47.882"
                },
                "BudgetYearOneBase": {
                    "val": "47.882"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "42.250"
                },
                "CurrentYear": {
                    "val": "43.126"
                },
                "BudgetYearOne": {
                    "val": "47.825"
                },
                "BudgetYearOneBase": {
                    "val": "47.825"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-15.541"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.057"
                },
                "BudgetYearOneBase": {
                    "val": "-0.057"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-6.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "-2.374"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-7.167"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.057"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.057"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects Congressional reduction, reprogrammings and the SBIR\/STTR transfer. \nFY 2018:  N\/A\nFY 2019:  Decrease reflects minor program repricing."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MED-01"
                    },
                    "ProjectTitle": {
                        "val": "BASIC OPERATIONAL MEDICAL SCIENCE"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "42.250"
                        },
                        "CurrentYear": {
                            "val": "43.126"
                        },
                        "BudgetYearOne": {
                            "val": "47.825"
                        },
                        "BudgetYearOneBase": {
                            "val": "47.825"
                        },
                        "BudgetYearTwo": {
                            "val": "44.771"
                        },
                        "BudgetYearThree": {
                            "val": "47.456"
                        },
                        "BudgetYearFour": {
                            "val": "47.456"
                        },
                        "BudgetYearFive": {
                            "val": "47.456"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Basic Operational Medical Science Program Element will explore and develop basic research in medical-related information and technology leading to fundamental discoveries, tools, and applications critical to solving DoD challenges.  Programs in this project address the Department's identified medical gaps in warfighter care related to health monitoring and preventing the spread of infectious disease.  Efforts will draw upon the information, computational modeling, and physical sciences to discover properties of biological systems that cross multiple scales of biological architecture and function, from the molecular and genetic level through cellular, tissue, organ, and whole organism levels.  To enable in-theater, continuous analysis and treatment of warfighters, this project will explore multiple diagnostic and therapeutic approaches, including the use of bacterial predators as therapeutics against infections caused by antibiotic-resistant pathogens; developing techniques to enable rapid transient immunity for emerging pathogens; exploring methods to slow damage from pathological infection or traumatic injury; and identifying fundamental biological mechanisms that enable certain species to be tolerant to various environmental insults.  Advances in this area may be used as a preventative measure to mitigate widespread disease."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Analysis and Adaptation of Human Resilience"
                                    },
                                    "Description": {
                                        "val": "The Analysis and Adaptation of Human Resilience program will explore new methods to maintain and optimize warfighter health in response to environmental insults such as new and emerging infectious diseases.  Research efforts in this area will apply recent advances in comparative biology, genetic sequencing, omics technologies, and bioinformatics to develop new tools for modulating health to ensure warfighter readiness.  One approach to achieve this goal is identifying the fundamental mechanisms that enable certain species to be tolerant to various environmental insults.  Genomic and physiological analyses of a wide array of resilient animal species may be combined with sophisticated algorithms to identify important patterns of survival.  By analyzing patterns in the underlying variability of host responses for resilient animals, one may formulate a survival blueprint to restore and maintain warfighter homeostasis in response to infection.  This approach is orthogonal to traditional infectious disease research, which primarily relies on reducing the pathogen load through drug intervention.  Research efforts within this program may enable discovery of novel methods to optimize human health against infectious diseases caused by multi-drug resistant pathogens."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.809"
                                            },
                                            "Text": {
                                                "val": "-  Explored methods for effectively screening animal susceptibility and disease tolerance to infection.\n-  Collected, curated, and integrated retrospective datasets into the analysis of tolerance mechanisms.\n-  Validated algorithms and analytical tools to facilitate the discovery of tolerance mechanisms.\n-  Identified approaches for intervention based on novel tolerance mechanisms in animals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.861"
                                            },
                                            "Text": {
                                                "val": "-  Screen susceptibility and tolerance to infection in different animal species.\n-  Complete an analysis of the host response to infection in different animal species.\n-  Apply validated algorithms and tools towards the discovery of tolerance mechanisms.\n-  Generate a preliminary set of tolerance-based interventions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.055"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.055"
                                            },
                                            "Text": {
                                                "val": "-  Analyze the tolerance response across different animal species, infection models and those discovered in animals using open source human data sets.\n-  Validate tolerance mechanisms in resilient animal models.\n-  Test tolerance-based interventions in susceptible animal models."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease is due to the completion of the exploration of tolerance mechanisms and focusing on validation and testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Outpacing Infectious Disease"
                                    },
                                    "Description": {
                                        "val": "Military readiness and national security depend on the health and well-being of military service members.  Unfortunately, today's antivirals and vaccines are often circumvented by fast-mutating viruses that evolve to develop drug resistance.  Military service members often deploy to areas with such diseases that require new protective measures to maintain readiness.  The Outpacing Infectious Disease thrust will investigate fundamental methods for using biology as a technology to create adaptive therapeutic response mechanisms to outpace viral diseases such as enabling co-evolution and co-transmission of newly developed therapeutics to ultimately outcompete the pathogen.  Key advances expected from this research include identifying methods to discover and develop new classes of dynamic therapeutics for fast-mutating viruses.  This approach represents a significant departure from conventional antiviral therapies, which typically rely on static solutions and continuous re-formulation and re-development in attempt to keep pace with emerging strains and disease variants.  Advances in this area may be applied to the mitigation of known, new, or emerging diseases that impact military readiness and pose a National Security risk as a potential pandemic."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.234"
                                            },
                                            "Text": {
                                                "val": "-  Designed and built pathogen-derived therapeutic interfering particles (TIPs) to control disease by interfering with the pathogen.\n-  Developed dynamic in vitro platforms to test TIPs in vitro.\n-  Assessed the safety and efficacy of selected TIPs in vitro.\n-  Initiated design of computational models to assess host-disease-therapeutic dynamics at the cellular and organismal levels."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "16.976"
                                            },
                                            "Text": {
                                                "val": "-  Perform screening, optimization, and generalization of therapeutic interfering particles (TIPs) to other virus cases using dynamic in vitro platforms.\n-  Demonstrate proof of concept TIP co-evolution in vitro.\n-  Initial in vivo assessment of TIP safety and efficacy for selected viruses.\n-  Demonstrate initial proof of concept of TIP efficacy and co-evolution in silico."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.616"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.616"
                                            },
                                            "Text": {
                                                "val": "-  Apply predictive mathematical models to optimize TIP packaging and mobilization for increased efficacy.\n-  Investigate factors that determine TIP long-term stability.\n-  Evaluate TIPs for selected viruses in relevant animal models of infection.\n-  Optimize TIP production, purification, and scale-up."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects focused effort and evaluation of most promising technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Preventing the Emergence of Disease (PED)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Preventing Disease Transmission from Animal Carriers\n\nMany emerging infectious disease outbreaks have origins in animal reservoirs and occur in areas where DoD personnel are deployed, putting them at high risk of endemic and emerging diseases.  The Preventing the Emergence of Disease (PED) program will investigate how animal pathogens are transmitted to humans and explore novel approaches to prevent these events.  Tools such as detailed molecular analysis and bioinformatics will be leveraged. Researchers will develop models to quantify the probability of pathogen disease transmission from animals to humans.  Promising intervention approaches will be developed to prevent viral species jumps from animal reservoirs to humans. Predicting such jumps is a key capability to mitigating outbreaks originating in animal reservoirs."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.789"
                                            },
                                            "Text": {
                                                "val": "-  Quantify pathogen dynamics in different animal species and environments.\n-  Develop risk models of species jumps for selected viruses using biosurveillance data, geographic location, and animal-animal and\/or animal-human interactions.\n-  Integrate molecular and biosurveillance data in initial models to assess potential for animal to human transmission of selected viruses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.314"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.314"
                                            },
                                            "Text": {
                                                "val": "-  Develop mathematical models that predict parameters responsible for virus species jump.\n-  Identify approaches to deliver preemptive therapeutics at scale to large populations of animal and\/or vector reservoirs.\n-  Establish testbeds to validate model predictions.\n-  Provide proof-of-concept demonstration that preemptive approach reduces the probability of virus jump."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects initiation of framework for multi-location longitudinal sampling."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Early Battlefield Interventions (EBI)"
                                    },
                                    "Description": {
                                        "val": "Based on initial research conducted under the Analysis and Adaptation of Human Resilience program, the Early Battlefield Interventions (EBI) program will explore new methods to slow and limit damage caused by acute trauma and infection often suffered by our warfighters under far-forward conditions.  Research efforts will apply advances in molecular and cellular biology, cell signaling, and biomaterials to develop new tools to alter the time course of pathological processes associated with infection and tissue damage.  This tactic is a departure from traditional therapeutic approaches that seek to control symptoms associated with active infections or innate physiological responses to tissue trauma.  Advances in this area may be applied to the creation of both prophylactic and therapeutic medical countermeasures to forward-deployed service members."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Identify new chemical biology methods for reversibly slowing biological processes in cells.\n-  Develop high-throughput testing protocol to evaluate molecular mechanisms of novel approaches."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "9.840"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "9.840"
                                            },
                                            "Text": {
                                                "val": "-  Optimize chemical biology methods to reversibly slow biological processes in cells.\n-  Evaluate safety and efficacy of reversal mechanisms in cells. \n-  Investigate novel delivery methods to successfully implement interventions in multi-cellular systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects initiation of a thrust to investigate delivery mechanisms for leading chemical biology methods."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT)"
                                    },
                                    "Description": {
                                        "val": "The Autonomous Diagnostics to Enable Prevention and Therapeutics (ADEPT) program will develop the underlying technologies to rapidly respond to a disease or threat and improve individual readiness and total force health protection by providing capabilities which are currently available only in centralized laboratories in the U.S. to non-tertiary care and individual settings.  ADEPT will develop and exploit biological tools for the in vivo creation of nucleic acid circuits that continuously and autonomously sense and respond to changes in physiologic state and for novel methods to target delivery, enhance immunogenicity, or control activity of vaccines, potentially eliminating the time to manufacture a vaccine ex vivo.  ADEPT advancements to control cellular machinery include research to optimize orthogonality and modularity of genetic control elements; identify methods to increase sensitivity and specificity; and demonstrate methods to control cellular machinery in response to changes in physiological status.  ADEPT will develop methodologies for measuring health-specific biomarkers from a collected biospecimen to enable diagnostics at the point-of-need or resource limited clinical facilities (point-of-care), in-garrison or deployed.  Additionally, ADEPT will develop techniques that will enable the rapid establishment of transient immunity through stimulation of the production of components of the immune system to impart effective but temporary protection.  This transient immunity would bridge the time gap between the delivery of a vaccine and the development of a long term protective immune response.  Applied research efforts are budgeted in PE 0602115E, Project BT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.107"
                                            },
                                            "Text": {
                                                "val": "-  Initiated studies of gene-encoded antibodies in human safety trials.\n-  Initiated studies of efficacy of gene-encoded antibodies in a human clinical trial.\n-  Demonstrated the ability to identify antibodies against infectious diseases from patients in less than thirty days.\n-  Used current good manufacturing processes to synthesize formulations for animal challenge study."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Harnessing Biological Systems"
                                    },
                                    "Description": {
                                        "val": "The Harnessing Biological Systems program explored fundamental approaches to applying the advantages of nature's building blocks and principles in the design of biological technologies and systems.  Rather than creating biomimetic designs that imitate naturally evolved capabilities this program sought to transition to a biocentric design approach, developing tools and understanding mechanisms to leverage evolutionary advances from the start.  Key advances from this research included identifying approaches to discover and develop new classes of dynamic therapeutics for antibiotic-resistant bacteria.  One example was the identification of the underlying mechanisms by which predatory bacteria prey upon and consume other antibiotic-resistant bacteria that are pathogenic to humans.  This approach represents a significant departure from conventional antibacterial therapies that rely on small molecule antibiotics.  Advances in this area may be applied to a range of biological technologies including the autonomous control of epidemics."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.100"
                                            },
                                            "Text": {
                                                "val": "-  Investigated predatory bacteria effectiveness against pathogens of interest in in vivo models.\n-  Investigated mechanisms of predation and potential resistance.\n-  Developed quantitative models to describe predator-pathogen-host interactions.\n-  Analyzed biosynthetic pathways of the gut microbiota to discover and characterize disease tolerance-mediating metabolites."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}