{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-f6ce2d6fdd72f55e6bde81509aa64b9e4fd9e88c2a3ca324177acd603679c7b4-10",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603739E"
        },
        "ProgramElementTitle": {
            "val": "ADVANCED ELECTRONICS TECHNOLOGIES"
        },
        "R1LineNumber": {
            "val": "55"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "52.990"
            },
            "CurrentYear": {
                "val": "79.173"
            },
            "BudgetYearOne": {
                "val": "111.099"
            },
            "BudgetYearOneBase": {
                "val": "111.099"
            },
            "BudgetYearTwo": {
                "val": "145.159"
            },
            "BudgetYearThree": {
                "val": "192.760"
            },
            "BudgetYearFour": {
                "val": "207.577"
            },
            "BudgetYearFive": {
                "val": "217.629"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Advanced Electronics Technologies program element is budgeted in the Advanced Technology Development Budget Activity because it seeks to design and demonstrate state-of-the-art manufacturing and processing technologies for the production of various electronics and  microelectronic devices, sensor systems, integrated photonic-electronic components that have military applications and potential commercial utility. Introduction of advanced product design capability and flexible, scalable manufacturing techniques will enable the commercial sector to rapidly and cost-effectively satisfy military requirements.\n\nThe Mixed Technology Integration project funds the advanced development and demonstration of selected basic and applied electronics research programs.  Examples of technologies with funded development and demonstration activities include, but are not limited to: (1) self-contained laser weapon systems to protect airborne platforms from emerging surface-to-air missiles; (2) integrated photonic-electronic components for positioning, navigation and timing in GPS-denied environments; (3) flexible, software-defined cameras that enable real-time image analysis of complex scenes to provide more actionable information; and (4) component programs that integrate mixed signal (analog and digital) or mixed semiconductor technology to substantially improve the capability of existing components and\/or reduce their size, weight and power.  Funding under this project is intended to advance transitioning novel technologies to use, providing advanced components compatible with mid-term and other future warfighting requirements.\n\nThe Beyond Scaling Advanced Technologies project is a continuation of DARPA's basic and applied research in this area and will support activities in large scale co-development with leading industry players to enable and accelerate transformative computing interactions with industry. Additionally, funding under this project is intended to secure the design and capture of advanced intellectual property (IP) and architectures, IP sharing and re-use, and limited access to state-of-the-art (SOTA) and state-of-the-practice (SOTP) foundries for microelectronics fabrication runs."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.807"
                },
                "CurrentYear": {
                    "val": "79.173"
                },
                "BudgetYearOne": {
                    "val": "81.110"
                },
                "BudgetYearOneBase": {
                    "val": "81.110"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "52.990"
                },
                "CurrentYear": {
                    "val": "79.173"
                },
                "BudgetYearOne": {
                    "val": "111.099"
                },
                "BudgetYearOneBase": {
                    "val": "111.099"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "3.183"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "29.989"
                },
                "BudgetYearOneBase": {
                    "val": "29.989"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "3.710"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.527"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "29.989"
                                },
                                "BudgetYearOneBase": {
                                    "val": "29.989"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Increase reflects reprogrammings offset by the SBIR\/STTR transfer.  \nFY 2018:  N\/A\nFY 2019:  Increase reflects expanded focus in the Beyond Scaling Advanced Technologies Project supporting the Electronics Resurgence Initiative (ERI)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "MT-15"
                    },
                    "ProjectTitle": {
                        "val": "MIXED TECHNOLOGY INTEGRATION"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "52.990"
                        },
                        "CurrentYear": {
                            "val": "79.173"
                        },
                        "BudgetYearOne": {
                            "val": "60.399"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.399"
                        },
                        "BudgetYearTwo": {
                            "val": "93.489"
                        },
                        "BudgetYearThree": {
                            "val": "140.760"
                        },
                        "BudgetYearFour": {
                            "val": "155.577"
                        },
                        "BudgetYearFive": {
                            "val": "165.629"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Mixed Technology Integration project funds the advanced development and demonstration of selected basic and applied electronics research programs.  Examples of technologies with funded development and demonstration activities include, but are not limited to: (1) self-contained laser weapon systems to protect airborne platforms from emerging surface-to-air missiles; (2) integrated photonic-electronic components for positioning, navigation and timing in GPS-denied environments; (3) flexible, software-defined cameras that enable real-time image analysis of complex scenes to provide more actionable information; and (4) component programs that integrate mixed signal (analog and digital) or mixed semiconductor technology to substantially improve the capability of existing components and\/or reduce their size, weight and power.  Funding under this project is intended to advance transitioning novel technologies to use, providing advanced components compatible with mid-term and other future warfighting requirements."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Precise Robust Inertial Guidance for Munitions (PRIGM)"
                                    },
                                    "Description": {
                                        "val": "The Precise Robust Inertial Guidance for Munitions (PRIGM) program aims to develop inertial sensor technologies for positioning, navigation, and timing (PNT) in GPS-denied environments.  These inertial sensors can provide autonomous PNT information when GPS is unavailable.  The program will exploit recent advances in integrating photonic (light-manipulating) components into electronics and in employing microelectromechanical systems (MEMS) as high-performance inertial sensors for use in extreme environments. Whereas conventional MEMS inertial sensors suffer from inaccuracies due to factors such as temperature sensitivity, photonics-based PNT techniques have demonstrated the ability to reject these inaccuracies.  PRIGM will focus on two areas: (1) By 2020, it aims to develop and transition a Navigation-Grade Inertial Measurement Unit (NGIMU), a state-of-the-art MEMS device, to DoD platforms; and (2) By 2030, it aims to develop Advanced Inertial MEMS Sensors (AIMS) that can provide gun-hard, high-bandwidth, high dynamic range navigation for GPS-free munitions.  These advances should enable navigation applications, such as smart munitions, that require low-cost, size, weight, and power (SWaP) inertial sensors with high bandwidth, precision and shock tolerance.  PRIGM will advance state-of-the-art MEMS gyros from TRL-3 devices to a TRL-6 transition platform, eventually enabling the Service Laboratories to perform TRL-7 field demonstrations.  The ultimate goal is to develop a complete MEMS-based NGIMU with a mechanical\/electronic interface identical to existing DoD-standard tactical-grade MEMS IMUs, providing a drop-in replacement for existing DoD systems.  Service laboratories have been actively involved throughout program development and remain engaged to facilitate transition of NGIMU prototypes, which will be delivered at the program conclusion.  This program has basic research efforts funded in PE 0601101E, Project ES-01 and applied research efforts funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.200"
                                            },
                                            "Text": {
                                                "val": "-  Fabricated and performed initial characterization of MEMS inertial sensors meeting stability and repeatability specifications consistent with navigation-grade performance.\n-  Began preparation of five MEMS gyroscope prototypes, meeting stability and repeatability specifications consistent with navigation-grade performance, for delivery to the government.\n-  Began preparation of five MEMS accelerometer prototypes, meeting stability and repeatability specifications consistent with navigation-grade performance, for delivery to the government."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.000"
                                            },
                                            "Text": {
                                                "val": "-  Deliver five MEMS gyroscopes meeting environmental and performance requirements (vibration, shock survivability, operation over temperature).\n-  Deliver five MEMS accelerometers meeting environmental and performance requirements (vibration, shock survivability, operation over temperature).\n-  Commence development of MEMS-based, navigation-grade, integrated IMU meeting program-defined SWaP and performance metrics, excluding environmental requirements and shock survival."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.600"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.600"
                                            },
                                            "Text": {
                                                "val": "-  Complete development and characterization of MEMS-based, navigation-grade, integrated IMU meeting program-defined SWaP and performance metrics, excluding environmental requirements and shock survival.\n-  Deliver two MEMS-based, navigation-grade, integrated IMU prototypes for government evaluation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects a transition from development to completion and characterization of IMU prototypes."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Reconfigurable Imaging (ReImagine)"
                                    },
                                    "Description": {
                                        "val": "The Reconfigurable Imaging (ReImagine) program aims to create multi-functional readout integrated circuits (ROICs) that fundamentally change the way camera systems collect, process and relay image information. This is accomplished by adding multifunctional flexibility in the ROIC.  Today, most cameras are designed to capture high quality imagery at standard frame rates.  These traditional camera architectures collect a single type of data across the full image frame.  Specialty cameras can be used to capture different spatial, spectral or temporal data but are rarely deployed because of the cost and complexity of adding imaging subsystems for niche measurements.  Although these measurements are typically only desired for specific features or regions of interest (ROIs) in a scene, the cameras collect the specialized data over the full image frame.  The ReImagine architecture, conversely, would enable a single, real-time reconfigurable, software-defined camera system with the ability to collect different data in different ROIs.  Depending on the need, a ReImagine imager would be able to selectively collect and simultaneously process data from a specific ROI, for example, at a higher resolution (i.e., foveated imaging), at a higher frame rate or with 3-D depth information.  The system would interface with virtually any sensor and could therefore be used in any spectral band.  By demonstrating more efficient data collection and computation across ROIs, ReImagine ROICs should enable real-time analysis of much more complex scenes and provide more actionable information than has ever been possible.  Technologies from this program are intended for transition to the Air Force, Navy and Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "15.790"
                                            },
                                            "Text": {
                                                "val": "-  Developed and deliver GFE multi-functional digital ROIC configuration software to ReImagine performers.\n-  Completed detailed definition of the Gen-1 designs.\n-  Developed preliminary multi-function concepts of operation for multiple DoD applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.173"
                                            },
                                            "Text": {
                                                "val": "-  Complete mapping multi-function processing algorithms to the ROIC layer using custom software tools.\n-  Begin development of the 2nd generation (Gen-2) designs.\n-  Complete 3-D integration of the ReImagine Gen-1 multilayer ROIC.\n-  Demonstrate the application benefits of multifunctional capability through simulation."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "24.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "24.000"
                                            },
                                            "Text": {
                                                "val": "-  Continue the fabrication of a ReImagine Phase 1 prototype imager.  \n-  Develop a detailed operational description and simulation for the ReImagine Gen-2 multi-functional digital ROIC, mapping applications and demonstrating enhanced operation and capability.\n-  Initiate design and layout of the ROIC interface and focal plane array layers to operate with the Gen-2 multi-functional digital ROIC for enhanced programmable functionality.\n-  Develop a detailed plan for a Gen-2 multi-functional digital ROIC camera prototype."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Rapid Array Development (RAD)"
                                    },
                                    "Description": {
                                        "val": "The Rapid Array Development (RAD) program seeks to leverage recent developments in flexible and adaptive radio frequency (RF) hardware, access to a larger variety of more powerful computing platforms, and advances in software virtualization to radically change the development and deployment cycle for electromagnetic (EM) arrays. EM arrays, which enable communications, radar and electronic warfare (EW), are currently high performance but slow and costly to create.  In contrast, they must evolve rapidly in order to adapt to new modes of operation and changing operating parameters associated with modern military threats.  However, the available design and test infrastructure is not flexible enough to support testing and fielding new EM array algorithms across a wide variety of military platforms.  Furthermore, EM software and hardware are often developed in separate silos; as a result, implementing new EM applications in hardware tends to require a lengthy and expensive development process with extended cycles of iteration between the two areas.  RAD will therefore focus on three core areas: (1) making ultra-flexible testbeds for existing and future EM arrays accessible to the DoD community; (2) reducing the complexity of phased array hardware through high level abstraction; and (3) speeding up EM system development time through hardware\/software co-design.  In light of changing requirements, the resulting technologies would also enable DoD greater reuse of its available hardware resources while minimizing the need to modify specialized EM systems, leading to improved and simplified upgrade cycles.  Technologies developed under the RAD program are planned for transition to the services through a series of demonstrations proving the radically shorter time scale of development."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "12.000"
                                            },
                                            "Text": {
                                                "val": "-  Initiate development of a compute engine to optimize the implementation of EM algorithms on a system of heterogeneous processors.\n-  Initiate development of cloud-based applications to facilitate rapid re-configuration of an array platform without having to modify existing hardware.\n-  Explore use of toolchains and toolsets for programming on heterogeneous computing systems.\n-  Explore new models of machine learning and supervisory controls to manage complex allocation of processing resources."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "17.799"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "17.799"
                                            },
                                            "Text": {
                                                "val": "-  Develop a flexible array testbed that will be the common hardware platform for an applications development environment.\n-  Develop a processing platform capable of executing EM algorithms, array configuration, data flow and end-user interactions.\n-  Continue development of cloud-based applications to facilitate rapid re-configuration of an array platform without having to modify existing hardware.\n-  Initiate plans for a testbed installation at a military base or radar test range."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects the shift from exploring and initiating development to developing RAD software and the testbed environment."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter Wave Digital Arrays (MIDAS) *"
                                    },
                                    "Description": {
                                        "val": "*formerly Radio Frequency Collaborative Unmanned Distributed System (RF CLOUDS)\n\nThe Millimeter Wave Digital Arrays (MIDAS) program will develop a common millimeter wave phased-array tile that is scalable to large arrays to provide wideband frequency agility from 18-50 GHz with element-level digital beamforming.  Millimeter wave systems are used today to achieve physical security through the use of narrow antenna beams in a small form-factor.  We see this applied to satellite communications and tactical line-of-sight communications such as in the F-22 and F-35.  One of the challenges of using directional communications in mobile applications is the problem of knowing where to point the antenna when both platforms are mobile.  This can be solved with digital beamforming to enable a mobile platform to listen in all directions with many antenna beams to facilitate neighbor discovery and when transmitting, multiple beams can be used to communicate with several neighbors simultaneously.  This capability will increase the network throughput and robustness that will be tolerant to unexpected outages.  To achieve these goals, the program will develop a common digital phased array tile that can be used to build large arrays from this common block.  The program will be executed in two primary technical areas.  First, advanced complementary metal oxide semiconductor (CMOS) will be used to develop the core transceiver elements at a size and power consumption that is required to fit in the small size required by current millimeter wave systems.  Second, a combination of advanced packaging and high-performance semiconductors will be used to build the wideband antenna and front-end amplifiers necessary to make a complete system."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Begin preliminary design review.\n-  Begin development of a low-power, 16-element, element-level digital phased array at millimeter wave frequencies in advanced CMOS."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The decrease in FY 2019 reflects the program moving to Project MT-16."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID)"
                                    },
                                    "Description": {
                                        "val": "The Efficient Ultra-Compact Laser-Integrated Diodes (EUCLID) program aims to significantly reduce the size of laser diode pump modules (DPMs) while increasing their electrical-to-optical efficiency.  DPMs are a critical component of fiber-laser array weapons systems, which combine light from many lower-power lasers to engage targets at tactically-relevant distances.  Commercial DPMs, which cater to the laser manufacturing industry, feature large cooling systems and are too cumbersome for integration into many small DoD platforms.  EUCLID plans to leverage advances in thermal management components to design, build, test, and demonstrate densely packageable, prototype DPMs that are less than half the size of their commercial counterparts.  The program will also pursue improved optical components that can more efficiently focus light from individual laser diodes.  The resulting EUCLID DPMs are intended to be available for procurement and integration into ultra-low size, weight, and power fiber-laser array weapons systems, enabling integration into a variety of Air Force, Navy, Army, and Missile Defense Agency platforms."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Complete critical design of a >650 Watt, >60% efficiency DPM with less than 0.31 cm3\/Watt and 0.31 grams\/Watt, including integrated thermal management and improved optical designs.\n-  Model and simulate thermal management systems to demonstrate laser diode operation at a designated temperature, given appropriate coolant temperature, flow rate, and pressure drop values.\n-  Model optical designs to demonstrate that coupling efficiency from the laser diode bars to the delivery fiber is within the overall system's electrical-to-optical efficiency budget."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Build and test prototype DPMs which produce >4 kW of optical power and >58% efficiency and are suitable for powering a coherently combinable fiber laser amplifier assembly.\n-  Generate detailed designs of a compact, packaged 4 kW diode pump assembly based on the prototype DPMs."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Endurance"
                                    },
                                    "Description": {
                                        "val": "The Endurance program aims to develop laser technology to protect airborne platforms from emerging and legacy electro-optical\/infrared (EO\/IR) guided surface-to-air missiles.  Endurance is planned to have an open architecture, granting the flexibility to integrate different subsystems with varying capabilities.  Endurance is an early application of technology developed through DARPA's Excalibur program and is planned to transition to the Services.  The advanced technology component of the program will focus on developing and field testing various subsystems for laser beam generation, command and control, threat missile warning, target acquisition and tracking, beam control, energy storage and delivery, and thermal management.  It will also develop subsystem interfaces and integrate the components into a packaged system for field testing. Technologies from this program are intended for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.000"
                                            },
                                            "Text": {
                                                "val": "-  Developed a preliminary engineering design for a flight-prototype of a pod-mounted laser weapon system.\n-  Tested the brassboard laser weapon system at outdoor test ranges against a representative set of static targets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.000"
                                            },
                                            "Text": {
                                                "val": "-  Assess brassboard system performance in live-fire testing.\n-  Perform environmental testing to assess performance under stressing vibrational and temperature conditions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion and planned transition to the Services."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "FLASH - Scaling Fiber Arrays at Near Perfect Beam Quality"
                                    },
                                    "Description": {
                                        "val": "The FLASH program demonstrated an ultra-low-size, weight, and power (SWaP) high energy laser system suitable for integration onto a range of military platforms, including unmanned aerial vehicles (UAVs) and 4th and 5th generation aircraft.  With its modular, scalable architecture, future systems could be built with output power levels in the hundreds of kilowatts, enabling a broad set of offensive mission capabilities, many of which are not possible with current technology.  To accomplish its program goals, FLASH pursued two major thrusts.  First, FLASH greatly reduced the size and weight of high-power fiber laser amplifiers, increased their power efficiency and improve their resistance to shock, vibration and acoustic stresses found on military platforms.  Second, FLASH fabricated an array of these amplifiers and integrated them into a transportable system with advanced battery power, thermal management and coherent-beam combination sub-systems.  Technologies from this program are intended for transition to the Air Force, Navy, Army and Missile Defense Agency."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.500"
                                            },
                                            "Text": {
                                                "val": "-  Completed line-replaceable fiber amplifier units and integrated into 50 kW-class transportable, packaged laser system.\n-  Tested and demonstrated the 50 kW-class transportable, packaged laser system. Achieved >40% electrical-to-optical efficiency, better than 1.1x diffraction limited beam quality, in a <20 cu. ft. and <750 lbs. package."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Diverse & Accessible Heterogeneous Integration (DAHI)"
                                    },
                                    "Description": {
                                        "val": "The Diverse Accessible Heterogeneous Integration (DAHI) program developed the design and manufacturing capabilities required to seamlessly integrate various semiconductors, microelectromechanical systems, photonic (light-manipulating) devices and thermal management structures into true systems-on-a-chip (SOC).  This capability enabled dramatic size, weight and volume reductions and higher performance for DoD electronic warfare, communications and radar systems.  Historically, chip designers have had to decide between the availability, development and low cost of silicon circuits or the high performance of compound semiconductor (CS) materials.  DAHI, however, built on previous DARPA and commercial efforts, which demonstrated that heterogeneously integrating CS and silicon can yield significant performance improvements over silicon or CS alone.  DAHI's advanced technology development effort focused on establishing a technologically mature manufacturing path for integrating a wide array of materials and devices, including CS, on a common substrate.  Relevant manufacturing processes are made available to a wide variety of designers from the DoD laboratories, federally funded research and development centers, academia and industry.  DAHI supported demonstrating increasingly complex circuits that leverage heterogeneous integration.  DAHI technologies are intended for transition to national security and semiconductor manufacturing partners.  This program has applied research efforts funded in PE 0602716E, Project ELT-01."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.500"
                                            },
                                            "Text": {
                                                "val": "-  Finalized refinements of yield to demonstrate 99.99% yield on interconnect technology and reliability and coordinate with self-sustaining foundry activity to ensure successful transition of heterogeneous integration technology.\n-  Finalized the development of seamless process design kits and integrated design flows to facilitate the use of the foundry service by external users.\n-  Expanded technology options with demonstrations of updated InP and GaN devices, advanced Si nodes, high-Q passives, GaAs chiplets, SiC interposers, and third-party commercial components.\n-  Established ongoing foundry business with cost models, fully exercised quotation process, initiation of IDIQ contract vehicle, qualification in progress, and foundry runs scheduled through 2020."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "MT-16"
                    },
                    "ProjectTitle": {
                        "val": "BEYOND SCALING ADVANCED TECHNOLOGIES"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "50.700"
                        },
                        "BudgetYearOneBase": {
                            "val": "50.700"
                        },
                        "BudgetYearTwo": {
                            "val": "51.670"
                        },
                        "BudgetYearThree": {
                            "val": "52.000"
                        },
                        "BudgetYearFour": {
                            "val": "52.000"
                        },
                        "BudgetYearFive": {
                            "val": "52.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Beyond Scaling Advanced Technologies Project is a continuation of DARPA's basic and applied research in this area and will support activities in large scale co-development with leading industry players to enable and accelerate transformative computing interactions with industry. Additionally, funding under this project is intended to secure the design and capture of advanced intellectual property (IP) and architectures, IP sharing and re-use, and limited access to state-of-the-art (SOTA) and state-of-the-practice (SOTP) foundries for microelectronics fabrication runs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Beyond Scaling - Access"
                                    },
                                    "Description": {
                                        "val": "The Beyond Scaling - Access program will demonstrate the design and fabrication of advanced electronics through collaborations with leading industry players. Although the United States has led the development of advanced electronics since its inception and is home to three of the five leading-edge foundries, recent investments by foreign competitors are threatening this leadership. Additionally, the fabrication cost of next generation microelectronics has increased at an alarming rate. While the commercial sector is able to spread these costs over a large volume of products, the low volumes used by the DoD has led to a cost barrier in meeting its future technology needs. In some cases, the inability to place orders in volume has created a lack of access to advanced technology nodes entirely. To address this, the DoD must participate in more industry partnerships that not only leverage investments in the commercial industry but also provide access to SOTA facilities in the U.S. This program will build on existing relationships and forge forward-looking collaborations among the commercial electronics community, defense industrial base, university researchers, and the DoD. Activities include securing advanced IP and electronics architectures, IP sharing and re-use, and limited access to SOTA and SOTP foundries for microelectronics fabrication runs."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "30.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "-  Identify and secure access to SOTA commercial IP for use in DoD designs. \n-  Demonstrate IP sharing and reuse of IP across various DoD and commercial designs.\n-  Establish SOTA and SOTP microelectronics fabrication runs for DoD designs at leading-edge commercial foundries."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Millimeter Wave Digital Arrays (MIDAS)*"
                                    },
                                    "Description": {
                                        "val": "*Formerly Radio Frequency Collaborative Unmanned Distributed System (RF CLOUDS)\n\nThe Millimeter Wave Digital Arrays (MIDAS) program will develop a common millimeter wave phased-array tile that is scalable to large arrays to provide wideband frequency agility from 18-50 GHz with element-level digital beamforming.  Millimeter wave systems are used today to achieve physical security through the use of narrow antenna beams in a small form-factor.  We see this applied to satellite communications and tactical line-of-sight communications such as in the F-22 and F-35.  One of the challenges of using directional communications in mobile applications is the problem of knowing where to point the antenna when both platforms are mobile.  This can be solved with digital beamforming to enable a mobile platform to listen in all directions with many antenna beams to facilitate neighbor discovery and when transmitting, multiple beams can be used to communicate with several neighbors simultaneously.  This capability will increase the network throughput and robustness that will be tolerant to unexpected outages.  To achieve these goals, the program will develop a common digital phased array tile that can be used to build large arrays from this common block.  The program will be executed in two primary technical areas.  First, advanced complementary metal oxide semiconductor (CMOS) will be used to develop the core transceiver elements at a size and power consumption that is required to fit in the small size required by current millimeter wave systems.  Second, a combination of advanced packaging and high-performance semiconductors will be used to build the wideband antenna and front-end amplifiers necessary to make a complete system. Technologies from this program are intended for transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.700"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.700"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate a low-power, 16-element, element-level digital phased array at millimeter wave frequencies in advanced CMOS.\n-  Demonstrate a wideband and efficient power amplifier technology co-packaged with a wideband antenna."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects the program moving from Project MT-15."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                }
            ]
        }
    }
}