{
    "id": "2019-Army-PB-2040-JBOOK-19f845352605fba4a6f3023996f0354f921fbe2e4ae425fd1d2a4fef03ce50a1-3",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA1-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601104A"
        },
        "ProgramElementTitle": {
            "val": "University & Industry Rsch Ctrs"
        },
        "R1LineNumber": {
            "val": "4"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "108.688"
            },
            "CurrentYear": {
                "val": "87.395"
            },
            "BudgetYearOne": {
                "val": "92.115"
            },
            "BudgetYearOneBase": {
                "val": "92.115"
            },
            "BudgetYearTwo": {
                "val": "88.203"
            },
            "BudgetYearThree": {
                "val": "89.772"
            },
            "BudgetYearFour": {
                "val": "91.572"
            },
            "BudgetYearFive": {
                "val": "93.406"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "651.151"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) fosters university and industry based research to provide a scientific foundation for enabling technologies for future force capabilities.  Broadly, the work in this PE falls into three categories: Collaborative Technology Alliances \/ Collaborative Research Alliances (CTAs\/CRAs), University Centers of Excellence (COE), and University Affiliated Research Centers (UARCs).  The Army formed CTAs to leverage large investments by the commercial sector in basic research areas that are of great interest to the Army.  CTAs are industry-led partnerships between industry, academia, and the Army Research Laboratory (ARL) to incorporate the practicality of industry, the expansion of the boundaries of knowledge from universities, and Army scientists to shape, mature, and transition technology relevant to the Army mission.  CTAs have been competitively established in the areas of Micro Autonomous Systems Technology (MAST), Network Sciences, Robotics, and Cognition and Neuroergonomics. CRAs are academia-led partnerships, which leverage the cutting-edge innovation found in the academic environment.  CRAs have been established in the areas of Multi-Scale Materials Modeling (electronic materials and materials in extreme environments) and in cyber security.  The COEs focus on expanding the frontiers of knowledge in research areas where the Army has enduring needs, and couples state-of-the-art research programs at academic institutions with broad-based graduate education programs to increase the supply of scientists and engineers in automotive and rotary wing technology.  Also included are Army Educational Outreach Program (AEOP) and activities to stimulate interest in science, math, and technology among middle and high school students.  This PE includes support for basic research at three Army UARCs, which have been created to exploit opportunities to advance new capabilities through a sustained long-term multidisciplinary effort.  The Institute for Soldier Nanotechnologies focuses on Soldier protection by emphasizing revolutionary materials research for advanced Soldier protection and survivability.  The Institute for Collaborative Biotechnologies focuses on enabling network centric-technologies, and broadening the Army's use of biotechnology for the development of bio-inspired materials, sensors, and information processing.  The Institute for Creative Technologies is a partnership with academia and the entertainment and gaming industries to leverage innovative research and concepts for training and simulation.  Examples of specific research of mutual interest to the entertainment industry and the Army are technologies for realistic immersion in synthetic environments, networked simulation, standards for interoperability, and tools for creating simulated environments.  This PE also includes the Historically Black Colleges and Universities and Minority Institution (HBCU\/MI) Centers of Excellence that address critical research areas for Army Transformation. \n\nThe cited work is consistent with the Assistant Secretary of Defense, Research and Engineering Science and Technology focus areas and the Army Modernization Strategy."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "94.28"
                },
                "CurrentYear": {
                    "val": "87.395"
                },
                "BudgetYearOne": {
                    "val": "92.115"
                },
                "BudgetYearOneBase": {
                    "val": "92.115"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "108.688"
                },
                "CurrentYear": {
                    "val": "87.395"
                },
                "BudgetYearOne": {
                    "val": "92.115"
                },
                "BudgetYearOneBase": {
                    "val": "92.115"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "14.408"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "0"
                },
                "BudgetYearOneBase": {
                    "val": "0"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "18"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-3.546"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.046"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Funding increase to support additional collaboration between Army and university researchers in the areas of cyber science, internet of battlefield things, distributed collaborative intelligent systems, and quantum science."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "EA6"
                    },
                    "ProjectTitle": {
                        "val": "Cyber Collaborative Research Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.155"
                        },
                        "CurrentYear": {
                            "val": "3.338"
                        },
                        "BudgetYearOne": {
                            "val": "4.886"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.886"
                        },
                        "BudgetYearTwo": {
                            "val": "4.982"
                        },
                        "BudgetYearThree": {
                            "val": "5.082"
                        },
                        "BudgetYearFour": {
                            "val": "5.186"
                        },
                        "BudgetYearFive": {
                            "val": "5.29"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.919"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project fosters research performed through the Cyber Security Collaborative Research Alliance (CSEC CRA), a competitively selected consortium, formed to advance the theoretical foundations of cyber science in the context of Army networks.  This CRA consists of academia, industry and government researchers working jointly with the objective of developing a fundamental understanding of cyber phenomena so that fundamental laws, theories, and theoretically grounded and empirically validated models can be applied to a broad range of Army domains, applications, and environments.  This research focuses on three interrelated aspects of cyber security and is conducted using a trans-disciplinary approach that takes into account the human element of the network.  The three aspects of cyber that are addressed are: 1) vulnerabilities and risks of cyber networks to malicious activities, 2) anticipating, detecting, and analyzing malicious activities, and 3) agile cyber maneuver to thwart and defeat malicious activities.  Overarching goals of cyber security are to significantly decrease the adversary's return on investment when considering cyber attack on Army networks, and minimizing the impact on (Army) network performance related to implementing cyber security.  The CRA research creates a framework that effectively integrates the knowledge of cyber assets and potential adversary capabilities and approaches, and provides defense mechanisms that dynamically adjust to changes related to mission, assets, vulnerability state, and defense mechanisms.\n\nWork in this Project supports key Army needs and provides the technical underpinnings to Program Element (PE) 0602782A (Command, Control, Communications Technology)\/Project H92 (Communications Technology). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyber Security Collaborative Research Alliance"
                                    },
                                    "Description": {
                                        "val": "The Cyber Security Collaborative Research Alliance (CSEC CRA) supports basic research to enable capabilities for rapid development and adaptation of cyber tools for dynamically assessing cyber risks, detecting hostile activities on friendly networks, and supporting agile maneuver in cyber space in spite of the continuous evolution and emergence of novel threats."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.155"
                                            },
                                            "Text": {
                                                "val": "Will extend fundamental theories and models of dynamic cyber threats and defense developed in Fiscal Year (FY) 2015 and 2016, leading to practical defense strategies via analytical models of collaborative and composite risk, and appropriate communication of risk metrics; user\/defender\/attacker feedback models to capture interactions; optimized evidence collection and introspective detection; model-based generation and verification of cyber maneuvers; multi-party stealth games; and extensive validation on realistic data-sets and test-beds."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.338"
                                            },
                                            "Text": {
                                                "val": "Develop a science of resilient detection in adversarial settings, leading to models of decision-making under uncertainty; develop theories, models and algorithms to execute maneuver at the software, system and network layers; research behavioral and game theoretical models to model user-defender-adversary interactions; enhance the analytical framework, integrating detection and risk assessment, to provide choices of agility maneuvers that minimize risk; experimentally validate the analytical framework on realistic testbeds."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.886"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.886"
                                            },
                                            "Text": {
                                                "val": "Will enhance fundamental theories and methods to streamline development of new models and algorithms of dynamic cyber threats; will develop new approaches and theoretical frameworks needed to provide resilient and automated capabilities for software, network and system components and overall system function; will research methods for more agile human behavior models and human-machine agent functionality in increasingly complex adversarial environments; will incorporate realistic experimental validation methods for developing new operationally feasible methods."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to enable pursuit of knowledge to support Networks\/C3I for improved communications and sensing."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "F17"
                    },
                    "ProjectTitle": {
                        "val": "Neuroergonomics Collaborative Technology Alliance"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.126"
                        },
                        "CurrentYear": {
                            "val": "4.923"
                        },
                        "BudgetYearOne": {
                            "val": "4.72"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.72"
                        },
                        "BudgetYearTwo": {
                            "val": "4.83"
                        },
                        "BudgetYearThree": {
                            "val": "4.943"
                        },
                        "BudgetYearFour": {
                            "val": "5.044"
                        },
                        "BudgetYearFive": {
                            "val": "5.145"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "34.731"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project fosters research through the Cognition and Neuroergonomics Collaborative Technology Alliance (CTA), a competitively selected industry and university consortium, to leverage world-class research in support of future force and Army transformation needs.  Escalating levels of complexity and uncertainty on the current and future battlefield present conditions which have never existed before now.  Solution strategies and approaches must be developed or tailored.  The emerging field of neuroergonomics, which seeks to understand the brain at work and to leverage that understanding to optimize system design, offers tremendous potential for providing the solutions needed to meet the needs of Army forces in the future.  This CTA addresses the solution strategies and approaches needed to design systems to fully exploit investments in revolutionary technological advances in areas such as robotics, microelectronics, and computer and network information systems.  These technologies present significant opportunities to enhance Army mission capabilities, but impose significant burdens on the human brain, which will ultimately limit Soldier-system effectiveness, sustainability, and survivability.  The technical barriers associated with this project include: immature knowledge base to guide the neuroergonomic approach to human-system integration; inadequate capabilities to sense and extract information about brain activity in dynamic, operational environments; lack of valid measures to robustly and uniquely characterize operationally-relevant cognitive performance; lack of techniques for integrating advanced understandings of brain activity into systems designs, including real-time use of measures of cognitive behavior as system inputs and the capability to account for individual differences in maximizing Soldier-system performance.  This CTA conducts an intensive and accelerated program to formulate, validate, and transition basic research findings through multi-dimensional approaches focused in three areas: understanding fundamental principles underlying Soldier neurocognitive performance in operational environments, advancing computational approaches for the analysis and interpretation of neural functioning, and fundamental advancement in neurotechnologies that enhance Soldier-system interactions and performance. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Neurocognitive performance in operational environments"
                                    },
                                    "Description": {
                                        "val": "This effort is intended to understand fundamental principles underlying Soldier neurocognitive performance in operational environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.892"
                                            },
                                            "Text": {
                                                "val": "Will develop models of neural activity to characterize performance in Army-relevant tasks; and investigate relationships between brain activity recorded on the scalp and brain activity recorded within the skull to improve understanding of how the skull and scalp affect recorded brain signals."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.821"
                                            },
                                            "Text": {
                                                "val": "Utilize behavioral, physiological, and neural measures to explore emotional state and the emotional tone of interpersonal communication; develop novel methods for improved trust and successful communication between vehicle operators, passengers, and autonomous agents based on emotional state."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.794"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.794"
                                            },
                                            "Text": {
                                                "val": "Will utilize computational techniques on large-scale heterogeneous datasets to discover robust relationships between complex cognitive states and subsequent performance across a range of Army-relevant tasks; will investigate the relationship between individual brain network connectivity profiles and task performance."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of high priority S&T areas including intelligent systems research, internet of battlefield things research, and quantum sciences research for manned-unmanned teaming (Next Generation Combat Vehicles\/Future Vertical Lift), Networks\/C3I, and communications, respectively."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Computational neural analysis"
                                    },
                                    "Description": {
                                        "val": "This effort advances computational approaches for the analysis and interpretation of neural functioning."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.56"
                                            },
                                            "Text": {
                                                "val": "Will develop algorithms for reliable comparisons between simple experimental tasks and operationally-relevant tasks; and develop analytical methods for automated characterization of within-subject, cognitive state fluctuations during long-term task performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.477"
                                            },
                                            "Text": {
                                                "val": "Develop experimental paradigms and computational techniques to understand the brain circuits underlying shifts between decision-making and task-related actions; develop novel methods for identifying changes in the statistics of the operational environment, task constraints, and arousal level."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.362"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.362"
                                            },
                                            "Text": {
                                                "val": "Will elucidate the underlying components responsible for physiological signal degradation in ambulatory environments via novel multi-layered sensor systems; will develop theoretical models and adaptive algorithms for optimal signal acquisition and noise mitigation."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of high priority S&T areas including intelligent systems research, internet of battlefield things research, and quantum sciences research for manned-unmanned teaming (Next Generation Combat Vehicles\/Future Vertical Lift), Networks\/C3I, and communications, respectively."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neurotechnologies"
                                    },
                                    "Description": {
                                        "val": "This effort provides a fundamental advancement in neurotechnologies that enhance Soldier-system interactions and performance."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.674"
                                            },
                                            "Text": {
                                                "val": "Will investigate performance of dry electrode systems in high noise conditions inherent to real-world tasks for applications in mobile environments; and develop a combined hardware-software solution for mitigation of noise in the signal for enhanced interpretation of brain data."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.625"
                                            },
                                            "Text": {
                                                "val": "Develop computational frameworks and systems for asynchronous brain-computer communication; identify, separate, and interpret brain activity during naturally occurring periods of stable eye position in both seated and ambulatory environments."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.564"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.564"
                                            },
                                            "Text": {
                                                "val": "Will investigate the application of computation frameworks for the prediction of behavioral performance in operationally-relevant tasks with increased temporal complexity and multifaceted objectives; will develop approaches to combine information, derived from brain activity, across individuals to improve situational awareness."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of high priority S&T areas including intelligent systems research, internet of battlefield things research, and quantum sciences research for manned-unmanned teaming (Next Generation Combat Vehicles\/Future Vertical Lift), Networks\/C3I, and communications, respectively."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF5"
                    },
                    "ProjectTitle": {
                        "val": "Distributed Collaborative Intelligent Systems CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "4.178"
                        },
                        "BudgetYearOne": {
                            "val": "5.82"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.82"
                        },
                        "BudgetYearTwo": {
                            "val": "6.131"
                        },
                        "BudgetYearThree": {
                            "val": "6.295"
                        },
                        "BudgetYearFour": {
                            "val": "6.436"
                        },
                        "BudgetYearFive": {
                            "val": "6.565"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "35.425"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project fosters basic research through the highly Distributed and Collaborative Intelligent Systems and Technology (DCIST) Collaborative Research Alliance (CRA), a competitively selected university consortium which leverages world-class research necessary to address future force and Army Transformation needs. The CRA links a broad range of government technology agencies, as well as industrial and academic partners with the Army Research Laboratory (ARL). The DCIST CRA focuses on systems with a large number of heterogeneous intelligent agents, including Soldiers that can be distributed over large areas and are required to move through contested environments and against peer capabilities at op-tempo. To meet these goals innovative research is performed in three main technical areas: distributed intelligence, large heterogeneous group control, and adaptive and resilient behaviors. The payoff to the warfighter will be extended reach, situational awareness, and operational effectiveness against dynamic threats in contested environments, and technical and operational superiority through intelligent, resilient and collaborative behaviors of Soldiers and intelligent systems. The CRA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, and to make available to the Alliance state-of-the-art facilities and equipment at the participating organizations.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Collaborative Intelligent Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Extend reach, situational awareness, and operational effectiveness against dynamic threats in contested environments through intelligent, resilient and collaborative behaviors of heterogeneous teams of Soldiers, intelligent systems, smart sensors, and knowledge sources."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.178"
                                            },
                                            "Text": {
                                                "val": "Explore and develop the underpinning science and technology for highly distributed and collaborative intelligent systems along technical areas to include distributed intelligence, large heterogeneous group control, and adaptive and resilient behaviors."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.82"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.82"
                                            },
                                            "Text": {
                                                "val": "Will establish the theoretical foundations of multi-faceted distributed networked intelligent systems combining autonomous agents, sensors, tactical super-computing, knowledge bases in the tactical cloud, and human experts to acquire and apply knowledge to affect and inform decisions of the collective team. Will develop theory and algorithms for control of large autonomous teams with varying levels of heterogeneity and modularity across sensing, computing, platforms, and degree of autonomy. Will develop theory and methods for heterogeneous teams to carry out tasks under dynamic and varying conditions in the physical world."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to support the university consortia included in Collaborative Research Alliance on intelligent, resilient and collaborative behaviors of Soldiers and intelligent systems."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "FF7"
                    },
                    "ProjectTitle": {
                        "val": "Internet of Battlefield Things CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.068"
                        },
                        "BudgetYearOne": {
                            "val": "4.179"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.179"
                        },
                        "BudgetYearTwo": {
                            "val": "6.02"
                        },
                        "BudgetYearThree": {
                            "val": "6.084"
                        },
                        "BudgetYearFour": {
                            "val": "6.175"
                        },
                        "BudgetYearFive": {
                            "val": "6.299"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "31.825"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project will foster research performed through the Internet of Battlefield Things (IoBT) Collaborative Research Alliance (CRA), a competitively selected consortium formed to advance the theoretical foundations of the Internet of Things in the context of Army Operations. The CRA will comprise academia, industry and government researchers working jointly with the objective of developing a fundamental understanding of phenomena of Internet of Things and cyber-physical systems in tactically relevant environments. The CRA will facilitate collaboration across organizations to provide multi-disciplinary perspectives on basic research challenges, as well as the use of state-of-the-art facilities and equipment at the participating organizations. This research focuses on three interrelated aspects of pervasive and converged cyber- physical complex information systems and is conducted using a trans-disciplinary approach that takes into account the information-theoretic and human elements of Army IoBT interactions. The three aspects of the emergent Internet of Battlefield Things topical areas addressed are: 1) dynamic discovery and adaptation of cyber- physical devices, networks, and information sources, 2) resilient re-purposing and re-tasking of devices and information capabilities, and 3) algorithmic, distributed and centralized information-stream processing. Overarching goals of the basic research on Army IoBT are to investigate foundational cross-cutting theories and methods leading towards a science of heterogeneous, self-adapting, complex cyber-physical systems. This research will lead to optimized real-time adversarial situation estimates in information-enabled warfare and greatly enhance the speed and precision for complex military operations involving converged sensing, communications, and resilient actuation.\n\nWork in this Project builds fundamental knowledge for and accelerates the transition of communications and networks technology to Program Element (PE) 0602783A (Computer and Software Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Internet of Battlefield Things Collaborative Research Alliance (IoBT CRA)"
                                    },
                                    "Description": {
                                        "val": "The Internet of Battlefield Things (IoBT) Collaborative Research Alliance (CRA), seeks to gain fundamental understanding of IoT phenomena and its performance in tactical environments, ranging from sparse, remote settings to complex, dense urban environments. To enable an IoBT capability, research needs to address intelligent resourcing and influence in complex, constrained and uncertain networks (demand from massive numbers of dynamically connected devices, limited and unpredictable connectivity, shared civilian networks, computation at or near the device), heterogeneous sensing and actuation devices (efficient, smart devices with self-organizing\/preservation\/directing capabilities), and variable, and unreliable provenance and dynamisms of information and device signals."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.068"
                                            },
                                            "Text": {
                                                "val": "Competitively select a consortium consisting of academia, industry and government researchers; investigate new theories for complex system effects that can be applied to dynamic, heterogeneous, adaptive systems-of-systems where the boundaries of control extend beyond personal, organizational, and political borders; explore universal theoretical principles that span the multiple levels at which self-configuring and resilient systems can exist?from systems to enterprises; e.g., formalisms to support diverse nonlinear emergent system behaviors; investigate methods for determining how to incorporate human behavior models into the formal methodology of feedback and just-in-time control; and study theoretical foundations for information, leading to an understanding of tradeoffs (amount of information collected, opportunity for tampering, resource consumption, latency, etc.) and thus predictive resource allocation (sensing, computing, communications, etc.) taking into account risk and uncertainty."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.179"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.179"
                                            },
                                            "Text": {
                                                "val": "Will investigate theoretical foundations, models, and methods of autonomic complex systems that deliver adaptive cyber-physical capabilities and services necessary to enable effective command and control across military, adversary, and non-combatant domains; will research the scientific principles, theories, and methods and predictive processing, analytics, and anomaly detection of broadly heterogeneous and varied data that may be unknown combinations of sparse and voluminous; will investigate methods to augment goal-driven decision-making."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increased to support the university consortia involved with the Collaborative Research Alliance that will create the underlying science base of heterogeneous, self-adapting complex cyber-physical systems."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H04"
                    },
                    "ProjectTitle": {
                        "val": "HBCU\/MI Programs"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.429"
                        },
                        "CurrentYear": {
                            "val": "1.536"
                        },
                        "BudgetYearOne": {
                            "val": "1.591"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.591"
                        },
                        "BudgetYearTwo": {
                            "val": "1.629"
                        },
                        "BudgetYearThree": {
                            "val": "1.671"
                        },
                        "BudgetYearFour": {
                            "val": "1.704"
                        },
                        "BudgetYearFive": {
                            "val": "1.738"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "11.298"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports basic research through the Partnered Research Initiative (PRI), the Army's research initiative focused on partnerships with Historically Black Colleges and Universities and Minority Institutions (HBCU\/MI).  The focus of this effort is to enhance programs and capabilities of high-interest scientific and engineering disciplines through innovative research performed in collaboration with Collaborative Technology Alliances and Collaborative Research Alliances (CTA\/CRAs).  The CTA\/CRAs work with Army, industry, and other academic partners to transition research to technology demonstration.  In addition, the Centers of Excellence (CoEs) and CTA\/CRA partnerships provide opportunities to recruit, educate, and train outstanding students and post-doctoral researchers in science and technology areas relevant to the Army.\n\n\nWork performed in this Project supports key Army needs and is coordinated with one or more of the following Projects: 0601104A (University and Industry Research Center)\/Project EA6 (Cyber CRA), \/Project F17 (Neuroergonomics CTA), \/Project H09 (Robotics CTA), \/Project H50 (Network Sciences CTA), Micro Autonomous Systems Technology CTA), and \/Project VS2 (Multiscale Modeling of Materials). \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Centers of Excellence for Battlefield Capability Enhancements (BCE)"
                                    },
                                    "Description": {
                                        "val": "Five new Partnership in Research Transition (PIRT) Centers of Excellence were established in 2011 at: Hampton Univ. (Lower Atmospheric Research Using Light Detection and Ranging (Lidar) Remote Sensing); NCA&T State Univ. (Nano to Continuum Multi-Scale Modeling Techniques and Analysis for Cementitious Materials Under Dynamic Loading); Delaware State Univ. (Center for Advanced Algorithms); Howard Univ.(2) (Bayesian Imaging and Advanced Signal Processing for Landmine and Improvised Explosive Device (IED) Detection Using Ground Penetrating Radar (GPR), and Extracting Social Meaning From Linguistic Structures in African Languages).  These Centers were selected to: enhance programs and capabilities through Army-relevant, topic-focused, near-transition-ready innovative research; strengthen the capacity of the HBCUs to provide excellence in education; and to conduct research critical to the national security functions of the DoD."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.429"
                                            },
                                            "Text": {
                                                "val": "Will conduct new research efforts with HBCU\/MIs through ARL?s CTA\/CRAs.  Projects will be within the scope of CTA\/CRAs and will represent opportunities to pursue new, high quality research in areas of strategic importance to the Army.   Areas of research will include: network science, cognition and neuroergonomics, multiscale modeling of materials, robotics, and\/or cyber security."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.536"
                                            },
                                            "Text": {
                                                "val": "Conduct research with HBCU\/MIs begun in FY17 and perform in collaboration with ARL?s CTA\/CRAs.  Projects are within the scope of CTA\/CRAs and pursue high quality, collaborative research in areas of strategic importance to the Army. Areas of research include: network science, cognition and neuroergonomics, multiscale modeling of materials, robotics, and\/or cyber security."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.591"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.591"
                                            },
                                            "Text": {
                                                "val": "Will continue to conduct research with HBCU\/MIs performed in collaboration with ARL?s CTA\/CRAs.  Projects are within the scope of CTA\/CRAs and will pursue high quality, collaborative research in areas of strategic importance to the Army. Areas of research will include: network science, cognition and neuroergonomics, multiscale modeling of materials, robotics and\/or cyber security."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to support research executed through academia and preparation of a competent future STEM workforce."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H05"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Collaborative Biotechnologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.341"
                        },
                        "CurrentYear": {
                            "val": "5.999"
                        },
                        "BudgetYearOne": {
                            "val": "5.999"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.999"
                        },
                        "BudgetYearTwo": {
                            "val": "5.998"
                        },
                        "BudgetYearThree": {
                            "val": "5.997"
                        },
                        "BudgetYearFour": {
                            "val": "6.15"
                        },
                        "BudgetYearFive": {
                            "val": "6.273"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.757"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports research at the Army's Institute for Collaborative Biotechnologies (ICB), led by the University of California-Santa Barbara, and two major supporting partners, the California Institute of Technology and the Massachusetts Institute of Technology.  The ICB was established as a University Affiliated Research Center (UARC) to support leveraging biotechnology for: advanced sensors; new electronic, magnetic, and optical materials; and information processing and bioinspired network analysis. The objective is to perform sustained multidisciplinary basic research supporting technology to provide the Army with biomolecular sensor platforms with unprecedented sensitivity, reliability, and durability; higher-order arrays of functional electronic and optoelectronic components capable of self-assembly and with multi-functions; and new biological means to process, integrate, and network information.  These sensor platforms will incorporate proteomics (large scale study of proteins) technology, Deoxyribonucleic Acid (DNA) sequence identification and detection tools, and the capability for recognition of viral pathogens.  A second ICB objective is to educate and train outstanding students and post-doctoral researchers in revolutionary areas of science to support Army Transformation.  The ICB has many industrial partners, such as International Business Machine (IBM) and Science Applications International Corporation (SAIC), and has strong collaborations with Argonne, Lawrence Berkley, Lawrence Livermore, Los Alamos, Oak Ridge, and Sandia National Laboratories, the Army's Institute for Soldier Nanotechnologies, the Institute for Creative Technologies, and Army Medical Research and Materiel Command (MRMC) laboratories.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Institute for Collaborative Biotechnologies"
                                    },
                                    "Description": {
                                        "val": "Perform sustained multidisciplinary basic research supporting technology to provide the Army with bio-inspired materials and biomolecular sensor platforms."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.646"
                                            },
                                            "Text": {
                                                "val": "Will conduct basic research efforts in systems and synthetic biology, photonic and electronic materials, cellular structural materials, and biotechnology tools; and increase research efforts in understanding and engineering microbial consortia for potential biological processing and manufacturing.  Understanding microbial consortia and engineering them for biological processing\/manufacture could provide the Army with the ability to produce complex chemical intermediates\/feed stocks for material synthesis, bioremediation of toxic materials in the environment, probiotics for enhanced Solider health\/performance, waste mitigation, and novel routes to energy generation for reduced logistics loads."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.342"
                                            },
                                            "Text": {
                                                "val": "Continue to support basic research efforts in synthetic and systems biology, biotechnology tools, and designing microbial consortia. Cellular structural materials, and photonic and electronic materials projects are being combined into new bio-inspired materials effort. On-going research efforts will include bio-inspired optical and photonic materials for potential applications in controlling infrared response and improved energy conversion and storage; novel nanomaterial platform for in situ biomarker detection; and engineering microbial consortia for bio-production."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.345"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.345"
                                            },
                                            "Text": {
                                                "val": "Will support new set of basic research projects in synthetic and systems biology, bio-inspired materials, and biotechnology tools. The new efforts will include creating novel inorganic-organic hybrid materials with novel photo and ion-conducting properties, mechanistic study of IR detection system of rattlesnakes, and engineering novel biocatalysts for abiological chemistry."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased due to inflation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Neuroscience"
                                    },
                                    "Description": {
                                        "val": "Perform multidisciplinary basic research in the area of neuroscience."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.695"
                                            },
                                            "Text": {
                                                "val": "Will continue supporting basic cognitive neuroscience research efforts to better understand decision-making, the effect of fatigue on cognition, and identification of neural indicators\/biomarkers for optimal decision making; understand how the brain achieves accurate classification under high stress; and develop neuro-engineering techniques to make inferences about human?s cognitive and attentional states that are particularly relevant to challenges faced by the Soldier."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.657"
                                            },
                                            "Text": {
                                                "val": "Continue to support basic cognitive neuroscience research efforts to better understand the effect of fatigue and stress on cognition and on decision-making, and identification of neural indicators\/biomarkers for optimal decision-making; and develop neuro-engineering techniques to make inferences about a human?s cognitive and attentional states that are particularly relevant to challenges faced by the Soldier."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.654"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.654"
                                            },
                                            "Text": {
                                                "val": "Will support a new set basic research projects in cognitive neuroscience including new mapping strategies for the neural systems for planning skills, understanding the cognitive priority control, and development of multiscale hierarchical framework for analysis of dynamic neuroscience data."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of biological research."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H09"
                    },
                    "ProjectTitle": {
                        "val": "Robotics CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.884"
                        },
                        "CurrentYear": {
                            "val": "4.136"
                        },
                        "BudgetYearOne": {
                            "val": "4.24"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.24"
                        },
                        "BudgetYearTwo": {
                            "val": "2.957"
                        },
                        "BudgetYearThree": {
                            "val": "3.076"
                        },
                        "BudgetYearFour": {
                            "val": "3.139"
                        },
                        "BudgetYearFive": {
                            "val": "3.202"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.634"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports a collaborative effort between the competitively selected industry and university consortium, the Robotics Collaborative Technology Alliance (CTA), and the Army Research Laboratory (ARL) for the purpose of leveraging world-class research in support of the future force and Army transformation needs.  This project conducts basic research in areas that will expand the capabilities of intelligent mobile robotic systems for military applications with a focus on enhanced, innate intelligence, ultimately approaching that of a dog or other intelligent animal, to permit unmanned systems to function as productive members of a military team.  Research is conducted in machine perception, including the exploration of sensor phenomenology, and the investigation of basic machine vision algorithms enabling future unmanned systems to better understand their local environment for enhanced mobility and tactical performance; intelligent control, including the advancement of artificial intelligence techniques for robot behaviors permitting future systems to autonomously adapt, and alter their behavior to dynamic tactical situations; understanding the interaction of humans with machines focusing upon intuitive control by Soldiers to minimize cognitive burden; dexterous manipulation of the environment by unmanned systems; and unique modes of mobility to enable unmanned systems to seamlessly navigate complex or highly constrained three dimensional environments.  The program will conduct both analytic and validation studies.  \n\nWork in this Project builds fundamental knowledge for and complements the companion applied technology program, Program Element (PE) 0602120A, Project TS2 (Robotics).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Autonomous Systems"
                                    },
                                    "Description": {
                                        "val": "Explore opportunities enabling revolutionary, autonomous, and highly mobile systems for the future force.  Research focuses on unmanned systems operating as a team with human supervisors and displaying a high degree of adaptability to dynamic environmental and tactical situations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.884"
                                            },
                                            "Text": {
                                                "val": "Will develop ?peer-to-peer? teaming between humans and robots through expanded fine grained semantic perception especially through the inclusion of contextual information, exploration of deep-learning techniques and techniques for learning based upon sparse data, modeling of basic human behaviors, and exploration of techniques for energy efficient mobility in complex environments."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.136"
                                            },
                                            "Text": {
                                                "val": "Research the algorithmic infrastructure necessary to enable peer-to-peer teaming through intuitive mechanisms, e.g., communication of perceptual information and intelligent machine behaviors through language. Explore methods to generalize machine intelligence for adaptation to new situations."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.24"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.24"
                                            },
                                            "Text": {
                                                "val": "Will create a framework to demonstrate integrated cognitive, perceptual, motion and manipulation planning, and human multi-modal interface capabilities to assess ability for robots to maneuver in unstructured environments, team with humans to execute complex missions, and perform autonomous mobile manipulation in ad hoc scenarios."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding increase to expand the research from robotic peer-to-peer teaming to human-robot teaming."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H50"
                    },
                    "ProjectTitle": {
                        "val": "Network Sciences Cta"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.814"
                        },
                        "CurrentYear": {
                            "val": "6.466"
                        },
                        "BudgetYearOne": {
                            "val": "5.828"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.828"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "21.108"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "The Mobile Network Modeling Institute moves to in-house basic research in Fiscal Year (FY) 2018 under Program Element (PE) 0601102A (Defense Research Sciences) \\ H48 (Battlespace Info & Comm Rsc)."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports a competitively selected university and industry consortium, the Network Sciences Collaborative Technology Alliance (NS CTA), formed to leverage commercial research investments to provide solutions to Army's requirements for robust, survivable, and highly mobile wireless communications networks, while meeting the Army's needs for a state-of-the-art wireless mobile communications networks for command-on-the-move.  The NS CTA performs foundational, cross-cutting network science research leading to: a fundamental understanding of the interplay and common underlying science among social\/cognitive, information, and communications networks; determination of how processes and parameters in one network affect and are affected by those in other networks; and prediction and control of the individual and composite behavior of these complex interacting networks.  This research will lead to optimized human performance in network-enabled warfare and greatly enhanced speed and precision for complex military operations.  The CTA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, as well as the use of state-of-the-art facilities and equipment at the participating organizations. Many of the results of the NS CTA provide a foundation for a new Collaborative Research Alliance for the Internet of Battlefield Things to begin in FY18. \n\nWork in this Project builds fundamental knowledge for and accelerates the transition of communications and networks technology to PE 0602783A (Computer and Software Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Network Sciences Collaborative Technology Alliance (NS CTA)"
                                    },
                                    "Description": {
                                        "val": "The Network Sciences CTA focuses on four major research areas: Information Networks, Communication Networks, Social\/Cognitive Networks, and Interdisciplinary Research to develop a fundamental understanding of the ways that information, social\/cognitive, and communications networks can be designed, composed, and controlled to dramatically increase mission effectiveness and ultimately enable humans to effectively exploit information for timely decision-making.  Information Networks research develops the fundamental understanding of autonomous network activities and its linkage to the physical and human domains as related to human decision making within the networked command and control (C2) structure.  Social\/Cognitive Networks research is developing the fundamental understanding of the interplay of the various aspects of the social and cognitive networks with information and communications.  Communications Networks research is developing the foundational techniques to model, analyze, predict, and control the behavior of secure tactical communication networks as an enabler for information and C2 networks.  Integration is focused on achieving an integrated Information Networks, Social\/Cognitive Networks, Communications Networks research program that significantly enhances the fundamental understanding of the underlying science of networks."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.82"
                                            },
                                            "Text": {
                                                "val": "Will model dynamics and co-evolution of inter-genre networks and discovery, inference, and prediction in inter-genre networks; generate models for optimal design and decentralized control of time-varying, non-linear, composite networks; derive algorithms for context-aware knowledge synthesis and analytics over multi-genre (communications, information and socio-cognitive) networks that model uncertainty in distributed processing and user interactions for better situational understanding; create a unifying semantic framework, in the context of multi-genre needs, to address information capacity across multi-genre networks, and to characterize and control the trade-offs in semantic information delivery; and generate predictive models of social-cognitive aspects of multi-genre networks, and mechanisms for influencing networks across cultures, and augmentation of human performance in networked operations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.466"
                                            },
                                            "Text": {
                                                "val": "Explore game-theoretic and dynamic programming formulations for network redesign under adversarial dynamics by characterized and establishing conditions for pure and mixed equilibria and formulating algorithms that trades-off current optimality for long-term behavior; develop a theory of reliable real-time social sensing for information extraction by constructing models of social media as noisy communication channels, establishing fundamental bounds on accuracy, and developing real-time algorithms for reliable information extraction; obtain insights on the co-evolution of opinion diffusion and social networks by developing theoretical models of opinion diffusion in dynamic social networks and the impact of cultural and structural properties."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.828"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.828"
                                            },
                                            "Text": {
                                                "val": "Will explore machine learning techniques that can classify different types of networks, including social networks, using deep network signatures to identify networks of special interest (e.g. adversarial) in early stages of their growth. Will develop techniques to jointly model changes in information streams and multi-genre networks to enable the prediction of the impact of external events and anomalies in dynamic networks. Techniques for combining user-oriented multidimensional summarization mechanisms with information-centric networking offers the potential to enable effective analytics in combined communications, information, and social networks."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of high priority S&T areas including intelligent systems research, internet of battlefield things research, and quantum sciences research for manned-unmanned teaming (Next Generation Combat Vehicles\/Future Vertical Lift), Networks\/C3I, and communications, respectively.  With FY19 being the final year of the CTA, research efforts are concluding as research goals are met."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Mobile Network Modeling Institute"
                                    },
                                    "Description": {
                                        "val": "This research focuses on novel computational models, data structures, computational architectures and techniques that enable predictions of performance and stability of large, complex communications networks.  It takes into account the impact of Soldiers' information needs and modalities of access and use of communication networks in complex adversarial environments, high mobility, and adversarial effects such as jamming or cyber-attacks. Also considered are computational modeling approaches that capture dynamics of information that flows through the network and\/or is stored within the network, and undergoes continual changes as new information arrives and other information ages or is refuted\/superseded by newly arrived information; and the impact of clouds and local tactical cloudlets on network behaviors. In FY18, the funding for this research is in project 0601102A\\ H48."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.994"
                                            },
                                            "Text": {
                                                "val": "Will validate high-fidelity scalable simulation methods for large-scale networks on emerging large-scale high performance computing architectures; use large-scale network experiments to observe and identify atypical behaviors with unknown ramifications; document methods for quantifying uncertainty (for large-scale networking modeling); and derive new mathematical algorithms on emerging heterogeneous computing that can assist in training communication systems for Soldiers."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H53"
                    },
                    "ProjectTitle": {
                        "val": "Army High Performance Computing Research Center"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "4.234"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "4.234"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project ended in FY17."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project supports critical research at the Army High Performance Computing Research Center (AHPCRC).  Research at the AHPCRC is focused on the Lightweight Combat Systems Survivability, computational nano- and bio-sciences, computational battlefield network and information sciences including evaluating materials suitable for armor\/anti-armor and sensor applications, defense from chemical and biological agents, and associated enabling technologies requiring computationally intensive algorithms in the areas of combat systems survivability, battlefield network sciences, chemical and biological defense, nanoscience and nanomechanics, and computational information sciences, scientific visualization enabling technologies that support the future force transition path. This program ends in Fiscal Year (FY) 17.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army High Performance Computing Research Center (AHPCRC)"
                                    },
                                    "Description": {
                                        "val": "The AHPCRC research mission is to advance computational science and its application to critical Army technologies through an Army-university-industry collaborative research program in such areas as combat systems survivability, and chemical and biological defense.  The cooperative agreement for the AHPCRC terminates in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.234"
                                            },
                                            "Text": {
                                                "val": "Will investigate new scalable methods for data intensive sciences, specifically exploring next generation computing architectures (scalable algorithms development for data intensive sciences);  research next generation computing and programming models and battle command software for emerging heterogeneous memory and storage hierarchies; and develop algorithmic approaches for exascale computers for physics based modeling."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H54"
                    },
                    "ProjectTitle": {
                        "val": "Micro-Autonomous Systems Technology (MAST) CTA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.531"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "6.531"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "This project ended in FY17."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project fosters basic research through the Micro Autonomous Systems and Technology (MAST) Collaborative Technology Alliance (CTA), a competitively selected industry-university consortium which leverages world-class research necessary to address future force and Army Transformation needs.  The CTA links a broad range of government technology agencies, as well as industrial and academic partners with the Army Research Laboratory (ARL).  The MAST CTA focuses on innovative research in four main technical areas related to the coherent and collaborative operation of multiple micro autonomous platforms: microsystem mechanics, processing for autonomous operation, microelectronics, and platform integration.  Payoff to the warfighter will be advanced technologies to support future force requirements in situational awareness.  The CTA facilitates the exchange of people among the collaborating organizations to provide cross-organizational perspectives on basic research challenges, and to make available to the Alliance state-of-the-art facilities and equipment at the participating organizations. The MAST cooperative research alliance terminates in Fiscal Year (FY) 17.\n\nWork in this Project complements and is fully coordinated with the United States (U.S.) Army Tank and Automotive Research, Development, and Engineering Center (TARDEC); the U.S. Army Natick Soldier Research, Development, and Engineering Center (NSRDEC); and the U.S. Special Operations Command (SOCOM).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Micro-Autonomous Systems Technology (MAST) CTA"
                                    },
                                    "Description": {
                                        "val": "Enhance tactical situational awareness in urban and complex terrain by enabling the autonomous operation of a collaborative ensemble of multifunctional mobile microsystems.  The MAST cooperative research alliance terminates in FY17."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.531"
                                            },
                                            "Text": {
                                                "val": "Will analyze, integrate and experimentally validate bio-inspired optic flow and gust detection sensors and control algorithms for MAST-scaled aerial platforms; analyze, integrate, and experimentally validate increased platform stability and bio-inspired agility concepts for MAST-scale ambulatory robots in complex 3D terrains; characterize and experimentally validate an advanced 5 gram submillimeter radar concept for obstacle detection and platform navigation; develop and experimentally validate advanced optical methods to enable cooperative control for teams of MAST-scaled platforms; characterize methods and experimentally validate rapid deployment of heterogeneous robot teams for exploration of unknown environments and bio-inspired landing, perching, and grasping for micro-aerial vehicles; and develop and experimentally validate concepts for robust communications in complex radio frequency (RF) environments."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H59"
                    },
                    "ProjectTitle": {
                        "val": "International Tech Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "6.346"
                        },
                        "CurrentYear": {
                            "val": "6.682"
                        },
                        "BudgetYearOne": {
                            "val": "6.556"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.556"
                        },
                        "BudgetYearTwo": {
                            "val": "6.742"
                        },
                        "BudgetYearThree": {
                            "val": "7.081"
                        },
                        "BudgetYearFour": {
                            "val": "7.225"
                        },
                        "BudgetYearFive": {
                            "val": "7.37"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "48.002"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project funds the International Technology Centers (ITCs) and the Foreign Technology (and Science) Assessment Support (FTAS) program.  \n\nThe nine ITCs located in in North America, South America, Asia, and Europe support the Army's goals of providing the best technology in the world to our Warfighters by leveraging the Science and Technology (S&T) investments of our international partners.  The ITCs perform identification and evaluation of international technology programs to assess their potential impact on the Army's S&T investment strategy.  ITC 'technology finds' are submitted as technology information papers (TIPs) to various Army S&T organizations for evaluation and consideration for further research and development.  Highly promising research will be awarded seed funding by the ITC through a grant, contract, or cooperative agreement.  The FTAS program also builds upon the TIPs submitted by the ITCs.  In some cases the TIP is truly unique and may well meet an Army requirement or potentially support ongoing Army S&T investments.  In such cases, the FTAS program can provide initial resources (seed money) to determine the appropriateness of these technology areas identified by the TIPs as having potential relevance to the Army.  These efforts will provide information useful in making early assessments of the technology's potential contributions to the Army's S&T strategy.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "International Technology Centers (ITC)"
                                    },
                                    "Description": {
                                        "val": "This project funds the technology search function of the International Technology Centers (ITCs).  Research and\/or technologies that have possible interest to the Army are described by a technology information papers (TIP).  Review of these TIPs by the research community will provide useful information in making early assessments of the technology's potential contributions to the Army's science and technology (S&T) strategy.  Highly promising international basic research will be provided seed funding by the ITC for further evaluation through a grant, contract, or cooperative agreement, typically to a university."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.346"
                                            },
                                            "Text": {
                                                "val": "Will continue to solicit projects and build on the success of the FTAS Program; continue to enhance and refine technology search capabilities using customer feedback (RDECs, PMs and labs) to focus on near and long term capabilities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.682"
                                            },
                                            "Text": {
                                                "val": "Continue to solicit projects and build on the success of the Foreign Technology (and Science) Assessment Support (FTAS) Program; and continue to enhance and refine technology search capabilities using customer feedback (RDECs, PMs and labs) to focus on near- and long-term capabilities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.452"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.452"
                                            },
                                            "Text": {
                                                "val": "The ITCs will continue to seek out foreign science and technologies that may have U.S. Army interest within their area of responsibility. Highly promising international basic research will be awarded seed funding for further evaluation through a grant, contract, or cooperative agreement, typically to a university."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of foreign technology assessments to ensure knowledge and awareness of worldwide S&T developments."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Foreign Technology (and Science) Assessment Support (FTAS)"
                                    },
                                    "Description": {
                                        "val": "This Project funds the Foreign Technology (and Science) Assessment Support (FTAS) program.  The FTAS program builds upon the technology information papers (TIPs) submitted by the U.S. Army laboratories and International Technology Centers (ITCs).  In some cases a TIP is truly unique and may well meet an Army requirement or potentially support ongoing Army Science & Technology (S&T) investments.  In such cases, the FTAS program can provide initial resources (seed money) to determine the appropriateness of technology areas identified by the TIPs to meet Army needs.  These efforts will provide information useful in making early assessments of the technology's potential contributions to the Army's S&T strategy."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.104"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.104"
                                            },
                                            "Text": {
                                                "val": "Will solicit projects and build on the success of the FTAS Program.  Once scientific quality of candidate projects is assessed by the U.S. Army Senior Scientist Corps, up to $150K in seed funding will be provided to U.S. Army laboratories to further determine the appropriateness of technology areas identified by the TIPs as having potential relevance to the Army."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "New start effort to enable pursuit of knowledge of foreign-generated technology and ensure technological overmatch for future operations."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H73"
                    },
                    "ProjectTitle": {
                        "val": "Automotive Research Center (ARC)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.057"
                        },
                        "CurrentYear": {
                            "val": "3.235"
                        },
                        "BudgetYearOne": {
                            "val": "3.296"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.296"
                        },
                        "BudgetYearTwo": {
                            "val": "3.361"
                        },
                        "BudgetYearThree": {
                            "val": "3.427"
                        },
                        "BudgetYearFour": {
                            "val": "3.498"
                        },
                        "BudgetYearFive": {
                            "val": "3.568"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "23.442"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project fosters basic research in novel, high payoff technologies that can be integrated into Army ground platforms.  The Center of Excellence for Automotive Research is part of the basic research component of the National Automotive Center (NAC), a business group within the Army Tank-Automotive Research, Development, and Engineering Center (TARDEC).  The Center of Excellence for Automotive Research is an innovative university\/industry\/government consortium leveraging commercial technology for potential application in Army vehicle systems through ongoing and new programs in automotive research, resulting in significant cost savings and performance enhancing technological opportunities.  The research performed in this Project contributes to formulating and establishing the basic scientific and engineering principles for these technologies.  \n\nWork in this Project complements and is fully coordinated with work under Program Element (PE) 0602601A (Combat Vehicle and Automotive Technology).  Selected university partners include:  University of Michigan, Virginia Tech, Wayne State University, University of Iowa, Oakland University, and Clemson University.  Key industry partners include all major US automotive manufacturers and suppliers.  The Automotive Research Center (ARC) formulates and evaluates advanced automotive technologies and advances state-of-the-art modeling and simulation for the Army's future ground vehicle platforms. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering science and technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Automotive Research Center (ARC)"
                                    },
                                    "Description": {
                                        "val": "The ARC is an U.S. Army Center of Excellence for Modeling and Simulation of ground Vehicles. The Center relies on the collaboration of researchers from multiple universities and disciplines in order to bridge fundamental technology gaps in five research thrust areas of strategic importance to the Army, associated with conversion and management of power and energy within vehicles, mobility and survivability of the complete vehicle system, including the human operator, and vehicle integration\/optimization."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.057"
                                            },
                                            "Text": {
                                                "val": "Will expand research and further develop modeling and simulation methodologies for enabling autonomy in ground vehicle systems and increased force protection\/survivability focused on real-time obstacle avoidance, latency compensation and shared human-machine control; research tire and track modeling and other off-road mobility related topics necessary for terramechanics advancements.  Research thrust areas will focus on dynamics and control of vehicles with emphasis on autonomous and autonomy-enabled systems, human-centered modeling and simulation, high performance structures and materials as it pertains to lightweighting\/advanced battery systems\/lubricants\/fuels, next-generation propulsion systems, advanced and hybrid power trains, and vehicle system integration, multi-objective and multi-disciplinary design optimization and robustness focused on modular systems that are expeditionary in nature."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.235"
                                            },
                                            "Text": {
                                                "val": "Continue to focus on dynamics and control of vehicles with emphasis on autonomy-enabled systems, and ground vehicle system integration of advanced powertrains, storage systems and lightweight structures\/materials. Research and develop modeling and simulation methodologies for vehicle dynamics-conscious real-time hazard avoidance in autonomous ground vehicles (AGV), improving inherent mobility through innovative latency compensation techniques and robotrust algorithms, increasing energy efficiency and mobility of connected vehicles, adaptive powertrain thermal management based on active monitoring and control, superior engine heat rejection using advanced materials, new fatigue reliability and random vibration methods for linear and nonlinear systems, etc. Solicit proposals for continuing and new projects from all ARC consortium researchers in the first quarter of Fiscal Year (FY) 2018."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.296"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.296"
                                            },
                                            "Text": {
                                                "val": "Will continue advanced modeling and simulation research on ground vehicle power generation, storage, and distribution while expanding more into autonomy and mobility problems for ground vehicles.  Topics will include teleoperated, semi-autonomous, fully-autonomous, and multiple autonomous vehicle operation and control, high fidelity simulation environments for operational evaluations of autonomy related technologies, high performance terramechanics models, perception in degraded sensor environments, machine learning, robotic trust, etc."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J08"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Creative Technologies (ICT)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.948"
                        },
                        "CurrentYear": {
                            "val": "6.308"
                        },
                        "BudgetYearOne": {
                            "val": "6.44"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.44"
                        },
                        "BudgetYearTwo": {
                            "val": "6.569"
                        },
                        "BudgetYearThree": {
                            "val": "6.701"
                        },
                        "BudgetYearFour": {
                            "val": "6.837"
                        },
                        "BudgetYearFive": {
                            "val": "6.974"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "45.777"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports simulation and training technology research at the Army's Institute for Creative Technologies (ICT) at the University of Southern California.  The ICT was established as a University Affiliated Research Center (UARC) to support Army training and readiness through research into simulation, mixed and virtual reality, artificial intelligence, computer graphics, and learning sciences. ICT applies the results of this research and proves its value in Army relevant applications such as training, mission rehearsal, leadership development, cultural awareness, negotiation, health and medical, and distance learning.  The ICT actively performs research and engages industry and academic institutions internationally to incorporate the latest research results and hardware and software into its research program and application development and exploit dual-use technology. The ICT serves as a means for the military to learn about, benefit from, and facilitate the transfer of applicable technologies into military systems.  In addition the ICT works with creative talent from the entertainment industry to advance and leverage techniques and capabilities and adapt concepts of story and character to increase the degree of participant immersion in synthetic environments in order to improve the realism and usefulness of these experiences.  In developing a true synthesis of the creativity, research, technology, and capability of industry and the research and development community, the ICT is revolutionizing capabilities for the Army by making it more effective in terms of cost, time, range of experiences and the quality of the result and by producing research and applications that will benefit the Army of the 21st century. Resulting research, techniques, and technologies are transitioned for maturation to Program Element (PE) 0602308A (Advanced Concepts and Simulation) \/ Project D02 (Modeling & Simulation for Training and Design).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Immersive Environments"
                                    },
                                    "Description": {
                                        "val": "Conduct basic research in immersive environments, to include virtual humans, three-dimensional (3D) sound and visual media, to achieve more efficient and affordable training, modeling, simulation and application solutions and tools. Research includes investigation of techniques and methods to address the rapid development of synthetic environments and the study of perception and cognition to help direct the development of new technologies and techniques that evoke more realistic responses from users. Perform research into auditory aspects of immersion to provide the sound stimulus for increasing the realism for military training and simulation devices."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.258"
                                            },
                                            "Text": {
                                                "val": "Will conduct studies with immersive virtual reality environments to identify ways to induce users to react in realistic and naturalistic ways to support more effective training and learning experiences in virtual spaces; investigate research technologies to automatically recognize nonverbal behaviors and interpersonal dynamics in groups for improved human-computer and human-robot interactions; and investigate the use of machine learning techniques to acquire automatically through interaction with users a variety of linguistic features that support more natural and fluid language interaction."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.394"
                                            },
                                            "Text": {
                                                "val": "Incorporate semantic, nonverbal human behaviors with verbal messages to increase realism of simulated face-to-face conversations between humans and virtual humans. Develop algorithms to automatically analyze social simulation models for proactively identifying potential data gaps and eliciting data from both online and expert sources to fill in the identified gaps. Create end-to-end neural network-inspired solutions for modeling entrainment for groups of individuals (mixed with virtual agents)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.55"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.55"
                                            },
                                            "Text": {
                                                "val": "Will examine characteristics of virtual humans that promote trust in domains such as persuasion tasks, social dilemmas and interviews (with sensitive questions) and will examine differences between normative influence (emphasizing social norms) and informational influence (e.g. conveying expert information); these areas have potential applications for not only virtual humans but also robotics."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to enable improved knowledge to support Soldier Lethality for enhanced human performance and team cohesion."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Graphics and Animations"
                                    },
                                    "Description": {
                                        "val": "Conduct basic research to identify new computational techniques in graphics for achieving real-time photo-realistic rendering of physical and synthetic environments for training and simulations. Research innovative methods for automatically generating animations and gestures for virtual humans based on what is being communicated. Research new technologies for scanning real people and rapidly generating virtual humans which look like these people significantly reducing the time, expense and effort required to develop virtual humans and virtual environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.379"
                                            },
                                            "Text": {
                                                "val": "Will research new technologies for developing life-like, high definition novel performances that include the rapid synthesis of a wide range of facial animations by digital characters allowing for the creation of new performances even when the original (real) subject is no longer available; investigate methods and techniques for the autostereoscopic rendering and display of virtual humans in 3D shared spaces such that they can be viewed by multiple simultaneous viewers without the need for special glasses or headwear; research computational camera system techniques for the purpose of rapidly capturing photorealistic digital characters and authoring performance-driven animations; conduct experiments to determine effectiveness of the human-virtual human interaction at varying levels of fidelity; and extend virtual character capture methods to extract and model hair and cloth to improve the photorealism of dynamic virtual characters."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.462"
                                            },
                                            "Text": {
                                                "val": "Research hybrid approaches to tracking and creating high-definition facial and body performances of virtual humans for increased realism within virtual and mixed reality environments; investigate techniques to rapidly capture and recreate objects and scenes within virtual reality environments; and develop models for animated characters that include relevant aspects of actual human personalities such as gait, posture, and gestures."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.26"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.26"
                                            },
                                            "Text": {
                                                "val": "Will research virtual reality and augmented reality-driven teleportation system that will use detailed 3D models created in prior research to in-person, photo-realistic communication for remote participants; Will research techniques for rapidly capturing movement and speech animations that are specific to individuals."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased due to reduced emphasis on creating detailed 3D models as a result of prior year progress."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Techniques and Human-Virtual Human Interaction"
                                    },
                                    "Description": {
                                        "val": "Basic research to investigate methods and techniques for creating virtual human computer-generated characters that look, communicate and behave like real people, meaning the virtual humans will be autonomous, use verbal and non-verbal communication, exhibit emotions, model their own beliefs, desires and intentions as well as those of others, and reason using advanced artificial intelligence. Investigate methods and techniques for improving the perception, communication, understanding, and responsiveness of virtual humans when interacting with live humans and explore how people relate to virtual humans."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.311"
                                            },
                                            "Text": {
                                                "val": "Will explore strategic use of emotion and how emotional displays can be used to manipulate negotiation outcomes and develop a dynamic computer model representation; extend research to explore in depth differences between how people respond to virtual humans, real humans and robots; create meta-dialogue strategies for controlling interactions between people and virtual humans and use online learning to enhance speech synthesis so that virtual humans engage in human-like interaction with people and other virtual human agents; and refine conceptual virtual humans architecture to validate advanced and more natural emotional behaviors, reasoning, and interactions via natural language and speech."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.452"
                                            },
                                            "Text": {
                                                "val": "Examine and formalize multiple pathways that leaders can use to influence the emotions and motivations of others (in both negotiation and leadership settings). Create models of motivation and personality within a cognitive architecture for virtual humans. Develop a new theory of human-machine teaming focused on gaining a better understanding of the human-machine social relationships. Evaluate the use of meta-dialogue, on-line learning, story, culture, and knowledge-based interaction-enhanced capabilities within the context of long-term interactions between humans and artificial agents"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.63"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.63"
                                            },
                                            "Text": {
                                                "val": "Will study how extended interaction occurs in groups larger than a dyad, investigate how information can span multiple conversations, and research how to endow virtual humans with these capabilities.  Will develop techniques that will allow virtual humans to automatically identify strategic emotional manipulation and defend against it. Will leverage Sigma cognitive architecture?s combined neural and symbolic representations to create a model of question answering."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to enable improved knowledge to support Soldier Lethality for enhanced human performance."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J12"
                    },
                    "ProjectTitle": {
                        "val": "Institute For Soldier Nanotechnology (ISN)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.947"
                        },
                        "CurrentYear": {
                            "val": "5.999"
                        },
                        "BudgetYearOne": {
                            "val": "5.999"
                        },
                        "BudgetYearOneBase": {
                            "val": "5.999"
                        },
                        "BudgetYearTwo": {
                            "val": "5.998"
                        },
                        "BudgetYearThree": {
                            "val": "5.997"
                        },
                        "BudgetYearFour": {
                            "val": "6.057"
                        },
                        "BudgetYearFive": {
                            "val": "6.178"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.175"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports sustained multidisciplinary research at the Army's Institute for Soldier Nanotechnologies (ISN) at the Massachusetts Institute of Technology.  The ISN was established as a University Affiliated Research Center (UARC) to support research to devise nanotechnology-based solutions for the Soldier.  The ISN emphasizes revolutionary materials research for advanced Soldier protection and survivability.  The ISN works in close collaboration with the United States (U.S.) Army Research Laboratory (ARL), the Army Natick Soldier Research, Development and Engineering Center (NSRDEC), and other U.S. Army Research Development and Engineering Command (RDECOM) elements, as well as several major industrial partners, including Raytheon and DuPont, in pursuit of its goals.  This project emphasizes revolutionary materials research toward an advanced uniform concept.  The future uniform will integrate a wide range of functionality, including ballistic protection, responsive passive cooling and insulating, screening of chemical and biological agents, biomedical monitoring, performance enhancement, and extremities protection.  The objective is to lighten the Soldier's load through system integration and multifunctional devices while increasing survivability.  The new technologies will be compatible with other Soldier requirements, including Soldier performance, limited power generation, integrated sensors, communication and display technologies, weapons systems, and expected extremes of temperature, humidity, storage lifetimes, damage, and spoilage. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Nanomaterials and Nanotechnologies for Soldier Application (formerly Nanomaterials)"
                                    },
                                    "Description": {
                                        "val": "Nanomaterials research efforts focus on light-weight, multifunctional nanostructured fibers and materials."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.479"
                                            },
                                            "Text": {
                                                "val": "Will continue to fund basic nanomaterials research efforts, including functional nanocrystals for spectral applications, graphene integration for infrared (IR) detection, and nanoparticles with specified optical resonances for obscurant applications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.999"
                                            },
                                            "Text": {
                                                "val": "Support new basic research projects in nanomaterials that can lead to development of novel nanophotonic and optical sensing and energy conversion platforms, and personal medicine platforms for the Soldier Explore novel nanomaterials and composites to improve Soldier protection against blast and ballistic threats, mitigate shock, and improve impact absorption. Investigate multiscale modeling efforts for fracture process in novel nanomaterials. Study novel strategies for treatment of incompressible wounds and improved vaccination\/infection control strategies by leveraging targeted nano-therapies."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.999"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.999"
                                            },
                                            "Text": {
                                                "val": "Will support continuing basic research projects in nanomaterials to improve protection against blast and ballistic threats. Will continue to support nano-optoelectronics and novel light-matter interactions for optical sensing and energy conversion platforms. Will continue to support battle field medicine through novel strategies for treatment of incompressible wounds, and improved vaccination\/infection control strategies by leveraging targeted nano-therapies."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blast Effects on Soldier"
                                    },
                                    "Description": {
                                        "val": "Blast Effects on Soldier research involves the areas of Battle Suit Medicine and Blast and Ballistic Protection. Will be discontinued as a separate task and will be merged with Nanomaterials and Nanotechnologies for Soldier Application task in Fiscal Year (FY) 18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.982"
                                            },
                                            "Text": {
                                                "val": "Will continue basic research to improve understanding of the physics, biology and physiology of blast-induced trauma and the strengths and limitations of various materials to protect against blast related injuries. Support efforts to develop computational tools for high-fidelity 3D simulations of blast and ballistic impacts on human protective materials, including crack formation and propagation, and materials failure."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Soldier Protection"
                                    },
                                    "Description": {
                                        "val": "Soldier Protection research efforts focused on Soldier Survivability and Protection and Nanosystems Integration. Will be discontinued as a separate task and will be merged with Nanomaterials and Nanotechnologies for Soldier Application task in FY18."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.486"
                                            },
                                            "Text": {
                                                "val": "Will continue funding basic research efforts that could lead to development of novel therapeutic multifunctional materials and drug delivery vehicles. Support efforts in synthesis of nanoscale superelastic alloys and other novel nanomaterial systems for potential flexible protection application."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J13"
                    },
                    "ProjectTitle": {
                        "val": "UNIVERSITY AND INDUSTRY INITIATIVES (CA)"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "18"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "18.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional Increase"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding provided for University and Industry Initiatives."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Congressional Program Increase - basic research"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "13"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Materials in extreme dynamic environments"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J14"
                    },
                    "ProjectTitle": {
                        "val": "Army Educational Outreach Program"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "9.484"
                        },
                        "CurrentYear": {
                            "val": "10.047"
                        },
                        "BudgetYearOne": {
                            "val": "10.272"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.272"
                        },
                        "BudgetYearTwo": {
                            "val": "10.466"
                        },
                        "BudgetYearThree": {
                            "val": "10.675"
                        },
                        "BudgetYearFour": {
                            "val": "10.893"
                        },
                        "BudgetYearFive": {
                            "val": "11.111"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "72.948"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports science, technology, engineering, and mathematics (STEM) activities that encourage elementary\/middle\/high school and undergraduate youths to develop an interest in and pursue education and employment in the STEM fields. These activities are coordinated within the Army Educational Outreach Program (AEOP) that links and networks appropriate components to derive the best synergies to present the Army to a larger pool of technical talent and to provide students with Army-unique practical experiences at Army laboratories, centers, and institutes and expose them to DoD careers. AEOP increases interest and involvement of students and teachers across the nation in STEM at all proficiency levels and backgrounds to include under-represented and economically disadvantaged groups through exposure to Army sponsored research, education, competitions, internships, and practical experiences. This Project utilizes Army STEM assets to contribute to a STEM literate citizenry as well as enhances the national pool of science and engineering personnel that in turn supports defense industry and Army laboratory and research, development, and engineering center needs.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus area, the Army Modernization Strategy, and the Federal STEM Strategic Plan."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "eCYBERMISSION"
                                    },
                                    "Description": {
                                        "val": "This program supports a nation-wide, web-based STEM competition for students in grades 6 through 9, designed to stimulate interest and encourage continued education in these areas among middle and high school students nationwide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.672"
                                            },
                                            "Text": {
                                                "val": "Will continue STEM activities with concentrated effort in reaching out to students from underserved populations; increase geographic diversity; sustain program growth; and will implement program enhancements based on prior years? evaluations outcomes."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.821"
                                            },
                                            "Text": {
                                                "val": "Continue STEM activities with concentrated effort in reaching out to students from underserved populations; increase geographic diversity; sustain program growth; and will implement program enhancements based on prior years? evaluations outcomes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding eliminated so as to increase support of Army Educational Outreach Program (AEOP) Cooperative Agreement."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Educational Outreach and Workforce Development"
                                    },
                                    "Description": {
                                        "val": "This effort aims to broaden STEM competencies through various outreach and workforce development initiatives at participating Army labs and research centers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.309"
                                            },
                                            "Text": {
                                                "val": "Will continue AEOP support and outreach to under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions, and mentor students to broaden their interest in and their development of STEM education."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.2"
                                            },
                                            "Text": {
                                                "val": "Continue AEOP support and outreach to under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions, and mentor students to broaden their interest in and their development of STEM education."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Will continue AEOP support and outreach to under-represented and economically disadvantaged areas to enhance STEM education through student experiences in Army labs and academic partner institutions, and mentor students to broaden their interest in and their development of STEM education."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased to enable support of Army Educational Outreach Program (AEOP) Cooperative Agreement, thereby increasing program initiatives while decreasing marketing initiatives."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Army Educational Outreach Program (AEOP) Cooperative Agreement"
                                    },
                                    "Description": {
                                        "val": "The Army Educational Outreach Program Cooperative Agreement encompasses a variety of outreach activities under AEOP. This activity supports a strong partnership with government, academia and industry to address the shortfall of clearable STEM skilled talent preparing for the workforce. These activities include Army-sponsored research, education, competitions, internships and practical experiences designed to engage and guide students and teachers in Army sponsored STEM programs. AEOP has targeted efforts to reach and engage underserved and underrepresented communities in STEM initiatives to build the pool of diverse STEM competitive talent."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.205"
                                            },
                                            "Text": {
                                                "val": "Will continue Army lab and research center sponsorship of students and STEM education opportunities; provide incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to support future decisions and best practices."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.711"
                                            },
                                            "Text": {
                                                "val": "Continue Army lab and research center sponsorship of students and STEM education opportunities; provide incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to support future decisions and best practices. FY18 evaluation efforts include assessments that speak to the STEM education investments impact on teaching 21st century skills."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.954"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.954"
                                            },
                                            "Text": {
                                                "val": "Will continue Army lab and research center sponsorship of students and STEM education opportunities; provide incentives in STEM competitions that include scholarships, experiences and mentorships as well as expose students to DoD career opportunities; streamline processes, leverage funding and build educational partnerships; and perform annual comprehensive review and educational assessments to support future decisions and best practices."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to support outreach to STEM populations to ensure a competent technical workforce into the future."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "West Point Cadet Research"
                                    },
                                    "Description": {
                                        "val": "The West Point Cadet Research Program provides West Point Cadets an opportunity to work on Army research projects alongside Army and industry scientists and engineers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.298"
                                            },
                                            "Text": {
                                                "val": "Will conduct West Point cadet research internship program to enhance cadet training through field experience in Army research labs and centers."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.315"
                                            },
                                            "Text": {
                                                "val": "Conduct West Point cadet research internship program to enhance cadet training through field experience in Army research labs and centers."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.318"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.318"
                                            },
                                            "Text": {
                                                "val": "Will conduct West Point cadet research internship program to enhance cadet training through field experience in Army research labs and engineering centers."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J15"
                    },
                    "ProjectTitle": {
                        "val": "Network Sciences ITA"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "3.921"
                        },
                        "CurrentYear": {
                            "val": "4.082"
                        },
                        "BudgetYearOne": {
                            "val": "4.111"
                        },
                        "BudgetYearOneBase": {
                            "val": "4.111"
                        },
                        "BudgetYearTwo": {
                            "val": "4.151"
                        },
                        "BudgetYearThree": {
                            "val": "4.233"
                        },
                        "BudgetYearFour": {
                            "val": "4.32"
                        },
                        "BudgetYearFive": {
                            "val": "4.406"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "29.224"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports research at a competitively selected United States (U.S.)\/United Kingdom (U.K.) government, university, and industry consortium established to perform fundamental network and information science investigations in the areas of network theory, system-of-systems security, sensor processing and delivery, and distributed coalition planning and decision making.  The focus is on enhancing distributed, secure, and flexible decision-making to improve coalition operations, and developing the scientific foundations for complex and dynamic networked systems-of-systems to support the complex human, social, and technical interactions anticipated in future coalition operations with the emphasis on integration of multiple technical disciplines in an international arena. The Army Research Laboratory (ARL) and the U.K. Ministry of Defense (MOD) established the jointly funded and managed U.S. and U.K. consortium, known as the International Technology Alliance (ITA) on Network and Information Sciences, in Fiscal Year (FY) 2006. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Distributed Analytics and Information Science for U.S.\/U.K. Coalition Operations Information (formerly Network and Information Science Basic Research for U.S.\/U.K. Coalition Operations Information)"
                                    },
                                    "Description": {
                                        "val": "This research will address the fundamental science underpinning the complex information network issues that are vital to future U.S.\/U.K. coalition military operations and to fully exploit the joint development of emerging technologies necessary to enable coalition operations. These efforts provide enhanced ability to perform adaptive, goal-driven, semantically-aware, distributed analytics for situational understanding in coalition operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.921"
                                            },
                                            "Text": {
                                                "val": "Will cultivate a fundamental understanding of using distributed services to support coalition information processing in dynamic environments for building composite information infrastructures; develop information-centric networking that supports secure coalition operations via logically distributed and decentralized architectures across heterogeneous coalition networks; formulate dynamic policy-based autonomous management techniques to jointly control both coalition information and infrastructural services that dynamically adjust to mission changes, network dynamics and policy changes; develop formal theories, frameworks and mechanisms to dynamically match operational tasks to information resources for complex coalition operations; and investigate formal theories and techniques to enable multi-level integrated fusion of disparate information sources in context of decision support objectives for coalitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.082"
                                            },
                                            "Text": {
                                                "val": "Model complex, adaptive human systems including group and sub-group reactions to external and internal stimuli to recognize and discriminate behaviors of interest. Investigate software-defined information-centric networking that supports secure coalition operations via logically distributed and decentralized control plane architectures across heterogeneous, mobile networks; create formal theories, techniques, and frameworks to enable multi-level integrated fusion of disparate information sources in the context of decision-support objectives; and identify distributed learning techniques to compose and adapt distributed services in dynamic coalitions."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.111"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.111"
                                            },
                                            "Text": {
                                                "val": "Will investigate and formally model new generative policy techniques in which elements can generate their policies under a loose set of guidance from a central coalition commander, will investigate algorithms that ensure consistency and coherence in the operation of such a system to enable ad hoc and dynamic coalition formation; will investigate fundamental limits and models for agile code and agile data to support distributed analytics in coalitions with mechanisms that dynamically adapt analytics processing in a tactical coalition environment as missions and coalitions change; will develop deep learning techniques for multi-layer situational understanding with information fusion at varying levels of semantic granularity to obtain situational understanding in complex multi-layer coalition environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "J17"
                    },
                    "ProjectTitle": {
                        "val": "Vertical Lift Research Center Of Excellence"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "2.959"
                        },
                        "CurrentYear": {
                            "val": "3.13"
                        },
                        "BudgetYearOne": {
                            "val": "3.186"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.186"
                        },
                        "BudgetYearTwo": {
                            "val": "3.249"
                        },
                        "BudgetYearThree": {
                            "val": "3.313"
                        },
                        "BudgetYearFour": {
                            "val": "3.381"
                        },
                        "BudgetYearFive": {
                            "val": "3.449"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "22.667"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project fosters research to provide vertical lift capability and engineering expertise for the Army. The focus of the Vertical Lift Research Center of Excellence (VLRCOE) is to couple state-of-the-art research programs with broad-based graduate education programs at academic institutions with the goal of increasing the supply of scientists and engineers who can contribute to Army Transformation. Work will provide research into technologies that can improve tactical mobility, reduce the logistics footprint, and increase survivability for rotary wing vehicles.  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Vertical Lift Research Center of Excellence (VLRCOE)"
                                    },
                                    "Description": {
                                        "val": "VLRCOE agreements with Penn State University, University of Maryland, and Georgia Institute of Technology to supplement a robust experimental and analytic basic research program in rotorcraft technologies including: Aeromechanics, Structures, Flight Dynamics and Control, Rotorcraft Design and Concepts, Vibration and Noise Control, Propulsion, Affordability, Safety and Survivability, and Naval Operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.959"
                                            },
                                            "Text": {
                                                "val": "Will initiate a new, five year COE program that supports the Future Vertical Lift program and focuses on graduate education and a robust experimental\/computational\/analytical basic research program in rotorcraft technologies including: aeromechanics, structures, flight dynamics and control, rotorcraft design and concepts, vibration and noise control, propulsion, affordability, safety and survivability, and Naval operations.  Specific areas of interest and proposals will be selected based on evaluations by a consensus of government subject matter experts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.13"
                                            },
                                            "Text": {
                                                "val": "Execute the second year of the five year cooperative agreements with the Centers of Excellence at Georgia Institute of Technology, Pennsylvania State University, and University of Maryland. Conduct basic research in areas of long term interest for the future vertical lift program, such as hub drag reduction, aeroelastic stability, and reduced order modeling for flight dynamics. Conduct the first annual review by a group of government organizational leaders and subject matter experts (SME's) from the Army, the Navy and NASA to evaluate the research progress and provide technical direction.  The basic research at the Centers is highly collaborative in nature with government subject-matter-experts closely tied into the research performed at the universities."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.186"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.186"
                                            },
                                            "Text": {
                                                "val": "Will execute the third annual review of the VLRCOE program with a diverse team of Government subject matter experts (SMEs) and organizational leaders from the Army, the Navy and NASA, to provide technical direction for the research tasks. Will execute the cooperative agreement with the Centers of Excellence at Georgia Institute of Technology, Pennsylvania State University, and University of Maryland incorporating the reviewers' feedback to realign the research tasks with the Army's strategic science and technology plans. The Centers will conduct a robust experimental and analytic basic research program in close collaboration with government SMEs in areas relevant to future vertical lift to include nanocomposites to enhance fatigue life of rotorcraft components, optimal control allocation methods and advanced cueing & flight control algorithms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased due to inflation."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS2"
                    },
                    "ProjectTitle": {
                        "val": "Multi-Scale Materials Modeling Centers"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "8.511"
                        },
                        "CurrentYear": {
                            "val": "9.047"
                        },
                        "BudgetYearOne": {
                            "val": "8.754"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.754"
                        },
                        "BudgetYearTwo": {
                            "val": "8.739"
                        },
                        "BudgetYearThree": {
                            "val": "8.688"
                        },
                        "BudgetYearFour": {
                            "val": "8.886"
                        },
                        "BudgetYearFive": {
                            "val": "9.064"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "61.689"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports two competitively awarded Collaborative Research Alliances (CRAs) to provide the Army with next generation multi-functional materials for ballistic and electronic applications and to address the extreme challenges associated with understanding and modeling materials subject to Army operational environments.  The Materials in Extreme Dynamic Environments consortium, led by Johns Hopkins University partnered with CalTech, Rutgers University, and University of Delaware, focuses on understanding materials under high strain rates.  The Multiscale Multidisciplinary Modeling of Electronic Materials consortium, led by University of Utah partnered with Boston University and Rensselaer Polytechnic Institute, focuses on microscale properties to design macroscale behavior for electronics.  Research at both CRAs will address the modeling and experimental challenges associated with developing multidisciplinary physics simulations across multiple length scales for materials to include: a limited ability to relate materials chemistry, structure, and defects to materials response and failure under extreme conditions; an inadequate ability to predict the roles of materials structure, processing, and properties on performance in relevant extreme environments and designs; and the lack of experimental capabilities to quantify multiscale response and failure of materials under extreme conditions.\n\nWork in this Project supports key Army needs and is coordinated with work performed in Program Element (PE) 0601102A (Defense Research Sciences)\/Project H44 (Adv Sensor Research) and H42 (Materials and Mechanics).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Collaborative Research Alliances in Materials in Extreme Dynamic Environments and Multiscale Multidisciplinary Modeling of Electronic Materials."
                                    },
                                    "Description": {
                                        "val": "Research will focus on the following areas: two-way multiscale modeling for predicting performance and designing materials, investigating analytical and theoretical analyses to effectively define the interface physics across length scales; advancing experimental capabilities for verification and validation of multiscale physics; and modeling and strategies for the synthesis of high loading rate tolerant materials so that all of the latter lead to the development of a comprehensive set of metrics that define high loading rate tolerant material systems.  The multiscale modeling capability will be applied across multiple disciplines to facilitate revolutionary advances in materials for coupled environments (electromagnetic, high rate, high pressure and other extreme environments)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "8.511"
                                            },
                                            "Text": {
                                                "val": "Will continue to advance the state-of-the-art in multi-scale modeling for electronic materials by further validation of the capability to tailor electronic materials? properties; develop the validation and verification techniques for models that cross or tie-together critical scales in time and space for tailored electronic materials and optimized band structure; develop additional algorithms\/theories to advance the state-of-the-art of electronic materials with regards to interactions carriers and impurities; and further advance the state of the art in interface physics with regards to strain, polarization, piezoelectric, electromagnetic phenomena and solid\/liquid boundaries to map and to predict electronic materials' behavior within Army relevant devices.  Continue to develop and refine a proof-of-concept \"materials-by-design\" capability to predict key properties for materials in extreme dynamic environments based on the fundamental properties of the atomic and molecular components; assess the learning from the novel high rate experimentation results especially when combined with multiscale computational approaches and key visualization techniques; begin confirmation of the ability to predict and control microstructure; validate that we have defined the comprehensive set of material characteristics and properties at length scales that govern high rate deformation (ballistic effects), fracture and failure phenomena in metallic, polymeric, ceramic and composite material systems through both computational and experimental techniques using representative materials; and begin development of the fabrication technology for optimized polymeric, metallic, ceramic and composite systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.047"
                                            },
                                            "Text": {
                                                "val": "Create data-sharing protocols and interfaces for sharing fundamental materials research data related high-strain materials.  Complete integrated multiscale models for high rate deformation and failure in four material classes, specifically metals, ceramics, polymers and composites. Explore and characterize microstructure, high strain-rate behavior and failure mechanisms of the 1st iteration of the designed (controlled) materials. Investigate grain boundary modification as related to icosahedral borides and their dynamic properties, and pioneer nanomechanical testing for microfibrils of polymer fibers that have been extracted from macrofibers. Explore uncertainty quantification techniques created for specific materials, and examine their applicability across different materials classes and applications. Integrate the ab initio calculations, atomistic and coarse?grained molecular dynamics (MD) simulations, and continuum level modeling into multiscale modeling framework that facilitates the design of novel: a) Si-based nanostructured anodes and b) three-dimensional (3D) interdigitated anode\/cathode nanostructure for batteries. Develop a framework and related codes to carry out simulations of materials and nanostructures from first principles and the description of electronic excitations. Develop computationally efficient models to study non?ideal behavior of materials, specifically, the study of point and extended defects, interfaces and nano\/microstructures in electronic and optoelectronic materials. Develop multiscale modeling tools that accurately capture the coupling of redox reactions, the charge transport mechanisms, and the mesoscale morphological features in membrane structure."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.754"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.754"
                                            },
                                            "Text": {
                                                "val": "Will implement data-sharing protocols and processes for sharing fundamental materials research data within the program. Will complete integrated multiscale models for high rate deformation and failure in all three material classes: metals, ceramics and composites. Will investigate solid solution strengthening of magnesium and the effects on spall strength, and the design of interface behavior and increased matrix strain in glass epoxy composites.  Will implement uncertainty quantification techniques across the three materials classes and applications; design and implement algorithms and tools for coupled multiscale modeling capable of enhancing\/optimizing the design of individual components and systems across the three electronic materials research areas; develop methodologies for Uncertainty Quantification-driven bridging\/mapping between models and simulation techniques and assessment of reliability of simulation-predicted outcomes for polymer membranes and electrode\/electrolytes interfaces; and extend the Nonequilibrium Green's function code (inclusion of carrier-carrier scattering and parallel implementation) to evaluate key quantities not accessible to other simulation approaches, e.g. phonon-assisted Auger-induced leakage, trap- and phonon-assisted tunneling for electro-optical materials."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels decreased due to reduced emphasis on one of the four material systems being studied, namely polymers."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "VS3"
                    },
                    "ProjectTitle": {
                        "val": "Center For Quantum Science Research"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "5.001"
                        },
                        "CurrentYear": {
                            "val": "5.221"
                        },
                        "BudgetYearOne": {
                            "val": "6.238"
                        },
                        "BudgetYearOneBase": {
                            "val": "6.238"
                        },
                        "BudgetYearTwo": {
                            "val": "6.381"
                        },
                        "BudgetYearThree": {
                            "val": "6.509"
                        },
                        "BudgetYearFour": {
                            "val": "6.641"
                        },
                        "BudgetYearFive": {
                            "val": "6.774"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "42.765"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project supports an extramural research consortium, which will bring together a critical mass of preeminent university and industry researchers to explore and develop critical emerging concepts in Quantum Information Science (QIS). The focus will be on establishing a first of its kind, multi-site distributed quantum network based on quantum memories.  The Center for Distributed Quantum Information will study and demonstrate both the physical backbone and network layer for a robust quantum information network that will provide secure and tamper-proof communications and exponentially greater information processing capabilities for the future Army.  The Center for Distributed Quantum Information will perform collaborative research with Army in-house scientists and engineers to help accelerate the transition of the research.  In addition to providing the required expertise and critical mass to the effort, the  consortium will also bring together a broad but unified multi-disciplinary research team needed to accelerate progress in the field of quantum information sciences. \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology focus areas, and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Center for Distributed Quantum Information"
                                    },
                                    "Description": {
                                        "val": "This work supports critical quantum science basic research at the United States (U.S.) ARL exploiting quantum effects to greatly enhance computing, communications, imaging, sensing, and security, ensuring Army dominance on the future battlefield."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.001"
                                            },
                                            "Text": {
                                                "val": "Will research and refine quantum network protocols and algorithms, as well as experimentally and theoretically investigate entanglement between two quantum nodes, entanglement verification protocols, teleportation of quantum state between two nodes, and frequency conversion to connect hybrid platforms."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.221"
                                            },
                                            "Text": {
                                                "val": "Entangle two physically separate nodes, improve interfacing between nodes, and apply initial networking protocols. Complete construction of third physical node within a quantum network."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.238"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.238"
                                            },
                                            "Text": {
                                                "val": "Will simultaneously entangle three or more physically separate quantum nodes and investigate quantum networking algorithms and protocols. Quantum-state transfer, node-to-node entanglement, error protection protocols, and frequency conversion will continue to be refined and improved."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Funding levels increased to enable pursuit of knowledge to support Networks\/C3I for improved communications and sensing."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}