{
    "id": "2019-Navy-PB-1319-JBOOK-d4028cfc347373f894e741f0ef44baac41c8b52c4128dfd2dc1f305018c1279e-15",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA6-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605866N"
        },
        "ProgramElementTitle": {
            "val": "Navy Space & Electr Warfare Supt"
        },
        "R1LineNumber": {
            "val": "198"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "9.658"
            },
            "CurrentYear": {
                "val": "17.341"
            },
            "BudgetYearOne": {
                "val": "16.227"
            },
            "BudgetYearOneBase": {
                "val": "16.227"
            },
            "BudgetYearTwo": {
                "val": "22.450"
            },
            "BudgetYearThree": {
                "val": "19.177"
            },
            "BudgetYearFour": {
                "val": "19.194"
            },
            "BudgetYearFive": {
                "val": "19.624"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "Project 0706, Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program: Develops advanced technology to identify and eliminate Electromagnetic Interference (EMI) sources from Navy systems.  Supports research and development technology efforts, develops top-level plans, and supports systems in the Space and Electronic Warfare (SEW) mission area."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "9.658"
                },
                "CurrentYear": {
                    "val": "17.341"
                },
                "BudgetYearOne": {
                    "val": "18.686"
                },
                "BudgetYearOneBase": {
                    "val": "18.686"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "9.658"
                },
                "CurrentYear": {
                    "val": "17.341"
                },
                "BudgetYearOne": {
                    "val": "16.227"
                },
                "BudgetYearOneBase": {
                    "val": "16.227"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.000"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.459"
                },
                "BudgetYearOneBase": {
                    "val": "-2.459"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-2.043"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-2.043"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.416"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.416"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request was reduced by $2.043 million to account for the availability of prior year execution balances and $0.416 million for rate and miscellaneous adjustments."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0706"
                    },
                    "ProjectTitle": {
                        "val": "EMC & RF Mgmt"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "9.658"
                        },
                        "CurrentYear": {
                            "val": "17.341"
                        },
                        "BudgetYearOne": {
                            "val": "16.227"
                        },
                        "BudgetYearOneBase": {
                            "val": "16.227"
                        },
                        "BudgetYearTwo": {
                            "val": "22.450"
                        },
                        "BudgetYearThree": {
                            "val": "19.177"
                        },
                        "BudgetYearFour": {
                            "val": "19.194"
                        },
                        "BudgetYearFive": {
                            "val": "19.624"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "Electromagnetic Compatibility (EMC) and Radio Frequency (RF) Management Program. This project develops tools, processes, and algorithms to identify and mitigate EMI sources for Navy systems and platforms. \n\n(a) It will support the Afloat Electromagnetic Spectrum Operations Program (AESOP), an automated spectrum Fleet operational capability. The application will be enhanced to comply with fleet operational requirements and streamline Strike Force frequency management processes. It will provide automated Spectrum Management (SM) tools for development of operational task communication and radar\/weapon plans to support fleet deployments, exercises, and contingency operations. It will provide identification and mitigation of EMI in Navy, North Atlantic Treaty Organization (NATO), Allied, Ashore and Joint Combat Operations.  It will provide analysis related to spectrum reallocation proposals to assess impacts on Navy operations and systems.\n\n(b) It will support the Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP) to identify, engineer, and evaluate effectiveness of potential EMI corrections. The program also characterizes and quantifies the operational impact of EMI problems on system's mission performance.\n\n(c) It will support the Nuclear Electromagnetic Pulse (EMP) Survivability Program. The program assesses the EMP survivability of all mission critical systems and funds development of a hardness assurance and maintenance program. It will develop improved modeling capability to reduce hardness validation costs at delivery and over the lifetime of the system\/platform. The program develops new and updated design criteria, test methodology, test limits, and survivability validation procedures for all Navy systems, ships, submarines and shore facilities.\n\n(d) It will support the Real-Time Spectrum Operations Program.  The program investigates Electromagnetic (EM) Environmental effects between shipboard transmitters\/receivers and develops EM and spectrum techniques with Commercial off the shelf (COTS)  technologies to provide the ability to monitor EM spectrum usage and system EM degradation on all ships in a given strike group.  The program will investigate technologies to build an EM Spectrum Common Operational Picture (COP) to detect and assess operational capabilities in real-time.  Additional investigations will be performed to develop processes and procedures to predict the EM environment for planning purposes.  In the out-years, these capabilities will be used to build the next generation combat system with inherent spectrum agility and self-awareness capability, further enhancing the Navy's ability to perform Command and Control (C2) of the EM Spectrum warfighting domain."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Afloat Electromagnetic Spectrum Operations Program (AESOP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.420"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Identify new\/modified military equipment and review their spectrum usage to provide capability to ships.\n- Develop software and database modifications to support new Navy shipboard systems; i.e. DBR, AMDR, EASR, etc\n- Develop software and database modifications to enhance spectrum planning based on fleet requirements, including in the areas of TACAN and below decks wireless.\n- Update the common system database elements with equipment parameters, platform data, policy\/littoral restrictions information.\n- Develop software modifications as needed to ensure interoperability and common analysis tools\/techniques (e.g., propagation models).\n- Evaluate International, National, DoD and Navy spectrum processes that could impact Naval operations.\n- Assess potential changes and develop tests to evaluate potential updates to the fleet operational application."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.394"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Research International, National, DoD and Navy spectrum processes that could impact Naval operations.\n- Identify new\/modified military equipment and review their spectrum usage to provide capability to ships.\n- Perform analysis of these new\/modified systems against existing Fleet equipment spectrum use, and develop potential scenarios for further testing and evaluation.\n- Evaluate, test, and integrate into the software updates to toolkits and application programming interfaces (APIs), such as ArcGIS, SQL Server, and propagation models such as the Advanced Propagation Model (APM)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.300"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Identify new\/modified military equipment and update AESOP models and database to de-conflict and coordinate spectrum use.\n- Research and update spectrum usage in Numbered Fleet Standing Communications Plans to accommodate new communications systems and host nation infrastructure spectrum usage.\n- Based on feedback from Zumwalt class and Gerald R Ford class, develop and refine spectrum coordination software for their new, high-power radars and operational concepts.\n- Develop and refine software and database modifications to support new Navy shipboard and airborne spectrum-dependent-systems (SDSs), i.e., AMDR and EASR slated for 2020-2021 fielding aboard USN ships.\n-Research, assess, and implement in software the international, national, DoD, and Navy spectrum littoral restrictions, laws, treaties, and policies to ensure compliance."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $0.094 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Shipboard Electromagnetic Compatibility Improvement Program (SEMCIP)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.270"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- As new problems are identified, perform EMI Problem Characterization and Quantification to identify level of problem severity.\n- EMI problems with a high severity level can debilitate the combat capability of strike force capability and operational readiness will be added to the priority list for evaluating potential EMI solutions.\n- In FY2017 the program will continue evaluation of the Navy's Next Generation: Radars (i.e., Multi-Band and Dual Band Radars), Electronic Warfare Systems (i.e., Ships Signal Exploitation Equipment Increment F), Satellite Communication (i.e., the Navy Multi-Band Terminal and the Commercial Broadband Satellite Program), and Common Data Link (CDL) Programs.\n- An additional focus area is the evaluation of Commercial Off the Shelf (COTS) systems\/radars and the integration of Unmanned Aircraft Systems (UAS).\n- Develop and evaluate the effectiveness of proposed EMI solutions and coordinate with system program managers for proper integration of the final EMI solution."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.655"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- As new problems are identified, perform EMI Problem Characterization and Quantification to identify level of problem severity.  EMI problems with a high severity level can debilitate the combat capability of strike force capability and operational readiness will be added to the priority list for evaluating potential EMI solutions.\n- The program will evaluate the Navy's Next Generation: Radars (i.e., Multi-Band and Dual Band Radars), Electronic Warfare Systems (i.e., Ships Signal Exploitation Equipment Increment F), Satellite Communication (i.e., the Navy Multi-Band Terminal and the Commercial Broadband Satellite Program), and Common Data Link (CDL) Programs.\n- The program will focus on the evaluation of Commercial Off the Shelf (COTS) systems\/radars and the integration of Unmanned Aircraft Systems (UAS).\n- The program will develop and evaluate the effectiveness of proposed EMI solutions and coordinate with system program managers for proper integration of the final EMI solution."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.677"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.677"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Instrumentation will be developed to extract digital data and raw video from several different search radars enabling quantitate (instead of qualitative) assessment of performance degradation and electromagnetic interference.\n- Instrumentation will be developed to perform non-invasive (i.e. off satellite) bit error rate test methods for SATCOM system.  This enables EMI quantification at the modem later, rather than spectral layer, to quantify impacts in terms of data rate and satellite resources.   \n- Develop and evaluate the effectiveness of proposed EMI solutions and coordinate with system program managers for proper integration of the final EMI solution.\n- EMI Problem Characterization and Quantification will be performed on approximately 60 specific EMI problems to identify level of problem severity and prioritize EMI mitigation efforts.\n- The program will evaluate the Navy's Next Generation: Radars (i.e., Enterprise Air Search Radar, Air & Missile Defense radar, Dual Band Radar, Next Gen Surface Search Radar, etc.), Electronic Warfare Systems (i.e., Surface Electronic Warfare Improvement Program and Ships Signal Exploitation Equipment Mods), Satellite Communication (i.e., the Navy Multi-Band Terminal and the Commercial Broadband Satellite Program), and Common Data Link Programs."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was increased by $0.022 million to fund development of instrumentation in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Electromagnetic Pulse (EMP) Survivability"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.004"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Investigate Modeling and Simulation (M&S) Verification, Validation, & Accreditation (VV&A) efforts in support of obtaining a higher confidence, low cost High Altitude Electromagnetic Pulse (HEMP) survivability assessment in lieu of full ship threat level testing.\n- Conduct HEMP survivability assessment using existing methods onboard an existing ship and compare measurements to multiple, independent M&S investigations leveraging different methodologies.\n- Continue support for the Naval NSWCDD Naval Ordinance Transient Electromagnetic Simulator (NOTES) EMP Facility (ashore test bed).\n- Develop Data Acquisition conceptual capability for HEMP testing at NOTES facility and on afloat platforms\n- Investigate HEMP afloat testing technology concepts in order to support full ship HEMP testing requirements in MIL-STD 4023"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.834"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Perform Modeling and Simulation (M&S) Verification, Validation, & Accreditation (VV&A) efforts \n- Support Development of obtaining a higher confidence, low cost High Altitude Electromagnetic Pulse (HEMP) survivability assessment in lieu of full ship threat level testing.\n- Conduct HEMP survivability assessments using existing methods onboard an existing ship and compare measurements to multiple, independent M&S investigations leveraging different methodologies \n-Complete Data Acquisition capability design\n- Initiate conceptual at-sea HEMP demonstration plan"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.880"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop computational electromagnetic (CEM) modeling capability to assist in ship hardness design.\n- Develop small-scale test capability to assist in understanding phenomena associated with complex shipboard electrical design and energy coupling\/cross-coupling to the cables in order to support EMP critical item design, testing, maintenance, and repair required to incorporate EMP survivability into the fleet.\n- Complete Modeling and Simulation (M&S) Verification, Validation, & Accreditation (VV&A)efforts\n- Continue investigation of obtaining high confidence, low cost HEMP testing technology \n- Continue support for Naval Ordinance Transient Electromagnetic Simulator (NOTES) \n- Refine at-sea HEMP demonstration plan \n- Initiate Data Acquisition capability \n- Develop and\/or improve design criteria, test methodology, test limits, and survivability validation procedures for Navy systems, ships, submarines and shore facilities.  Continue research and development of integrated solutions\nthat can be used for EMP hardening improvement and benefiting EMI reduction such as cable shield ground adapters (CSGAs) and terminal protection devices (TPDs).  \n- Enhance CSGA RDTE and Navy Pulse Current Injection (PCI) testing to meet requirements in Appendix C of MIL-STD-4023, Shipyard Protective Elements Testing.  Update appropriate MIL-STD procedures to reflect appropriate test\nmethodologies and validation procedures."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was increased by $0.046 million to account for development of CEM and small-scale test capability."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Real-Time Spectrum Operations (RTSO)"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6.964"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Integrate the RTSO S2F Own Force Monitoring Software demonstrated on USS VELLA GULF (CG 72) with the 59 Fleet Forces Command Purchased Own Force Monitoring Kits.  The kits are provided to deploying units.\n- Deliver the RTSO Software 1.0 (S2F Own Force Monitoring Software) to every ship in the Navy.  The OFM software when used with the Own Force Monitoring Kits will provide the user interface to quickly identify EMCON compliance and authorized frequency plan compliance in real-time.\n- Investigate running the RTSO Software on the CANES shipboard server for future applications in providing spectrum awareness and status to multiple users.\n- Demonstrate the capability for real-time Electromagnetic Inference \/ Jamming detection awareness in a lab or test range environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.458"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Develop and integrate ship's positional updates to enable real-time calculations of electromagnetic interference\/feed into a RTSO fleet\/user interface that provides recommended actions to resolve the interference.\n- Investigate and integrate Meteorological and Oceanographic (METOC), refractivity, climatology data and update propagation models to include in the real-time calculations.\n- Finalize Consolidated Afloat Networks and Enterprise Services (CANES) network interface specification and integrate RTSO Software into the CANES network.  This will provide spectrum awareness to multiple users.\n- Develop and publish a RTSO Spectrum Common Operating Picture (COP) to enable Electromagnetic Maneuver Warfare (EMW) capabilities and provide spectrum situational awareness of the strike group within the AOR. \n- Develop and integrate multiple user defined displays and Graphical User Interfaces (GUIs) so the operator can tailor their views based on the operational needs.  \n- Develop and integrate Satellite Communications (SATCOM) tools (i.e., jamming, interference, and coverage) into a RTSO GUI for mission critical SATCOM systems.\n- Develop RTSO Software interface requirements for specific systems such as radar, electronic warfare, and communication systems.\n- Investigate and develop RTSO Software interface requirements for Combat Systems baselines [i.e., AEGIS and Ship Self-Defense System (SSDS)].\n- Define RTSO Doctrine, Organization, Training, Materiel, Leadership and Education, Personnel, Facilities and Policy (DOTMLPF-P) requirements that effect Manpower, Personnel, Training and Education (MPT&E) requirements and solutions.\n-Perform initial DOTMLPF-P analysis to assess RTSO training requirements.  Perform review\/update\/development of Navy Tactical Tasks (NTAs) measures, standards, and criteria to support RTSO operation and maintenance. Perform review\/update of Defense Readiness Reporting System-Navy (DRRS-N) to evaluate RTSO Personnel, Equipment, Supply, Training, Ordnance and Facilities (PESTOF) resource measures.\n-Develop a plan for RTSO training and certification requirements analysis for course development and implementation within the RTSO NTSP and Theater\/Fleet Training Plans.  Develop\/update Job Duty Task Analysis (JDTA) requirements to support RTSO equipment basic operation\/maintenance; and tactical operation to support Task Unit and Strike Group personnel.\n-Identify the Knowledge, Skills, and Abilities (KSAs) necessary for leaders, warfighters, civilians, and contractor personnel to understand and effectively utilize RTSO.  Develop\/update Personnel Qualification Standard (PQS) to support RTSO JDTA requirements."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "13.370"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "13.370"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Based on evolving fleet requirements and feedback on prior versions of RTSO software, research, develop, enhance, and refine: \n(a.) recommended actions to resolve interferences;\n(b.) refractivity, climatology, and propagation model accuracy; \n(c.) spectrum common operational picture, tailored to multiple users' perspectives;\n(d.) navigation, location, and position data interfaces; and\n(e.) additional satellite communications connectivity, coverage, performance, and interference measurement\/model capabilities \n- Conduct research, development, testing, and evaluation for own-force spectrum monitoring capabilities, including commercial and military sensors, antenna, and network connections.\n- Research and develop proof-of-concept capabilities for spectrum mission planning decision aids and intelligent sectoring\/cut-outs for radiating systems\n- Initiate research and development efforts for models to estimate effective RF performance ranges of spectrum dependent systems in the complex electromagnetic environment (one-on-one and multi-on-one effects)"
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 funding request was reduced by $1.949 million to account for the availability of prior year execution balances."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "An acquisition strategy is not required."
                        },
                        "PerformanceMetrics": {
                            "val": "Performance metrics will consist of quarterly program reviews."
                        }
                    }
                }
            ]
        }
    }
}