{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-17",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603606A"
        },
        "ProgramElementTitle": {
            "val": "Landmine Warfare and Barrier Advanced Technology"
        },
        "R1LineNumber": {
            "val": "47"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "16.798"
            },
            "CurrentYear": {
                "val": "17.948"
            },
            "BudgetYearOne": {
                "val": "11.104"
            },
            "BudgetYearOneBase": {
                "val": "11.104"
            },
            "BudgetYearTwo": {
                "val": "11.238"
            },
            "BudgetYearThree": {
                "val": "11.873"
            },
            "BudgetYearFour": {
                "val": "12.018"
            },
            "BudgetYearFive": {
                "val": "7.922"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "88.901"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and demonstrates sensors, subsystems, and neutralization technologies that can be used by dismounted forces as well as ground and air platforms to detect, identify and mitigate the effects of landmines, improvised explosive devices, minefields, and other explosive hazards. This PE also conducts modeling and simulation activities to assess the effectiveness of detection and neutralization concepts. Project 608 supports the maturation and demonstration of enabling component and subsystems for counter explosive hazards and countermine technologies in the areas of countermine and barrier development and Project 683 funds efforts on area denial sensors.\n\nWork in this PE is fully coordinated with PE 0602120A (Sensors and Electronic Survivability), PE 0602622A (Chemical, Smoke and Equipment Defeating Technology), PE 0602624A (Weapons and Munitions Technology), PE 0602712A (Countermine Systems), PE 0602784A (Military Engineering Technology), PE 0603004 (Weapons and Munitions Advances Technologies), PE 0603270 (Electronic Warfare Technology), and PE 0603710A (Night Vision Advanced Technology).  \n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nWork in this PE is performed by the United States (U.S.) Army Research, Development, and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "17.451"
                },
                "CurrentYear": {
                    "val": "17.948"
                },
                "BudgetYearOne": {
                    "val": "13.097"
                },
                "BudgetYearOneBase": {
                    "val": "13.097"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "16.798"
                },
                "CurrentYear": {
                    "val": "17.948"
                },
                "BudgetYearOne": {
                    "val": "11.104"
                },
                "BudgetYearOneBase": {
                    "val": "11.104"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.653"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-1.993"
                },
                "BudgetYearOneBase": {
                    "val": "-1.993"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.645"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.993"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.993"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.008"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY19 funding reduction occurred in order to support funding shifts to other higher priority efforts that impact C3I\/Network senior leader priorities."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "608"
                    },
                    "ProjectTitle": {
                        "val": "Countermine & Bar Dev"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.888"
                        },
                        "CurrentYear": {
                            "val": "15.957"
                        },
                        "BudgetYearOne": {
                            "val": "11.104"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.104"
                        },
                        "BudgetYearTwo": {
                            "val": "11.238"
                        },
                        "BudgetYearThree": {
                            "val": "11.873"
                        },
                        "BudgetYearFour": {
                            "val": "12.018"
                        },
                        "BudgetYearFive": {
                            "val": "7.922"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "85.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates technologies for finding and neutralizing explosive hazards in varying vegetation, soil, and weather conditions both day and night. Activities include maturation and demonstration of modular, semi-autonomous, and autonomous air, ground, and Soldier borne technologies to enable standoff and close-in detection and neutralization of explosive threats. Efforts are supported by modeling and simulation assessments to define potential system effectiveness.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Ground Vehicle Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort improves detection, marking, and defeat of low metal\/low contrast explosive threats buried in the road and along the sides of roads, Improvised Explosive Devices (IEDs), and antitank landmines. This effort also matures technologies to increase standoff detection and defeat distances, both in roads and off routes, enabling faster rates of advance and safer operations for early entry and route clearance missions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.888"
                                            },
                                            "Text": {
                                                "val": "Will integrate optimized forward looking EO\/IR sensor suite with multi-step target detection algorithms and automated decision making tools to provide a robust vehicle mounted technology demonstrator; finalize forward looking EO\/IR to down looking GPR sensor cueing architectures and software to fuse target nominations from the standoff and localization sensors into a GUI; integrate LIDAR sensor to image and identify side attack targets and threats onto vehicle testbed; and optimize target detection algorithms to detect road side explosive hazards."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.957"
                                            },
                                            "Text": {
                                                "val": "Demonstrate and evaluate an integrated forward looking electro-optical (EO)\/infrared (IR) sensor suite with multi-step target detection algorithms and automated decision making tools in relevant outdoor environments; demonstrate real-time on-the-move forward looking EO\/IR to down looking Ground Penetrating Radar (GPR) sensor cueing with integrated graphical user interface; demonstrate and evaluate Light Detection and Ranging (LIDAR) sensor capability to identify side attack targets using vehicle test bed; validate optimized target detection algorithms to detect in-road and road side explosive hazards."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Autonomous Explosive Hazard Detection"
                                    },
                                    "Description": {
                                        "val": "This effort demonstrates an integrated modular sensor and sensor data processing capability to enable remote and semi-autonomous detection of mines, other explosive hazards, and indicators of emplacement, such as command wires and initiation devices from a safe standoff distance using small unmanned ground and air platforms. This effort also matures and demonstrates explosive hazard (EH) detection technologies that can be adapted to address near-peer threats in multiple environments."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.104"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.104"
                                            },
                                            "Text": {
                                                "val": "Will mature sensors to detect wire components from standoff distances and sensor configurations for implementation on unmanned platforms; exploit novel sensor phenomenologies for optimization of explosive threat detection approaches; improve threat detection algorithms and signal processing techniques for the detection of buried explosive hazards using data collected in near-peer environments; mature low contrast target marking schemas and approaches; improve performance of close-in explosive threat confirmation sensors."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment to support explosive threat detection efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "683"
                    },
                    "ProjectTitle": {
                        "val": "Area Denial Sensors"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "1.91"
                        },
                        "CurrentYear": {
                            "val": "1.991"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "3.901"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and demonstrates surveillance and command and control technology components for anti-access area denial systems that inform maneuver elements and minimize the risk to non-combatants from exposure to anti-personnel landmines (APLs) and related maneuver barriers. The technology includes distributed personnel surveillance systems and command and control systems to be used with human-in-the-loop threat confirmation. This Project uses modeling and simulation to evaluate new concepts and doctrine. This Project also matures and optimizes components and system architectures, and it validates components in field settings.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Area Denial Sensors"
                                    },
                                    "Description": {
                                        "val": "This effort matures and demonstrates networked sensor and sensor fusion technology efforts to provide detection, identification, and classification in support of remotely delivered sensor systems and area denial munitions. Key technologies to be matured and demonstrated include deployable multi-mode sensors, fused sensor information, and local area network communications to meet requirements for human-in-the-loop command and control."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.91"
                                            },
                                            "Text": {
                                                "val": "Will mature and demonstrate a hand emplaced sensor system that captures relevant threat signatures to increase probability of detection and decrease false alarms; will optimize sensor fusion technologies to provide operator management of multiple remotely employed sensor nodes to provide situational awareness and area denial effects."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.991"
                                            },
                                            "Text": {
                                                "val": "Demonstrate scatterable deployed sensor fields, develop image and data processing techniques to improve data management to decision cycle time; demonstrate sensor target data connection to fire control, optimize sensor performance and coordinate interfaces with Fires elements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort ends in FY18."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}