{
    "id": "2019-Army-PB-2040-JBOOK-847dfe4e73309859a889cb5f70d0d254b239ca12b728711e935d5f7e74ee328c-6",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA3-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603007A"
        },
        "ProgramElementTitle": {
            "val": "Manpower, Personnel and Training Advanced Technology"
        },
        "R1LineNumber": {
            "val": "36"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "12.11"
            },
            "CurrentYear": {
                "val": "6.466"
            },
            "BudgetYearOne": {
                "val": "8.044"
            },
            "BudgetYearOneBase": {
                "val": "8.044"
            },
            "BudgetYearTwo": {
                "val": "12.632"
            },
            "BudgetYearThree": {
                "val": "12.798"
            },
            "BudgetYearFour": {
                "val": "16.834"
            },
            "BudgetYearFive": {
                "val": "17.254"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "86.138"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) matures and validates applied behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This PE evaluates new selection measures, assignment methods, and performance metrics for individuals and units, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Work in this PE will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nEfforts in this PE support the Army Science and Technology Soldier portfolio.\n\nWork in this PE complements and is fully coordinated with PE 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Human Capital Strategy.\n\nWork in this PE is performed by the U.S. Army Research Institute (ARI) for the Behavioral and Social Sciences in Ft. Belvoir, VA."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "14.417"
                },
                "CurrentYear": {
                    "val": "6.466"
                },
                "BudgetYearOne": {
                    "val": "8.088"
                },
                "BudgetYearOneBase": {
                    "val": "8.088"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "12.11"
                },
                "CurrentYear": {
                    "val": "6.466"
                },
                "BudgetYearOne": {
                    "val": "8.044"
                },
                "BudgetYearOneBase": {
                    "val": "8.044"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-2.307"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.044"
                },
                "BudgetYearOneBase": {
                    "val": "-0.044"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.4"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-1.902"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.044"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.044"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.005"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Fiscal Year (FY) 2018 funding reduction reflects realignment of Army Research Institute manpower to a Management Headquarters PE; Realignment does not alter Research, Development, Test, and Evaluation (RDTE) Management Decision Packets (MDEPs)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "792"
                    },
                    "ProjectTitle": {
                        "val": "Personnel Performance & Training"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "12.11"
                        },
                        "CurrentYear": {
                            "val": "6.466"
                        },
                        "BudgetYearOne": {
                            "val": "8.044"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.044"
                        },
                        "BudgetYearTwo": {
                            "val": "12.632"
                        },
                        "BudgetYearThree": {
                            "val": "12.798"
                        },
                        "BudgetYearFour": {
                            "val": "16.834"
                        },
                        "BudgetYearFive": {
                            "val": "17.254"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "86.138"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project matures and validates applied behavioral and social science technologies that enhance the Soldier Lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., unit cohesion). These technologies provide advanced personnel measures that more fully assess potential and predict performance, behavior, attitudes, and resilience. These technologies also provide innovative and effective Talent Management methods to optimize individual and team performance to ensure the Army can meet mission requirements in uncertain and complex environments. This Project evaluates new selection measures, assignment methods, and performance metrics for individuals and units, assesses innovative training methods, and conducts scientific assessments to inform Human Capital policy and programs. Work in this Project will result in effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints.\n\nEfforts in this Project support the Army Science and Technology Soldier portfolio.\n\nWork in this Project complements and is fully coordinated with Program Element (PE) 0602785A (Manpower\/Personnel\/Training Technology).\n\nThe cited work is consistent with the Science and Technology priorities of the Army Chief of Staff, the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas, and the Army Human Capital Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Talent Management"
                                    },
                                    "Description": {
                                        "val": "Previously titled ?Personnel Assessment,? this effort refines and assesses innovative talent management approaches to provide the Army the flexibility to adapt to changes in force structure and recruiting environments. This effort validates Soldier selection measures, techniques, and tools to more fully assess Soldier potential and better predict behavior, attrition, and performance. This effort also matures and validates methods to develop and model Soldier talents\/competencies longitudinally across a career."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.008"
                                            },
                                            "Text": {
                                                "val": "Will validate expanded enlisted screens and non-cognitive assessments as predictors for success in military occupational specialties (MOS) and in-service assignments (e.g., Recruiters, Instructors). This research is ongoing validation of non-cognitive assessments for valued Army outcomes (e.g., attrition, performance) across a Soldier?s first term of enlistment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.395"
                                            },
                                            "Text": {
                                                "val": "Validate competency model (i.e., a collection of competencies that together define successful performance in a particular work setting) of critical military occupations (e.g., cyber operations for more flexible personnel management of enlisted Soldiers)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.659"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.659"
                                            },
                                            "Text": {
                                                "val": "Will demonstrate differential prediction of cognitive and non-cognitive abilities among Military Occupational Specialty clusters for incorporation into the assignment process to support forecasting of future talent management and human performance needs in near-peer operational environments; provide research to assess the validity of integrated personnel assessments augmented with archival human capital data; provide research to empirically validate instructional approaches to prepare instructors\/trainers to train complex skills required for emerging high-tempo operational environments that necessitate decisive and timely decision making (e.g., dense urban and distributed units)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increased funding will accelerate talent management assessments efforts."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Unit Performance and Cohesion"
                                    },
                                    "Description": {
                                        "val": "Previously titled ?Personnel Readiness, Performance, and Conduct,? this effort will mature and refine measures and methods to ensure cohesive, high performing teams for future operational environments. This effort will mature and assess methods to optimize team composition to enhance unit performance, methods to rapidly build and sustain team cohesion, and metrics and assessments of unit performance, command climate, unit resilience, and cohesion."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.102"
                                            },
                                            "Text": {
                                                "val": "Mature research to develop training and leader development methods to develop unit climate of dignity, respect, and inclusion and unit resilience (e.g., prepare Leaders to assess, enhance, and sustain individual and unit resilience); Mature research to develop measures and strategies to optimize small unit performance and individual training performance (e.g., how best to obtain optimal performance while using highly automated training systems)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.071"
                                            },
                                            "Text": {
                                                "val": "Validate integrated holistic assessment that leverages existing personnel data (i.e., integrated measures collected across the Soldier Lifecycle that feeds holistic assessments and predictive models of behaviors, performance, and outcomes); demonstrate the effectiveness of strategies to optimize individual training performance (e.g., deliver prototype training tool to enhance PATRIOT air defense launch control crewmembers? fire control decision-making)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.385"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.385"
                                            },
                                            "Text": {
                                                "val": "Will refine measures of collective performance in combat training exercises."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease in funding to support the acceleration of Talent Management assessment efforts."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}