{
    "id": "2019-AirForce-PB-3600-JBOOK-ff3ce798fd66c1fdf15074778cc17eeee0864d783490f920850ed1e15fcb218d-11",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-AIRFORCE_V1-U_RDTE_JustificationBook_Air_Force_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Air_Force_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Air Force",
        "appropriation_code": "3600",
        "appropriation_name": "Research, Development, Test & Evaluation, Air Force"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602605F"
        },
        "ProgramElementTitle": {
            "val": "Directed Energy Technology"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Air Force"
        },
        "AppropriationCode": {
            "val": "3600"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Air Force"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "127.365"
            },
            "CurrentYear": {
                "val": "132.993"
            },
            "BudgetYearOne": {
                "val": "141.898"
            },
            "BudgetYearOneBase": {
                "val": "141.898"
            },
            "BudgetYearOneOCO": {
                "val": "0.000"
            },
            "BudgetYearTwo": {
                "val": "133.106"
            },
            "BudgetYearThree": {
                "val": "134.172"
            },
            "BudgetYearFour": {
                "val": "136.237"
            },
            "BudgetYearFive": {
                "val": "129.251"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program covers research in directed energy weapon technologies, primarily high energy lasers; including laser devices, optical beam control; integration; target lethality\/vulnerability assessments; ground-based optical space situational awareness; and  high power microwaves. Laser research includes moderate to high power laser devices that are applicable to a wide range of applications, optical technologies to propagate lasers beams through the atmosphere, and integration of these technologies into demonstration packages.  In space situational awareness, this research uses the Starfire Optical Range and the Maui Space Surveillance System to develop and implement technologies to identify visual characteristics such as status and health of orbiting space objects.  In high power microwaves, this research examines technologies for applications such as counter-electronics and non-lethal weapons. This program conducts research into other novel directed energy applications; conducts directed energy weapon vulnerability\/lethality assessments; develops protection technologies versus directed energy weapons; conducts research into other advanced non-conventional\/innovative weapons; develops and uses tools to compare solutions to determine the most effective and efficient directed energy technologies to meet Air Force needs; coordinates efforts through the Department of Defense Science and Technology Executive Committee process to harmonize efforts and eliminate duplication.\n\nThis program element may include necessary civilian pay expenses required to manage, execute, and deliver science & technology capabilities. The use of program funds in this PE would be in addition to the civilian pay expenses budgeted in program elements 0601102F, 0602102F, 0602201F, 0602202F, 0602203F, 0602204F, 0602601F, 0602602F, 0602788F, 1206601F, and 0602298F.\"\n\nThis program is in Budget Activity 2, Applied Research because it includes studies, investigations, and non-system specific technology efforts directed toward general military needs with a view toward developing and evaluating the feasibility and practicality of proposed solutions and determining their parameters"
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "127.163"
                },
                "CurrentYear": {
                    "val": "132.993"
                },
                "BudgetYearOne": {
                    "val": "128.039"
                },
                "BudgetYearOneBase": {
                    "val": "128.039"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "127.365"
                },
                "CurrentYear": {
                    "val": "132.993"
                },
                "BudgetYearOne": {
                    "val": "141.898"
                },
                "BudgetYearOneBase": {
                    "val": "141.898"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0.202"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "13.859"
                },
                "BudgetYearOneBase": {
                    "val": "13.859"
                },
                "BudgetYearOneOCO": {
                    "val": "0.000"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.762"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.560"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Other Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "13.859"
                                },
                                "BudgetYearOneBase": {
                                    "val": "13.859"
                                },
                                "BudgetYearOneOCO": {
                                    "val": "0.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Increase in FY 2017 reflect reprogramming to support Research and Development Projects, 10 U.S.C., Section 2358.\n\nIncrease in FY 2019 due to realignment of funds to focus on Directed Energy Game Changer efforts."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "624866"
                    },
                    "ProjectTitle": {
                        "val": "Lasers & Imaging Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "92.797"
                        },
                        "CurrentYear": {
                            "val": "99.946"
                        },
                        "BudgetYearOne": {
                            "val": "108.392"
                        },
                        "BudgetYearOneBase": {
                            "val": "108.392"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "96.403"
                        },
                        "BudgetYearThree": {
                            "val": "96.141"
                        },
                        "BudgetYearFour": {
                            "val": "96.241"
                        },
                        "BudgetYearFive": {
                            "val": "91.294"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the technical feasibility of moderate to high power lasers, including beam control, for applications such as aircraft protection, force protection, and precision engagement from Air Force platforms. This project investigates the effects of laser weapons on a wide range of systems and components as well as producing, modifying, validating and applying directed energy weapon and non-directed energy weapon concept development and assessment tools to determine which technology solutions to pursue. This project conducts research supporting ground-based optical space situational awareness."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Energy Laser Technologies and Directed Energy Assessments"
                                    },
                                    "Description": {
                                        "val": "Develop and demonstrate high energy laser device technologies for Air Force applications. Develop and demonstrate optical laser beam control technologies including atmospheric propagation and pointing and tracking. Perform laser system level modeling and simulation validated by laser effects and vulnerability testing. Develop tools and perform assessments which allow comparisons among directed energy weapon concepts and tradeoffs between directed energy weapon and non-directed energy weapon solutions. Integrate optical beam control technologies with laser device technologies and demonstrate the combined technologies. Develop and use technologies to better understand the vulnerability of weapon systems to high energy lasers."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "65.408"
                                            },
                                            "Text": {
                                                "val": "Continue with beam control and scaling of monolithic fiber amplifier scaling using advanced fibers. Continue with the development of beam control aero-effects mitigating techniques. Continue with the conduct of effects tests to establish system requirements and validity models. Continue integration of beam control and low power laser system for future pod-mounted moderate power laser demonstration. Transition IWEA Build 1 to external users and complete IWEA Build 2. Conduct assessments of  DE and\/or synergistic DE\/Kinetic Energy (KE) weapon capabilities to help users plan weapon investments. Continue to model and characterize foreign HEL threats and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "66.657"
                                            },
                                            "Text": {
                                                "val": "Develop beam control technologies including aero-effects mitigation techniques. Power scale monolithic fiber amplifiers using advanced fibers.  Conduct effects testing to establish system requirements and validate models.  Integrate beam control and low power laser subsystems for fiscal year (FY) 2021 pod-mounted moderate power airborne laser demonstration vs representative targets.  Transition the Integrated Weapons Environment for Analysis Build 2 to external users and transition Integrated Weapons Environment for Analysis into an advanced framework to support Air Force Research Laboratory-wide Modeling, Simulation & Analysis environment.  Assess directed energy weapon and\/or synergistic directed energy weapon\/kinetic energy weapon capabilities to help users plan weapon investments. Model and characterize foreign high energy laser threats, and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "79.824"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "79.824"
                                            },
                                            "Text": {
                                                "val": "Continue to develop beam control technologies including aero-effects mitigation techniques.  Continue to power scale monolithic fiber amplifiers using advanced fibers. Continue with effects testing to establish system requirements and validate models. Finish integration of beam control and low power laser subsystems for FY 2021 pod-mounted moderate power airborne laser demonstration vs representative targets.  Demonstrate Phase I low power laser system. Begin integration of moderate power system into a pod for Phase 2 aircraft self-protect demonstration including ground support and aircraft interface. Continue to support and enhance Integrated Weapons Environment for Analysis for internal and external users and utilize Integrated Weapons Environment for Analysis as the weapons server in an advanced framework to support Air Force-wide modeling, simulation, and analysis. Continue to assess directed energy weapon and\/or synergistic directed energy weapon\/kinetic energy weapon capabilities to help users plan weapon investments. Continue to model and characterize foreign high energy laser threats, and provide information to develop mitigation techniques to protect blue assets."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increase compared to FY 2018 by $13.167 million. Justification for this increase is to accelerate high energy laser technology development and transition."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Optical Space Situational Awareness and Satellite Vulnerability"
                                    },
                                    "Description": {
                                        "val": "Develop advanced, long-range, electro-optical technologies that enable ground-based optical SSA and quantum-based optical communications.  Develop and use technologies to understand the vulnerability of blue satellite systems and components to lasers. Operate the Starfire Optical Range to conduct research meeting internal and customer requirements."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "27.389"
                                            },
                                            "Text": {
                                                "val": "Complete integration of geosynchronous satellite characterization and local-space search for bright objects as components of a dynamic telescope demonstration to keep track of potential threat objects in space. Investigate daylight detection of geosynchronous satellites to address the long-duration gaps during daytime hours when satellites cannot normally be detected by our optical systems.  Explore techniques to detect smaller objects and characterize their relative orbits around our assets. Investigate through modeling and simulation the susceptibility of satellite optical systems to laser threats to support course of action decision-making for protection and design improvements for resilience."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "33.289"
                                            },
                                            "Text": {
                                                "val": "Complete the dynamic telescope subsystems that maintain custody of high-priority threat objects in deep space, re-identify from night-to-night near-geosynchronous satellites, and search or dim objects lurking in objects in vicinity around high-value blue satellites.  Report on the maturity of three sensor technologies for detection of geosynchronous satellites allowing custody through daytime hours when satellites cannot normally be detected by our ground-based optical systems.  Mature component technologies for 24\/7 real-time optical imaging of near-earth satellites enabling characterization on tactical timelines.  Provide recommendations to Air Force programs on potential transitions of maturing technologies for space situational awareness and satellite modeling.  Shift emphasis of laser-enabled space situational awareness research to full-dark imaging using laser illumination. Investigate through modeling and simulation the susceptibility of satellite optical systems to laser threats to inform practical designs for protection equipment and for tactically-rapid course-of-action decision-making enabling protection methods. Continue development of long-range secure optical communications technologies leveraging quantum science for free space laser-communication channels. Continue to maintain Starfire Optical Range facility and experimental equipment in a mission-ready state."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "28.568"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "28.568"
                                            },
                                            "Text": {
                                                "val": "Begin fielding the dynamic telescope subsystem that searches the geosynchronous satellite belt visible from the mid-Pacific multiple-times per night, enabling a periodic comprehensive census of dim objects in the geo-belt. Continue to mature daylight detection of geosynchronous satellites thus allowing custody through daytime hours when satellites cannot normally be detected by our ground-based optical systems. Continue to mature component technologies for 24\/7 real-time optical imaging of near-earth satellites enabling characterization on tactical timelines.  Continue investigation through modeling and simulation the susceptibility of satellite optical systems to laser threats  to inform practical designs for protection equipment and for tactically-rapid course-of-action decision-making enabling protection methods. Continue maturing laser-enabled space situational awareness research focused on full-dark imaging using laser illumination. Investigate laser-enabled options for both ranging to and imaging to enable range-profiling of geosynchronous satellites from apertures smaller than three meters. smaller apertures, allowing rapid orbit determination from a broader range of electro-optical assets. Continue development of long-range secure optical communications technologies leveraging quantum science for free space laser-communication channels. Continue to maintain Starfire Optical Range facility and experimental equipment in a mission-ready state."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 decreased compared to FY 2018 by $4.721 million. Justification for this is to accelerate high energy laser technology development and transition."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "624867"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Weapons & Survivability Technology"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "34.568"
                        },
                        "CurrentYear": {
                            "val": "33.047"
                        },
                        "BudgetYearOne": {
                            "val": "33.506"
                        },
                        "BudgetYearOneBase": {
                            "val": "33.506"
                        },
                        "BudgetYearOneOCO": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "36.703"
                        },
                        "BudgetYearThree": {
                            "val": "38.031"
                        },
                        "BudgetYearFour": {
                            "val": "39.996"
                        },
                        "BudgetYearFive": {
                            "val": "37.957"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearOneOCO": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project explores the use of high power microwave and other unconventional\/innovative weapon concepts to support applications such as nonlethal counter-personnel and electronic warfare including disruption, degradation, and damage of electronic infrastructure on Air Force platforms.  This research includes weapon technology that can provide covert effects and\/or no collateral or human damage.  The project also investigates the effects of potential adversary high power microwave weapons and how to mitigate those effects on US assets, as well as producing and applying directed energy weapon and non-directed energy weapon concept development and assessment tools to determine which technology solutions to pursue.  This project includes but is not limited to high power microwaves, plasmas, particle beams and millimeter waves."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Power Microwave and Unconventional Weapon Technologies"
                                    },
                                    "Description": {
                                        "val": "Investigate technologies for high power microwave and unconventional weapon technology components. Investigate high power microwave and other unconventional weapon concepts using innovative technologies. Investigate advanced technologies that support force protection tactical applications, including non-kinetic\/non-lethal counter-electronics applications."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.920"
                                            },
                                            "Text": {
                                                "val": "Refine ultra-short pulsed laser atmospheric propagation studies. Conduct effects studies on electronics based on the assessments from FY15 and FY16. Continue compact 50 kilovolt solid state switch research. Complete research on smaller, higher power, source technology for joint Air Force-Navy HPM technologies."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.956"
                                            },
                                            "Text": {
                                                "val": "Begin ultra-short pulsed laser atmospheric propagation studies in a density gradient. Conduct effects studies on electronics based on the assessments from fiscal year (FY) 2016 and FY 2017 to support a joint high power microwave program with the Navy.  Complete compact 50 kilovolt solid state switch for a militarily relevant platform.  Initiate design of smaller, higher power, source technology for the joint Air Force - Navy high power microwave demonstration."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.038"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.038"
                                            },
                                            "Text": {
                                                "val": "Complete ultra-short pulsed laser atmospheric propagation studies in a density gradient. Complete effects studies on electronics based on the assessments from FY 2016 and FY 2017 to support a joint high power microwave program with the Navy. Design and develop high power microwave components for ground and aerial high power microwave demonstrators. Design and develop smaller, higher power, source technology for the joint Air Force-Navy high power microwave demonstration."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 compared to FY 2018 increased by $0.082 million. Justification for this increase is described in plans above."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Power Microwave Effects and Mitigation Research"
                                    },
                                    "Description": {
                                        "val": "Assess the effects\/lethality of high power microwave technologies. Develop and apply sophisticated models to enhance the development of high power microwave and related technology. Develop tools and perform assessments which allow comparisons among directed energy concepts and tradeoffs between directed energy and non-directed energy solutions. Investigate technologies to counter the effects of high power microwave."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "29.648"
                                            },
                                            "Text": {
                                                "val": "Test and validate Phase 2 of DE High Performance Computing Software Applications Institute software, which allows modeling of DE sources and propagation that involves plasmas and laser DE weapons. Continue to assess potential improvements to US weapons systems from employing HPEM weapons technologies for platform protection and target prosecution. Continue further assessments of HPEM and KE weapon concepts in a common environment to help users plan weapons investments. Transition Modeling, Simulation & Analysis (MS&A) tools to the broader MS&A community. Continue to model and characterize current and projected HPEM threats to blue systems and provide assessments to developers for hardening materials and designs."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "25.091"
                                            },
                                            "Text": {
                                                "val": "Test and validate Phase 3 of directed energy High Performance Computing Software Applications Institute software, which allows modeling of directed energy sources and propagation that involves plasmas and laser directed energy weapons. Assess potential improvements to blue weapons systems from employing high power microwave weapons technologies for platform protection and target prosecution. Continue assessments of high power microwave and synergistic\/kinetic energy weapon concept capabilities to help users plan weapons investments. Transition modeling, simulation and analysis tools to the broader modeling, simulation and analysis community. Transition Integrated Weapons Environment for Analysis Build 2 to external users and complete Integrated Weapons Environment for Analysis transition into an advanced framework to support Air Force Research laboratory wide modeling, simulation and analysis environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "25.468"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "25.468"
                                            },
                                            "Text": {
                                                "val": "Iteratively improve upon software applications that are hosted in the directed energy High Performance Computing Software Applications Institute for a broad spectrum directed energy sources. Develop end-to-end modeling and weapon utility assessments to incorporate high power microwave weapon technology into various platforms for multiple target prosecutions. Build synergistic weapon concept assessments that merge kinetic energy and non-kinetic weapon investments. Continue to support the modeling, simulation, and analysis tools that have been transitioned to the broader modeling, simulation, and analysis community."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 increased compared to FY 2018 by $0.377 million.  Justification for this increase is described in plans above."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Please refer to the Performance Base Budget Overview Book for information on how Air Force resources are applied and how those resources are contributing to Air Force performance goals and most importantly, how they contribute to our mission."
                        }
                    }
                }
            ]
        }
    }
}