{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c6d4730c5f45a9998742a765fe5a52840fa01fae9e79d847b7e2f989ef6d2407-6",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_A-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602251D8Z"
        },
        "ProgramElementTitle": {
            "val": "Applied Research for the Advancement of S&T Priorities"
        },
        "R1LineNumber": {
            "val": "12"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "40.798"
            },
            "CurrentYear": {
                "val": "49.226"
            },
            "BudgetYearOne": {
                "val": "60.688"
            },
            "BudgetYearOneBase": {
                "val": "60.688"
            },
            "BudgetYearTwo": {
                "val": "53.356"
            },
            "BudgetYearThree": {
                "val": "54.385"
            },
            "BudgetYearFour": {
                "val": "55.315"
            },
            "BudgetYearFive": {
                "val": "56.363"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities program element (PE) enables the early launch of S&T applied research projects to shape Components' investments.  The PE focuses on the design, development, and improvement of prototypes and new processes to achieve general mission requirements and to translate promising research into solutions for military needs.  Additionally, the PE enables concept exploration efforts and studies of alternative concepts.  The research projects are aligned with the Department of Defense (DoD) S&T priorities and designated focus areas that include non-system specific technology efforts and feasibility assessments and are formulated and managed by teams of subject matter experts drawn from the Office of the Secretary of Defense, the Military Services, and the Defense Agencies.  The PE also provides support to the S&T Communities of Interest (CoI)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "42.206"
                },
                "CurrentYear": {
                    "val": "49.226"
                },
                "BudgetYearOne": {
                    "val": "53.060"
                },
                "BudgetYearOneBase": {
                    "val": "53.060"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.798"
                },
                "CurrentYear": {
                    "val": "49.226"
                },
                "BudgetYearOne": {
                    "val": "60.688"
                },
                "BudgetYearOneBase": {
                    "val": "60.688"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.408"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "7.628"
                },
                "BudgetYearOneBase": {
                    "val": "7.628"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.356"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.046"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.006"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.018"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.018"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Assumption"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.354"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.354"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "High Priority Program"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "8.000"
                                },
                                "BudgetYearOneBase": {
                                    "val": "8.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2019 adjustments are reflective of higher priority DoD requirements."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "227"
                    },
                    "ProjectTitle": {
                        "val": "Applied Research for the Advancement of S&T Priorities"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "40.798"
                        },
                        "CurrentYear": {
                            "val": "49.226"
                        },
                        "BudgetYearOne": {
                            "val": "60.688"
                        },
                        "BudgetYearOneBase": {
                            "val": "60.688"
                        },
                        "BudgetYearTwo": {
                            "val": "53.356"
                        },
                        "BudgetYearThree": {
                            "val": "54.385"
                        },
                        "BudgetYearFour": {
                            "val": "55.315"
                        },
                        "BudgetYearFive": {
                            "val": "56.363"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Applied Research for the Advancement of Science and Technology (S&T) Priorities program was established to implement Department-wide technology development portfolios and foster Tri-Service research areas of common interest within cross-cutting S&T efforts.  The program has three investment areas:  (1) large, three-year applied research programs selected by the S&T Executives; (2) smaller, two-year technology ‘seedling’ programs nominated by the Communities of Interest (CoIs) to address technology gaps or opportunities; and (3) technical support to the CoIs.  The execution of the program by the Office of the Secretary of Defense (OSD) and the support it provides to the CoIs assures strategic oversight and multi-agency coordination."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Applied Research for the Advancement of S&T Priorities"
                                    },
                                    "Description": {
                                        "val": "The program focuses on fostering Tri-Service research areas of common interest within cross-cutting S&T efforts that give the joint warfighter a technological advantage in the fight.  It is intended to focus on emerging areas of science, to build experience within Department of Defense laboratories, to include investment in laboratory infrastructure and people, and will be a foundation for further investments by the Services following the completion of the projects.\n\nCross-cutting efforts align with the S&T Priorities, such as Electronic Warfare, Human Systems, Autonomy, and Cyber, as well other focus areas, such as Advanced Materials, Biomedical, Weapons, Quantum, and Command, Control, Communications, Computers and Intelligence."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "30.000"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nQuantum Science and Engineering Program (QSEP) ($15.000 million):\n−\tPlan to entangle  electron and nuclear spin ensembles and setup Silicon Carbide chemical vapor deposition reactor to grow low-strain, high purity samples for use as quantum memories\n−\tPlan to demo e-beam pumped lasing in Ultraviolet (UV) for Vertical External Cavity Surface Emitting Laser (VECSEL) structure\n−\tPlan to finalize cavity design with integrated thermal management \n−\tPlan to fabricate photonic cavities with integrated defect qubits; measure the spin and optical properties, including enhancement of photon emission\n−\tPlan to measure memory time, readout efficiency, and second order correlation in optical lattice\n−\tEstablish trapped ion capability and prepare ultra-high vacuum chambers for quantum node tests; trap ions in two independent ultra-high vacuum chamber for remote entanglement demo \n−\tOptimize Aluminum Nitride devices for singlemode operation; design\/simulate experiment for out-coupling of Ytterbium (Yb) ion\n−\tConduct Initial quantum frequency conversion (QFC) experiments; demonstrate initial coupling; conduct loss measurements\/characterization\/testing \n\nSynthetic Biology for Military Environments (SBME) ($14.000 million):\n-       Continue efforts to establish a biological open system architecture and “chassis” relevant to military environments and to create a cell-free system for gene network optimization \n-       Plan to develop Genetic manipulation tools for the nine chassis candidates, and the Genetic parts will be identified computationally and validated experimentally; the final selections will be made using potential applications and the maturity of genetic and characterization tools\n\nInitiation of new Applied Research for the Advancement of S&T Priority Project ($1.000 million)"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "42.000"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nQuantum Science and Engineering Program (QSEP) ($15.000 million):  Will complete three-year research project;\n− Enhance the performance of silicon carbide quantum memories through the use of isotopically pure elements in the crystal growth process;\n‎‎− Demonstrate spin-photon entanglement using silicon carbide crystals as the photon source;\n− Improve quantum dot material properties to enhance the indistinguishably of photons‎, which is an important property of photons that enables the design and fabrication of more advanced quantum repeaters and quantum communication experiments;\n− Conduct single and dual stage frequency conversion with single photons to improve the transport of photons through telecommunications fiber and allows coupling of disparate quantum systems;\n− Demonstrate a quantum repeater with four quantum memory system;\n− Analyze ion-photon interface to enable long-distance quantum communication and demonstrate remote entanglement in a trapped in experiment.\n\nSynthetic Biology for Military Environments (SBME) ($15.000 million):\n− Continue efforts to establish a biological open system architecture and chassis relevant to military environments and to create a cell-free system for gene network optimization; \n− Develop transcriptomic, proteomic and metabolomic tools.  The tools will be applied to identify chassis network architectures, measure compensatory changes, and determine circuit yields;\n− Design complex circuits and initiate the synthesis, incorporation, and testing of the circuit;\n− Initiate the validation and optimization of the circuits in both cell-based and cell-free platforms;\n− Explore ruggedization of the cell-free platform to improve stability for storage and field use;\n− Continue iterations of in silico predictions, test bed optimization and in vivo validation; these testing scenarios will be used to establish calibration transfer between systems;\n− Complete baseline measurements of the simple circuits in chassis organisms and extend the circuit designs to produce modulating output.\n\nDefense Optical Channel Program (DOC-P) ($11.000 million):\n− Evaluate bandwidth and power efficient waveforms for laser communications;  \n− Begin development of lab tools that emulate measured channel data (effects of scintillation\/weather) with high fidelity;  \n− Begin development of chip scale circuit prototype for optical frequency comb and investigate optical clock designs for small size, weight and power implementation;  \n− Integrate atmospheric propagation physics and optical beam control principles with quantum information theory to define capabilities, limitations, and technology requirements for Quantum Key Distribution (QKD) protocols;\n− Assess commercial-off-the-shelf based testbed with adaptive spatial filtering for daylight QKD demonstration; \n− Develop technical requirements for Quantum receiver\/transmitter testbed.\n\nSelect and initiate FY 2018 Applied Research for the Advancement of S&T Priority Project ($1.000 million)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "44.646"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "44.646"
                                            },
                                            "Text": {
                                                "val": "Continue concept exploration efforts that focus on the S&T priority areas.  The challenge areas within the priorities include:\n\nSynthetic Biology for Military Environments (SBME) ($15.000 million):  Will complete three-year research project.\n− Optimize chassis organisms with respect to production of synthesis products and fitness for targeted environments;\n− Refine tools within the open system architecture;\n− Increase characterization throughput of engineered circuits in both chassis organisms and cell free platforms;\n− Develop specialized characterization approaches;\n− Test additional circuits using the cell-free platform;\n− Refine transcriptomic, proteomic and metabolomic tools; \n− Select a strategy for ruggedization of the cell-free platform to improve stability for storage and field use;\n− Document completed circuits;\n− Document the findings.\n\nDefense Optical Channel Program (DOC-P) ($18.000 million):\n− Develop and assess adaptive laser communications protocols for tolerance to dynamic and intermittent contacts;  \n− Begin Space-Ground laser communication scintillation characterization;\n− Laboratory demonstration of microwave photonics modulation of lasercom payload;   \n− Integrate atmospheric propagation physics and optical beam control principles with quantum information theory to define capabilities, limitations, and technology requirements for Quantum Entanglement Distribution;\n− Integrate classical\/quantum channels and prototype atomic-line spectral filter;\n− Begin engineering and outfitting of Startfire Optical Range (SOR) optical comm facility for Quantum Key Distribution demonstration.\n\nContinue FY 2018 Applied Research for the Advancement of S&T Priority Project ($11.000 million).\n\nSelect and initiate FY 2019 Applied Research for the Advancement of S&T Priority Project ($1.000 million)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increased amount of $3.000 million from FY 2018 to FY 2019 will support the DOC-P research effort.  This provides the DOC-P project with the required $30.000 million for the second full-year of the project's timeline."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "S&T Communities of Interest (CoIs)"
                                    },
                                    "Description": {
                                        "val": "The S&T CoIs effort facilitates cooperation and collaboration among Components; it optimizes the development of critical S&T efforts across the DoD enterprise.  The efforts include the development of technology roadmaps and the integration of technology planning.  The CoIs select and examine critical technology areas to address gaps or opportunities."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.798"
                                            },
                                            "Text": {
                                                "val": "Continued to provide technical support to the Communities of Interest.  Conclude projects initiated in FY 2016, and select a new set of projects to address gaps identified by the Communities of Interest.\n\nThe completed projects include:\n−\tDevelopment of a Prototype Cryogenic Optical Interconnect Demonstrator\n−\tElectromagnetic Battle Management in Heterogonous Disconnected Electromagnetic Environment\n−\tJoint-Service Universal Materials Data Fusion and Visualization Structures\n\nThe Communities of Interest will select a set of new two-year projects in FY 2017."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.226"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to CoIs.\n\nConclude Seedling projects initiated in FY 2017, and select a new set of Seedling projects to address gaps identified by the CoIs. Concluding Seedling Projects are:\n\nPreparing for Enhanced Energetic Materials: An affordable CL-20: The singular solution to range and energy challenges is to make both propellant formulations (for range) and explosive formulations (for energy) using the most powerful, mature energetic crystal, CL-20. Current use of CL-20 is extremely limited because of its cost of large-scale manufacture ($1,000\/lb). The proposed work intends to achieve new, cheaper, high-yield, production routes to CL-20.\n- Research CL-20 production with fewer organic synthesis reactions, thereby reducing production costs; these reactions will employ commercially available metal catalysts, instead of the current expensive Palladium catalyst required.\n- Pursue the CL-20 precursor known as TetraAcetylDiAminohexaazaisowurtzitane (TADA), utilizing commercial off-the-shelf (COTS) starting materials.\n- Work on small-scale mixing of CL-20 propellant formulations to achieve reasonable viscosity, pot life, mechanical and safety properties.\n\nDevelopment of Prototype Soft Epidermal Biosystems with Advanced Sensing Capabilities for Warfighters in Triage Settings: To develop a wireless epidermal system that integrates flexible electronics and a range of biosensors to provide rapid vital sign screening solution for battlefield triage of combat casualties. \n- Development of stretchable circuit and biosensor designs.\n- Integration of soft elastomeric substrates and fluidic channel.\n- Validation of porcine animal model and test conditions for future evaluation of novel epidermal biosystems.\n- Evaluation of epidermal biosystems in porcine animal models and clinical settings."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.042"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.042"
                                            },
                                            "Text": {
                                                "val": "Continue to provide technical support to CoIs.\n\nSelect a new set of Seedling projects to address gaps identified by the CoIs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increased amount of $0.816 million from FY 2018 to FY 2019 will support one additional Seedling project in FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Additive Manufacturing (AM) of Energetics"
                                    },
                                    "Description": {
                                        "val": "Additive manufacturing (AM) of energetics provides the ability for tailored and integrated munitions with enhanced capabilities.  Integration of unique printed structures and printed energetics with smart fusing can allow for more agile manufacturing processes with reduced development times.  As a cross-service area of interest, the Department of Defense (DoD) Communities of Interest in Materials and Manufacturing Processes and Weapons Technologies have engaged in discussions to identify areas of collaboration.  In order to rapidly advance additive manufacturing of energetics, a joint effort across the services and the Department of Energy would support the programs interested in AM of energetics, such as Program Executive Office for Ammunition, Next Generation Hand-Grenade, Harpoon, and Lightweight torpedo."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "*** PLEASE ENTER ACCOMPLISHMENT\/PLANNED PROGRAM TEXT FOR PRIOR YEAR. ***"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.000"
                                            },
                                            "Text": {
                                                "val": "Explore preliminary concepts of low volume direct write energetics within smart fusing in tailored AM structures.  In addition, systemically explore the relationship between low volume direct write energetics and tailored AM metallic structures."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "This is a single year investment effort from the DoD in FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Project performance metrics specific to each effort are identified in the project plans established by the program leads and the Communities of Interest.  Individual project success will be monitored through these metrics."
                        }
                    }
                }
            ]
        }
    }
}