{
    "id": "2019-DefenseAdvancedResearchProjectsAgency-PB-0400-MJBOOK-0-0-f6ce2d6fdd72f55e6bde81509aa64b9e4fd9e88c2a3ca324177acd603679c7b4-13",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-DARPA-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Defense_Advanced_Research_Projects_Agency_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Defense Advanced Research Projects Agency",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603767E"
        },
        "ProgramElementTitle": {
            "val": "SENSOR TECHNOLOGY"
        },
        "R1LineNumber": {
            "val": "58"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Defense Advanced Research Projects Agency"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "239.391"
            },
            "CurrentYear": {
                "val": "210.123"
            },
            "BudgetYearOne": {
                "val": "190.128"
            },
            "BudgetYearOneBase": {
                "val": "190.128"
            },
            "BudgetYearTwo": {
                "val": "272.997"
            },
            "BudgetYearThree": {
                "val": "303.098"
            },
            "BudgetYearFour": {
                "val": "277.758"
            },
            "BudgetYearFive": {
                "val": "276.964"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Sensor Technology program element is budgeted in the Advanced Technology Development Budget Activity because it funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability and battle damage assessment.  \n\nThe Surveillance and Countermeasures Technology project will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats.\n\nThe Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems Project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "241.288"
                },
                "CurrentYear": {
                    "val": "210.123"
                },
                "BudgetYearOne": {
                    "val": "177.278"
                },
                "BudgetYearOneBase": {
                    "val": "177.278"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "239.391"
                },
                "CurrentYear": {
                    "val": "210.123"
                },
                "BudgetYearOne": {
                    "val": "190.128"
                },
                "BudgetYearOneBase": {
                    "val": "190.128"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-1.897"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "12.850"
                },
                "BudgetYearOneBase": {
                    "val": "12.850"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedReductions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalRescissions": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "CongressionalDirectedTransfers": {
                    "PriorYear": {
                        "val": "0.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "2.103"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.000"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "TotalOtherAdjustments"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "12.850"
                                },
                                "BudgetYearOneBase": {
                                    "val": "12.850"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "FY 2017:  Decrease reflects the SBIR\/STTR transfer offset by reprogrammings.  \nFY 2018:  N\/A\nFY 2019:  Increase reflects initiation of several programs in the Sensors and Processing Systems project."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "SEN-01"
                    },
                    "ProjectTitle": {
                        "val": "SURVEILLANCE AND COUNTERMEASURES TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "26.966"
                        },
                        "CurrentYear": {
                            "val": "37.843"
                        },
                        "BudgetYearOne": {
                            "val": "34.644"
                        },
                        "BudgetYearOneBase": {
                            "val": "34.644"
                        },
                        "BudgetYearTwo": {
                            "val": "28.901"
                        },
                        "BudgetYearThree": {
                            "val": "20.401"
                        },
                        "BudgetYearFour": {
                            "val": "13.401"
                        },
                        "BudgetYearFive": {
                            "val": "8.401"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Surveillance and Countermeasures Technology project funds sensor efforts that will improve the accuracy and timeliness of our surveillance and targeting systems for improved battlefield awareness, strike capability, and battle damage assessment.  Timely surveillance of enemy territory under all weather conditions is critical to providing our forces with the tactical information needed to succeed in future wars.  This operational surveillance capability must continue to perform during enemy efforts to deny and deceive the sensor systems, and operate, at times, in a clandestine manner.  This project will exploit recent advances in multispectral target phenomenology, signal processing, low-power high-performance computing, and low-cost microelectronics to develop advanced surveillance and targeting systems.  In addition, this project encompasses several advanced technologies related to the development of techniques to counter advanced battlefield threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Aerial Dragnet"
                                    },
                                    "Description": {
                                        "val": "Aerial Dragnet seeks to detect multiple small Unmanned Aerial Systems (UAS) in complex and\/or urban terrain before they are within Line-Of-Sight (LOS) of friendly assets.  Unlike traditional air targets, small UASs pose a special threat in urban terrain for several reasons: they can fly at low altitudes between buildings, they are small making them difficult to sense, and they move at slow speeds making them difficult to differentiate from other movers.  Moreover, the development of small UASs is driven by commercial technologies, which make them rapidly adaptable and very easy to use.  Building upon research conducted in the System of Systems Integration Technology and Experimentation (SoSITE) program (budgeted in PE 0603766E, Project NET-01), Aerial Dragnet will perform surveillance using an architecture consisting of networked sensors mounted on distributed aerial platforms.  The ability to see over and into urban terrain allows an Aerial Dragnet to rapidly detect, track, and classify UAS incursions, thus enabling multiple defeat options.  This program focuses on the development of payloads, to be hosted on unmanned aerial platforms, comprising of signal processing software, sensor hardware, and networking for distributed, autonomous operation.  The system will be scalable to provide cost-effective surveillance coverage from neighborhood to city-sized areas.  Aerial Dragnet technologies are expected to transition to the Army and Marines with particular relevance to missions in the EUCOM and CENTCOM Area of Responsibilities (AORs)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.984"
                                            },
                                            "Text": {
                                                "val": "-  Commenced development of surveillance subsystems for UAS detection, classification, and localization from an aerial platform.\n-  Commenced government simulation, modeling, and instrumentation efforts for testing non-line-of-sight UAS detection and tracking."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "14.090"
                                            },
                                            "Text": {
                                                "val": "-  Conduct engineering subsystem tests to assess small UAS detection performance in an instrumented urban test area.\n-  Complete development of initial hardware sensor payloads.\n-  Evaluate software for non-line-of-sight UAS tracking and classification.\n-  Demonstrate and test system performance over a neighborhood-sized urban area."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "18.230"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "18.230"
                                            },
                                            "Text": {
                                                "val": "-  Update hardware sensor payloads to reduce size, weight, power, and cost.\n-  Network multiple aerial surveillance platforms to increase coverage.\n-  Develop autonomy algorithms to allow surveillance platforms to adapt to urban terrain.\n-  Demonstrate and test the performance of the system in a multi-neighborhood-sized urban area."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects the expanded integration and testing of the system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Blue Note"
                                    },
                                    "Description": {
                                        "val": "Blue Note seeks to perform Terrain Scattered Jamming (TSJ) against surveillance radars, where radar signals are scattered off the ground into the threat radar receive beam.  Blue Note, expanding on methods developed under the Retrodirective Arrays for Coherent Transmission (ReACT) program (budgeted in PE 0603766E, Project NET-01), will develop new ways of acquiring the threat radar's waveform, which is required to execute TSJ.  Blue Note will also design new terrain scattered jamming waveforms to make it more difficult to mitigate and more effective at longer ranges from the threat radar.  Technologies developed under the Blue Note program will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.785"
                                            },
                                            "Text": {
                                                "val": "-  Commence development of new methods for acquiring threat radar waveforms.\n-  Commence design and analysis of new jamming waveforms.\n-  Conduct initial data collection using existing U.S. radars."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.414"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.414"
                                            },
                                            "Text": {
                                                "val": "-  Develop hardware to reduce system latency.\n-  Refine jamming waveforms to manage more advanced threats.\n-  Develop performance assessment tools.\n-  Demonstrate real-time operation of an integrated system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The increase in FY 2019 reflects more complex testing of the integrated system."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multi-Optical Sensing (MOS)"
                                    },
                                    "Description": {
                                        "val": "The proliferation of Radio Frequency (RF)-based countermeasures, such as Digital Radio Frequency Memory (DRFM), has presented challenges to the effectiveness of data sensors.  The Multi-Optical Sensing (MOS) program will enable an alternative approach to detecting, tracking, and performing non-cooperative target identification, as well as providing fire control for fighter class and long-range strike aircraft.  This program leverages emerging high-sensitivity Focal Plane Array (FPA) and compact, multi-band laser systems technology in the near\/mid\/long-wave infrared bands to enable the development of a multi-optical sensing system.  Technical challenges include the demonstration of inexpensive, multi-band, large-format, photon-counting, high-bandwidth receivers and their integration into a multi-optical sensor suite compatible with airborne assets.  The MOS program seeks to advance the state of the art of components and technology to support an all-optical airborne system that can detect, geolocate, and identify targets at standoff ranges.  Technologies from this program will transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "16.982"
                                            },
                                            "Text": {
                                                "val": "-  Completed the development of the second-generation prototype system and integrate onto an airborne platform.\n-  Performed ground-to-air demonstrations with the second-generation prototype system.\n-  Performed air-to-air demonstrations with the second-generation prototype system."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "13.968"
                                            },
                                            "Text": {
                                                "val": "-  Perform analysis of flight data to demonstrate the impact of a multi-mode airborne laser radar system. \n-  Complete development of high-power laser system.\n-  Transfer technology and hardware to Air Force."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-02"
                    },
                    "ProjectTitle": {
                        "val": "SENSORS AND PROCESSING SYSTEMS"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "134.174"
                        },
                        "CurrentYear": {
                            "val": "107.813"
                        },
                        "BudgetYearOne": {
                            "val": "86.610"
                        },
                        "BudgetYearOneBase": {
                            "val": "86.610"
                        },
                        "BudgetYearTwo": {
                            "val": "212.796"
                        },
                        "BudgetYearThree": {
                            "val": "276.697"
                        },
                        "BudgetYearFour": {
                            "val": "264.357"
                        },
                        "BudgetYearFive": {
                            "val": "268.563"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Sensors and Processing Systems project develops and demonstrates the advanced sensor and processing technologies and systems necessary for Intelligence, Surveillance, and Reconnaissance (ISR) missions.  Future battlefields will continue to be populated with targets that use mobility and concealment as key survival tactics, and high-value targets will range from specific individual insurgents and vehicles to groups of individuals and large platforms such as mobile missile launchers and artillery.  The Sensors and Processing Systems Project is primarily driven by four needs: (a) providing day-night ISR capabilities against the entire range of potential targets; (b) countering camouflage, concealment, and deception of mobile ground targets; (c) detecting and identifying objects of interest\/targets across wide geographic areas in near-real-time; and (d) enabling reliable identification, precision fire control tracking, timely engagement, and accurate battle damage assessment of ground targets.  The Sensors and Processing Systems Project develops and demonstrates technologies and system concepts that combine novel approaches to sensing with emerging sensor technologies and advanced sensor and image processing algorithms, software, and hardware to enable comprehensive knowledge of the battlespace and detection, identification, tracking, engagement, and battle damage assessment for high-value targets in all weather conditions and combat environments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spatial, Temporal and Orientation Information for Contested Environments (STOIC)"
                                    },
                                    "Description": {
                                        "val": "The Spatial, Temporal and Orientation Information for Contested Environments (STOIC) program will enable precision cooperative effects by developing global time transfer and synchronization systems independent of GPS.  As a corollary to time synchronization, this program will also enable GPS-independent positioning to maintain precise time synchronization between collaborating mobile users.  Key attributes of this program are global availability, minimal and low cost infrastructure, anti-jamming capability, and performance equal to or better than GPS through recent advances in optical clocks and time transfer.  Demonstrations on relevant platforms in relevant environments will be used to validate the technology.  This program will transition to the Services, emphasizing platforms that operate in GPS-denied environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "20.365"
                                            },
                                            "Text": {
                                                "val": "-  Completed development of compact optical clocks.\n-  Completed initial demonstration of prototype GPS-independent precision time transfer system and began system evaluations.\n-  Completed development of jam-proof PNT system and conducted tests to validate system performance."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.632"
                                            },
                                            "Text": {
                                                "val": "-  Conduct real-time demonstrations of jam-proof very low frequency (VLF) based positioning system.\n-  Complete validation of optical clock components for long-term performance.\n-  Conduct real-time demonstration of precision time transfer using tactical data link signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.103"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.103"
                                            },
                                            "Text": {
                                                "val": "-  Conduct field demonstrations of VLF-based positioning system with ionospheric modeling correction to validate performance in a relevant environment.\n-  Initiate transition of VLF-based positioning system to Army and Navy acquisition programs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects completion of major testing and demonstration efforts in FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Automatic Target Recognition (ATR) Technology"
                                    },
                                    "Description": {
                                        "val": "Automatic Target Recognition (ATR) systems provide the capability to detect, identify, and track high value targets from collected sensor data.  Current ATRs are typically designed for specific sensors and static due to pre-programmed target lists and operating mode, limiting mission execution capabilities.  Extending ATR Technology to accommodate sensor upgrades or include new emerging targets can be costly and time consuming.  The objective of the ATR Technology program is to develop technologies that reduce operation limitations while also providing significant performance improvements, dramatically reduced development times, and reduced life cycle maintenance costs.  Recent breakthroughs in deep learning, sparse representations, manifold learning, and embedded systems offer promise for dramatic improvements in ATR Technology.  The program will focus on three core areas: (1) development of on-line adaptive algorithms that enable performance-driven sensing and ATR technology; (2) recognition technology that enables rapid incorporation of new targets; and (3) technologies that dramatically reduce required data rates, processing times, and the overall hardware and software footprint of ATR systems.  ATR technology developed under the program is planned for transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.759"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrated adaptable ATR algorithms and transferred techniques that learned to classify new targets with significantly-reduced measured training data. \n-  Evaluated algorithm performance against denied targets with minimal or no training data.\n-  Conducted radar data collections to provide additional targets and training data.\n-  Continued to improve ATR algorithm performance, focused on reducing false-alarm rate.\n-  Completed Preliminary Design Review (PDR) of a flightworthy, low-power ATR processing hardware that executes the ATR algorithm in real-time.\n-  Demonstrated ATR algorithm running in an Open Mission System (OMS) enabled environment on embedded hardware."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.352"
                                            },
                                            "Text": {
                                                "val": "-  Continue to improve ATR algorithm performance, focusing on reducing processing times and system size and power requirements.\n-  Develop flightworthy prototype, low-power ATR processing hardware that executes the ATR algorithm in real-time.\n-  Demonstrate Open Mission System (OMS) enabled ATR operation in tactical radar System Integration Laboratory (SIL).\n-  Prepare for a flight demonstration of ATR algorithms running on an airborne platform.\n-  Conduct flight verification of ATR hardware and software and perform flight demonstration of ATR algorithms operating on an airborne platform."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.369"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.369"
                                            },
                                            "Text": {
                                                "val": "-  Conduct additional flight demonstrations of ATR algorithms operating on an airborne platform to facilitate transition to the Services.\n-  Expand ATR application to new radar sensor mode and demonstrate in laboratory environment."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects fewer testing and data collection requirements."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Seeker Cost Transformation (SECTR)"
                                    },
                                    "Description": {
                                        "val": "The Seeker Cost Transformation (SECTR) program will develop novel weapon terminal sensing and guidance technologies and systems, for air-launched and air-delivered weapons, that can: (1) find and acquire fixed and moving targets with only minimal external support; (2) achieve high navigation accuracy in a GPS-denied environment; and (3) have very small size and weight, and potentially low cost.  The development objectives are technologies and systems with small Size, Weight and Power (SWaP), low recurring cost, applicability to a wide range of weapons and missions such as small unit operations, suppression of enemy air defenses, precision strike, and time-sensitive targets.  The technical approach for the sensing\/processing hardware is to use both passive electro-optical infrared (EO\/IR) sensors, which have evolved into very small and inexpensive devices in the commercial market, and a reconfigurable processing architecture, such as the architecture developed in DARPA's Adaptable, Low Cost Sensors (ADAPT) program.  The program will also develop a Government-owned open architecture for the seeker with standardized interfaces between components (both hardware and software).  The technical approach to target recognition will start from \"deep learning\" and 2D\/3D machine vision algorithms pioneered for facial recognition and the identification of critical image features.  Technologies developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.002"
                                            },
                                            "Text": {
                                                "val": "-  Conducted laboratory demonstrations of sensor\/processing unit.\n-  Conducted captive flight test of small SWaP sensors.\n-  Completed Critical Design Review (CDR) of the prototype seeker system.\n-  Integrated GPS-free navigation software and target recognition software into the small SWaP sensors\/processing unit.\n-  Conducted hardware-in-the-loop (HWIL) test of integrated sensors\/processing unit with GPS-free navigation and target recognition software.\n-  Completed and distributed seeker open architecture standards and interfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.989"
                                            },
                                            "Text": {
                                                "val": "-  Integrate prototype SECTR seeker including all GPS-free navigation and novel target recognition subsystems into the seeker system.\n-  Conduct prototype SECTR seeker performance laboratory tests.\n-  Perform integration of prototype SECTR seeker with one or more Precision Guided Munition (PGM) platforms.\n-  Demonstrate prototype SECTR seeker performance in hardware-in-the-loop (HWIL) tests simulating flight with integrated PGM platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.350"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.350"
                                            },
                                            "Text": {
                                                "val": "-  Conduct prototype SECTR seeker and PGM captive-carry flight tests and HWIL tests.   \n-  Conduct free-flight test of integrated prototype SECTR seeker-guided PGM."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects shifting from prototype development to prototype SECTR seeker captive-carry flight tests and free-flight tests."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Satellite Sensors"
                                    },
                                    "Description": {
                                        "val": "The Small Satellite Sensors program will develop and space-qualify electro-optical and infrared (EO\/IR) sensor and inter-satellite communications technologies, and establish feasibility that new DoD tactical capabilities can be implemented on small (< 100 kg) satellites.  Experimental payloads will be flown on small satellites, and data will be collected to validate new operational concepts.  Small satellites provide a low-cost and quick-turnaround capability for testing new technologies and experimental payloads.  Operationally, small and low-cost satellites enable the deployment of larger constellations which can provide greater coverage, persistence, and survivability compared to a small number of more expensive satellites, as well as the possibility for launch-on-demand.  This program seeks to leverage rapid progress being made by the commercial sector on small satellite bus technology, as well as investments being made by DoD and industry on low-cost launch and launch-on-demand capabilities for small satellites.  The program will focus on developing, demonstrating, and validating key payload technologies needed by DoD that are not currently being developed for commercial space applications.  Technologies developed under this program will transition to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "23.478"
                                            },
                                            "Text": {
                                                "val": "-  Completed detailed design of small satellite EO\/IR sensor, and completed satellite system critical design review.\n-  Completed construction of the first small EO\/IR payload and satellite bus.\n-  Built inter-satellite communications link hardware for integration into satellites.\n-  Developed and tested mission data processing software.\n-  Developed detailed plan for on-orbit operations.\n-  Initiated design of direct-to-user data downlinks for tactical experimentation with time-critical strike concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "27.651"
                                            },
                                            "Text": {
                                                "val": "-  Complete construction, integration, and ground testing of all experimental satellites.\n-  Implement direct-to-user data link hardware and software on at least one satellite.\n-  Demonstrate on-board image processing.\n-  Develop ground-segment receivers and experimentation plan for real-time demonstrations.\n-  Deliver first EO\/IR satellite for launch into low earth orbit."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "20.970"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "20.970"
                                            },
                                            "Text": {
                                                "val": "-  Launch satellites and conduct on-orbit operations including mission planning, payload testing, and image collection.\n-  Downlink raw imagery for ground processing and pre-processed imagery for comparative analysis.\n-  Perform data collection campaigns and analyze experimental data from satellites.\n-  Perform inter-satellite communications link tests and coordinated multi-satellite operations.\n-  Demonstrate feasibility of novel real-time tactical operational concepts."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects the completion of all satellite design and fabrication efforts, with program focus shifting to final launches and the on-orbit experimental operations and data analysis."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Dynamically Composed RF Systems"
                                    },
                                    "Description": {
                                        "val": "Dominance of the Radio Frequency (RF) spectrum is critical to successful U.S. military operations.  Radar systems, Electronic Warfare (EW) systems, and communication systems require custom software and hardware that is costly and time consuming to build and integrate onto platforms.  The Dynamically Composed RF Systems program addresses these challenges by developing adaptive, converged RF array systems.  This enables enhanced operational capability by dynamically adapting the system for tasks to support radar, communications, and EW in a converged manner.  This program will design and develop: (1) a modular architecture for collaborative, agile RF systems; (2) advanced techniques for RF apertures and airframe integration and the associated wide-band agile electronics to support converged missions over those apertures; (3) a heterogeneous signal processing complex implementing hardware-agnostic RF operating modes (the RF Virtual Machine); (4) software tools for the control, coordination, and scheduling of RF functions and payloads at the element level to maximize overall task performance (a system and sensor resource manager (SSRM)).  This capability can be adapted to address diverse missions.  Technology developed under this program will transition to the Services."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "14.450"
                                            },
                                            "Text": {
                                                "val": "-  Assembled requirements to provide an abstraction of underlying software and hardware architectures (RF Virtual Machine).\n-  Commenced design of modular architecture for agile, collaborative converged RF payload systems, and assessment of candidate missions, platforms, and costs.\n-  Commenced design of RF apertures and associated airframe integration, and agile low-power wide-band RF electronics suitable for RF payloads for compact platforms\/UAVs.\n-  Commenced development of SSRM software for controlling and scheduling RF hardware (including processor) to carry out the desired RF functions.\n-  Explored and experimentally established technical readiness of candidate design approaches to technical program elements."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "20.689"
                                            },
                                            "Text": {
                                                "val": "-  Demonstrate SSRM algorithms and software approach for controlling and scheduling RF hardware to execute converged RF functions.\n-  Select prototype system architecture and begin detailed design of converged RF payload.\n-  Design RF Virtual Machine performing RF processing on heterogeneous processing complexes.\n-  Conduct laboratory testing on RF Virtual Machine to confirm validity of design approach.\n-  Design converged RF front end and apertures to address bandwidth, field of view, and sensitivity goals commensurate with the prototype system architecture and the limitations of compact platforms \/ unmanned aerial vehicles (UAV).\n-  Design and begin implementation of SSRM software to control and schedule the RF hardware to execute converged RF missions with functional and spectral flexibility."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.080"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.080"
                                            },
                                            "Text": {
                                                "val": "-  Conduct laboratory testing on prototype converged RF front end and apertures to demonstrate that hardware will meet goals for bandwidth, field of view, and sensitivity.\n-  Complete system design and validate that the system will meet the program goals.\n-  Develop integration plan describing how the converged RF payload will be installed into the target platform.\n-  Complete system interface control documents defining interfaces between the system, the payload, and off-board controllers.\n-  Complete initial version of the SSRM software."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program evolution from technology maturation to specific integrated system design."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Video-rate Synthetic Aperture Radar (ViSAR)"
                                    },
                                    "Description": {
                                        "val": "Recent conflicts have demonstrated the need for close air support by precision attack platforms such as the AC-130J aircraft in support of ground forces.  Under clear conditions, targets are easily identified and engaged quite effectively, but in degraded environments, the atmosphere can inhibit traditional optical sensors.  The AC-130J must fly above cloud decks in order to avoid anti-aircraft fire, negating optical targeting sensors.  Similarly, rotary\/wing blades in urban operations generate copious amounts of dust that prevent circling assets from supplying cover fire for ground forces.  The Video-rate Synthetic Aperture Radar (ViSAR) program will develop a real-time spotlight Synthetic Aperture Radar (SAR) imaging sensor that provides imagery of a region to allow high-resolution fire direction in conditions where optical sensors do not function.  Technology from this program is anticipated to transition to the Special Operations Command (SOCOM)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.500"
                                            },
                                            "Text": {
                                                "val": "-  Conducted flight demonstrations in cooperation with the Air Force Research Laboratory (AFRL) and AFSOC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.300"
                                            },
                                            "Text": {
                                                "val": "-  Commence development of video SAR image processing technology."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.150"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.150"
                                            },
                                            "Text": {
                                                "val": "-  Continue development of video SAR image processing technology."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects minor program repricing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "All-Signal Tactical Real-Time Analyzer (ASTRAL)"
                                    },
                                    "Description": {
                                        "val": "The All-Signal Tactical Real-time Analyzer (ASTRAL) program will develop and demonstrate a system for radio frequency and optical Electromagnetic (EM) signal surveillance and environment understanding.  Building on technologies explored under the Dynamically Composed RF Systems program, also in this Program Element\/Project, the objective of ASTRAL is to provide a factor of at least 1000 times improvement over current signal awareness processing speed over broad spectral coverage.  The program will use technology that supports a development path leading to a mobile, tactical capability.  The development objectives of the ASTRAL program are to (1) develop a hybrid processor that provides real-time processing of the most challenging Low-Probability-of-Intercept (LPI) threat signals across a wide bandwidth, and (2) identify exploitation algorithms for military applications that are well-suited to this type of hybrid processor.  Several strategic and tactical spectrum awareness applications addressed include (a) real-time exploitation of optical communications, (b) city-wide wireless device geo-location, (c) broadband LPI radar warning, and (d) theater-wide spread-spectrum LPI radio geo-location.  ASTRAL will transition to the Services and Intelligence Community."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.000"
                                            },
                                            "Text": {
                                                "val": "-  Explore development of ultra-wide-band and high-speed signal processing.\n-  Design a brassboard hybrid signal processor capable of discovering LPI signals."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.769"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.769"
                                            },
                                            "Text": {
                                                "val": "-  Identify hybrid processor architectures suited for a wide range of tactical military signal awareness applications.\n-  Integrate the brassboard hybrid signal processor system.\n-  Demonstrate LPI signal processing at broad bandwidth in a laboratory environment with simulated and real signal inputs.\n-  Select hybrid processor architectures for specific tactical military application development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects increased signal process integration and demonstrations."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "3DNow"
                                    },
                                    "Description": {
                                        "val": "The 3DNow program aims to develop technologies that let warfighters rapidly access tactical 3D situational awareness data within a secure government owned framework built on a commercial technology base.  Building on ideas explored in the System of Systems Enhanced Small Units (SESU) program (budgeted in PE 0603766E, Project NET-01), 3DNow will leverage the latest trends in image processing algorithms, embedded systems, portable devices, and assured separation kernel software to build an interface layer that securely connects the latest commercial hardware to the rest of the military infrastructure.  In order to mature and demonstrate the concept, 3DNow will conduct several development cycles focused on supporting tactical level urban warfare.  New technologies to be developed include mapping algorithms, image processing algorithms, and interoperability software and hardware.  This new technology will interface with commercial drones, Software Defined Radios (SDR), advanced sensors such as those found in self-driven cars (miniature radars and lidars), high-resolution imagers, and Internet of Things (IoT) devices.  3DNow will transition the framework and sample systems to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.783"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.783"
                                            },
                                            "Text": {
                                                "val": "-  Develop program plan and work with Service partners to define capabilities.\n-  Define focus of development cycles.\n-  Commence development of first generation interface layer."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cognitive Maneuver"
                                    },
                                    "Description": {
                                        "val": "The Cognitive Maneuver program will build decision aids for gray zone scenarios, where adversaries attempt to manipulate a U.S.-allied nation through the use of both kinetic and non-kinetic means.  Based on research performed under the Resilient Synchronized Planning & Assessment Contested Environment (RSPACE) program (budgeted in PE 0603766E, Project NET-01), the purpose of the Cognitive Maneuver program is to reduce ambiguity and reveal intent of gray zone actors who use techniques such as misinformation and intimidation to destabilize host nations and possibly produce advantageous conditions for military engagements. The tools produced by Cognitive Maneuver will automate gray zone information operations, and help U.S. Forces adapt to changing conditions and adversary responses. Instead of relying on passive collection of sensory data, Cognitive Maneuver will employ active sensing, and recommend actions U.S. forces and allied partners can take to stimulate the environment and reveal any hostile strategies. To achieve this goal, Cognitive Maneuver will build and demonstrate tools to 1) develop a dynamic model of hostile activities in a gray zone environment, 2) assess the decision space to recommend which actions may provide the highest value information, and 3) monitor execution of these actions to assess incremental progress toward reducing the ambiguity of the operating environment and suggest adjustments.  Cognitive Maneuver will transition to the Services."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.036"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.036"
                                            },
                                            "Text": {
                                                "val": "-  Develop a taxonomy for cognitive maneuver.\n-  Design gray zone modeling, initial algorithms for action generation, and initial development of monitor and assessment tools.\n-  Build a library of real and synthetic data and a laboratory simulation test environment.\n-  Commence development of technology to networked urban sensors to create a situation awareness picture."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 increase reflects program initiation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Adaptive Radar Countermeasures (ARC)"
                                    },
                                    "Description": {
                                        "val": "The Adaptive Radar Countermeasures (ARC) program will pursue new algorithms for rapidly protecting DoD systems against new or unknown radar-based threats.  Protecting these systems currently relies on uniquely identifying an enemy radar and applying an appropriate, pre-programmed Electronic Countermeasure (ECM), which can take years to develop.  The emergence of digitally-programmed radars that exhibit novel behaviors and agile waveform characteristics, however, has made this approach to countering radar-based threats increasingly challenging.  Developing new ECM over several years is no longer sufficient.  ARC will therefore pursue new processing techniques and algorithms that adapt in real-time to generate suitable countermeasures.  Using techniques such as machine learning and artificial intelligence, ARC will learn the behavior of the threat system and then choose and implement an appropriate countermeasure strategy.  The program is planned for transition to Air Force, Navy, and Marine Corps airborne electronic warfare systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "19.487"
                                            },
                                            "Text": {
                                                "val": "-  Identified test ranges and assets that emulate advanced, complex radar signals in static and open-air testing environments.\n-  Developed detailed flight demonstration objectives and conducted test readiness reviews in coordination with Service transition partners.\n-  Continued to refine algorithms making them robust to realistic Radio Frequency (RF) test conditions in real-time laboratory testing, free-space static testing, and open-air flight demonstrations."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "4.200"
                                            },
                                            "Text": {
                                                "val": "-  Conduct testing of ARC against advanced, complex radar signals in static and open-air testing environments.\n-  Deliver ARC technology to Service transition partners for inclusion into identified airborne platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "The FY 2019 decrease reflects program completion and transition to Air Force, Marine Corps, and Navy."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Scanning Technology for Imaging Radars (ASTIR)"
                                    },
                                    "Description": {
                                        "val": "The Advanced Scanning Technology for Imaging Radars (ASTIR) program provided immediate benefit to applications that are constrained by power, weight, and the complexity limits of production.  The goal of this program was to demonstrate a new imaging radar architecture using an electronically scanned sub-reflector to produce a more readily available, cost-effective sensor solution that does not require platform or target motion.  Key system attributes included: (1) high-resolution 3D imaging for enhanced identification and targeting, independent of platform or target motion; (2) video frame rates to provide well-focused images even when there is platform or target motion; (3) beam steer with a single transmit\/receive chain to reduce system complexity resulting in lower cost, power, and weight; and (4) millimeter-wave (mmW)\/terahertz (THz) electronic component advancements from other DARPA programs for transmit and receive functions.  This program resulted in a more readily available, cost-effective imaging radar technology that works in concert with a wide area surveillance system to provide target identification at video frame rates in all conditions where existing sensors do not work.  Candidate military applications include efficient terminal seekers, imaging systems for defense of shipping in ports and littoral environments, base perimeter monitoring, and screening of personnel passing through access control points.  Technology developed under this program transitioned to the Air Force."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.593"
                                            },
                                            "Text": {
                                                "val": "-  Completed assessments of candidate military applications and showed benefit from technologies developed under this effort.\n-  Completed electronically scanned sub-reflector sensor requirements."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Multifunction RF (MFRF)"
                                    },
                                    "Description": {
                                        "val": "The Multifunction RF (MFRF) program enabled U.S. rotary wing aircraft forces to fight effectively in all forms of severely Degraded Visual Environments (DVE) when our adversaries cannot.  The program went beyond landing aids in DVE to address all elements of combat to include landing, takeoff, hover\/taxi, in route navigation, lethality, and survivability.  Building on previous RF sensors advancements, the program sought to eliminate many redundant RF elements of current independently developed situational and combat support systems to provide multifunction capability with flexibility of adding new mission functions.  This reduced the overall Size, Weight, Power, and Cost (SWaP-C) of subsystems and protrusive exterior antennas on military aircraft, enabling greater mission capability with reduced vehicle system integration burden.  The program approach included: (1) development of synthetic vision for pilots that fuses sensor data with high-resolution terrain databases; (2) development of Advanced Rotary Multifunction Sensor (ARMS), utilizing silicon-based tile arrays, for agile electronically scanning technology at low SWaP-C; and (3) implementation of software development kit to re-define modes as required by mission or platform needs, and ease of adding new modes via software without hardware modifications.  Technology developed under this program transitioned to the Army."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.540"
                                            },
                                            "Text": {
                                                "val": "-  Prepared technologies developed under MFRF for planned transition to the Army."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Specific programmatic performance metrics are listed above in the program accomplishments and plans section."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "SEN-06"
                    },
                    "ProjectTitle": {
                        "val": "SENSOR TECHNOLOGY"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "78.251"
                        },
                        "CurrentYear": {
                            "val": "64.467"
                        },
                        "BudgetYearOne": {
                            "val": "68.874"
                        },
                        "BudgetYearOneBase": {
                            "val": "68.874"
                        },
                        "BudgetYearTwo": {
                            "val": "31.300"
                        },
                        "BudgetYearThree": {
                            "val": "6.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This project funds classified DARPA programs that are reported in accordance with Title 10, United States Code, Section 119(a)(1) in the Special Access Program Annual Report to Congress."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Classified DARPA Program"
                                    },
                                    "Description": {
                                        "val": "This project funds Classified DARPA Programs.  Details of this submission are classified."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "78.251"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "64.467"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "68.874"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "68.874"
                                            },
                                            "Text": {
                                                "val": "Details will be provided under separate cover."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Details will be provided under separate cover."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Details will be provided under separate cover."
                        }
                    }
                }
            ]
        }
    }
}