{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-JBOOK-c6d4730c5f45a9998742a765fe5a52840fa01fae9e79d847b7e2f989ef6d2407-30",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_A-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0603941D8Z"
        },
        "ProgramElementTitle": {
            "val": "Test and Evaluation\/Science and Technology"
        },
        "R1LineNumber": {
            "val": "64"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "430.371"
            },
            "PriorYear": {
                "val": "89.605"
            },
            "CurrentYear": {
                "val": "89.586"
            },
            "BudgetYearOne": {
                "val": "96.389"
            },
            "BudgetYearOneBase": {
                "val": "96.389"
            },
            "BudgetYearTwo": {
                "val": "97.574"
            },
            "BudgetYearThree": {
                "val": "99.520"
            },
            "BudgetYearFour": {
                "val": "101.515"
            },
            "BudgetYearFive": {
                "val": "105.858"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "The Test and Evaluation\/Science and Technology (T&E\/S&T) Program seeks out and develops test technologies to keep pace with evolving weapons technologies.  This program is critical to ensure that the Department of Defense (DoD) has the ability to adequately test the advanced systems that will be fielded in the future.  To meet this objective, the T&E\/S&T Program performs the following activities:\n• Exploits new technologies and processes to meet important test and evaluation (T&E) requirements.\n• Expedites the transition of new technologies from the laboratory environment to the T&E community.\n• Leverages industry advances in equipment, modeling and simulation, and networking to support T&E.\nAdditionally, the T&E\/S&T Program examines emerging T&E requirements resulting from Joint Service initiatives to identify T&E technology needs and develop a long-range roadmap for technology insertion. The program leverages and employs applicable applied research efforts from the highly developed technology base in DoD laboratories and test centers, other Government agencies, and industry to accelerate development of new test capabilities.  The program outreaches and engages academia to address test technology challenges in DoD testing, advancing Science, Technology, Engineering and Mathematics (STEM) initiatives at Historically Black Colleges and Universities (HBCU) and other minority serving institutions.  This program provides travel funds for T&E\/S&T program oversight, special studies, analyses, and strategic planning related to test capabilities and infrastructure.  The T&E\/S&T Program aligns with the S&T Communities of Interest (COI) to prepare the T&E community to test warfighting capabilities that emerge from priority S&T investments.  The T&E\/S&T Program is funded within the Advanced Technology Development Budget Activity because it develops and demonstrates high payoff technologies for current and future DoD test capabilities."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "87.135"
                },
                "CurrentYear": {
                    "val": "89.586"
                },
                "BudgetYearOne": {
                    "val": "97.056"
                },
                "BudgetYearOneBase": {
                    "val": "97.056"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "89.605"
                },
                "CurrentYear": {
                    "val": "89.586"
                },
                "BudgetYearOne": {
                    "val": "96.389"
                },
                "BudgetYearOneBase": {
                    "val": "96.389"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "2.470"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.667"
                },
                "BudgetYearOneBase": {
                    "val": "-0.667"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-2.416"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.101"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Inflation Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.667"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.667"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Other Reduction"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.013"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "091"
                    },
                    "ProjectTitle": {
                        "val": "High Speed Systems Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "111.279"
                        },
                        "PriorYear": {
                            "val": "32.074"
                        },
                        "CurrentYear": {
                            "val": "17.930"
                        },
                        "BudgetYearOne": {
                            "val": "15.185"
                        },
                        "BudgetYearOneBase": {
                            "val": "15.185"
                        },
                        "BudgetYearTwo": {
                            "val": "15.340"
                        },
                        "BudgetYearThree": {
                            "val": "15.898"
                        },
                        "BudgetYearFour": {
                            "val": "16.179"
                        },
                        "BudgetYearFive": {
                            "val": "16.835"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "High-speed\/hypersonic weapons are being developed to ensure the continued military superiority and strike capability of the United States including freedom of movement and freedom of action in areas protected by anti-access\/area denial defenses.  Current weapon system demonstrations and technology development programs include high-speed and hypersonic air-breathing missiles, maneuvering reentry and boost-glide weapons, hypersonic gun-launched projectiles, and air-breathing space access vehicles.  These systems require development of conventional and high-speed turbine, ramjet, scramjet, and combined cycle engines; high temperature materials; thermal protection systems (TPS); and thermal management systems.  \n  The High Speed Systems Test (HSST) project addresses test technology needs including propulsion, aerodynamic and aerothermal testing, so the test community has the technology to support the required test scenarios for concepts under development in the science and technology (S&T) community.  The technology developments within the HSST project align with the Department of Defense (DoD) S&T priority investments.  As such, the HSST project is developing, validating and transitioning advanced test and evaluation (T&E) technologies for ground test, open-air range flight test, and advanced computational tools, along with instrumentation and diagnostics systems for use in both ground tests and flight tests of high speed systems.\n  The HSST project develops technologies to enable robust, accurate, and timely T&E of these future weapon systems.  DoD acquisition regulations require weapon systems to undergo a thorough T&E process to detect deficiencies early and to ensure system suitability and survivability.  However, the extreme environments in which these weapons operate preclude accurate determination of their performance and operability with today’s T&E assets.  Current national test capabilities have deficiencies in data accuracy, flight condition replication and simulation, test methods, productivity, modeling and simulation (M&S) fidelity, and range safety.\n  The HSST mission is to address these national test capability gaps by providing test technology solutions that will enable high-speed and hypersonic weapon systems to be successfully developed through accurate, robust, and efficient T&E."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "High Speed Systems Test"
                                    },
                                    "Description": {
                                        "val": "The HSST project continued to advance ground and flight test technologies, techniques, instrumentation, and modeling and simulation capabilities required for the development of high speed air-breathing propulsion and boost-glide weapons. HSST continued progress toward addressing the two most significant technology shortfalls in current hypersonic aero propulsion ground test capabilities: clean air heat addition (i.e. non-vitiated air) and variable Mach number test capability.  Current production ground test facilities create the high temperature propulsion system inlet conditions necessary for air-breathing scramjet engine testing by burning fuel in the facility airflow supplied to the engine inlet for operation.  As demonstrated by a previous HSST test, the resulting vitiated air has different gas properties than clean air found in the atmosphere and thus is not representative of what the vehicle would experience during flight.  This significantly affects the engine’s performance and operability in the test environment resulting in erroneous flight performance predictions.  In addition to the ability to test in clean air, a variable Mach number capability is required to “fly the mission” and determine the critical transient operability effects throughout the flight envelope. Incorporation of component technologies, previously developed by the T&E\/S&T program, were integrated into a small-scale, clean air, true temperature, and variable Mach number (M4.5-7.5) aero propulsion test facility, called the Hypersonic Aerothermal and Propulsion Clean Air Testbed (HAPCAT).  Completion of this facility will demonstrate that the component technologies and their integration have reached Technology Readiness Level (TRL) 6, provide an on-going test asset to the DoD, and reduce risk for construction of a full-scale facility.  The HAPCAT project continued to develop and demonstrate air delivery system (ADS) technologies to provide uniform flow with variable pressure and temperature through a nozzle up to Mach 7.5 conditions.  The project activities included the design and initial fabrication of the ADS and conceptual design of a full scale facility. \n  Efforts continued on the morphing ceramic nozzle for hypersonic ground test facilities project which seeks to achieve a variable Mach number capability and variable inlet distortion patterns representative of flight-like inlet systems.  Following validation testing conducted at the Air Force Research Lab (AFRL), efforts were made to begin the refurbishment of the nozzle for implementation into the HAPCAT facility.  \n  Construction of the Large Energy National Shock (LENS) Tunnel II extension was completed and evaluated to verify extended run times. Such testing will enable the full development of complex flow features affecting vehicle performance, the determination of control surface responsiveness and effectiveness, and the evaluation of the performance of aerodynamic features. The improvements will help fill a critical test capability gap and support future hypersonic vehicle programs. Initial facility performance assessments of the extended tunnel demonstrated a three-fold increase in test run time.  The facility was successfully used by multiple customers who required the expanded capabilities in order to meet their test objectives.\n  The HSST project continued development of a mid-pressure arc heater prototype.  The prototype replaced an existing Huels arc heater with a segmented heater, creating a test envelope approximately three times larger than the current envelope for aerothermal testing.  Validations runs were successfully completed confirming extended test run times of up to 30 minutes and a higher thermal load representative of that experienced by a hypersonic vehicle TPS. These efforts advanced progress toward the goal of improved T&E of maneuvering reentry and boost\/glide vehicles. In a related effort, the arc heater flow quality aerothermal test technology development progressed toward independently-powered spin-coils to control the physical characteristics of the spinning arc column, its attachment location and duration on electrode surfaces within the arc heater.   The effort investigated two different spin-coil designs, one of which was validated for use in the mid-pressure arc heater facility.  This effort will improve the service life of the electrodes and improve nozzle flow quality.  \n  The HSST project continued research that will provide better prediction and determination of boundary layer growth and transition effects upon hypersonic vehicle performance. Understanding and predicting boundary layer transition represents a critical shortfall in the hypersonic community, as it affects the thermal loads, stability and control, and overall performance of a vehicle. Experimental results acquired through the boundary layer transition effort will be used to validate state of the art prediction tools and measurements of boundary layer transition mechanisms.\n  Facility flow field characterizations were conducted at the Purdue quiet tunnel and the LENS facilities at CUBRC, enabling more effective comparisons between all the facilities and informing test customers of intrinsic flow features in each facility. The characterizations will also provide insight to boundary layer transition studies in these facilities. The project also conducted testing of a boost-glide vehicle, resulting in critical findings to support future flight tests of the vehicle.   \n  HSST completed development of a ground based, portable high altitude light detection and ranging (LIDAR) system to measure atmospheric conditions (density, temperature, pressure, wind speed\/direction, oxygen\/water content) along a hypersonic vehicle’s flight path.  This technology is a significant advancement over current methods, which employ balloons carrying sensors to sample the atmosphere.  The LIDAR will improve the accuracy of characterizing high altitude atmospheric conditions. This atmospheric data is needed to assess the performance and operability of air-breathing missiles and boost-glide vehicles during development. Testing and demonstration of LIDAR atmospheric sensing was completed and the portable system was transitioned to support test programs at coastal flight test ranges to demonstrate system performance in a maritime environment. Development of an airborne version of the LIDAR continued with the design and testing of hardware components for the in-flight demonstration of the system on a crewed aircraft in preparation for implementation on an uncrewed vehicle. \n  Progress continued on a high fidelity automated airborne reconfigurable tracking system which seeks to provide high resolution imaging of hypersonic vehicles in flight.  The final design was completed including concepts for integration onto a Global Hawk aircraft. \n  The fabrication, and installation of a telemetry capability integrated with a High Altitude, Long Endurance Uncrewed Aerial System (HALE UAS) for a technical demonstration continued in preparation for support of flight testing.\n  Measurements of thermal emissions from the surface of typical boost-glide vehicles in an impulse test facility were conducted to evaluate the effectiveness of different surface compositions and treatments and filter frequencies for thermal imaging. The completion of this project resulted in valuable insights gained for a boost-glide vehicle design; these insights will be useful for future testing in high-enthalpy (high-energy) facilities.   \n  Advances were achieved in the development of M&S tools. Verification and improvement of computational fluid dynamics (CFD) codes continued, making use of the unique data sets obtained from HSST scramjet engine tests and boundary layer experiments.   A technical report was generated that summarizes the methodology for conducting boundary layer stability computations in support of acquisition programs, including shortfalls in current capabilities and recommended improvements for the toolsets available. This report was released to the hypersonic community and serves as a benchmark document for use in hypersonic programs.\n  The HSST transient thermal analysis software effort transitioned to users in the hypersonic community to support ground testing and flight testing.  \n  A force measurement system technology development completed for use in short-duration, high-enthalpy test facilities. Such technology will permit testing that elucidates real gas effects on hypersonic vehicles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "32.074"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts will address: test technologies, techniques, and methodologies to determine full-scale propulsion system performance and operability from subscale tests.  New initiatives will address technology for testing weather effects and further development of M&S codes for accurate prediction of flow fields, boundary layer transition, and heat transfer in high-speed flow.   Efforts will include demonstration of new flight test techniques, improvements in instrumentation, and continued improvement and validation of CFD codes.\n  Progress will continue toward integration and operation of the HAPCAT clean-air, variable Mach number testbed, including the design, fabrication, testing and installation of the air delivery system components. The air delivery system will combine three separate streams of pressurized air, each at different temperatures and pressures, and deliver them to the hypersonic nozzle of the HAPCAT facility.  The air streams are regulated through the air delivery system to produce a specified flight enthalpy (energy) level appropriate for the clean air flight condition being simulated in the test. \n  Upgrades to the Large Energy National Shock Tunnel to increase productivity and accuracy during operation will be initiated. \n  The upgrades to the mid-pressure arc heater will be completed to include the operation of a validated segmented arc heater system. Completion of boundary layer transition efforts will establish a new baseline protocol and recommendations for hypersonic aero performance predictions.\n  Efforts will continue to assess the technical performance and CONOPS for a HALE UAS configured to support flight T&E of hypersonic vehicles. A telemetry system onboard a UAS capable of collecting data from a hypersonic flight vehicle over broad open ocean areas will be demonstrated."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17.930"
                                            },
                                            "Text": {
                                                "val": "Continuing efforts will address: test technologies, techniques, and methodologies to determine full-scale propulsion system performance and operability from subscale tests.  New initiatives will address technology for testing weather effects and further development of M&S codes for accurate prediction of flow fields, boundary layer transition, and heat transfer in high-speed flow.  Efforts will include demonstration of new flight test techniques, improvements in instrumentation, and continued improvement and validation of CFD codes.\n  The HAPCAT clean-air, variable Mach number testbed will complete; this will include the design, fabrication, testing and installation of the ADS components. The ADS will combine three separate streams of pressurized air, each at different temperatures and pressures, and deliver them to the hypersonic nozzle of the HAPCAT facility.  The air streams are regulated through the ADS to produce a specified flight enthalpy level appropriate for the clean air flight condition being simulated in the test. \n  Upgrades to the LENS Tunnel to increase productivity and accuracy during operation will continue. \n  Further validation of the spin-coil designs for the arc heater flow quality aerothermal test technology development will continue.  Completion of boundary layer transition efforts will establish a new baseline protocol and recommendations for hypersonic aero performance predictions.\n  Efforts will continue to assess the technical performance and CONOPS for a HALE UAS configured to support flight T&E of hypersonic vehicles. A telemetry system onboard a UAS capable of collecting data from a hypersonic flight vehicle over broad open ocean areas will be demonstrated.  Efforts will continue to develop atmospheric sensing and optical imaging systems on uncrewed platforms to support flight tests."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "15.185"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "15.185"
                                            },
                                            "Text": {
                                                "val": "Developments will continue to improve hypersonic ground and flight test capabilities to levels required for acquisition programs.  Efforts will include investigation of new flight test techniques to include further development and demonstration of a UAS-based range concept, investigation of new ground test instrumentation, and continued improvement and validation of CFD codes. \n  The high fidelity automated airborne reconfigurable tracking system will be completed and demonstrated on a UAS, providing a new capability to support flight T&E of hypersonic vehicles."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "N\/A"
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "092"
                    },
                    "ProjectTitle": {
                        "val": "Spectrum Efficient Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "41.068"
                        },
                        "PriorYear": {
                            "val": "9.193"
                        },
                        "CurrentYear": {
                            "val": "9.011"
                        },
                        "BudgetYearOne": {
                            "val": "10.682"
                        },
                        "BudgetYearOneBase": {
                            "val": "10.682"
                        },
                        "BudgetYearTwo": {
                            "val": "10.253"
                        },
                        "BudgetYearThree": {
                            "val": "10.566"
                        },
                        "BudgetYearFour": {
                            "val": "10.782"
                        },
                        "BudgetYearFive": {
                            "val": "11.248"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Weapon systems have become increasingly complex in recent years, resulting in the need for significantly more data to be passed among these systems as well as between the systems and our test infrastructure.  A vast amount of data must be collected, transmitted, and analyzed, which requires a large amount of radio frequency (RF) spectrum resources.  However, the amount of RF spectrum designated to support test and evaluation (T&E) is decreasing, most notably due to reallocation of spectrum for commercial use.  The combination of decreasing RF spectrum and increasing data requirements results in an urgent need to develop test technologies that maximize the use of spectrum resources for Department of Defense (DoD) T&E operations.\n  The L and S frequency bands are the traditional spectrum allotted for military T&E use.  The explosive need for spectrum in the commercial sector has resulted in reallocation of portions of these bands to industry.  To compensate, DoD is now authorized to use the C-Band spectrum which offers numerous benefits, including the potential for a large increase in available bandwidth, but the C-Band spectrum comes with technical challenges and regulatory constraints.  Most notably, our current test infrastructure for telemetry is not designed to accommodate C-Band and the band is heavily shared for alternate uses.  Technologies are required to implement innovative techniques that efficiently facilitate our use of C-Band without a major overhaul to our national test infrastructure.  For instance, commercial telemetry transmitters operate in C-Band but do not have the form factor (size, weight and power) nor ruggedized packaging to survive airborne test applications.\n  Traditional telemetry applications employ streaming telemetry where data is moved one-way from the instrumented system under test to our test range infrastructure.  Modern network based telemetry capabilities enable more robust, efficient bidirectional transfer of data.  The DoD strategy is to create technologies for implementing a telemetry capability in C-Band, using the legacy L- and S-Bands for both streaming and networked telemetry, and researching the feasibility of using higher frequency bands to augment telemetry operations.\n  The Spectrum Efficient Technology (SET) project is developing test technologies that enable more efficient use of legacy telemetry bands and expansion into non-traditional areas of the RF and optical spectra at DoD test ranges.  The technology development efforts within the SET project have been prioritized to align with Department of Defense guidance on science and technology priority investments. As such, the SET project is focusing on growing data requirements of warfighting systems and the limited availability of spectrum for testing.  The SET project is structured to develop test technologies to advance range communications, networked telemetry capabilities, and enhanced management of spectrum at DoD test ranges."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Spectrum Efficient Technology"
                                    },
                                    "Description": {
                                        "val": "The SET project performed risk reduction on a networked data recorder and data transmission scheme in support of Central Test and Evaluation Investment Program (CTEIP) networked telemetry projects.  The networked data recorder addresses CTEIP requirements for data recording and parametric extraction during flight testing.  The networked data recorder was used as the primary data recorder during CTEIP flight tests.  The data transmission scheme is designed to minimize the amount and type of data transmitted over the telemetry network, reducing the amount of bandwidth consumed during a test event. This technology enables more efficient use of the RF spectrum by reducing the amount of data transmitted by only transmitting data parameters when changes occur.  \n  A non-blocking Ethernet switch for airborne applications was demonstrated showing 10 gigabit Ethernet data speeds required to support CTEIP data transmission requirements. Once ruggedized, this technology will serve as the network backbone which will tie all onboard instrumentation together with the onboard test data transmitter. SET matured technology to enable more efficient handling of multiple priority test data and communications between the network router and telemetry transceiver.  Development continued on a multi-band transceiver operating in the L\/S\/C-Band spectrum employing multiple advanced waveforms.  This technology determines the performance of the telemetry link and selects the optimal modulation scheme based on current link conditions, accounting for issues such as multipath.  Technology enabling the compression of Pulse Code Modulation (PCM) data was further matured. \n  The SET project developed technologies to address over-the-horizon telemetry requirements to support the testing of large footprint, long range missiles and hypersonic weapons.  An S-Band phased array antenna suitable for mounting on a Global Hawk platform was developed and its antenna gain performance characterized in a high fidelity laboratory environment.  A modular digital beam-forming solution to control a phased array antenna and track multiple targets simultaneously was matured.  These technologies will significantly reduce the system complexity for an airborne phased array antenna, providing savings in terms of size, weight, and power consumption.    \n  The SET project initiated an effort to develop a software-based technology solution to accurately characterize RF spectrum utilization on DoD test ranges. This technology will develop the interfaces to existing range RF spectrum scheduling and resource management tools and also implement a standard set of spectrum usage metrics to quantify RF spectrum usage based on times of day and test programs. This tool will transition initially to the Air Force Test Center at Edwards AFB to support RF spectrum management activities, aid in the identification of future spectrum requirements, and quantify the impact of inadequate access to spectrum, in terms of program cost and schedule."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.193"
                                            },
                                            "Text": {
                                                "val": "The SET project will further advance development of technologies required for network telemetry.  An L\/S\/C-Band transceiver will be transitioned to support both the CTEIP transceiver development and testing at the Edwards AFB RF Laboratory.  The following will be transitioned to CTEIP projects: technology capable of reconfiguring the data modulation scheme based on telemetry link conditions, technology enabling more efficient handling of priority test data and communication between the network router and telemetry transceiver, and technology enabling the dynamic reconfiguration of transmitted test data over a telemetry network.  The development of an Ethernet switch for airborne applications will continue.  Technology enabling the compression of PCM data will be further matured. Efforts to develop spectrum management tools to optimize the use of available RF spectrum and accurately quantify RF spectrum usage on DoD test ranges will continue.\n  The SET project will transition technologies to address over-the-horizon telemetry requirements to support the testing of long range missiles including hypersonic weapons.  An S-Band phased array antenna with a modular digital beam-forming controller will be integrated into a Global Hawk and used to support over-the-horizon telemetry requirements for a Navy hypersonic flight test in FY 2017.\n  The SET project will initiate development of a steerable, multi-band antenna for airborne platforms.  This antenna technology will employ either mechanical or digital methods to point the telemetry link to a specific ground receive antenna. The pointing of the telemetry link will enable spectrum reuse through spatial diversity, enabling two test platforms to transmit test data within the same portion of RF spectrum.  The SET project will initiate development of radio technology that can utilize alternate spectrum in the upper frequency bands."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "9.011"
                                            },
                                            "Text": {
                                                "val": "The SET project will further advance development of technologies required for network telemetry.  An L\/S\/C-Band transceiver will be transitioned to support both the CTEIP transceiver development and testing at the Edwards AFB RF Laboratory.  The following will be transitioned to CTEIP projects: technology capable of reconfiguring the data modulation scheme based on telemetry link conditions, technology enabling more efficient handling of priority test data and communication between the network router and telemetry transceiver, technology enabling the dynamic reconfiguration of transmitted test data over a telemetry network, and an Ethernet switch for airborne applications.  Technology enabling the compression of PCM data will be further matured. Efforts to develop spectrum management tools to optimize the use of available RF spectrum and accurately quantify RF spectrum usage on DoD test ranges will continue.\n  The SET project will transition technologies to address over-the-horizon telemetry requirements to support the testing of long range missiles including hypersonic weapons.  An S-Band phased array antenna with a modular digital beam-forming controller will be integrated into a Global Hawk and used to support over-the-horizon telemetry requirements for a Navy hypersonic flight test in CY 2017.\n  The SET project will initiate development of a steerable, multi-band antenna for airborne platforms.  This antenna technology will employ either mechanical or digital methods to point the telemetry link to a specific ground receive antenna. The pointing of the telemetry link will enable spectrum reuse through spatial diversity, enabling two test platforms to transmit test data within the same portion of RF spectrum.  The SET project will initiate development of radio technology that can utilize alternate spectrum in the upper frequency bands."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "10.682"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "10.682"
                                            },
                                            "Text": {
                                                "val": "The SET project will further advance development of technologies required for network telemetry.  Technology enabling the compression of PCM data will complete and transition to support aeronautical telemetry requirements at several test ranges including the Air Force Test Center and Army Redstone Test Center.  Efforts to develop spectrum management tools to optimize the use of available RF spectrum and accurately quantify RF spectrum usage on DoD test ranges will continue.  Efforts to develop phased array technology for use on the ground will continue.  The development of a steerable, multi-band antenna for airborne platforms will continue.  The development of radio technology that can utilize alternate spectrum in the upper frequency bands will continue.\n  The SET project will initiate several efforts to develop the key technology components to use higher frequencies to support telemetry requirements.  These efforts will focus on power amplifier, transmitter, and antenna development."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "093"
                    },
                    "ProjectTitle": {
                        "val": "Electronic Warfare Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "64.171"
                        },
                        "PriorYear": {
                            "val": "9.193"
                        },
                        "CurrentYear": {
                            "val": "11.127"
                        },
                        "BudgetYearOne": {
                            "val": "12.478"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.478"
                        },
                        "BudgetYearTwo": {
                            "val": "13.109"
                        },
                        "BudgetYearThree": {
                            "val": "13.478"
                        },
                        "BudgetYearFour": {
                            "val": "13.755"
                        },
                        "BudgetYearFive": {
                            "val": "14.349"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "In order to establish dominance in the modern battlespace, our offensive and defensive electronic warfare systems must be capable against advanced radio frequency (RF) directed threats and electro-optic (EO) guided threats, which include infrared (IR) guidance.  Ensured dominance in these areas requires more robust test and evaluation (T&E) with technologies that are rapidly adaptable to changing threats. \n  Readily available, IR seeking, man-portable air defense systems (MANPADS) are difficult to detect and pose an imminent and lethal threat to military aircraft of all types.  Our ability to counter such threats is essential to owning the battlespace in theater.  Therefore, the ability to test missile warning systems (MWS), hostile fire indicator (HFI) systems, IR countermeasures (IRCM), and advanced threat sensors is critical to our national defense. Additionally, a new generation of enemy RF missile seekers is both currently fielded and in further development, requiring a correspondingly new generation of test technologies to test the latest countermeasures.  The T&E community is required to test IRCM and RF countermeasure systems in a repeatable manner with ground-truth data before and after integration into warfighting systems.  Without new test technologies, the Department of Defense (DoD) will be unable to perform adequate T&E of advanced warning and countermeasure systems.\n  The technology development efforts within the Electronic Warfare Test (EWT) project have been prioritized to align with DoD guidance on science and technology priority investments.  As such, the EWT project is focusing on the test needs in both the EO, including IR, and the RF threat domains.  Additionally, development of core test technologies in this area can be leveraged to meet other EO and RF test requirements, such as in fire control systems; intelligence, surveillance and reconnaissance (ISR) sensors, and weapon seekers.\n  The EWT project develops test technologies to stimulate IRCM and RF system sensors through the high-fidelity simulation of scenes viewed by the sensors.  Stimulation can be as simple as testing to see if a system under test responds to an image or as complex as simulating complex battle space phenomena to measure the response of a system under test in a more relevant, cluttered scenario.  Simulations and stimulations are used at open air ranges and in installed system test facilities (ISTF), and in hardware-in-the-loop (HWIL) test beds."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Electronic Warfare Test"
                                    },
                                    "Description": {
                                        "val": "The prototype multi-static radar for testing of HFI systems completed. EWT continued to develop high fidelity scene generation technology for both EO and RF environments.  EWT completed a wideband multi-beam klystron transmitter for high fidelity threat simulation of next generation RF surface-to-air missiles to include demonstration and transition to a test range.  Development of Digital RF Memory (DRFM) algorithms for generation of virtual radar targets was completed.  Work was completed on using DRFMs to enable chamber testing of data link communications between aircraft; the technology transitioned to Navy facilities.  Development of synthetic aperture radar scene projection continued."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "9.193"
                                            },
                                            "Text": {
                                                "val": "The prototype multi-static radar for testing of HFI systems will be completed. EWT will continue to develop high fidelity scene generation capability for both EO and RF environments.  EWT will continue developing a wideband multi-beam klystron transmitter for high fidelity threat simulation of next generation RF surface-to-air missiles to include demonstration and transition to a test range.  Development of DRFM algorithms for generation of virtual radar targets will be completed.  Work will be completed on using DRFMs to enable chamber testing of data link communications between aircraft.  The EWT project will invest in new technologies related to improving the electronic warfare T&E infrastructure.  These include investments in technology for testing IRCM systems, weapon seekers and ISR sensors. The EWT project will invest in high frame rate, high temperature, large format scene projectors and improvements to scene generation."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.127"
                                            },
                                            "Text": {
                                                "val": "The EWT project will invest in new technologies related to improving the electronic warfare T&E infrastructure.  These new technologies will address the requirements to test and evaluate emerging weapon seekers, ISR sensors and next generation IRCM and RF EW systems. These investments will include high apparent temperature IR scene projectors at high frame rates and large formats to support testing of emerging sensors.  RF scene generation to support EW systems testing will be developed.  High power two-color emitters for open air testing of EO\/IR sensors will be investigated. A plane-wave generator for representing RF threats inside an ISTF will be investigated."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.478"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.478"
                                            },
                                            "Text": {
                                                "val": "The EWT project will continue prior year efforts to improve the electronic warfare T&E infrastructure.  Technologies to support adaptive EW testing will be investigated."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "094"
                    },
                    "ProjectTitle": {
                        "val": "Advanced Instrumentation Systems Technology"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "49.168"
                        },
                        "PriorYear": {
                            "val": "4.883"
                        },
                        "CurrentYear": {
                            "val": "10.004"
                        },
                        "BudgetYearOne": {
                            "val": "11.517"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.517"
                        },
                        "BudgetYearTwo": {
                            "val": "12.524"
                        },
                        "BudgetYearThree": {
                            "val": "12.886"
                        },
                        "BudgetYearFour": {
                            "val": "13.150"
                        },
                        "BudgetYearFive": {
                            "val": "13.718"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Advanced Instrumentation Systems Technology (AIST) project addresses the test technology gaps resulting from emerging weapon systems that need to be tested at Department of Defense (DoD) open air ranges, undersea ranges, installed systems test facilities, hardware-in-the-loop laboratories, and measurement test facilities.  Instrumentation requirements for systems under test are increasing exponentially for new weapons systems.  Vehicle-borne and warfighter-wearable instrumentation packages are required.  This instrumentation is for sensing and collecting critical performance data; determining accurate time, space, position information (TSPI)and attitude information; interfacing with command and control data links; monitoring and reporting system-wide communications; recording human operator physical and cognitive performance; and storing and transmitting data.\n  The technology development efforts within the AIST project have been prioritized to align with DoD guidance on science and technology (S&T) communities of interest (COIs).  The AIST project is focused on supporting technology developments for advanced TSPI instrumentation (especially with limited or no availability of the Global Positioning System (GPS)), advanced sensors, advanced energy and power systems for instrumentation, non-intrusive instrumentation, mitigating range encroachment issues, and measuring warfighter physical and cognitive performance.  \n  The AIST project addresses requirements for miniaturized, non-intrusive instrumentation suites with increased survivability in harsh environments.  Such instrumentation is an urgent need because minimal space is available to add instrumentation to new or existing weapon systems subsequent to their development; furthermore, additional weight and power from instrumentation can adversely affect weapon system signature and performance.  Instrumentation for humans-in-the-loop, such as dismounted warfighters, must not adversely affect performance, induce artificiality in the test environment, nor create operational burden.  New technologies can be exploited to integrate small, non-intrusive instrumentation into emerging platforms during design and development, and, in some cases, into existing platforms.  This class of instrumentation will provide critical system performance data during test and continuous assessment throughout a system’s lifecycle.  Technology developed under AIST can also benefit training and combat missions by enabling a continual feedback loop between the developer, training staff, operators and commanders."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Advanced Instrumentation Systems Technology"
                                    },
                                    "Description": {
                                        "val": "Major thrusts included continuing efforts in advanced sensors, TSPI instrumentation, warfighter physical and cognitive assessment under various workloads and mitigation of test range encroachments.  \n  The AIST project completed development of advanced waveforms to mitigate wind turbine effects on DoD test ranges.  Development continued on a passive imaging technology to derive size, shape, mass, drag coefficients, velocity and vectors for individual fragments to quickly characterize the fragment characteristics and distribution in warhead testing.  \n  Work completed on classifiers to identify specific sea mammals (e.g., various dolphin and whale species) found at undersea ranges and the automated processing and display of mammal detections.  The AIST project continued the development of: a system to measure and assess warfighter cognitive performance under realistic conditions during a T&E event; a personnel tracking system using amplitude modulation (AM) band signals; and technology to evaluate back face deformation of body armor from a blunt trauma event.\n  Work completed on a technology for in-water vehicles to recognize their position relative to another in-water platform in real time.  This will improve safety during tests and allow for more controlled two-body T&E events involving conventional sea platforms as well as autonomous underwater vehicles.  This technology transitioned to the U.S. Navy.\n  The AIST project initiated an effort to develop a high fidelity model which takes into account the noisier acoustic properties of shallow water environments (120 feet to 900 feet) for littoral T&E.  The model will support evaluation of undersea test range technologies (e.g., hydrophone arrays, new communication signals\/modulations, transducers, and portable instrumentation."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.883"
                                            },
                                            "Text": {
                                                "val": "Efforts will include development of advanced TSPI technologies for non-intrusive applications using wireless systems and optical, infrared, and\/or acoustic techniques.  TSPI technologies will be further developed to support: data collection in GPS-denied environments with a focus toward data fusion from disparate sensors, TSPI on high dynamic systems such as missiles and projectiles, and Real Time Casualty Assessment (RTCA).\n  Advanced sensor initiatives for non-intrusive applications will include multimodal transducers, and self-registering\/self-calibrating sensors.  Sensing applications will include weapon system orientation, body armor blunt trauma evaluation, air launched stores separation, and weapon angle of incidence measurement at impact.  Advanced data transformation initiatives will develop technologies for adaptive computing, virtual\/synthetic instrumentation, data compression, wireless on-board data transport and improved data storage density.  Other areas of investigation will include micro-miniaturization of electronic components for non-intrusive applications.  AIST will continue to investigate technologies for mitigating range environmental encroachment issues such as alternative energy interference with range tracking systems.  Additional efforts will include human performance measurement and assessment, specifically human interaction with unmanned systems and the evaluation of the interaction of the warfighter and weapons\/equipment and interactions between individual warfighters in team-based holistic assessments.\n  The AIST project will complete technologies to measure: fragment characteristics from warhead testing; TSPI using distinctive near-field patterns from AM signals; and mental effort of warfighters during test events.   AIST will demonstrate a capability for in-water vehicles to recognize their position relative to another in-water platform in real time.  AIST will demonstrate automated processing and displaying of marine mammal locations on DoD sea ranges."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "10.004"
                                            },
                                            "Text": {
                                                "val": "Efforts will include development of advanced TSPI technologies for non-intrusive applications using wireless systems and optical, infrared, and\/or acoustic techniques.  TSPI technologies will be further developed to support: data collection in GPS-denied environments with a focus toward data fusion from disparate sensors, TSPI on high dynamic systems such as missiles and projectiles, and real time casualty assessment.\n  Advanced sensor initiatives for non-intrusive applications will include multimodal transducers, and self-registering\/self-calibrating sensors.  Sensing applications will include weapon system orientation, body armor blunt trauma evaluation, air launched stores separation, and weapon angle of incidence measurement at impact.  Advanced data transformation initiatives will develop technologies for adaptive computing, virtual\/synthetic instrumentation, data compression, wireless on-board data transport and improved data storage density.  Other areas of investigation will include micro-miniaturization of electronic components for non-intrusive applications.  AIST will continue to investigate technologies for mitigating range environmental encroachment issues such as alternative energy interference with range tracking systems.  Additional efforts will include human performance measurement and assessment, specifically human interaction with unmanned systems and the evaluation of the interaction of the warfighter and weapons\/equipment and interactions between individual warfighters in team-based holistic assessments.\n  The AIST project will complete technologies to measure: fragment characteristics from warhead testing; TSPI using distinctive near-field patterns from AM signals; and mental load of warfighters during test events."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.517"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.517"
                                            },
                                            "Text": {
                                                "val": "The AIST project will initiate development of: sensors to support advanced hypervelocity projectile testing; non-destructive weapons testing (such as non-destructive radiographic defect evaluation for warheads and other weapons structures); energy and power for rapidly deployable sea ranges; advanced non-intrusive data management techniques; and mitigation technologies for monitoring effects from electromagnetic interference from solar power towers.  The AIST project will complete fiber optic shape sensing technology that accurately provides dynamic measurements during the time history of back face deformation of body armor from a blunt trauma event.  AIST will complete development of a high fidelity model for assessing technologies used in an undersea littoral test range."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "095"
                    },
                    "ProjectTitle": {
                        "val": "Directed Energy Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "41.779"
                        },
                        "PriorYear": {
                            "val": "7.362"
                        },
                        "CurrentYear": {
                            "val": "7.259"
                        },
                        "BudgetYearOne": {
                            "val": "8.654"
                        },
                        "BudgetYearOneBase": {
                            "val": "8.654"
                        },
                        "BudgetYearTwo": {
                            "val": "8.593"
                        },
                        "BudgetYearThree": {
                            "val": "8.853"
                        },
                        "BudgetYearFour": {
                            "val": "9.034"
                        },
                        "BudgetYearFive": {
                            "val": "9.424"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) is exploring the military utility, safety, and suitability of directed energy weapons.  A robust test capability to assess directed energy weapons is essential to understanding their effectiveness and limitations, including determining their effectiveness in performing counter improvised explosive device (C-IED) operations.  Such assessments will depend upon knowledge acquired through the test and evaluation (T&E) of directed energy technologies and testing of operational concepts.  Directed energy weapon technologies, primarily consisting of high energy lasers (HEL) and high powered microwaves (HPM), are outpacing available test capabilities.  Traditional test techniques for evaluating conventional munitions (with flight times ranging from seconds to minutes) are not sufficient for the T&E of directed energy weapons that place energy on target instantaneously.  Consequently, new test technology solutions are needed to ensure that adequate developmental, live-fire, and operational test capabilities are available when directed energy programs are ready to test.\n  Directed energy system and component testing requires three principal assessments:  (1) energy or power on target; (2) the effects on the target; and (3) the propagation of the directed energy to the target through the atmosphere.  In addition, the vulnerabilities of DoD systems to directed energy threats are required to be characterized, such as those requirements captured in Military Standard (MIL-STD)-464C.  Equally as important, current test capabilities do not provide the detailed data required to understand U.S. directed energy system performance and effects. The technology development efforts within the Directed Energy Test (DET) project have been prioritized to align with DoD guidance on science and technology priority investments.  As such, the DET project is developing the technologies necessary for quantitative assessment of United States (U.S.) HEL and HPM performance, as well as the vulnerability of DoD weapon systems to enemy directed energy threats."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Directed Energy Test"
                                    },
                                    "Description": {
                                        "val": "DET continued efforts to measure HEL energy on small targets such as mortars. The effort is designing a recoverable mortar prototype to address Army and Navy requirements and an Air Force requirement for a missile-mounted target board.   \n  Work completed on a Light Detection and Ranging (LIDAR)-based technology to characterize atmospheric profiles along a slant path adjacent to the HEL beam propagation path in a maritime environment.  This technology enables real-time determination of the maritime atmospheric aerosol extinction profile from coastal land or a moving ship.  \n  Development of non-intrusive dielectric voltage probes capable of measuring high voltage pulses and potentials completed.  This technology will support measurements during HPM engagements including testing of electrical static discharge weapons used for C-IED applications. \n    Efforts continued to mature a dense plasma focus technology to produce strategically relevant, ultra-short pulse neutron fluence levels for nuclear vulnerability testing.  This project successfully demonstrated neutron production.  These efforts were reducing risk for the Central Test and Evaluation Investment Program Pulsed Neutron Environment project."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.362"
                                            },
                                            "Text": {
                                                "val": "Efforts will continue to focus on technology developments for onboard measurement of energy on target and characterizing effects on small targets, such as mortars and rockets.  DET will continue efforts to characterize HEL beam propagation through the atmosphere in the maritime environment to support emerging needs of the Navy. \n  The DET project will continue development of surrogate HPM sources to address gaps in MIL-STD-464C and instrumentation to support joint technology demonstration programs. \n  The effort to mature the dense plasma focus technology for ultra-short pulse neutron source to address nuclear vulnerability testing will be continued."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.259"
                                            },
                                            "Text": {
                                                "val": "Efforts will continue to focus on technology developments for onboard measurement of energy on target and characterizing effects on small targets, such as mortars and rockets.  \n  The DET project will continue development of surrogate HPM sources to address gaps in MIL-STD-464C testing and instrumentation to support Joint technology demonstration programs. \n  The effort to mature the dense plasma focus technology for an ultra-short pulse neutron source to support nuclear vulnerability testing will continue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.654"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.654"
                                            },
                                            "Text": {
                                                "val": "Investments in HEL test technologies will be initiated to assess the changes in HEL effects due to the shift of HELs to shorter wavelengths near one micron.  These technology developments will include efforts to characterize the performance of HEL systems as they engage small targets such as enemy rockets, missiles, artillery, and unmanned aerial vehicles.\n  In the HPM area, measuring the actual cause of HPM effects on electronics will be addressed by measurement of electrical currents within the wires and chips of the electronic targets. DET will continue to investigate new technologies to further address gaps in the availability of sources for MIL-STD-464C testing."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "096"
                    },
                    "ProjectTitle": {
                        "val": "C4I & Software Intensive Systems Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "82.136"
                        },
                        "PriorYear": {
                            "val": "12.379"
                        },
                        "CurrentYear": {
                            "val": "15.707"
                        },
                        "BudgetYearOne": {
                            "val": "12.381"
                        },
                        "BudgetYearOneBase": {
                            "val": "12.381"
                        },
                        "BudgetYearTwo": {
                            "val": "11.075"
                        },
                        "BudgetYearThree": {
                            "val": "11.420"
                        },
                        "BudgetYearFour": {
                            "val": "11.654"
                        },
                        "BudgetYearFive": {
                            "val": "12.158"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Command, Control, Communications and Intelligence (C4I) and Software Intensive Systems (SIS) Test (C4T) project is pursuing technologies to emulate Net-Centric Military Operations in a System of Systems (SoS) test environment.  Likewise, C4T is developing technologies to analyze the increasing mass of structured and unstructured data generated by C4I and SIS testing.  The technologies are required when testing sensor platforms, command and control systems and weapon platforms that support the kill chain in a Joint operation.  These systems must be evaluated for their ability to provide the accurate, timely transfer of data (e.g., target tracks, weapons allocation, mission tasking, and situational awareness) as the data passes among the Services and coalition participants.  \n  The technologies within C4T will remove undesired distributed testing biases while improving test agility and the tester’s ability to effectively conduct rapid analysis of “Big Data” and automated test reporting.  C4T advances test automation features (test planning, test execution, Big Data collection, analysis, and visualization) that enable the virtual integration of Department of Defense (DoD) weapon laboratories and open air ranges.  Using modeling and simulation (M&S) along with hardware-in-the-loop (HWIL)laboratories, the effectiveness of Joint missions can be assessed in terms of system-of-systems interoperability and effectiveness in executing Joint mission operations, including testing of weapons and command and control systems accessing and providing information."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "C4I and Software Intensive Systems Test"
                                    },
                                    "Description": {
                                        "val": "The C4T project completed development of technologies to enable the Test and Training Enabling Architecture (TENA) to utilize remote methods of authentication and privilege management to distributed users.  Moreover, these technologies will support the use of TENA over a broad range of networks and provide a common interoperability test architecture.   C4T continued development of technologies in multiple areas of “Big Data” rapid analytics by focusing on facilitating Data-to-Decisions (D2D). These technologies contribute to knowledge management and analytics in support of near-real time semantic analysis of large structured and unstructured datasets and assist the analyst in making decisions during test events. These technologies are targeted for support of F-35 testing. \n  C4T continued to develop real-time automated multi-band infrared target segmentation technology using state-of-the-art neural network and deep learning based algorithms.\n  Development continued on technologies to test MK-48 and MK-54 torpedoes.  These technologies will provide an acoustic propagation model, both narrow and broad band, of sufficient fidelity to test torpedo performance in various maritime tactical environments.  The model includes a real-time simulation\/emulation system for testing torpedo sonar systems in multiple bathometry, biological and threat environments.  The model will incorporate autonomous evasion maneuvers of targeted submarines or surface ships. \n  The C4T project continued the development of technologies to provide a reliable, fast, and cost-effective approach that enables Live Virtual Constructive (LVC) testing of next generation weapon systems.  These technologies will enable live assets to sense and respond to stimulus without regard to whether the stimulus is real or synthetic.\n  The C4T project initiated the development of technologies to optimize the deployment of test support networks, plan expeditionary tests, manage bandwidth and spectrum contention with a networked system under test, and provide Real-Time Casualty Assessment (RTCA) data during live tests. These technologies will address deficiencies in Operational Test (OT) for network-enabled technology."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "12.379"
                                            },
                                            "Text": {
                                                "val": "Development will continue on technologies to support the use of TENA over a broad range of networks and to provide a common interoperability test architecture.  Moreover, C4T will investigate M&S technologies to support emulation and stimulation of networks for conducting T&E. Technology developments will focus on semantic analysis of large structured and unstructured data sets. These technology developments will include the ability to process unstructured test data into a structured format for analysis using data-to-decision algorithms.\n  Further work on the correlation and analysis of “Big Data” from multiple sources will continue. Development of techniques to automate the reuse of knowledge to enable continuous developmental testing throughout the lifecycle of weapon systems will continue.\n  The C4T project will develop technologies that mitigate data biases introduced by the test infrastructure.  Multi-Level Security (MLS) and Cross Domain Solution (CDS) technologies will be investigated with the goals of improving the automation of preparing test data for analysis as well as facilitating automated sharing of information across all security enclaves."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "15.707"
                                            },
                                            "Text": {
                                                "val": "C4T will investigate modeling and simulation (M&S) technologies to support emulation and stimulation of networks for conducting T&E. Development will continue on the verification and validation (V&V) of the M&S test environment across battlespace environments in support of both developmental test (DT) and OT. C4T will continue to develop representations of systems, communications and environments with the necessary fidelity and run-time performance crucial for the successful testing at HWIL laboratories, installed system test facilities, and open air ranges. The development of LVC technologies in support of T&E of 5th generation aircraft will also continue.        Technology developments will focus on semantic analysis of large structured and unstructured data sets. These technology developments will include the ability to process unstructured test data into a structured format for analysis using D2D algorithms.\n  Further work on the correlation and analysis of “Big Data” from multiple sources will continue. Development of techniques to automate the reuse of knowledge to enable continuous DT throughout the lifecycle of weapon systems will continue.  Additional investments will be targeted at assessing warfighter systems that in themselves implement D2D, “Big Data”, and deep learning technologies.\n  The C4T project will continue to develop technologies that mitigate data biases introduced by the test infrastructure. Development will continue on LVC technologies for testing C4I systems within a synthetic battlespace environment to augment open-air ranges with vast simulated areas and dense communications environments.  Multi-Level Security (MLS) and Cross Domain Solution (CDS) technologies will be investigated with the goals of improving the automation of preparing test data for analysis as well as facilitating automated sharing of information across all security enclaves."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "12.381"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "12.381"
                                            },
                                            "Text": {
                                                "val": "Work started in FY 2018 will continue.  The C4T project will invest in developing MLS and CDS technologies and assessing DoD platforms employing “Big Data” techniques with a specific focus on tactical fighters in a net-enabled, dynamic environment.  Developments will include V&V across integration and aggregation techniques for SoS evaluation as well as automating testing of warfighter SIS using virtualized and cloud environments.\n  “Big Data” analytical tools will continue to be developed to automatically analyze, extract, and manage meaningful patterns, trends and information from terabytes of structured and unstructured test data. Transition of these technologies for F-35 testing will commence.\n  The C4T project will invest in developing technologies to improve M&S fidelity, run-time performance and the realistic representation of systems, sensors, communications and environments in support of T&E. Investments will also be made in technologies for:  testing warfighter systems employing agile communications, effectiveness evaluation in a mission context, analytics for database intensive warfighter systems, automated test planning, the design of experiments, machine cognitive analysis, and testing human-computer interactions."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "097"
                    },
                    "ProjectTitle": {
                        "val": "Unmanned and Autonomous System Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "23.314"
                        },
                        "PriorYear": {
                            "val": "10.316"
                        },
                        "CurrentYear": {
                            "val": "11.168"
                        },
                        "BudgetYearOne": {
                            "val": "14.490"
                        },
                        "BudgetYearOneBase": {
                            "val": "14.490"
                        },
                        "BudgetYearTwo": {
                            "val": "13.692"
                        },
                        "BudgetYearThree": {
                            "val": "13.105"
                        },
                        "BudgetYearFour": {
                            "val": "13.374"
                        },
                        "BudgetYearFive": {
                            "val": "13.952"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Unmanned and Autonomous Systems (UAS) support every domain of warfare.  They operate in space, in air, on land, on the sea surface, undersea and in subterranean conditions to support a vast variety of missions.  The emergence of unmanned systems brings a host of revolutionary capabilities that will profoundly influence warfare.  The Unmanned and Autonomous Systems Test (UAST) project addresses current and emerging challenges associated with the test and evaluation (T&E) of these critical warfighting capabilities.  The technology developments within the UAST portfolio have been prioritized to align with Department of Defense (DoD) guidance on science and technology priority investments, particularly in assessing autonomy.  As such, the UAST project is developing test technologies to simulate, stimulate, instrument, measure, and assess an autonomous system’s ability to perceive its environment, process information, adapt to dynamic conditions, make decisions, and effectively act on those decisions in the context of mission execution.\n  The UAST project will provide the test technologies to effectively measure performance and characterize risk, thereby increasing warfighter trust in autonomous systems.  Current DoD test capabilities and methodologies are insufficient to address the testing of increasingly autonomous units and teams of unmanned systems operating in unstructured, dynamic, battlespace environments.  Furthermore, advancements are being made in developing collaborating, system-of-autonomous-systems that will work in concert as a swarm or pack and in close proximity with humans.  New test technologies are needed to stress the collective set of autonomous systems under realistic conditions, predict emergent behavior of autonomous systems, emulate the complex environment, and assess mission performance of these highly coupled and intelligent systems."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Unmanned and Autonomous System Test"
                                    },
                                    "Description": {
                                        "val": "New efforts focused on test technologies supporting the near term challenges identified in the 2013–2038 DoD Unmanned Systems Integrated Roadmap, such as, integrating DoD unmanned systems within the National Airspace and safely operating unmanned aerial systems within the Major Range and Test Facility Bases (MRTFB). UAST collaborated with the Autonomy Community of Interest (COI) Test and Evaluation, Verification and Validation Working Group to ensure that UAST is investing in technologies relevant to the future of autonomous systems.\n  The UAST project explored technologies required for T&E of emerging UAS architectures, functional components, and interfaces. The UAST project emphasized autonomy test technologies that can be integrated for use in a Test and Training Enabling Architecture (TENA) environment within the MRTFB.  UAST continued investments in robustness testing technology to detect and predict vulnerabilities and failures within UAS software.  UAST continued developments to automatically predict test vehicle collision potentials and cue test range controllers to take corrective action.  These technologies will also prevent the test vehicle from violating flight envelopes, range boundaries, and warning areas. UAST initiated an effort to develop a software tool that will enable testers to monitor the internal autonomous processing states of a system under test without interfering with its operations or requiring modification to the system’s software or hardware.  UAST initiated efforts to produce a comprehensive and actionable Strategic Autonomy T&E Investment Plan by assessing autonomy test infrastructure gaps, and evaluating test technology maturity required to cover gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "10.316"
                                            },
                                            "Text": {
                                                "val": "Development of technologies that rapidly develop test plans, assess regression testing required, and characterize the bias from the test environment and instrumentation will complete.  The technologies will be fully compliant with TENA and suitable for integration on the Joint Mission Environment Test Capability network.  \n  The UAST project will continue to develop test technologies that address mid-term UAS test challenges associated with autonomy and initiate efforts to explore the far term challenges of testing system intelligence.  These efforts will include research on test technologies to measure the logical flow of sensing data to perception, decisions, and action.  The UAST project will invest in complementary tools to predict UAS behavior by monitoring how autonomous systems process data in response to environmental changes.  The UAST project will investigate technologies for T&E of UAS-to-UAS and human-to-UAS interactions.\n  The UAST project will demonstrate technologies to automatically predict test vehicle collision potentials and cue test range controllers to take corrective action.  These technologies will be TENA compliant to facilitate transition across the MRTFB.   The UAST will continue coordination with the Autonomy COI and relevant Service organizations to improve T&E of autonomous systems."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "11.168"
                                            },
                                            "Text": {
                                                "val": "Development of technologies that rapidly develop test plans, assess regression testing required, and characterize the bias from the test environment and instrumentation will complete.  The technologies will be fully compliant with TENA and suitable for integration on the Joint Mission Environment Test Capability network.  \n  The UAST project will continue to develop test technologies that address mid-term UAS test challenges associated with autonomy and initiate efforts to explore the far term challenges of testing system intelligence.  These efforts will include research on test technologies to measure the logical flow of sensing data to perception, decisions, and action.  The UAST project will invest in complementary tools to predict UAS behavior by monitoring how autonomous systems process data in response to environmental changes.  The UAST project will investigate technologies for T&E of UAS-to-UAS and human-to-UAS interactions.\n  The UAST project will complete the development of technologies to automatically predict test vehicle collision potentials and cue test range controllers to take corrective action.  These technologies will be TENA compliant to facilitate transition across the MRTFB.  The UAST project will complete the development of the Strategic Autonomy T&E Investment Plan. The UAST project will complete research on autonomous system test planning technology which will identify the most pertinent test plans for maritime, air, and ground-based autonomous systems, enabling testers to identify the degree of regression testing required for autonomous systems upon changes to hardware and\/or software.  UAST will continue coordination with the Autonomy COI and relevant Service organizations to improve T&E of autonomous systems."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "14.490"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "14.490"
                                            },
                                            "Text": {
                                                "val": "The UAST project will continue to initiate and develop technologies to support autonomous system test planning, autonomous system test execution, and autonomous system performance assessment. Efforts within test planning will include predicting autonomous behavior for testing and assuring thorough testing of autonomous systems.  Investments in test execution will include:  enhancing safety of autonomous system testing; creating test environments that are complex, immersive, and reactive; and adapting ranges to cognitive, autonomous system testing.  Developments under performance assessment will include: testing and evaluating UAS-to-UAS and human-to-UAS interactions and measuring autonomous system reliability.  \n  The UAST project will complete development of technologies that automatically learn conditions for activating vulnerabilities deep within an autonomous system, using machine learning and backward chaining techniques to determine system level inputs that induce failure."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "098"
                    },
                    "ProjectTitle": {
                        "val": "Cyberspace Test"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "17.456"
                        },
                        "PriorYear": {
                            "val": "4.205"
                        },
                        "CurrentYear": {
                            "val": "7.380"
                        },
                        "BudgetYearOne": {
                            "val": "11.002"
                        },
                        "BudgetYearOneBase": {
                            "val": "11.002"
                        },
                        "BudgetYearTwo": {
                            "val": "12.988"
                        },
                        "BudgetYearThree": {
                            "val": "13.314"
                        },
                        "BudgetYearFour": {
                            "val": "13.587"
                        },
                        "BudgetYearFive": {
                            "val": "14.174"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The Department of Defense (DoD) ability to use cyberspace for rapid communication and information sharing in support of operations is a critical enabler of DoD military missions.  Advancements in utilizing cyberspace are outpacing the technologies needed for test and evaluation (T&E).  The Cyberspace Test Technology (CTT) project develops advanced technologies and methodologies to test and evaluate DoD capabilities and information networks to defend and conduct full-spectrum military operations across cyberspace.  Current cyberspace T&E capabilities are insufficient to support the continual experimental, contractor, developmental, operational, and live-fire testing requirements of warfighter systems operating in cyberspace.  Many of the test tools and infrastructure items required for systems in cyberspace will require advancement and maturation of nascent test technologies.  The CTT project will address test technology shortfalls in cyberspace testing, including planning cyberspace tests, creating representative cyberspace threats and test environments, executing cyberspace tests, and performing cyberspace test analysis and evaluation."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Cyberspace Test"
                                    },
                                    "Description": {
                                        "val": "Completed development of an automated sanitization framework with assured capability for verifying sanitization of cyber range components; this is important because it allows the reuse of limited assets for successive T&E events. This technology transitioned to the National Cyber Range and other cyberspace test organizations.  The CTT project continued development of technologies to detect, monitor, and analyze malware behavior during cyber-attacks in a virtualized T&E environment. CTT continued development of tools to measure, classify, and emulate cyberspace threat actors for T&E."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.205"
                                            },
                                            "Text": {
                                                "val": "The CTT project will pursue technology developments addressing needs to: provide automated cyberspace test planning, create representative cyberspace threats and test environments, execute cyberspace tests, and perform cyberspace test analysis and evaluation.  These efforts will support defensive and offensive cyberspace weapon systems testing, as well as cyber resiliency testing of air, land, and sea-based weapon systems. CTT will continue to develop a system capable of detecting, monitoring, and analyzing malicious behavior during cyberspace attacks."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.380"
                                            },
                                            "Text": {
                                                "val": "The CTT project will pursue technology developments addressing needs to: provide automated cyberspace test planning, create representative cyberspace threats and test environments, execute cyberspace tests, and perform cyberspace test analysis and evaluation.  These efforts will support: defensive and offensive cyberspace weapon systems testing; the testing of datalinks; the testing of enterprise information systems; and testing of cyber resiliency of air, land, and sea-based weapon systems. CTT will continue to develop a system capable of detecting, monitoring, and analyzing malicious behavior during cyberspace attacks."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.002"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.002"
                                            },
                                            "Text": {
                                                "val": "The CTT project will pursue technology developments addressing needs to: provide automated cyberspace test planning, create representative cyberspace threats and test environments, execute cyberspace tests, and perform cyberspace test analysis. These efforts will support defensive and offensive cyberspace weapon systems testing, as well as cyber resiliency testing of air, land, and sea-based weapon systems."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Program Adjustments"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "Percentage of T&E\/S&T projects progressing satisfactorily toward technical, financial, schedule, and risk mitigation goals."
                        }
                    }
                }
            ]
        }
    }
}