{
    "id": "2019-Navy-PB-1319-MJBOOK-0-0-1cb3285e5eb3096a00efd774d79545d93ed7b90effed5e9c90908e9fa9d3e340-0",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA7-U_RDTE_MasterJustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0601103N"
        },
        "ProgramElementTitle": {
            "val": "University Research Initiatives"
        },
        "R1LineNumber": {
            "val": "1"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "1"
        },
        "BudgetActivityTitle": {
            "val": "Basic Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "117.320"
            },
            "CurrentYear": {
                "val": "118.130"
            },
            "BudgetYearOne": {
                "val": "119.433"
            },
            "BudgetYearOneBase": {
                "val": "119.433"
            },
            "BudgetYearTwo": {
                "val": "117.552"
            },
            "BudgetYearThree": {
                "val": "117.498"
            },
            "BudgetYearFour": {
                "val": "119.822"
            },
            "BudgetYearFive": {
                "val": "122.258"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This program includes support for multidisciplinary basic research in a wide range of scientific and engineering disciplines that enable the U.S. Navy to maintain technological superiority, and for university research infrastructure to acquire research instrumentation needed to maintain and improve the quality of university research important to the Navy. Multidisciplinary University Research Initiative (MURI) efforts involve teams of researchers investigating high priority topics and opportunities that intersect more than one traditional technical discipline. For many military problems this multidisciplinary approach serves to stimulate innovation, accelerate research progress and expedite transition of results into Naval applications. The Defense University Research Instrumentation Program (DURIP) supports university research infrastructure essential to high quality, Navy-relevant research. The instrumentation program complements other Navy research programs by supporting the purchase of high cost research instrumentation that is necessary to carry out cutting-edge research. The program supports Presidential Early Career Awards for Scientists and Engineers (PECASE), single investigator research efforts performed by outstanding academic scientists and engineers early in their research careers. This program provides the knowledge base, scientific concepts, and technological advances for the maintenance of Naval power and national security.\n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "101.714"
                },
                "CurrentYear": {
                    "val": "118.130"
                },
                "BudgetYearOne": {
                    "val": "120.233"
                },
                "BudgetYearOneBase": {
                    "val": "120.233"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "117.320"
                },
                "CurrentYear": {
                    "val": "118.130"
                },
                "BudgetYearOne": {
                    "val": "119.433"
                },
                "BudgetYearOneBase": {
                    "val": "119.433"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "15.606"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.800"
                },
                "BudgetYearOneBase": {
                    "val": "-0.800"
                }
            },
            "AdjustmentDetails": {
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-4.394"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.800"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.800"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional Add Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "20.000"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The funding increase from FY 2018 to FY 2019 reflects additional DURIP, MURI, and PECASE awards.\n\nThe FY 2019 funding request was reduced by $0.443 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nTechnical: N\/A\n\nSchedule: N\/A"
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "University Research Initiatives"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "97.977"
                        },
                        "CurrentYear": {
                            "val": "118.130"
                        },
                        "BudgetYearOne": {
                            "val": "119.433"
                        },
                        "BudgetYearOneBase": {
                            "val": "119.433"
                        },
                        "BudgetYearTwo": {
                            "val": "117.552"
                        },
                        "BudgetYearThree": {
                            "val": "117.498"
                        },
                        "BudgetYearFour": {
                            "val": "119.822"
                        },
                        "BudgetYearFive": {
                            "val": "122.258"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This project includes support for multidisciplinary basic research in a wide range of scientific and engineering disciplines that are important for maintaining the technological superiority of the U.S. Navy, and for university research infrastructure to acquire instrumentation needed to maintain and improve the quality of university research important to the Navy. MURI efforts involve teams of researchers investigating high priority topics that intersect more than one traditional technical discipline. For many military problems this multidisciplinary approach serves to stimulate innovation, accelerate research progress, and expedite transition of results into Naval applications. The DURIP project supports university research infrastructure essential to high quality, Navy-relevant research. The instrumentation project complements other Navy research programs by supporting the purchase of high cost research\ninstrumentation that is necessary to carry out cutting-edge research. The PECASE project supports single-investigator research efforts performed by outstanding academic scientists and engineers early in their research careers. This project provides the knowledge base, scientific concepts, and technological advances for the maintenance of Naval power and national\nsecurity."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "DEFENSE UNIVERSITY RESEARCH INSTRUMENTATION PROGRAM (DURIP)"
                                    },
                                    "Description": {
                                        "val": "DURIP funds are provided to universities to purchase relatively high cost research instrumentation that is normally not included in single-investigator type research grants. Individual grants range from $50K to $1.5M. The DURIP program is an Office of the Secretary of Defense (OSD) interest item and OSD directs that funding for the DURIP efforts be awarded after OSD announces the awardees, which typically takes place towards the second half of the fiscal year. In turn, universities need to purchase the instrumentation and take delivery before any billings are generated. It frequently takes several months for delivery and billing to be completed.  DURIP is a one year program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "33.454"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued competition for research instrumentation awards to universities."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "23.022"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support university research infrastructure essential to high-quality naval-relevant research."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "23.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "23.774"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to support university research infrastructure essential to high-quality naval-relevant research."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MULTIDISCIPLINARY UNIVERSITY RESEARCH INITIATIVE (MURI)"
                                    },
                                    "Description": {
                                        "val": "Research efforts include high priority topics that intersect more than one traditional discipline. MURI topics are selected to address Naval Science and Technology (S&T) Focus Areas as described in the Naval Research and Development Framework. The MURI program is an OSD interest item and OSD directs that funding for the MURI efforts be awarded after OSD announces the awardees, which typically takes place towards the second half of the fiscal year. Since the MURI program funds academic researchers, execution of the efforts typically ramps up during the summer academic break months. MURI projects make significant contributions to Navy and DoD objectives by; speeding up scientific programs by cross-fertilization of ideas, hastening the transition of basic research to practical applications, and training students in cross-disciplinary approaches to science and engineering research of importance to DoD. MURI is a five year program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "60.435"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued competition for new MURI awards to address selected high priority Naval S&T areas, transformational initiatives, and grand challenges, including strategically important DoD research areas. Approximately eight high priority research topics will be identified for publication in a BAA to solicit proposals.\n- Continued MURI projects begun in prior years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "86.438"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continued to support teams of researchers investigating high priority topics and opportunities thru competition for new MURI awards to address selected high priority Naval S&T areas, transformational initiatives, and grand challenges, including strategically important DoD research areas that intersect more than one traditional technical discipline."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "86.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "86.706"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Continue to support teams of researchers investigating high priority topics and opportunities thru competition for new MURI awards to address selected high priority Naval S&T areas, transformational initiatives, and grand challenges, including strategically important DoD research areas that intersect more than one traditional technical discipline."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 and FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "PRESIDENTIAL EARLY CAREER AWARDS (PECASE)"
                                    },
                                    "Description": {
                                        "val": "PECASE awards are made to academic scientists early in their research careers for extremely prestigious, single-investigator research in areas of vital importance to the Navy. Awards provide national recognition and research grants of up to $200K per year for five years. OSD, with policy and oversight responsibility for the PECASE program, directed that the number of PECASE awards be set at four new awards per year. PECASE is a five year program."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.088"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "- Selected six outstanding university researchers to receive the five-year PECASE research award to conduct research of importance to the Navy.\n- Continued PECASE programs begun in earlier years."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.670"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to award four new awards per OSD guidance for recognizing and honoring extraordinary achievements of young professionals at the outset of their independent research careers in Science and Technology"
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.953"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue to award four new awards per OSD guidance for recognizing and honoring extraordinary achievements of young professionals at the outset of their independent research careers in Science and Technology."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change between FY 2018 and FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This University Research Initiative seeks to improve the quality of defense research conducted by universities and supports the education of engineers and scientists in disciplines critical to national defense needs. The initiative is a collection of specialized research programs performed by academic research institutions. Individual project metrics are tailored to the needs of specific applied research and advanced development programs. Example metrics include extending the life of Thermal Barrier Coatings for transition to the Enterprise and Platform Enablers Future Naval Capability program. It is projected that the life time of Thermal Barrier Coating on Turbine Blades can be doubled. The National Research Council of the National Academies of Science and Engineering's Congressionally directed \"Assessment of Department of Defense Basic Research\" concluded that the DoD is managing its basic research program effectively."
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "9999"
                    },
                    "ProjectTitle": {
                        "val": "Congressional Adds"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "19.343"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "19.343"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "This congressional increase furthers the Navy's efforts to support multidisciplinary basic research in a wide range of scientific and engineering disciplines that enable the U.S. Navy to maintain technological superiority.  Through this increase, additional Multidisciplinary University Research Initiative (MURI), Defense University Research Instrumentation Program (DURIP) and Presidential Early CareerAwards for Scientists and Engineers (PECASE) will be selected and funded."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "19.343"
                                        },
                                        "Text": {
                                            "val": "This increase in Congressional funding furthers the U. S. Navy's efforts to support multidisciplinary basic research in a wide range of scientific and engineering disciplines that enable the U.S. Navy to maintain its technological superiority.  Through this increase, additional Multidisciplinary University Research Initiative (MURI) awards, Defense University Research Instrumentation Program (DURIP) awards, and Presidential Early Career Awards for Scientists and Engineers (PECASE) will be selected and funded."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This University Research Initiative seeks to improve the quality of defense research conducted by universities and supports the education of engineers and scientists in disciplines critical to national defense needs."
                        }
                    }
                }
            ]
        }
    }
}