{
    "id": "2019-Navy-PB-1319-JBOOK-537288bb42cd06b820f36efcf65b2a737491c736bab4820c1757960e05e3c4ff-6",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-NAVY_BA1_3-U_RDTE_JustificationBook_Navy_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Navy_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Navy",
        "appropriation_code": "1319",
        "appropriation_name": "Research, Development, Test & Evaluation, Navy"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602235N"
        },
        "ProgramElementTitle": {
            "val": "Common Picture Applied Research"
        },
        "R1LineNumber": {
            "val": "7"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Navy"
        },
        "AppropriationCode": {
            "val": "1319"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Navy"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "0.000"
            },
            "PriorYear": {
                "val": "40.649"
            },
            "CurrentYear": {
                "val": "36.450"
            },
            "BudgetYearOne": {
                "val": "36.348"
            },
            "BudgetYearOneBase": {
                "val": "36.348"
            },
            "BudgetYearTwo": {
                "val": "36.486"
            },
            "BudgetYearThree": {
                "val": "36.616"
            },
            "BudgetYearFour": {
                "val": "37.340"
            },
            "BudgetYearFive": {
                "val": "38.099"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "N\/A"
        },
        "ProgramElementMissionDescription": {
            "val": "The efforts described in this Program Element (PE) are based on investment directions as defined in the Naval Research and Development Framework. This strategy is based on needs and capabilities from Navy and Marine Corps guidance and input from the Naval Research Enterprise (NRE) stakeholders (including the Naval enterprises, the combatant commands, the Chief of Naval Operations (CNO), and Headquarters Marine Corps). It provides the vision and key objectives for the essential science and technology efforts that will enable the continued supremacy of U.S. Naval forces in the 21st century. The Strategy focuses and aligns Naval S&T with Naval missions and future capability needs that address the complex challenges presented by both rising peer competitors and irregular\/asymmetric warfare. \n\nActivities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments. \n\nDue to the number of efforts in this PE, the programs described herein are representative of the work included in this PE."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "41.185"
                },
                "CurrentYear": {
                    "val": "36.450"
                },
                "BudgetYearOne": {
                    "val": "38.376"
                },
                "BudgetYearOneBase": {
                    "val": "38.376"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "40.649"
                },
                "CurrentYear": {
                    "val": "36.450"
                },
                "BudgetYearOne": {
                    "val": "36.348"
                },
                "BudgetYearOneBase": {
                    "val": "36.348"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.536"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-2.028"
                },
                "BudgetYearOneBase": {
                    "val": "-2.028"
                }
            },
            "AdjustmentDetails": {
                "Reprogrammings": {
                    "PriorYear": {
                        "val": "0.001"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.528"
                    },
                    "CurrentYear": {
                        "val": "0.000"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Program Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-1.690"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.690"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Rate\/Misc Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "0.000"
                                },
                                "CurrentYear": {
                                    "val": "0.000"
                                },
                                "BudgetYearOne": {
                                    "val": "-0.338"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.338"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Congressional General Reductions Adjustments"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.009"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "The FY 2019 funding request was reduced by $0.229 million to reflect the Department of Navy's effort to support the Office of Management and Budget directed reforms for Efficiency and Effectiveness that include a lean, accountable, more efficient government.\n\nTechnical: Not applicable.\n\nSchedule: Not applicable."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "0000"
                    },
                    "ProjectTitle": {
                        "val": "Common Picture Applied Research"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "0.000"
                        },
                        "PriorYear": {
                            "val": "40.649"
                        },
                        "CurrentYear": {
                            "val": "36.450"
                        },
                        "BudgetYearOne": {
                            "val": "36.348"
                        },
                        "BudgetYearOneBase": {
                            "val": "36.348"
                        },
                        "BudgetYearTwo": {
                            "val": "36.486"
                        },
                        "BudgetYearThree": {
                            "val": "36.616"
                        },
                        "BudgetYearFour": {
                            "val": "37.340"
                        },
                        "BudgetYearFive": {
                            "val": "38.099"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectArticles": {
                            "AllPriorYears": {
                                "val": "0"
                            },
                            "PriorYear": {
                                "val": "0"
                            },
                            "CurrentYear": {
                                "val": "0"
                            },
                            "BudgetYearOne": {
                                "val": "0"
                            },
                            "BudgetYearOneBase": {
                                "val": "0"
                            },
                            "BudgetYearTwo": {
                                "val": "0"
                            },
                            "BudgetYearThree": {
                                "val": "0"
                            },
                            "BudgetYearFour": {
                                "val": "0"
                            },
                            "BudgetYearFive": {
                                "val": "0"
                            }
                        },
                        "ProjectMissionDescription": {
                            "val": "The activities described in this program element (PE) address future Navy and Marine Corps capabilities needed to maintain maritime superiority and ensure national security.  They are based on input from Naval Research Enterprise stakeholders (including the Naval enterprises, the combatant commands, OPNAV and Headquarters Marine Corps) and are designed to exploit breakthroughs in science and technology in order to deliver maximum warfighting benefit to our sailors and marines.  These efforts are aligned with shared priorities throughout the whole of RDT&E in order to quickly advance new capabilities from discovery to deployment across the warfighting domains.\n\nActivities and efforts in this program examine concepts and technologies that enable the transformation to network centric warfare. Network centric capabilities rely on information to connect assets and provide timely and accurate understanding of the environment. The mission area requirements for rapid, accurate decision-making; dynamic, efficient, mission-focused communications and networks; and pervasive and persistent sensing drive network centric S&T investments."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "COMMUNICATION AND NETWORKS"
                                    },
                                    "Description": {
                                        "val": "The overarching objective of this activity is to develop high throughput dynamic wireless communications and network technologies critical to the mission performance and robustness of naval communications for widely dispersed, mobile air, land, surface and submerged platforms.  These platforms are often size, weight and power (SWaP) limited, and will operate under constraints of cluttered radio frequency (RF) spectrum, harsh electro-magnetic interference (EMI) and Beyond Line Of Sight (BLOS) conditions.  The technical payoff is increased network data rates, interoperability across heterogeneous radios, dynamic bandwidth management, and greater mobile network connectivity.  The operational payoff is that warfighters from the operational command to the tactical edge have near real-time access to information, knowledge and decision-making necessary to perform their tasks, including coalition and allied forces.  Emphasis is on tactical edge communications and networks to fully realize net-centric warfare, bridging the Global Information Grid (GIG) and the 'disadvantaged user', e.g., small-deck combatants, submarines, unmanned vehicles, distributed sensors and ground units in urban and RF challenged environments.  \n\nThe current specific objectives are:\na) Radios and Apertures: Develop technologies for high band radio, electrically-small and actively scanned antennas, addressing critical issue of radio spectrum bandwidth efficiency, spectrum contention and clutter, agile frequency communications with dynamic spectrum access, all-digital front-end with wide dynamic range, power amplifier efficiency, multipath effects, saltwater propagation and BLOS communications. Develop algorithms and signal processing for space-time-frequency diversity communications, including measures for electronic protection, such as low-intercept, antijam waveforms and modulation.  Develop affordable antenna technologies for small size and weight, high radiation efficiency, and wideband operation with rapid beam-steering.  Develop alternatives to RF communications in airborne and terrestrial environments as well as high data rate underwater communications for undersea warfare (distributed sensor netting, unmanned underwater vehicle data exfiltration, submarine Communications at Speed and Depth) using electro-optic\/infra-red (EO\/IR) technologies.  Develop secure, high bandwidth communications systems and the exploitation of existing and emerging network protocols that will avail development of new, Low Earth Orbit (LEO) based data transport mechanisms.\n\nb) Tactical Networking and Network Control\/Management: \nDevelop advanced networking techniques for robust, highly dynamic environments; interoperable networks for secure communications and protocols, bandwidth and network management techniques that manage and allocate bandwidth across tactical and theater levels in support of net-centric operations. Develop rapidly auto-configuring and self-organizing networks with efficient and survivable routing, secure authentication, mobility management and Quality-of-Service guarantee, while optimizing network resources.  Address low bandwidth, synchronization and reliability for Service Oriented Architecture (SOA)\/middleware architecture in both mobile ad-hoc networks (MANET) and infrastructure-based Internet Protocol (IP) backbone networks. Develop cognitive network planning and operations engines whose criteria are based directly on mission objectives, while self-adapting and managing the spectrum allocation and radio resources in such a way that network operations, SOA community of interest, and computer network defense are integrated to form a single common tactical network picture that requires a minimum of human intervention and skill.  Develop technology for improving tactical edge networking and for improving voice communications.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.195"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Radios and Apertures:\n\n-Continued design and development of electronic protection for high frequency communications.\n-Continued technologies to improve spectrum co-existence of military waveforms with commercial communications (e.g., overlay\/underlay techniques, interference cancellation, machine learning and reasoning algorithms for distributed spectral awareness\/management, etc.).\n-Continued development of low cost approaches for electronic beam steering and multi-beam radio frequency systems.\n-Continued development of technologies to enable troposcatter communications on the move with reduced size, wei\n-Continued development of blue-green filter technologies with wide field of view, narrow bandwidth, and reduced size, weight, complexity, etc.\n-Continued design and development of electronic protection for HF communications.\n\n\nTactical Networking and Network Control\/Management:\n\n-Continued the development of software-defined networking capabilities for tactical platforms.\n-Continued dynamic routing mechanisms that focus on robust data delivery -- in near real time -- under harsh networking conditions (i.e.,intermittent connectivity, limited throughput, etc.).\n-Continued development of techniques and algorithms to manage resources of tactical networks in a manner consistent with Commander's Intent.\n-Continued development of techniques and algorithms to ensure end-to-end delivery of data across undersea networks with large delays and multi-modal communications."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7.283"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Continue research in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, SATCOM performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management.\n\nContinue network-centric and information warfare capability for the Navy\/Marine Corps by addressing deficiencies and science gaps in tactical networks. These capabilities address unique military environment and application challenges enabling new mission concepts requiring minimal human intervention. Focus on three specific objectives: dynamic network structural analytics and adaptation; robust network organization and transport, distributed group collaboration and discovery; and adaptive signaling and sensing to improve military wireless communications.  Demonstrate a digital design receiver testbed for compressed sensing techniques for a communications relay; and real time application of analytic complex network theory metrics to both aid the prediction of network performance and to assist a cyber tool to identify and track network strengths and weaknesses."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "7.242"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "7.242"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Information Technology: \nObjective is to provide resilient and effective network-centric and information warfare capability for the Navy\/Marine Corps by addressing deficiencies and science gaps in tactical networks. These capabilities address unique military environment and application challenges enabling new mission concepts requiring minimal human intervention. Current work and near-term plans focus on three specific objectives: dynamic network structural analytics and adaptation; robust network organization and transport, distributed group collaboration and discovery; and adaptive signaling and sensing to improve military wireless communications. Specific research examples include increasing the performance of low powered networks by using compressed sensing technology and technology to improve the design of distributed and cooperative Intelligence, Surveillance and Reconnaissance (ISR), Integrated Cyber and Electronic Warfare (ICE) operations in denied and contested Electromagnetic environments. \n\nContinue ongoing research and related thrusts in antenna technology to include electrically small antennas, wideband multifunction antennas, compatibility of phased array antennas with naval platforms and marine environments, directional beam forming\/steering techniques, and special-purpose submarine communication antenna systems; radio communications to include anti-jam and low-probability-of-intercept techniques, SATCOM performance enhancements, interference mitigation, adaptive equalization, bandwidth efficient modulation, cognitive radio for dynamic spectrum management, and high data rate tactical communications techniques including communications at speed and depth (for submarines); and wireless networks to include mobile ad-hoc wireless networking algorithms\/protocols, end-to-end Quality-of-Service, joint\/coalition interoperability, service oriented tactical networking, mission-based policy and network controls and management."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "APPLIED INFORMATION SCIENCES FOR DECISION MAKING"
                                    },
                                    "Description": {
                                        "val": "The goal of this activity is to develop enablers for decision making and mission execution, to achieve battlespace superiority.  It focuses on the development of algorithms and software technologies that identify and integrate informational content from multiple sources, leading to decision aids that support user-cognitive processes.  Because persistent sensors are generating massive amounts of data, the focus is on technologies that not only integrate information from diverse sources, but also provide indications of information significance in ways that support the user's decision needs, regardless of location and operational situation.  To achieve this, it must be possible to automate understanding of the battlespace by identifying objects, determining relationships among the objects, assessing intent, and automatically generating courses of action with associated risks and uncertainty.  Effort will also be devoted to developing technology for increasing assurance and security for C3 information systems and technology for improving information discovery and information presentation in such systems.  The Nano Electronics Technology activity is focused on developing ultra-low power, higher performance computing devices and components that are based on novel functionalities of nanometer scale materials and are enabled by improved understanding of nanomaterials, new devices and circuit design concepts, as well as new architectures uniquely suited for nanoscale systems.  \n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "24.688"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Data Understanding: \n\n-Continued efforts for reconstructing events from a loose network of heterogeneous cameras.\n-Continued development of algorithms for extraction of information from Light Detection and Ranging (LIDAR) and Radar.\n-Continued efforts to develop an automated tool to improve checkpoint security by identifying accents of non-native English speakers.\n-Continued development of methods for integration of low-level image processing and high-level knowledge for simultaneous image segmentation and object recognition, and visual reasoning for image understanding.\n-Continued development of 3D image processing for object recognition and meaningful change detection.\n-Continued development of modular, interactive, intelligent, video-based surveillance systems.\n-Continued methods for building sophisticated visual knowledge bases, development of methods for visual reasoning and integrating them in image\/video understanding, and development of methods for image description\n \nInformation Integration:\n\n-Continued development of methods for analysis and integration of text with imagery and video.\n-Continued development of methods for analysis of structured and unstructured data.\n-Continued development of algorithms and tools for information representation of unstructured data and structured data in such a way that shared concepts\/relationships in disparate data sets can be automatically compared, matched, or associated, and in a way that can facilitate and improve information fusion.\n-Continued development of algorithms and tools for information fusion of heterogeneous data for classification and reconstruction based on high level features inherent in each data source, with the goal of forming a more complete picture of battle space environment.\n-Continued development of algorithms and tools for discovering and extracting higher-level features -- objects, events, patterns, intents, relationships, anomalies -- from various data types in support of future asymmetric warfare.\n-Continued research to extend user interfaces for immersive simulation to enable users to better express themselves through non-verbal communications.\n-Continued research into designing more resilient networks that better adapt to disruption and change by developing new analytical models and methodologies for characterizing network node relationships to improve prediction of statistical communication performance and structural relationships within dynamic ad hoc networks.\n-Furthered research into designing more resilient networks that better adapt to disruption and change by developing new analytical models and methodologies for characterizing network node relationships to improve prediction of statistical communication performance and structural relationships within dynamic ad hoc networks.\n \nData Analytics (Formally Titled Mission Focused Autonomy (MFA):\n\n-Continued Maritime domain awareness toolkit development for small vessel tracking.\n-Continued cyber information awareness decision tools for hull, mechanical and electrical security for Naval vessels.\n-Continued bringing capability into a multi-level security environment.\n-Continued automating current set of time critical reports to ensure timely decision making that is informed by forensics data.\n-Continued efforts to develop a task scheduler for unmanned aerial system operators that reflects operator workload.\n-Continued research in mission-focused autonomy and reasoning methods; expanded autonomy from simple platform. kinematics to include all-source information exploitation and surrounding cultural and social influences.\n-Continued integrating this analytic environment into parallel Navy Tactical Cloud environment.\n  \nResource Optimization:\n-Continued development of methods for selecting sensors and platforms for search and surveillance operations in a theater, allocating the selected sensors and platforms to specific missions, operating the allocated sensors during a mission, and fusing the information from the sensors and other sources.\n-Continued development of optimization-based decision aids for resource allocation, such as those required for mission planning at the strategic, operational, and tactical level.\n\nCyber Defense:\n\n-Continued development for methods and tools for semi-\/fully- automated software model extraction and online program execution monitoring toward achieving adaptive and resilient computing system.\n-Continued development of anti-tamper methods that are capable of lengthy operation in unattended and un-powered environments, have very high probability of tamper detection and very low probability of false alarm, and remain undetected in the host system.\n-Continued development of automated tools that identify and mitigate potential software vulnerabilities, such as tools that analyze code as it is being written, vulnerability-aware compilers that automatically enhance code security, and techniques for enhancing the client-side security of web applications.\n-Continued research into better protecting Department of Defense systems by developing methods and tools that are applicable both to source and binary code for the detection and mitigation of attacks in commercial-off-the-shelf (COTS) software that exploit vulnerabilities in the Windows platform.\n-Furthered research into better protecting Department of Defense systems by developing methods and tools that are applicable both to source and binary code for the detection and mitigation of attacks in commercial-off-the-shelf (COTS) software that exploit vulnerabilities in the Windows platform.\n\n\nNanoscale Electronics:\n\n-Continued effort to develop a highly linear, low-noise radio frequency amplifier using aligned arrays of single-walled carbon nanotubes.\n-Continued new research in graphene synthesis and device concepts.\n-Continued effort to develop the synthesis, fabrication and testing of graphene-based electromechanical structures and devices.\n-Continued work on graphene-based devices and circuits for low power flexible electronics.\n-Continued research on graphene-organic hybrid materials interfaces and device structures.\n\n\nQuantum Information Sciences: \n-Continued free-space Quantum Key Distribution applied research program for secure communication.\n\nNetwork Situation Awareness & Security:\n\n-Continued development of algorithms\/methods for providing attribution of threat-agents through the network\/ infrastructure. Emphasis will be placed on addressing translational boundaries, cross-domains, and obfuscation techniques to avoid detection and tagging\n-Continued new mobile agent technology that provides network protection, thwarts botnet attacks, and provides for a resilient computational infrastructure and communications environment. Investigate new methods for subverting the control plane of the mobile code attacking the infrastructure.\n-Continued development of algorithms\/methods for providing attribution of threat-agents through the network\/ infrastructure. Building upon previous results, develop network-based techniques to provide pro-active response to attributed threat agents to mitigate attack vector and ensure mission success.\n-Continued investigating new methods for subverting the control plane of the mobile code attacking the network infrastructure.\n-Continued the development of new algorithms for taking control of bots once the control plane is compromised.\n-Continued development of new algorithms\/techniques to characterize Navy and Marine Corps network assets in order to develop robust security mechanisms and support technologies based on criticality and mission essential operations.\n\nNetwork Traffic Analysis and Assessment: \n\n-Continued development of new algorithms focused on detection of nation state sponsored activities through the network infrastructure. Develop algorithms to address sophisticated malicious code techniques.\n-Continued algorithms to address sophisticated malicious code techniques that exploit network traffic\/data that is fragmented, encrypted, and\/or obfuscated using polymorphic methods, as well as techniques that transgress security perimeters and exfiltrate data.\n-Continued development of new algorithms that provide attack prediction and targets of opportunity.\n-Continued the development of algorithms and techniques to detect stealthy protocols that enable covert communication by exploiting channels available in existing widely used protocols.\n\nInformation Assurance:\n\n-Continued the development of methods and techniques to provide component repurposing\/agility to flatten the attack surface from sophisticated nation-state sponsored attacks.\n-Continued the development of trusted computing technologies to minimize\/limit authentication\/sign-on services across various network, virtual, and\/or cloud environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "22.519"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Information Technology: \nInitiate research to improve the operational capability of Naval decision support systems and decrease the cost of these systems through transformative advances in information management that enables agility in timely and accurate decision and action. The military capability from this task area is technology to support improved situational awareness and operational effectiveness, improved techniques for dealing with information-intensive applications, and information management processes that improve the speed and accuracy of decisions and actions. \n\nElectromagnetic Warfare: \nInitiate research in advancing the state-of-the-art in being able to uniquely identify target of interest in very complex environments using passive technologies to assure high confidence to the decision maker when combined with other information sources.  This is being accomplished by expanding specific emitter identification technologies into areas detecting previously unaddressed and unexplored with the intent of maintaining battlespace superiority.\n\nQuantum Information Sciences: \nContinue research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation.\n\nComputational Methods for Decision Making (formerly Data Understanding, Information Integration, and Resource Optimization): \nContinue research of Information Integration, Automated Image Understanding, and Resource Optimization for the purpose of developing innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions; developing automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance; and developing automated decision-support tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time. Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner.\n\nNanoscale Electronics Technology:\nContinue research in novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. \n\nCyber Defense:\nContinue research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems as well as Navy's real-time safety critical cyber physical systems. \n\nData Analytics:\nContinue research in new approaches to support tactical decision makers and information superiority. This is performed by producing distributed situation assessment of a commander's environment through development of a common tactical picture; developing collaborative, distributed mission plans; monitoring and dynamically replanning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently through use of autonomic software; effectively using sensor information and making resource allocation decisions and information operations. Specific research involves real-time computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "22.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "22.434"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Information Technology:\nObjective is to improve the operational capability and security of Naval decision support systems and decrease the cost of these systems through transformative advances in information management that enables agility in timely and accurate decision and action. The military capability from this task area is technology to support improved situational awareness and operational effectiveness, improved techniques for dealing with information-intensive applications, and information management processes that improve the speed and accuracy of decisions and actions. Specific research examples include technology to detect and remediate security vulnerability in Commercial-off-the-Shelf software, technology to identify and locate individuals of interest using multi-biometrics, technology for goal driven autonomous systems, and technology to improve performance of Navy Watchstand personnel who must monitor multiple workstations concurrently.\n\nElectromagnetic Warfare: \nThe technologies being developed are advancing the state-of-the-art in being able to uniquely identify target of interest in very complex environments using passive technologies to assure high confidence to the decision maker when combined with other information sources.  This is being accomplished by expanding specific emitter identification technologies into areas detecting previously unaddressed and unexplored to maintain battlespace superiority.\n\nQuantum Information Sciences: Continue research of quantum key distribution (QKD) protocols and implementations for the purpose of understanding the security implications for QKD in the maritime environment, the development of protocols that simultaneously minimize leakage of information to the environment and the creation of secure networks, as well as schemes to maximize the information carried by a continuous or discrete variable; and research of algorithms for naval functions such as routing, weapon-target pairing, etc., a key application such as radar cross section calculation. \n\nComputational Methods for Decision Making: Continue research of Information Integration, Automated Image Understanding, and Resource Optimization for the purpose of developing innovative methods for combining traditional and non-traditional data from sensors and disparate sources to provide the best estimate of objects, events, and conditions in the battlespace, in terms of their identity, associated error or uncertainty, context, impact, while inferring relationships and their intentions; developing automated, image and signal intelligence understanding tools based on rigorous mathematical and statistical methods that lead to improved change detection, improve object and activity detection and recognition capabilities, context and scene understanding, and inferring of the threat levels to support decision making and persistent and adaptive surveillance; and developing automated decision-support tools based on mathematically rigorous techniques (e.g., mathematical optimization) that support decision-making to ensure the best use of scarce and\/or expensive resources, achieving optimal allocations for large complex scenarios, including ones that contain uncertainty, in drastically reduced amounts of time. Develop methods that support decision making in networked sensor management and allocation to ensure sensor assets are deployed in an optimal, or near optimal, manner. The amount of data that the decision makers are facing today is much larger than any time before in human history.  In addition, the data is much more complex, heterogeneous and fast changing.  Analysis of such large and complex datasets is beyond the cognitive abilities of any single decision maker.  The aim of this thrust is to develop new methods for extraction and analysis of relevant information from large-scale datasets, and to develop new tools for distributed information sharing and decision-making. To achieve this aim, it is required to advance fundamental understanding of networks (such as social and organizational networks), and to integrate rigorous methods from mathematical and computational sciences with methods from social sciences. \n\nNanoscale Electronics Technology: Continue research in novel nanometer scale (feature size near or below 10nm) logic\/memory devices and related circuits and architectures to deliver ultra-low power, light weight and high performance computational capability for autonomous vehicles and individual warfighters. \n\nCyber Defense: Continue research in cyber systems, leveraging results from basic research program, developing and evaluating technical approaches for future naval capabilities. The program investigates technologies for enhancing efficiency, robustness and cyber resiliency for all classes of computing systems in naval enterprise systems as well as Navy's real-time safety critical cyber physical systems. \n\nData Analytics: Continue research in new approaches to support tactical decision makers and information superiority. This is performed by producing distributed situation assessment of a commander's environment through development of a common tactical picture; developing collaborative, distributed mission plans; monitoring and dynamically replanning mission execution as required; understanding their environment by being able to access distributed heterogeneous enterprise information stores intelligently through use of autonomic software; effectively using sensor information and making resource allocation decisions and information operations. Specific research involves real-time computing, decision aids and collaborative workspaces; secure distributed architectures; and information warfare methods to protect secure information."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MULTI-SOURCE INTEGRATION AND COMBAT IDENTIFICATION"
                                    },
                                    "Description": {
                                        "val": "This activity addresses theater air and missile defense (TAMD), and responds to warfighter needs for rapid, high confidence Combat Identification (CID) of air and missile threats at long range, using real time and non-real time threat attributes and intelligence information.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.863"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "-Furthering development of methodology to incorporate EM vector sensors in USVs to enable HF signal detection and geolocation.\n-Furthering development of advanced 2D array geometries and signal processing techniques to expand the operational envelope of surface wave HF radar."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.530"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare \nNew algorithmic approaches are being developed to conduct automatic target recognition using associative learning.  A small sized design has been built to improve RF detection of targets at HF frequencies as precursors to adversary air attacks.  This in conjunction with improvements being made in HF surface wave radar array geometries should greatly improve operational capabilities in this reinvigorated part of the RF spectrum.  A new concept for rapidly assessing concurrently multiple missiles with multiple EW responses is being investigated to provide for rapid high quality assessment in this complex environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.535"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Electromagnetic Warfare: \n A small sized design has been built to improve RF detection of targets at HF frequencies as precursors to adversary air attacks.  This in conjunction with improvements being made in High Frequency (HF) surface wave radar array geometries should greatly improve operational capabilities in this reinvigorated part of the Radio Frequency (RF) spectrum.  A new concept for rapidly assessing concurrent multiple missiles with multiple Electronic Warfare (EW) responses is being investigated to provide for rapid high quality assessment in this complex environment."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "TACTICAL SPACE EXPLOITATION"
                                    },
                                    "Description": {
                                        "val": "The Tactical Space Exploitation initiative explores the application of new space craft technologies on small, light-weight and low-cost satellites, to enhance naval warfighting capabilities by taking advantage of the global access, revisit and connectivity provided by orbital platforms.\n\na) Spacecraft Technology: Affordable, expendable payload and bus technologies will be developed, which will serve as building blocks for future responsive space systems: payloads, bus technologies and significant space robotic technologies that address on-orbit inspection, servicing, repair and assembly, and mission-life extension.\n\nThe following are non-inclusive examples of accomplishments and plans for projects funded in this activity:"
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.903"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Spacecraft Technology:\n\n- Furthering efforts to radically reduce thermionic cathode temperature and power by developing the capability for rapid 3D printing of complex cathode parts using the new low-temperature emitter C12A7. \n- Furthering efforts to develop and demonstrate a low power, radiation-hard micro-satellite receiver on a chip which has wide dynamic range and a flexible architecture."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.118"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Spacecraft Technology \nDevelop advanced, high-payoff technologies that will preserve, protect, and enhance space capabilities in the performance of functions that are of critical importance to Naval operations while also reducing the cost of DoD space activities.  Initiate efforts to develop the key tomographic algorithm needed to construct three-dimensional ionospheric electron density from persistent space-based stereoscopic observations, to enable significant passive reduction of Over The Horizon Radar (OTHR) registration errors. Initiate use of the new NRL Loop Heat Pipe transient numerical model and stability theory to design oscillation-free LHPs, to enable precise, reliable spacecraft thermal regulation for higher mission reliability."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "5.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "5.137"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "Tactical Space Exploitation:\nSpace Research and Spacecraft Technology: Continue development of advanced, high-payoff technologies that will preserve, protect, and enhance space capabilities in the performance of functions that are of critical importance to Navy-Marine Corps operations while also reducing the cost of DoD space activities.\nNext-Generation Sensing example:  Conduct effort to develop a single pixel camera architecture for passive microwave imaging, maintaining currently delivered spatial resolution and calibration performance while significantly reducing current aperture diameter.  \nSpacecraft Technology example: Initiate development of a new capability for local space situational awareness (SSA) with a novel system that detects and tracks objects in close proximity to a satellite that is equipped with this capability."
                                            }
                                        },
                                        "BudgetYearOneOCO": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Articles": {
                                                "val": "0"
                                            },
                                            "Text": {
                                                "val": "N\/A"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "There is no significant change from FY 2018 to FY 2019."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "This PE supports the development of technologies that enable Information Warfare including communications and information assurance capabilities to enable all-source data access, tailored dissemination of information to Command and Control (C2) and Intelligence, Surveillance and Reconnaissance (ISR) users across the network, and rapid, accurate decision making based on this information.  The operational benefits sought are increased speed of response, accuracy, and precision of command; distributed self-synchronization; flexibility and adaptability to an operational situation; and decision superiority.  \n\nSpecific examples of metrics under this PE include:\n- Increase network data rates and interoperability across heterogeneous radios; improve dynamic bandwidth management and mobile network connectivity.\n- Increase the understanding of the battlespace by the development of automated tools for extracting information from images and signals, identifying objects, determining relationships among the objects, assessing intent, and generating courses of action.\n- Improve the integration of  sensors, networks, decision aids, weapons, and supporting systems into a highly adaptive, human-centric, comprehensive maritime system.\n- Improve integrated signals electronics packages in small, light-weight, and low-cost satellites to test new concepts for global ship tracking and two-way data exfiltration."
                        }
                    }
                }
            ]
        }
    }
}