{
    "id": "2019-OfficeoftheSecretaryOfDefense-PB-0400-MJBOOK-0-0-23f77ba5a7ee5d46da452f73e47c937f8b6c2de8e28c8e762d4f2ca7e7e96ebf-31",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-OSD_B-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.zzz_unzipped-U_RDTE_MasterJustificationBook_Office_of_the_Secretary_Of_Defense_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-MASTERJUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Office of the Secretary Of Defense",
        "appropriation_code": "0400",
        "appropriation_name": "Research, Development, Test & Evaluation, Defense-Wide"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604055D8Z"
        },
        "ProgramElementTitle": {
            "val": "Operational Energy Capability Improvement"
        },
        "R1LineNumber": {
            "val": "65"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Office of the Secretary Of Defense"
        },
        "AppropriationCode": {
            "val": "0400"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Defense-Wide"
        },
        "BudgetActivityNumber": {
            "val": "3"
        },
        "BudgetActivityTitle": {
            "val": "Advanced Technology Development (ATD)"
        },
        "ProgramElementFunding": {
            "AllPriorYears": {
                "val": "224.936"
            },
            "PriorYear": {
                "val": "41.459"
            },
            "CurrentYear": {
                "val": "38.403"
            },
            "BudgetYearOne": {
                "val": "40.582"
            },
            "BudgetYearOneBase": {
                "val": "40.582"
            },
            "BudgetYearTwo": {
                "val": "40.652"
            },
            "BudgetYearThree": {
                "val": "41.387"
            },
            "BudgetYearFour": {
                "val": "42.032"
            },
            "BudgetYearFive": {
                "val": "42.803"
            },
            "CostToComplete": {
                "val": "Continuing"
            },
            "TotalCost": {
                "val": "Continuing"
            }
        },
        "ProgramElementNote": {
            "val": "None"
        },
        "ProgramElementMissionDescription": {
            "val": "The basic mission of this program element is to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments.  It contains the two projects described below:\n\nP455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects.\n\nP456, the Hybrid Energy Storage Module (HESM), co-sponsored by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the Assistant Secretary of Defense for Energy, Installations and Environment (ASD(EIE)), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, (2) increase platform ability to sustain operations during engagement, and (3) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "37.329"
                },
                "CurrentYear": {
                    "val": "38.403"
                },
                "BudgetYearOne": {
                    "val": "40.914"
                },
                "BudgetYearOneBase": {
                    "val": "40.914"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "41.459"
                },
                "CurrentYear": {
                    "val": "38.403"
                },
                "BudgetYearOne": {
                    "val": "40.582"
                },
                "BudgetYearOneBase": {
                    "val": "40.582"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "4.130"
                },
                "CurrentYear": {
                    "val": "0.000"
                },
                "BudgetYearOne": {
                    "val": "-0.332"
                },
                "BudgetYearOneBase": {
                    "val": "-0.332"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "5.000"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.823"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "FFRDC Transfer"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.047"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Economic Adjustment"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.332"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.332"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Economic adjustment directed for FY19 (EA-008 budget decision)."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "455"
                    },
                    "ProjectTitle": {
                        "val": "Operational Energy Capability Improvement"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "206.773"
                        },
                        "PriorYear": {
                            "val": "41.459"
                        },
                        "CurrentYear": {
                            "val": "38.403"
                        },
                        "BudgetYearOne": {
                            "val": "40.582"
                        },
                        "BudgetYearOneBase": {
                            "val": "40.582"
                        },
                        "BudgetYearTwo": {
                            "val": "40.652"
                        },
                        "BudgetYearThree": {
                            "val": "41.387"
                        },
                        "BudgetYearFour": {
                            "val": "42.032"
                        },
                        "BudgetYearFive": {
                            "val": "42.803"
                        },
                        "CostToComplete": {
                            "val": "Continuing"
                        },
                        "TotalCost": {
                            "val": "Continuing"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "P455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                        },
                        "ProjectMissionDescription": {
                            "val": "The basic mission of this program element is to fund innovation to improve the Department of Defense’s (DoD) operational effectiveness via targeted operational energy science and technology (S&T) investments.  \n\nP455, the Operational Energy Capability Improvement Fund (OECIF), incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovation to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "OECI"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "4.953"
                                        },
                                        "Text": {
                                            "val": "The Joint Operational Command and Control effort demonstrated the ability to pass operational energy information around the battlefield.  Initial results show the ability to manually capture some limited operational energy information and provided it to decision makers within 24 hours of data capture.  The team conducted a design update for the Asset Wireless Network (AWN) Common Communications Module, installed firmware updates and executed a contract with Penn State University for AWN support\n\nOperational Energy Watson was able to demonstrate a minimum viable product centered on AF S&T investment in Hypersonics and specifically in high-temperature materials.  OE Watson is developing a cognitive assistant that combines deep learning, quantitative analysis, and analytic wargames. Funding also allowed for adoption of a single knowledge management tool(SEMS2.0) re-purposing from SERDP\/ESTCP to OECIF.  The tool has been adapted for OECIF and the FY18 call of proposals and selection is utilizing this new capability.\n\nSpace Solar Power team held the program kickoff, discussed the application for potential users, and defined metrics of success.  Initial focus is on current solar cell technology with additional investment in perovskites.\n\nThe Ultra High Density Hybrid Energy Storage Module effort (HD HESM) is a follow-on from P456.  The team initiated contracting through the Air Force Research Lab for a new High Density System, developed cross service System Requirements (Navy, Army and AF), and initiated platform analysis for HD HESM installation and operation.\n\nOECIF continues to co-sponsor, with SERDP\/ESTCP, emerging Waste-to-Energy Technology development."
                                        }
                                    },
                                    "CurrentYear": {
                                        "Funding": {
                                            "val": "0.000"
                                        },
                                        "Text": {
                                            "val": "TMSC, FY 2013 program, transitions to Project Manager Expeditionary Energy and Sustainment Systems and submits the Standard to the Defense Standardization Program Office.  \nTwo FY 2014 analytical methods and tools programs conclude.  STORM-E will finalize EF 21 scenario development and analysis.  J-DEPLOI will complete software development into MBPS, provide joint data integration, and complete verification and testing of J-DEPLOI capabilities.    \nFY 2015 vehicle efforts enter the final year of funding. The Automation\/Smart Cruise Control program concludes convoy vehicle testing using smart cruise control.  TVEK completes baselining performance data; integration and testing of the anti-idle system (DC\/DC, inverter, motor\/generator, 6T battery, HVAC, and cabin heating); electromagnetic interference testing on TVEK electrified components; and Functional and Preliminary Design Reviews. The Thermal Barrier Coatings program completes testing multiple iterations of coated pistons and will configure the engine test cell for testing a thermocouple instrumented piston.  The M&S for Lightweighting program completes M&S for emerging novel materials. \nThe FY 2016 efforts continue. The Small Turboprop Engine Range\/Power Enhancement program completes engine testing, and the IPTE completes preliminary engine design while acquiring engine fabrication material. The Reliable, Efficient, Tactical UAS Power System program will have an engine for testing.  Hybrid Tiger completes airframe fabrication\/energy system integration for first flight; evaluates energy performance; tunes software algorithms; refines benchtop assumptions with real-world flight measurements; updates the simulation to match measurements, and informs the hybrid energy design process. The Aluminum Seawater Power program completes breadboard combustor design review and performs testing; selects product-removal hardware and tests; and selects water replenishment hardware and tests. The HTVE-UE program continues tech development including pool testing and final preparations for 1-year at-sea test, continues studies and analyses related to HTV characterization\/environmental considerations and various CONOPS. The JP-8 Based Fuel Cell Power program conducts physical integration of the JP-8 reformer and solid oxide fuel cell and all supporting hardware; and conducts the first two iterations of system level tests to shape system design.       \nThe FY 2017 efforts continue.  The OSCIPPT team completes first release of the subsystem controls, the interface description document, and the coordination control for FY2017 physical architecture. TEAPPS identifies candidate thermal management system architectures and control schemes using the validated dynamic thermal modeling toolset, tests the thermal performance of a single-diode advanced thermal packaging module with phase change material, and completes fabrication of the first of two prototype thermal management systems for demonstration. PTROL team integrates and test systems for two FY 2018 demonstrations: laser power sent over optical fiber to an Unmanned Underwater Vehicle (UUV), and greater than 500W of power transmitted over 300m to a stationary receiver.  The W-Band Power Beaming team completes high power testing of samples of promising ceramic absorber materials developed in the first two years; completes modeling and fabrication of the Sterling engine heat pipe; and models collector antenna, integrated absorber, and heat transfer interface. SSP designs models electromagnetic antennas and manifolding; completes efficiency and sensitivity simulations of discrete rectifier; models rf to dc sensitivity, harvesting beam width, and interaction between rectifier loading and Rectenna. \nFY 2018 will be 1-year studies that illuminate S&T Gaps for Operational Energy in the near-, mid-, and far-term.  These efforts are expected to be complete and shape and influence the next DoD OE Strategy."
                                        }
                                    }
                                }
                            ]
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Operational Energy Capability Improvement Fund"
                                    },
                                    "Description": {
                                        "val": "The basic mission of the OECIF is to fund innovation that will improve DoD operational effectiveness via targeted S&T investments. As Defense-Wide funding, it incentivizes S&T to promote long term change in DoD capabilities so they are better aligned with the Operational Energy Strategy.  OECIF generally fosters innovation to improve operational energy performance and has two key mission aspects.  First, to develop operational energy technologies and practices that will improve DoD military capabilities and possibly reduce costs.  Second, to establish within the military Services institutional momentum to continue those innovations.  OECIF funds serve as “seed money” to start or consolidate promising operational energy innovations to be sustained by the Services; accordingly, OECIF generally emphasizes supporting or establishing programs, rather than one-off projects."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "36.506"
                                            },
                                            "Text": {
                                                "val": "The TMSC program, which began in FY13, will still be active. TMSC will test, validate, and submit the draft Tactical Microgrid Standards for DoD and Service concurrence.\n      \nThe analytical methods programs, which began in FY14, will continue.  The STORM-E effort will advance the EF 21 scenario development and analysis capabilities, identify energy-based risk to operations, examine mitigation solutions, and shape plans and programs.  OEATF will complete the FCPM V&V; complete analysis of the second of three scenarios; complete scenario enhancements for the third of three scenarios; develop an IWARS technical report addressing OE; and represent aerial resupply capability within SoSAT.  J-DEPLOI plans to continue adaptation and development of Group W's fuel planning tool, continue executing the plan for integration with MBPS, and begin verification and testing of the tool's first incremental capabilities.  MEAM plans to assess future force structure and logistics force implications, investigate incorporating Joint and Coalition operations, define warfighting operational effectiveness tactical decision aid requirements, and develop a production plan for resulting tools and methods.  CAMEL will continue analyzing concepts of operations associated with adaptive basing strategies within A2AD environments and the impact to operational energy within airlift and aerial refueling missions; explore overall costs associated with flex basing; and continue enhancements to the modeling, simulation and analysis tool set.\n\nThe FY15 vehicles program will continue.  The Thermally Efficient Cylinders program will conduct single-cylinder engine testing with the first generation coating; the coating and piston optimization will be based on feedback from testing and modeling.  The TVEK project will complete CAT 15 HEMTT A4 engine fuel map testing, test the baseline HEMTT vehicle's auxiliary systems, complete Analysis of Alternatives (AoA) of auxiliary systems for TVEK electrified component selections, develop M&S controls and software for the TVEK supervisory control system, initiate procurement of optimized TVEK components for testing in a system integration lab (SIL) at TARDEC, and conduct System Functional Review and Preliminary Design Review as part of the system engineering process.  The Automation\/Smart Cruise Control program will enter Phase II and conduct convoy vehicle simulations.  The M&S for Vehicle Light-Weighting program will repeat the weight optimization process with various other target components and compare the updated optimized system model with the baseline model.\n\nThe programs begun in FY16 will continue to ramp up during this fiscal year.  The Reliable, Efficient, Tactical UAS Power System program will build the Great Horned Owl engine, which will lead to a runnable second generation engine.  The Hybrid Tiger team will complete vehicle detailed analysis and purchase new wing tooling to build an integrated solar wing, combine software from multiple organizations, and complete end-to-end bench testing in preparation for maiden flight.  The HTVE-UE program will award a small business performer contract and initiate base tasks related to the detailed design, component fabrication and breadboard assembly, and test planning; and expand studies and analyses related to Forward Deployed Energy and Communications Outpost  (FDECO) interoperability, HTV characterization\/environmental considerations, and various CONOPS.  The Aluminum Seawater Power program will begin preliminary component fabrication of hardware and select test equipment.  The Small Turboprop Engine Range\/Power Enhancement program will complete the OBA, complete the engine requirements document and get Air Force concurrence, and will start engine preliminary design.  The JP-8 Based Fuel Cell Power Program will conduct JP-8 reformer maturation, increase the technology readiness level of the solid oxide fuel cell being used in the system, and begin the system level controls strategy and initial integration plan.  \n \nNew programs starting in FY17 may continue the shift within OECIF toward a greater emphasis on fuel consuming mobile platforms for the Pacific.  The focus of these new FY17 programs is likely to reflect input from the Services, various research Communities of Interest within DoD, such as Energy and Power, Ground and Sea Platforms, and Air Platforms, and any developing gaps or opportunities identified by ODASD(OE)."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "38.403"
                                            },
                                            "Text": {
                                                "val": "The TMSC program, which began in FY13, will still be active.  TMSC will incorporate DoD and Service comments and publish the final draft for DoD approval.\n\nJ-DEPLOI, which began in FY14, will still be active.  J-DEPLOI plans to complete software development and testing, MBPS integration, and plan transition of the program to MPBS management and PACOM users.\n\nThe FY15 vehicles program will continue.  The Thermally Efficient Cylinders program will test the single-cylinder engine with an optimized coating and piston and will begin laboratory preparations for multi-cylinder testing.  The TVEK program will complete the SIL testing with all sub-systems integrated into the vehicle, evaluate the sub-system fuel savings and M&S results from the Matlab Simulink and the Army Joint Operational Energy Initiative (JOEI) model to determine optimal kit architecture, start integration of kits in the HEMTT and LVSR vehicles, initiate electromagnetic interference testing of sub-systems, and develop vehicle test plans and agreements with testing facilities.  The Automation\/Smart Cruise Control program will complete Phase II by conducting convoy testing, deliver a final report, and provide the developed technology.  The M&S for Light-Weighting program will incorporate novel materials for analysis and compare with the baseline system model.\n\nThe FY16 unmanned vehicles programs will continue.  The Reliable, Efficient, Tactical UAS Power System program will test the second generation engine for power output, specific fuel consumption, altitude, and product reliability.  The Hybrid Tiger team will begin the flight testing phase validating the performance models and tuning flight controller gains, and refine software to emphasize optimal hybrid mode transitions and increased autonomy for soaring.  The HTVE-UE program will continue base tasks related to component fabrication and breadboard assembly and testing, execute at-sea test planning, and perform initial system deployment; and continue studies and analyses related to FDECO interoperability, HTV characterization\/environmental considerations, and CONOPS.  The Aluminum Seawater Power program will go through the next round of component development and testing, and begin integration testing.  The Small Turboprop Engine Range\/Power Enhancement program will begin engine detailed design and acquire long lead materials for engine fabrication.  The JP-8 Based Fuel Cell Power program will conduct physical integration of the JP-8 reformer and solid oxide fuel cell and all supporting hardware, and conduct the first two iterations of system level testing to determine weak parts of the system design.   \n\nThe programs begun in FY17 will continue to ramp up during this fiscal year. \n\nNew programs will start in FY18.  The focus of these new programs is likely to reflect input from the Services, various research Communities of Interest within DoD, such as Energy and Power, Ground and Sea Platforms, and Air Platforms, and any developing gaps or opportunities identified by ODASD(OE)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "40.582"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "40.582"
                                            },
                                            "Text": {
                                                "val": "The FY 2016 programs will reach their final year of OECIF funding.  The IPTE program will complete detailed design, initiate hardware manufacturing for the engine demonstrators, and complete a combustor rig test.  The Hybrid Tiger program will integrate energy and software systems to enable 24 hour and max endurance (100+ hour) demonstration flights; document performance, technical details, additional results, and paths forward; establish notional payload integration to determine mission utility and highlight transition path.  The Aluminum Seawater Power program will go through breadboard hot-component test readiness review and testing and complete the breadboard full-system test readiness review and testing.  The HTVE-UE program will conclude the at-sea testing, retrieve the device and analyze results while completing CONOPS and other studies and analyses as part of planning for transfer to other Navy S&T programs, which can further develop the technology for potential use by programs of record.  The JP-8 Based Fuel Cell Power program will conduct the third iteration of the system integration with finalized control strategy and balance plant hardware and begin preparations on the vehicle for installation. \n\t\t\t\t\t\t\t\t\nThe FY 2017 programs will continue.  The OSCIPPT team will complete the second major release of the subsystem controls, the interface description document, and coordination control for the physical architecture defined in FY 2017; demonstrate fuel savings improvements on aircraft and ship platforms; and demonstrate improved response times within the power and thermal systems enabling use of future high power sensors and weapons on aircraft.  The TEAPPS team will complete testing and modeling the first prototype thermal management system, design a sub-scale diode thermal management device with phase change materials, and identify the interfaces necessary to integrate an advanced thermal management system onto a Naval surface combatant.  The PTROL team will further build upon the technology to apply laser power beaming to power remotely a rotary wing unmanned air vehicle at greater range than in previous demonstrations as an interim step towards a broadly-applicable and transition-able final capability to be delivered in FY 2021.  The W-Band Power Beaming team will integrate the millimeter wave absorber and heat transfer assembly with the heat pipe and Stirling engine; perform short-range power beaming testing; transfer millimeter wave power from the gyrotron enclosure to the laboratory enclosure via existing waveguide hardware and beamed at the absorber using a short-range horn and mirror array."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY18-FY19 Increase in funding ($2.179)\nTwo of the FY17 congressional add programs are able to continue.  Space Solar and HD HESM. SSP will fabricate and demonstrate the Rectenna Array (diodes and manifolded antenna) - the goal is to show energy harvesting with a 1 uW per square cm incipient radio frequency. Additionally, teaming with NASA for prior S&T investment capture and work with NREL on space solar cells will continue.  HD HESM will execute hardware fabrication and assembly, complete initial factory acceptance testing, initiate HESM Test Program at the Air Force Research Lab, the Army Tank Automotive Research, Development and Engineering Center, and perform Navy platform analysis."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "456"
                    },
                    "ProjectTitle": {
                        "val": "Hybrid Energy Storage Module (HESM)"
                    },
                    "SpecialProject": {
                        "val": "0"
                    },
                    "ProjectFunding": {
                        "AllPriorYears": {
                            "val": "18.163"
                        },
                        "PriorYear": {
                            "val": "0.000"
                        },
                        "CurrentYear": {
                            "val": "0.000"
                        },
                        "BudgetYearOne": {
                            "val": "0.000"
                        },
                        "BudgetYearOneBase": {
                            "val": "0.000"
                        },
                        "BudgetYearTwo": {
                            "val": "0.000"
                        },
                        "BudgetYearThree": {
                            "val": "0.000"
                        },
                        "BudgetYearFour": {
                            "val": "0.000"
                        },
                        "BudgetYearFive": {
                            "val": "0.000"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "P456, the Hybrid Energy Storage Module (HESM), co-sponsored by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the Assistant Secretary of Defense for Energy, Installations and Environment (ASD(EIE)), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships.  The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, (2) increase platform ability to sustain operations during engagement, and (3) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Hybrid Energy Storage Module (HESM)"
                                    },
                                    "Description": {
                                        "val": "Co-sponsored by the Assistant Secretary of Defense for Research and Engineering (ASD(R&E)) and the Assistant Secretary of Defense for Energy, Installations and Environment (ASD(EIE)), develops advanced energy storage technologies to maximize performance and reliability, and enable future high power weapons and sensor systems on legacy and next generation vehicles, aircraft and ships. The goals of HESM are to (1) demonstrate energy storage systems with high power\/energy densities, scalable to all power levels, that reduce total logistics demand, (2) increase platform ability to sustain operations during engagement, and (3) reduce maintenance. Once demonstration is complete, this technology will be sustained by the Services and will be used to extend the operational performance and safety for these applications beyond the hybrid storage module baseline design configuration. This program is closely coordinated with the Advanced Management and Protection of Energy-storage Devices (AMPED) program of the Department of Energy's (DOE) Advanced Research Projects Agency - Energy (ARPA-E)."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "No longer funded"
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Additional capability funded with FY17 Congressional Add money in P455 will continue."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "0.000"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "0.000"
                                            },
                                            "Text": {
                                                "val": "Additional capability funded with FY17 Congressional Add money in P455 will continue."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "None"
                        }
                    }
                }
            ]
        }
    }
}