{
    "id": "2019-Army-PB-2040-JBOOK-7cc439c58b35d6d5df212354775b45840c7a8a4f08bb2e905cf035f34ec9d29d-21",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA6-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0605898A"
        },
        "ProgramElementTitle": {
            "val": "Management Headquarters (Rsch and Dev)"
        },
        "R1LineNumber": {
            "val": "173"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "6"
        },
        "BudgetActivityTitle": {
            "val": "RDT&E Management Support"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "49.287"
            },
            "CurrentYear": {
                "val": "54.679"
            },
            "BudgetYearOne": {
                "val": "54.145"
            },
            "BudgetYearOneBase": {
                "val": "54.145"
            },
            "BudgetYearTwo": {
                "val": "54.951"
            },
            "BudgetYearThree": {
                "val": "55.961"
            },
            "BudgetYearFour": {
                "val": "56.809"
            },
            "BudgetYearFive": {
                "val": "46.603"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "372.435"
            }
        },
        "ProgramElementNote": {
            "val": "Project FJ2 is a New Start for Fiscal Year 2019."
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the United States (U.S.) Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground (APG), Maryland. ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, and assessments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis Program Element provides the non-Army Management Headquarters Activity (non-AMHA) management and administrative support that enables the U.S. Army Research Institute for the Behavioral and Social Sciences (ARI) to accomplish its research mission and includes personnel\/manpower execution and oversight. ARI's behavioral and social science research provides effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints. ARI is the only Science and Technology (S&T) laboratory that conducts research to enhance the Soldier lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion). In addition, this Program Element includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range:  Aberdeen Test Center (ATC) at APG, Maryland; West Desert Test Center (WDTC) at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG) at Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC) at Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) at Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of ~ 2,700 developmental tests; approximately ~60 operational events; and more than ~840 Evaluation and Safety documents supporting acquisition programs.\n\nThis PE does not finance test facility operations, test instrumentation or test equipment."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "49.885"
                },
                "CurrentYear": {
                    "val": "54.679"
                },
                "BudgetYearOne": {
                    "val": "54.197"
                },
                "BudgetYearOneBase": {
                    "val": "54.197"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "49.287"
                },
                "CurrentYear": {
                    "val": "54.679"
                },
                "BudgetYearOne": {
                    "val": "54.145"
                },
                "BudgetYearOneBase": {
                    "val": "54.145"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "-0.598"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-0.052"
                },
                "BudgetYearOneBase": {
                    "val": "-0.052"
                }
            },
            "AdjustmentDetails": {
                "CongressionalGeneralReductions": {
                    "PriorYear": {
                        "val": "-0.008"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-0.59"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-0.052"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-0.052"
                                }
                            }
                        }
                    ]
                }
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FJ2"
                    },
                    "ProjectTitle": {
                        "val": "Army SHARP RDTE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "1.583"
                        },
                        "BudgetYearOneBase": {
                            "val": "1.583"
                        },
                        "BudgetYearTwo": {
                            "val": "1.582"
                        },
                        "BudgetYearThree": {
                            "val": "1.581"
                        },
                        "BudgetYearFour": {
                            "val": "1.581"
                        },
                        "BudgetYearFive": {
                            "val": "1.581"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "7.908"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project FJ2 is a New Start for Fiscal Year 2019."
                        },
                        "ProjectMissionDescription": {
                            "val": "This Project will conduct studies of sexual harassment and sexual assault response and prevention in support of National Defense Authorization Act (NDAA) requirements (FY12 S585; FY14 S1725c, FY14 S1733, FY16 S538) and the Chief of Staff of the Army's Readiness priorities related to caring for Soldiers and their families. Conducting studies to meet these requirements is a necessary step to ensure that training, prevention and outreach activities are having the desired effect and impact on the Total Force. Studies will focus on professionalizing the Sexual Harassment \/ Assault Response and Prevention (SHARP) workforce (i.e., identifying the critical capabilities needed for positions of trust), building climates for dignity and respect, updating prevention and outreach materials and resources (e.g., training), developing effective and adaptive outreach resources, developing efforts to improve Department of Defense (DoD) prevention and response for male Service members, and assessing the efficacy of SHARP programs and tools."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "SHARP RDTE Studies"
                                    },
                                    "Description": {
                                        "val": "Studies will focus on professionalizing the SHARP workforce (i.e., identifying the critical capabilities needed for positions of trust), building climates for dignity and respect, updating prevention and outreach materials and resources (e.g., training), developing effective and adaptive outreach resources, developing efforts to improve DoD prevention and response for male Service members, and assessing the efficacy of SHARP programs and tools."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.583"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.583"
                                            },
                                            "Text": {
                                                "val": "This requirement funds contracts that cover critical research needs of the Army SHARP Office and the greater Army with a specific focus on prevention.  Funding covers costs involved with conducting job analyses for SHARP positions, the creation of competency models for positions of trust, hiring subject matter experts to inform prevention research efforts (e.g., Consortium Research Fellows Program), assessing the efficacy of training\/prevention\/outreach efforts related to the sexual assault of male service members, providing research-based recommendations to installations executing prevention programs, and working with universities and industry to conduct research and present findings with SHARP stakeholders, Service partners, and the broader Army and DoD."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Project FJ2 is a new Start for Fiscal Year 2019"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "M65"
                    },
                    "ProjectTitle": {
                        "val": "Army Test and Evaluation Command"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "49.287"
                        },
                        "CurrentYear": {
                            "val": "50.802"
                        },
                        "BudgetYearOne": {
                            "val": "48.624"
                        },
                        "BudgetYearOneBase": {
                            "val": "48.624"
                        },
                        "BudgetYearTwo": {
                            "val": "49.379"
                        },
                        "BudgetYearThree": {
                            "val": "50.304"
                        },
                        "BudgetYearFour": {
                            "val": "51.067"
                        },
                        "BudgetYearFive": {
                            "val": "40.778"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "340.241"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project provides funding for the salaries and related personnel benefits for the authorized civilian personnel positions that provide for the management functions and the technical direction of the United States (U.S.) Army Test and Evaluation Command (ATEC) mission located at Aberdeen Proving Ground (APG), Maryland. ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, and assessments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter. \n\nThis Project includes staff\/management functions of resource management, human resources, safety, security, environmental, strategic planning and information\/technology support for command-wide databases in support of the developmental, evaluation and operational test mission with technical direction to the Army Evaluation Center (AEC), Aberdeen Proving Ground, Maryland; to the Operational Test Command (OTC), Fort Hood, Texas which consists of three forward Test Directorates (Airborne and Special Operations Test Directorate, Fort Bragg, North Carolina; Air Defense Artillery Test Directorate, Fort Bliss, Texas; and the Fires Test Directorate, Fort Sill, Oklahoma) together with four other Test Directorates (Aviation; Maneuver; Mission Command; Maneuver Support and Sustainment) at Ft Hood, Texas; and to the seven Major Range and Test Facility Base (MRTFBs) and one non-MRTFB test range: Aberdeen Test Center (ATC) at APG, Maryland; West Desert Test Center (WDTC) at Dugway Proving Ground (DPG), Utah; Electronic Proving Ground (EPG) at Fort Huachuca, Arizona; White Sands Test Center (WSTC) at White Sands Missile Range (WSMR), New Mexico; Yuma Test Center (YTC) at Yuma Proving Ground (YPG), Arizona; Cold Regions Test Center (CRTC) at Fort Greely, Alaska; and Tropic Regions Test Center (TRTC) at various locations, as well as for Redstone Test Center (RTC) at Redstone Arsenal, Alabama. This is the operating budget for ATEC Headquarters, which provides technical direction for the annual execution of ~ 2,700 developmental tests; approximately ~60 operational events; and more than ~840 Evaluation and Safety documents supporting acquisition programs."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Army Test and Evaluation Command"
                                    },
                                    "Description": {
                                        "val": "Civilian labor and other support required to manage and administer the Army test and evaluation mission at ATEC. ATEC plans, conducts and integrates developmental testing, independent operational testing, independent evaluations, assessments and experiments to provide essential information to Soldiers and acquisition decision makers supporting the American Warfighter."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "49.287"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "50.802"
                                            },
                                            "Text": {
                                                "val": "Funds authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "48.624"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "48.624"
                                            },
                                            "Text": {
                                                "val": "Will fund authorized civilian salaries, associated expenses (supplies, equipment, travel, etc.) and other support required to manage and administer the Army test and evaluation mission at ATEC."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Continuity of effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XW7"
                    },
                    "ProjectTitle": {
                        "val": "Command HQ - ARI"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "3.877"
                        },
                        "BudgetYearOne": {
                            "val": "3.938"
                        },
                        "BudgetYearOneBase": {
                            "val": "3.938"
                        },
                        "BudgetYearTwo": {
                            "val": "3.99"
                        },
                        "BudgetYearThree": {
                            "val": "4.076"
                        },
                        "BudgetYearFour": {
                            "val": "4.161"
                        },
                        "BudgetYearFive": {
                            "val": "4.244"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "24.286"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "The U.S. Army Research Institute for the Behavioral and Social Sciences (ARI) is the only Science and Technology (S&T) laboratory that conducts research to enhance the Soldier lifecycle (e.g., selection, assignment, training, leader development) and human relations (e.g., culture of dignity, respect, and inclusion). This Project supports the non-Army Management Headquarters Activity (non-AMHA) management and administrative functions to enable ARI to accomplish its research mission and includes activities such as budget execution, procurement oversight, RDT&E program planning and evaluation, management control, security\/safety, logistics, information technology, and personnel\/manpower execution and oversight. ARI's behavioral and social science research provides effective non-materiel solutions to help the Army adjust to changes in force size and structure, a variety of mission demands and contexts, challenges in human relations, and budgetary constraints."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Civilian Pay"
                                    },
                                    "Description": {
                                        "val": "This effort will provide personnel for management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance Research and Development (R&D) program."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.877"
                                            },
                                            "Text": {
                                                "val": "Provides personnel for management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.938"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.938"
                                            },
                                            "Text": {
                                                "val": "Will provide personnel for management, administrative, personnel, budget, and support functions at a level consistent with Army and mission requirements to meet the needs of ARI as an Army Laboratory conducting the Army's personnel, training, leader development, and organizational performance R&D program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Investment supports S&T strategy and senior leader priorities"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}