{
    "id": "2019-Army-PB-2040-JBOOK-3be08eef265cbf3fa6ee9f25bc102fc8e7dd36b72efeeb78b5538ece49603c5b-8",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA5B-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0604852A"
        },
        "ProgramElementTitle": {
            "val": "Suite of Vehicle Protection Systems - EMD"
        },
        "R1LineNumber": {
            "val": "117"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "5"
        },
        "BudgetActivityTitle": {
            "val": "System Development & Demonstration (SDD)"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "0"
            },
            "CurrentYear": {
                "val": "98.6"
            },
            "BudgetYearOne": {
                "val": "69.204"
            },
            "BudgetYearOneBase": {
                "val": "69.204"
            },
            "BudgetYearTwo": {
                "val": "47.706"
            },
            "BudgetYearThree": {
                "val": "93.852"
            },
            "BudgetYearFour": {
                "val": "97.634"
            },
            "BudgetYearFive": {
                "val": "120.682"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "527.678"
            }
        },
        "ProgramElementNote": {
            "val": "Project XU9 (Active Protection System) is a continuation of efforts previously executed under PE 0203735A - Combat Vehicle Improvement Programs."
        },
        "ProgramElementMissionDescription": {
            "val": "Current ground combat vehicle platforms and tactical wheeled vehicles within Army Brigade Combat Teams (BCTs) lack the ability to effectively detect, track, divert, disrupt, neutralize, or destroy incoming direct or indirect fired threat munitions.  Current solutions to defeat these threats, Explosive Reactive Armor (ERA) and Slat armor, do not provide preemptive or active protection and impose secondary blast hazards to crew, dismounted soldiers, and adjacent vehicles and equipment.  The Suite of Vehicle Protection Systems - EMD Program Element (0604852A) will develop and mature solutions to increase the protection of the Army's ground systems from both current and next generation direct or indirect fired threat munitions.  \n\nThe Active Protection System Project (XU9) will install and characterize Non-Developmental Item (NDI) Active Protection Systems on Abrams, Bradley, and Stryker demonstrator vehicles.  The Active Protection System effort will assess the maturity, performance, and integration risk of NDI Active Protection Systems, develop and refine Abrams, Bradley, and Stryker Active Protection System installation kit designs, and build prototypes necessary to conduct performance and safety testing to obtain an Active Protection System Urgent Materiel Release (UMR).  The Active Protection System NDI effort will also serve to inform the Vehicle Protection Suite Analysis of Alternatives (AoA).\n\nThe Vehicle Protection Suite (VPS) Project (FE8) will design, mature, and evaluate combinations of active, reactive, and passive solutions and leverage both Horizontal Technology Integration (HTI) principles and the Army's Modular Active Protection System (MAPS) to develop tailored vehicle Survivability Sets that will mitigate existing protection gaps, allow for future technology insertion to meet evolving threats, and minimize the impact to the current capabilities hosted on Army ground system platforms."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "98.6"
                },
                "BudgetYearOne": {
                    "val": "28.9"
                },
                "BudgetYearOneBase": {
                    "val": "28.9"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "98.6"
                },
                "BudgetYearOne": {
                    "val": "69.204"
                },
                "BudgetYearOneBase": {
                    "val": "69.204"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "0"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "40.304"
                },
                "BudgetYearOneBase": {
                    "val": "40.304"
                }
            },
            "AdjustmentDetails": {
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Reimbursable to Direct funded Salaries"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-1.996"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-1.996"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "Bradley and Stryker Continued Characterization Effort"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "42.3"
                                },
                                "BudgetYearOneBase": {
                                    "val": "42.3"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "- Reduction of funding to move salaries from program line (reimbursable) to be funded direct in OMA 43510700.\n- Increase of $42.300 million for continuation of Bradley and Stryker Non-Developmental Item Active Protection System."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "FE8"
                    },
                    "ProjectTitle": {
                        "val": "Vehicle Protection Suite"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "14.8"
                        },
                        "BudgetYearOne": {
                            "val": "26.904"
                        },
                        "BudgetYearOneBase": {
                            "val": "26.904"
                        },
                        "BudgetYearTwo": {
                            "val": "47.706"
                        },
                        "BudgetYearThree": {
                            "val": "93.852"
                        },
                        "BudgetYearFour": {
                            "val": "97.634"
                        },
                        "BudgetYearFive": {
                            "val": "120.682"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "401.578"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "Current ground combat vehicle platforms and tactical wheeled vehicles within Army Brigade Combat Teams (BCTs) lack the ability to effectively detect, track, divert, disrupt, neutralize, or destroy incoming direct or indirect fired threat munitions.  Current solutions to defeat these threats, Explosive Reactive Armor (ERA) and Slat armor, do not provide preemptive or active protection and impose secondary blast hazards to crew, dismounted soldiers, and adjacent vehicles and equipment.\n\nVehicle Protection Suite (VPS) will design, mature, and evaluate combinations of active, reactive, and passive solutions and leverage both Horizontal Technology Integration (HTI) principles and the Army's Modular Active Protection System (MAPS) to develop tailored vehicle Survivability Sets that will mitigate existing protection gaps, allow for future technology insertion to meet evolving threats, and minimize the impact to the current capabilities hosted on Army ground system platforms."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Maturation and Characterization of MAPS Compliant\/Non-developmental Item (NDI) Capabilities"
                                    },
                                    "Description": {
                                        "val": "Funding  provided supports MAPS maturation efforts."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "8.2"
                                            },
                                            "Text": {
                                                "val": "Maturation and characterization of MAPS compliant\/NDI capabilities (Hardware, Software, Interfaces, etc.). Results will inform VPS Analysis of Alternatives (AoA)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "11.257"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "11.257"
                                            },
                                            "Text": {
                                                "val": "Continues maturation and characterization of MAPS compliant\/NDI capabilities (Hardware, Software, Interfaces, etc.). Results will inform VPS Analysis of Alternatives (AoA)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 supports an increased level of safety and survivability characterization testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "VPS - Analysis of Alternatives (AoA)"
                                    },
                                    "Description": {
                                        "val": "Funding provided support VPS Analysis of Alternatives (AoA) ."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.05"
                                            },
                                            "Text": {
                                                "val": "Perform Analysis of Alternatives (AoA) of both existing and developmental active, reactive, and passive protection solutions.  The VPS AoA will assess the cost, maturity, complexity, performance, and physical properties of alternative survivability sets to determine the optimal application of VPS into to the Army's ground platforms."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.86"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.86"
                                            },
                                            "Text": {
                                                "val": "Continuing Analysis of Alternatives (AoA) of both existing and developmental active, reactive, and passive protection solutions.  The VPS AoA will assess the cost, maturity, complexity, performance, and physical properties of alternative survivability sets to determine the optimal application of VPS into to the Army's ground platforms."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2018 plan supports the initial 9 months of effort required to execute the VPS AoA.  FY 2019 plan supports the final 8 months of effort required to complete the VPS AoA."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Source Selection Evaluation Board"
                                    },
                                    "Description": {
                                        "val": "Funding provided support VPS Source Selection Board (SSEB) efforts"
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.08"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.08"
                                            },
                                            "Text": {
                                                "val": "The VPS SSEB will evaluate vendor(s) to develop MAPS-compliant VPS survivability sets for integration or installation on selected platforms across the vehicle fleet."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 plan includes initiation of the VPS Source Selection Evaluation Boards (SSEB)."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Vehicle Protection Suite Government Engineering and Program Management"
                                    },
                                    "Description": {
                                        "val": "Funding provided support government management support for VPS,  MAPS oversight, and SSEB preparation"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.35"
                                            },
                                            "Text": {
                                                "val": "Government program management support (labor, travel, training, supplies, and equipment) to support VPS program planning, to include the oversight of MAPS characterization, the VPS AoA, and preparation for source selection of vendor(s) to develop MAPS-compliant VPS survivability sets."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.707"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.707"
                                            },
                                            "Text": {
                                                "val": "Continuing government program management support (labor, travel, training, supplies, and equipment) to support VPS program planning, to include the oversight of MAPS characterization."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "VPS program initiation in FY 2018 reflects partial year of program oversight.  FY2019 reflective of a full year of program oversight."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "MAPS Controller Characterization - Test Support"
                                    },
                                    "Description": {
                                        "val": "Funding provided support MAPS test support"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.2"
                                            },
                                            "Text": {
                                                "val": "Test planning support in preparation for  FY19 characterization of the MAPS controller"
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to completion of the characterization test planning effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "AcquisitionStrategy": {
                            "val": "In FY 2018, the VPS program will initiate characterization of the MAPS compliant\/NDI capabilities (Hardware, Software, Interfaces, etc.) to inform the VPS Analysis of Alternatives (AoA). The VPS AoA will assess the cost, maturity, complexity, performance and physical properties of alternative survivability sets to determine the optimal application of VPS into the Army's ground platforms. A. Source Selection Evaluation Boards (SSEB) will be initiated in FY19 to select vendor(s) to develop MAPS-compliant VPS survivability sets for integration or installation on selected platforms across the vehicle fleet. The VPS platform integration contracts are planned for award in the first quarter of FY 2020."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Management Services"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Vehicle Protection Suite Program Management"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM Warren, Michigan"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Various"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "2.35"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.707"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.707"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "28.196"
                                                    },
                                                    "TotalCost": {
                                                        "val": "37.253"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Maturation and Characterization of MAPS Compliant\/Non-developmental Item (NDI) Capabilities"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various TACOM Warren"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "8.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.257"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.257"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "19.457"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Vehicle Protection Suite Analysis of Alternatives (AoA)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TACOM Warren Michigan"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.05"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.86"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.86"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.910"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "VPS Source Selection Evaluation Board"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "TACOM Warren Michigan"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "6.08"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "6.08"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-12"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "6.080"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "Remarks": {
                                        "val": "N\/A"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "MAPS enabled softkill\/hardkill characterization planning"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "TACOM"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "1.2"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-08"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "Continuing"
                                                    },
                                                    "TotalCost": {
                                                        "val": "Continuing"
                                                    },
                                                    "TargetValue": {
                                                        "val": "Continuing"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_FE8.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Characterization of MAPS with Softkill\/Hardkill Solutions"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "VPS NDI Capability Install\/Characterization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Protection Suite (VPS) Analysis of Alternatives (AoA)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Protection Suite (VPS) Source Selection Evaluation Boards (SSEB)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Protection Suite (VPS) Milestone B"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Protection Suite (VPS) Development Contract Awards"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Protection Suite (VPS) MAPS Development\/Maturation"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2021"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Vehicle Protection Suite (VPS) Platform Integration"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2025"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "XU9"
                    },
                    "ProjectTitle": {
                        "val": "Active Protection System"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "0"
                        },
                        "CurrentYear": {
                            "val": "83.8"
                        },
                        "BudgetYearOne": {
                            "val": "42.3"
                        },
                        "BudgetYearOneBase": {
                            "val": "42.3"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "126.100"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Project XU9 (Active Protection System) is a continuation of efforts previously executed under PE 0203735A - Combat Vehicle Improvement Programs."
                        },
                        "ProjectMissionDescription": {
                            "val": "The Active Protection System effort will install and characterize Non-Developmental Item (NDI) Active Protection Systems on Abrams, Bradley, and Stryker demonstrator vehicles.  The Active Protection System effort will assess the maturity, performance, and integration risk of NDI Active Protection Systems, develop and refine Abrams, Bradley, and Stryker Active Protection System installation kit designs, and build prototypes necessary to conduct performance and safety testing to obtain an Active Protection System Urgent Materiel Release (UMR).  The Active Protection System NDI effort will also serve to inform the Vehicle Protection Suite Analysis of Alternatives (AoA)."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Active Protection System (APS) Installation Kit Refinement and System Test - Abrams"
                                    },
                                    "Description": {
                                        "val": "Funding provided support APS integration and Test support for Abrams"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "36.8"
                                            },
                                            "Text": {
                                                "val": "Engineering, logistics, and program management to mature the Abrams APS integration kit design, build Abrams APS prototypes, and execute system performance and safety testing necessary to obtain an Abrams APS Urgent Materiel Release (UMR)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "At this time there is no FY 2019 requirement for Abrams characterization testing."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System (APS) Installation Kit Refinement and System Test - Bradley"
                                    },
                                    "Description": {
                                        "val": "Funding provided support APS integration and Test support for Bradley"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "30"
                                            },
                                            "Text": {
                                                "val": "Engineering, logistics, and program management to mature the Bradley APS integration kit design, develop software releases across Bradley vehicle variants to operate the APS, and execute contractor testing of the Vehicle Software Version Updates prior to the execution of system performance and safety testing necessary to obtain a Bradley APS Urgent Material Release (UMR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "26"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "26"
                                            },
                                            "Text": {
                                                "val": "Continue engineering, logistics, and program management to mature the Bradley Active Protection System (APS) integration kit design, develop software releases across Bradley vehicle variants to operate the APS, and execute contractor testing of the vehicle software version updates prior to the execution of system performance and safety testing necessary to obtain a Bradley APS Urgent Material Release (UMR)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 effort for characterization testing and initiation of the development of logistics products necessary for UMR will be reduced from FY 2018."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Active Protection System (APS) Installation Kit Refinement and System Test - Stryker"
                                    },
                                    "Description": {
                                        "val": "Funding provided support APS integration and Test support for Stryker"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "17"
                                            },
                                            "Text": {
                                                "val": "Engineering, logistics, and program management to mature the Stryker APS integration kit design, build Stryker APS prototypes, and execute system performance and safety testing necessary to obtain a Stryker APS Urgent Materiel Release (UMR)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "16.3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "16.3"
                                            },
                                            "Text": {
                                                "val": "Continue engineering, logistics, and program management to mature the Stryker APS integration kit design, build Stryker APS prototypes, and execute system performance and safety testing necessary to obtain a Stryker APS Urgent Materiel Release (UMR)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "FY 2019 effort for characterization testing and initiation of the development of logistics products necessary for UMR will be reduced from FY 2018."
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryList": {
                            "OtherProgramFundingSummary": [
                                {
                                    "LineItem": {
                                        "val": "GA0700"
                                    },
                                    "Title": {
                                        "val": "Abrams Tank (MOD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "492.044"
                                        },
                                        "CurrentYear": {
                                            "val": "387.526"
                                        },
                                        "BudgetYearOne": {
                                            "val": "961.6"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "927.6"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "34"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "284.209"
                                        },
                                        "BudgetYearThree": {
                                            "val": "289.323"
                                        },
                                        "BudgetYearFour": {
                                            "val": "269.175"
                                        },
                                        "BudgetYearFive": {
                                            "val": "286.432"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "GZ2400"
                                    },
                                    "Title": {
                                        "val": "Bradley Program (MOD)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "265.333"
                                        },
                                        "CurrentYear": {
                                            "val": "474.851"
                                        },
                                        "BudgetYearOne": {
                                            "val": "675.424"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "625.424"
                                        },
                                        "BudgetYearOneOCO": {
                                            "val": "50"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "637.19"
                                        },
                                        "BudgetYearThree": {
                                            "val": "663.46"
                                        },
                                        "BudgetYearFour": {
                                            "val": "650.662"
                                        },
                                        "BudgetYearFive": {
                                            "val": "840.733"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                },
                                {
                                    "LineItem": {
                                        "val": "GM0100"
                                    },
                                    "Title": {
                                        "val": "Stryker (Mod)"
                                    },
                                    "Funding": {
                                        "PriorYear": {
                                            "val": "82.681"
                                        },
                                        "CurrentYear": {
                                            "val": "97.552"
                                        },
                                        "BudgetYearOne": {
                                            "val": "287.49"
                                        },
                                        "BudgetYearOneBase": {
                                            "val": "287.49"
                                        },
                                        "BudgetYearTwo": {
                                            "val": "465.78"
                                        },
                                        "BudgetYearThree": {
                                            "val": "570.391"
                                        },
                                        "BudgetYearFour": {
                                            "val": "544.979"
                                        },
                                        "BudgetYearFive": {
                                            "val": "500.041"
                                        },
                                        "CostToComplete": {
                                            "val": "Continuing"
                                        },
                                        "TotalCost": {
                                            "val": "Continuing"
                                        }
                                    }
                                }
                            ]
                        },
                        "OtherProgramFundingSummaryRemarks": {
                            "val": "FY 2019 OCO funding in GA00700 and GZ2400, supports the procurement of Non-Development Item (NDI) Active Protection System (APS) for installation onto Abrams and Bradley."
                        },
                        "AcquisitionStrategy": {
                            "val": "The Active Protection System Project (XU9) is a continuation of efforts previously executed under PE 0203735A - Combat Vehicle Improvement Programs.\n\nThe Active Protection System (APS) installation and characterization effort will evaluate platform (Abrams, Bradley, Stryker) performance with an Non-Developmental Item (NDI) APS solution installed.  Platform performance evaluation includes APS sensor assessments, minimum live threat characterization, surface danger zone characterization, co-site mitigation (antennas\/radiators), electromagnetic interference assessment\/characterization, energetic radiation assessment, and a durability assessment.  The NDI APS installation and characterization is being executed through a partnership between the US Army, NDI APS solution vendors, and prime contractors for Abrams, Bradley, and Stryker vehicles.  NDI APS vendor support, to include procurement of demonstration hardware, is contracted on a Firm-Fixed Price (FFP) basis, while platform prime contractor technical support is provided on a Cost Plus Fixed-Fee (CPFF) basis.  The results from the installation and characterization effort will inform FY18 decisions to pursue the additional prototyping and testing necessary to obtain Urgent Materiel Releases (UMR) for NDI APS systems."
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    },
                    "R3Exhibit": {
                        "CostCategoryGroupList": {
                            "CostCategoryGroup": [
                                {
                                    "Name": {
                                        "val": "Product Development"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Active Protection System (APS) Installation Kit Development and Prototype Build - Abrams"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army TARDEC; Rafael Advanced Defense Systems; General Dynamics Land Systems (GDLS)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "23.881"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "23.881"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Active Protection System (APS) Installation Kit Development and Prototype Build - Bradley"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army TARDEC; Israeli Military Industries (IMI); BAE Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "28.948"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.4"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.4"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "33.348"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Active Protection System (APS) Installation Kit Development and Prototype Build - Stryker"
                                                },
                                                "ContractMethod": {
                                                    "val": "SS"
                                                },
                                                "ContractType": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivity": {
                                                    "val": "US Army TARDEC; Artis, LLC.; General Dynamics Land Systems (GDLS)"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "5.183"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "4.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "4.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "9.283"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Support"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Program Management Office (PMO) Support"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "PEO Ground Combat Systems"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Warren, MI"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "3.223"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-10"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "2.6"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "2.6"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-10"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "5.823"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                },
                                {
                                    "Name": {
                                        "val": "Test and Evaluation"
                                    },
                                    "CostCategoryItemList": {
                                        "CostCategoryItem": [
                                            {
                                                "Name": {
                                                    "val": "Government Testing - Abrams Active Protection System (APS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Army Test Centers"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.464"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2017-11"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "11.464"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Testing - Stryker Active Protection System (APS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Army Test Centers"
                                                },
                                                "Cost": {
                                                    "CurrentYear": {
                                                        "Amount": {
                                                            "val": "11.101"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2018-01"
                                                        }
                                                    },
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "11.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "11.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "22.201"
                                                    }
                                                }
                                            },
                                            {
                                                "Name": {
                                                    "val": "Government Testing - Bradley Active Protection System (APS)"
                                                },
                                                "FundingVehicle": {
                                                    "val": "MIPR"
                                                },
                                                "PerformingActivity": {
                                                    "val": "Various"
                                                },
                                                "PerformingActivityLocation": {
                                                    "val": "Army Test Centers"
                                                },
                                                "Cost": {
                                                    "BudgetYearOne": {
                                                        "Amount": {
                                                            "val": "20.1"
                                                        }
                                                    },
                                                    "BudgetYearOneBase": {
                                                        "Amount": {
                                                            "val": "20.1"
                                                        },
                                                        "AwardDate": {
                                                            "val": "2019-01"
                                                        }
                                                    },
                                                    "CostToComplete": {
                                                        "val": "0.000"
                                                    },
                                                    "TotalCost": {
                                                        "val": "20.100"
                                                    }
                                                }
                                            }
                                        ]
                                    }
                                }
                            ]
                        }
                    },
                    "R4Exhibit": {
                        "ScheduleProfile": [
                            {
                                "ImageFileName": {
                                    "val": "20180202_0_260714_XU9.png"
                                }
                            },
                            {
                                "ImageFileName": {
                                    "val": "20180202_1_260714_XU9.png"
                                }
                            }
                        ]
                    },
                    "R4aExhibit": {
                        "ScheduleDetailList": {
                            "ScheduleDetail": [
                                {
                                    "EventTitle": {
                                        "val": "Abrams APS Demonstrator Design and Install"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Abrams APS Characterization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Abrams APS Decision Point (DP) 1 (Production)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Abrams APS Installation Kit (IK) Refinement, Prototype Build, & Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Abrams APS Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "1"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bradley APS Demonstrator Design and Install"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bradley APS Characterization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bradley APS Decision Point (DP) 1 (Production)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bradley APS Installation Kit (IK) Refinement, Prototype Build, &Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Bradley APS Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2020"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Stryker APS Demonstrator Design and Install"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2016"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Stryker APS Characterization"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "4"
                                            },
                                            "Year": {
                                                "val": "2017"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Stryker APS Decision Point (DP) 1 (Production)"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Stryker APS Installation Kit (IK) Refinement, Prototype Build, & Test"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2018"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                },
                                {
                                    "EventTitle": {
                                        "val": "Stryker APS Production"
                                    },
                                    "Schedule": {
                                        "Start": {
                                            "Quarter": {
                                                "val": "2"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        },
                                        "End": {
                                            "Quarter": {
                                                "val": "3"
                                            },
                                            "Year": {
                                                "val": "2019"
                                            }
                                        }
                                    }
                                }
                            ]
                        }
                    }
                }
            ]
        }
    }
}