{
    "id": "2019-Army-PB-2040-JBOOK-23c6aee190fce0a8d0d998f778759a84066ef4463a8fe80c78fa11d9b9c06778-13",
    "meta": {
        "filename": "2019-BASE_RDTE-2019-ARMY_BA2-U_RDTE_JustificationBook_Army_PB_2019.zzz_unzipped-U_RDTE_JustificationBook_Army_PB_2019.xml",
        "doctype": "2019-BASE_RDTE-JUSTIFICATIONBOOK",
        "budget_year": "2019",
        "budget_cycle": "PB",
        "submission_date": "2018-02",
        "service_agency_name": "Army",
        "appropriation_code": "2040",
        "appropriation_name": "Research, Development, Test & Evaluation, Army"
    },
    "record": {
        "@monetaryUnit": "Millions",
        "ProgramElementNumber": {
            "val": "0602624A"
        },
        "ProgramElementTitle": {
            "val": "Weapons and Munitions Technology"
        },
        "R1LineNumber": {
            "val": "18"
        },
        "BudgetYear": {
            "val": "2019"
        },
        "BudgetCycle": {
            "val": "PB"
        },
        "SubmissionDate": {
            "val": "2018-02"
        },
        "ServiceAgencyName": {
            "val": "Army"
        },
        "AppropriationCode": {
            "val": "2040"
        },
        "AppropriationName": {
            "val": "Research, Development, Test & Evaluation, Army"
        },
        "BudgetActivityNumber": {
            "val": "2"
        },
        "BudgetActivityTitle": {
            "val": "Applied Research"
        },
        "ProgramElementFunding": {
            "PriorYear": {
                "val": "118.068"
            },
            "CurrentYear": {
                "val": "41.455"
            },
            "BudgetYearOne": {
                "val": "40.444"
            },
            "BudgetYearOneBase": {
                "val": "40.444"
            },
            "BudgetYearTwo": {
                "val": "46.783"
            },
            "BudgetYearThree": {
                "val": "43.044"
            },
            "BudgetYearFour": {
                "val": "62.028"
            },
            "BudgetYearFive": {
                "val": "63.269"
            },
            "CostToComplete": {
                "val": "0.000"
            },
            "TotalCost": {
                "val": "415.091"
            }
        },
        "ProgramElementMissionDescription": {
            "val": "This Program Element (PE) investigates, designs and evaluates enabling technologies to develop lethal weapons and munitions with increased performance and the potential for lower weight, reduced size, and improved affordability. Project H18 focuses on weapons and munitions development. Project H19 researches technologies to maintain and enhance weapons lethality. Project H28 evaluates munition components such as fuzes, power, warheads with tailorable effects, and munition compliant energetic materials.\n \nWork in this PE is related to, and fully coordinated with, PE 0602303A (Missile Technology), PE 0602105A (Materials Technology), PE 0602618A (Ballistics Technology), PE 0602772A (Advanced Tactical Computer Science and Sensor Technology), PE 0602782A (Command, Control, Communications Technology), and PE 0603004A (Weapons and Munitions Advanced Technology).\n\nThe cited work is consistent with the Lethality Portfolio and the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy.\n\nThe work in this PE is performed by the Army Research, Development and Engineering Command (RDECOM)."
        },
        "ChangeSummary": {
            "PreviousPresidentBudget": {
                "PriorYear": {
                    "val": "53.581"
                },
                "CurrentYear": {
                    "val": "41.455"
                },
                "BudgetYearOne": {
                    "val": "48.825"
                },
                "BudgetYearOneBase": {
                    "val": "48.825"
                }
            },
            "CurrentPresidentBudget": {
                "PriorYear": {
                    "val": "118.068"
                },
                "CurrentYear": {
                    "val": "41.455"
                },
                "BudgetYearOne": {
                    "val": "40.444"
                },
                "BudgetYearOneBase": {
                    "val": "40.444"
                }
            },
            "TotalAdjustments": {
                "PriorYear": {
                    "val": "64.487"
                },
                "CurrentYear": {
                    "val": "0"
                },
                "BudgetYearOne": {
                    "val": "-8.381"
                },
                "BudgetYearOneBase": {
                    "val": "-8.381"
                }
            },
            "AdjustmentDetails": {
                "CongressionalAdds": {
                    "PriorYear": {
                        "val": "66.5"
                    }
                },
                "SBIRSTTRTransfer": {
                    "PriorYear": {
                        "val": "-1.988"
                    }
                },
                "OtherAdjustmentDetailList": {
                    "OtherAdjustmentDetail": [
                        {
                            "Title": {
                                "val": "Adjustments to Budget Years"
                            },
                            "Funding": {
                                "BudgetYearOne": {
                                    "val": "-8.381"
                                },
                                "BudgetYearOneBase": {
                                    "val": "-8.381"
                                }
                            }
                        },
                        {
                            "Title": {
                                "val": "FFRDC"
                            },
                            "Funding": {
                                "PriorYear": {
                                    "val": "-0.025"
                                }
                            }
                        }
                    ]
                }
            },
            "SummaryExplanation": {
                "val": "Congressional increase in H1A Weapons & Munitions Tech Program Initiative; funding decreased in this PE to address higher priority Army Modernization efforts in the area of Long Range Precision Fires."
            }
        },
        "ProjectList": {
            "Project": [
                {
                    "ProjectNumber": {
                        "val": "H18"
                    },
                    "ProjectTitle": {
                        "val": "Weapons & Munitions Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "20.936"
                        },
                        "CurrentYear": {
                            "val": "21.455"
                        },
                        "BudgetYearOne": {
                            "val": "18.243"
                        },
                        "BudgetYearOneBase": {
                            "val": "18.243"
                        },
                        "BudgetYearTwo": {
                            "val": "20.91"
                        },
                        "BudgetYearThree": {
                            "val": "14.661"
                        },
                        "BudgetYearFour": {
                            "val": "16.972"
                        },
                        "BudgetYearFive": {
                            "val": "17.312"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "130.489"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs, investigates, and evaluates component technologies to enable affordable precision munitions as well as provide increased lethality and performance with reduced logistics and advanced direct\/indirect fire capabilities for Soldier, ground vehicle and aviation platforms. \n\nEfforts in this Project support the Army Science and Technology Lethality Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy"
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Propulsion Technology for the Future"
                                    },
                                    "Description": {
                                        "val": "This effort explores propellant technologies such as powder coextrusion and grain coatings, while retaining insensitive properties, for employment in gun launch environments as well as directional thrusters including those that deliver a broad spectrum of effects. It also conducts experiments with these propellants to increase the range of artillery and mortar rocket assisted projectiles."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "3.213"
                                            },
                                            "Text": {
                                                "val": "Evaluate novel and innovative gun propellant materials for the implementation of three-dimensional (3D) printed charge development; develop next generation charge concepts and prototypes using 3D printing technology for medium caliber up to large caliber charges for tank, artillery and mortar systems; develop engineering tools to design and model 3D printed charges using the novel materials and novel charge concepts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.429"
                                            },
                                            "Text": {
                                                "val": "Optimize formulation and design electrode configurations for electrically controlled energetic materials (ECEM) which could enable extended range and improve precision and temperature compensation; design and develop igniter materials and characterize interaction between coated propellant grains and ignition system in development of a temperature invariant propulsion system; conduct experiments to transform feed stock propellant formulations into spheroidal geometries using advanced processing techniques; mature the die design and formulation developed organically for co-extrusion processing; mature novel propellant formulations and validate models and experiments while investigating increased propellant masses for use in co-developed foam celluloid combustible case; continue to investigate, research, and mature new rocket motor formulations for use in emerging rocket assisted projectiles to determine potential range increases."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.921"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.921"
                                            },
                                            "Text": {
                                                "val": "Will investigate alternative processing methods amenable to achieving high-energy formulations in spheroidal and\/or pancake geometries in conjunction with development of high-energy propellant formulations; will investigate processing methods, material synthesis and formulation to support development of encapsulated propellant, which could result in improved stability\/sensitivity and combustion profiles without sacrificing combustion performance; will validate the optimized electrode configuration and formulation for electrically controlled energetic materials (ECEM)."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to propellant design formulations completed and available for processing and synthesis validation."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Weapons Technology"
                                    },
                                    "Description": {
                                        "val": "This effort investigates innovative weapon technologies such as recoil energy mitigation, affordable precision, extended range\/guided technologies, and advanced propellant for future medium caliber direct fire systems that could provide similar or greater lethality than current systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.42"
                                            },
                                            "Text": {
                                                "val": "Investigate novel weapon technologies that provide lethality improvements in confined, complex, constrained environments; investigate aviation armament technologies that support lighter, more lethal armaments for the family of rotary wing aircrafts."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.824"
                                            },
                                            "Text": {
                                                "val": "Investigate novel weapon technologies that will allow for heat check techniques of cracks in explosives; conduct experiments to develop cold spray deposition processes for erosion resistant metal coatings."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Affordable Precision Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that provide affordable precision capabilities for projectiles fired into Global Positioning System (GPS) denied environments."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.809"
                                            },
                                            "Text": {
                                                "val": "Validate the algorithm development for the imager based terminal guidance concepts through extensive modeling and simulation efforts; conduct experiments in order to verify the survivability and maturity of the candidate imager technologies in a high G environment."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "3.015"
                                            },
                                            "Text": {
                                                "val": "Characterize thoroughly the image navigation component and subsystem technologies across the operational conditions in order to ensure a robust Technology Readiness Level 5 (TRL-5) is achieved for all of the enabling subsystems; a new low Size, Weight, and Power (SWaP) Tactical Grade Gun Hardened Inertial Measurement Unit (IMU) will be demonstrated to a TRL-5."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "2.652"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "2.652"
                                            },
                                            "Text": {
                                                "val": "Will investigate the optimal architecture for an Automatic Target Recognition (ATR) capable Precision Guided Munition (PGM); will include initial system trade studies, modeling of various seeker types on candidate indirect fire platform systems and experimental assessments of high risk critical components."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to project completing the phase of component technologies characterization."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Extended Range Indirect Fire Weapon Technology"
                                    },
                                    "Description": {
                                        "val": "This effort initially investigates and determines the viability of candidate extended range indirect fire weapon technologies that facilitate light weight armaments with launch velocities resulting in ranges of 70km and beyond with emerging ammunition. Technologies will be applied at the system and sub-system level to address technology gaps."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.809"
                                            },
                                            "Text": {
                                                "val": "Mature and integrate extended range armament component technologies further; continue to validate technology concepts in an integrated environment to assess impacts to current systems; determine technologies that provide weight reduction potential while supporting increased velocities needed for ranges beyond the current capability of self-propelled artillery (M109A7) howitzer."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.783"
                                            },
                                            "Text": {
                                                "val": "Continue to mature extended range indirect fire component technologies and conduct integrated experiments to validate technologies for use with the M109A7 howitzer system to determine system impacts of the extended range capability as well as investigate the application of these technologies to other indirect fire systems such as the M777A2 and M119A3."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Applied Research phase completed."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Force Protection Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort accelerates the development of disruptive technologies that enable transformational protection capabilities for vital assets, forces and civilian populations, increasing safety, decreasing collateral damage and minimizing fratricide."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.472"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop armament technologies capable of providing non-kinetic, High-Powered \/Radio Frequency Directed Energy, lethal effects against Unmanned Aerial systems, precision Rocket, Artillery, Mortar and other potential threats."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Long Range Gun Technology Development"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and develops candidate extended range artillery weapon system and projectile technologies that increase the range up to 2x with increased precision. Resulting component technologies will be evaluated and matured in the fully coordinated effort of the same name in PE\/Project 0603004A\/232."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.317"
                                            },
                                            "Text": {
                                                "val": "This effort is being conducted in concert with the Extended Range Indirect Fire Weapon Technology effort; determine weight reduction of common 155mm armament concepts integrated with advanced micro-common fire control concepts to achieve extended range for demonstration mentioned in PE\/Project 0603004A\/232; validate post launch propulsion methods for next generation extended range munitions and determines range extension gains achieved by post launch lifting surfaces."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "This effort is conducted in concert with the Extended Range Indirect Fire Weapon Technology effort to determine weight reduction of common 155mm armament concepts integrated with advanced micro-common fire control concepts to achieve extended range for demonstration mentioned in PE\/Project 0603004A\/232; validates post launch propulsion methods for next generation extended range munitions and determine range extension gains that could be achieved by new designs of post launch projectile lifting surfaces."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completed the Applied Research phase."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Fuze and Power Technologies for Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort investigates and designs innovative fuze and power technologies for enhanced environment and target sensing\/classification, warhead initiation schemes and advanced fuze setting to provide enhanced lethality combined effects on targets and advanced initiation schemes for the next generation munitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.896"
                                            },
                                            "Text": {
                                                "val": "Continue to design and develop robust airburst fuze technology concepts for increased accuracy in multi-purpose rounds; mature micro-scale sensor components and devices for enhanced environment sensing and for arming and warhead initiation in which all the energetic components are both in and out-of-line; validate alternative fuze setting methodologies to more efficiently transfer and store power and data to smart indirect fire projectiles; mature multi-point initiation components applicable to Insensitive Munitions; validate innovative munitions power source technologies for medium and large caliber munitions. These technologies will continue to support the Joint Munitions Program Technical Coordinating Group (TCG ? 5 and TCG-10) and the JFTP."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.08"
                                            },
                                            "Text": {
                                                "val": "Continue to mature advanced sensor components and devices; mature advanced initiation systems applicable to insensitive munitions; mature and validate advanced power technologies for medium and large caliber munitions; and mature airburst fuzing technologies for reduced range error in medium caliber fuzing. These technologies continue to support the Joint Munitions Program TCG ? 5 and TCG-10 and the JFTP."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.054"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.054"
                                            },
                                            "Text": {
                                                "val": "Will advance the capability of state of the art in fuze proximity sensors to track targets in order to improve burst point accuracy and countermeasure robustness; will maximize usage of all real time battlefield targeting data and integrate with fuze setters, fuze sensors, power sources, component protective technologies and unique fuze ignition schemes to design and develop extremely reliable and versatile fuzes; will investigate these new fuze designs to support hypersonics, autonomous fuzing for varied targets as well as Counter-Unmanned Aerial Systems. These technologies will continue to leverage the OSD Joint Munitions Program TCG - 5 and TCG-10 and the OSD Joint Fuze Technology Program."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to maturation of sensor components and airburst technologies."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Cluster Munitions Replacement Acceleration"
                                    },
                                    "Description": {
                                        "val": "This effort will design and develop the critical components that will aid in the maturation of a materiel solution designed to replace 155mm dual purpose improved conventional munition (DPICM) artillery. The components will include the design, development and component testing of fuzing, warhead and stabilization technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "6"
                                            },
                                            "Text": {
                                                "val": "Effort investigates high reliability DPICM technologies, design and develop high reliability fuzing architectures in a small, self-contained form factor; assign component space allocation including investigation of fuze component level technologies, stabilizer design and development and mature warheads. Continue to develop advanced unitary warhead designs and to further design and establish warhead initiation requirements and compatibility with existing artillery fuze designs. Develop and mature critical components leveraging lessons learned from prior cluster munition replacement component testing."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "7"
                                            },
                                            "Text": {
                                                "val": "Investigate and mature fuze initiation train design; research and develop novel designs of arming, warhead and stabilization architectures; conduct lab experiments for critical components to validate reliability and functionality claims; fund research looking at the effectiveness of materiel solutions for various concepts."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.05"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.05"
                                            },
                                            "Text": {
                                                "val": "This effort will begin to validate the tactical designs for all concepts, and will investigate incorporating additional features into the design of critical components; will improve insensitive munitions (IM) performance as well as investigate and determine what other technologies could be incorporated into the materiel solutions as a potential improvements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease is due to cluster munition replacement technology transitioning from Applied Research to Advanced Demonstration in FY19."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Programmable Intelligent Collaborative Engagement Munition"
                                    },
                                    "Description": {
                                        "val": "This effort develops, matures and integrates a gun hardened suite of components (software, sensors, navigation and communications) that enable the application of distributed, cooperative and collaborative tactics for munitions."
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "0.824"
                                            },
                                            "Text": {
                                                "val": "Develop collaborative algorithms, which will include a set of tools like target assignment based on probability of kill scoring, target assignment with must hit priority where total probability of kill priority is applied after must hit criteria are achieved, and 3D pattern goals with arrival time objectives."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will design and develop hardware and mature algorithms and concepts validated in the prior year to a breadboard state; will utilize hardware and software in the loop testbed to validate collaboration across multiple munitions in flight."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase is due to the efforts needed for the building of hardware and generation of algorithms to demonstrate munition collaboration capability."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Rotorcraft Armaments Protection System"
                                    },
                                    "Description": {
                                        "val": "The Advanced Rotorcraft Armament and Protection System (ARAPS) effort designs and develops Future Vertical Lift (FVL) technologies for lightweight armament systems and multi-role munitions with enhanced lethality at extended ranges.  The effort investigates and determines the feasibility of a holistic fire control system that integrates all aspects of offensive and defensive capabilities for advanced protection and enhanced survivability."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.566"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.566"
                                            },
                                            "Text": {
                                                "val": "Will investigate integrated armament and advanced protection designs for Future Vertical Lift (FVL) offensive and defensive applications; will design critical component technologies in order to develop advanced lethality and survivability capabilities in fire control, weapon systems, munitions and countermeasures; will investigate system architecture solutions for an integrated armament and advanced protection system."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "First year of effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Radio Frequency Guided Munition"
                                    },
                                    "Description": {
                                        "val": "This effort investigates technologies that provide a Radio Frequency (RF) seeking capability for gun-launched projectiles to enable engagement of RF emitting sources and similar targets of interest."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "1.5"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "1.5"
                                            },
                                            "Text": {
                                                "val": "Will investigate RF seeker component technologies with a focus on projectile payload performance, size, weight, power, and gun launch survivability; will perform systems engineering and detailed performance analyses to determine the trade space when integrating these RF seeker technologies in gun-launched environments."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "First year of effort."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "ARCHER"
                                    },
                                    "Description": {
                                        "val": "This effort designs and develops advanced fire control algorithms and a multirole warhead guided projectile for area defense against medium (Groups 2 and 3) sized unmanned aerial systems (UAS) and aerial rotary wing platforms, point defense against rocket propelled grenades (RPGs), anti-tank guided missiles (ATGMs), and rocket, artillery, and mortars threats as well as precision fires against dismounts in defilade."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3"
                                            },
                                            "Text": {
                                                "val": "Will investigate and mature command guided, medium caliber projectile designs on a tactical turret platform; will research and develop novel warhead and projectile stabilization architectures; will conduct lab experiments to mature designs of projectile critical components; will validate reliability, functionality and performance of various projectile component technologies; will research the target defeat effectiveness of material solutions for various concepts and develop algorithms based on armament system requirements."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "First year of effort."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H19"
                    },
                    "ProjectTitle": {
                        "val": "Asymmetric & Counter Measure Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "14.35"
                        },
                        "CurrentYear": {
                            "val": "5.353"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "11.769"
                        },
                        "BudgetYearFive": {
                            "val": "12.005"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "43.477"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project designs and develops technologies to support asymmetric countermeasures such as efforts to maintain the lethality and overmatch of United States (US) weapons against current and future threat systems. Work in this Project is related to, and fully coordinated with, efforts in Projects H18 and H28 (also in Program Element (PE) 0602624A), PE 0602618A (Ballistics Technology), and projects 232 and L94 in PE 0603004A (Weapons and Munitions Advanced Technology).\n\nEfforts in this Project support the Army Science and Technology Lethality Portfolio.   \n \nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Novel Battlefield Effectors"
                                    },
                                    "Description": {
                                        "val": "This effort investigates unique weapon and munitions enabling technologies to achieve tunable effects on targets and that are capable of providing a full range of effects from non-lethal to highly lethal via a single weapon or munition."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.268"
                                            },
                                            "Text": {
                                                "val": "Investigate novel technologies capable of improving ammunition development and demilitarization throughout the life cycle; provide counter-countermeasure technologies for advanced development; explore the use of disruptive technologies that can be applied to current and future munitions and armament systems."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Counter-Countermeasure (CCM) Technologies for Weapons and Munitions"
                                    },
                                    "Description": {
                                        "val": "This effort investigates guidance signal reduction, inertial measurement unit, and antenna design technologies to enable continued effectiveness of US weapon systems against enemy countermeasures including Active Protection Systems (APS), Global Positioning System (GPS) jamming, and active seeker jamming."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.407"
                                            },
                                            "Text": {
                                                "val": "Validate high power antenna array concept designs that offer size, weight, and power (SWaP) reduction; investigate scalability of novel technologies for various potential applications such as vehicle stopping, counter electronics and counter Unmanned Aeriel Systems (UAS); continue to design and develop innovative technologies for compact solid state high power radio frequency sources."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1.309"
                                            },
                                            "Text": {
                                                "val": "Mature technologies providing active counter-countermeasures against radio frequency (RF) threats; develop advanced materials for passive protection and structural enhancements; conduct designs of experiments to isolate key variables for design enhancements; integrate technologies for performance characterization against simulated threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Decrease due to realignment of funding in support of the Accelerated Extended Range Artillery Munition Suite effort (PE 0603004A\/Project 232)"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Enhanced Fire Control for Indirect Fires"
                                    },
                                    "Description": {
                                        "val": "This effort evaluates the applicability and integration of state-of-the-art acquisition and engagement technologies for data and image processing, weapon orientation sensors and methodologies to enhance fire control capability, and therefore weapon effectiveness, at various ranges and under battlefield conditions. Investigates components and architectures that will reduce size, weight, power and cost (SWaP-C), and increase commonality and operation across direct and indirect fire control systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.923"
                                            },
                                            "Text": {
                                                "val": "Further mature extended range tracking and miniaturization of components for use in GPS-denied environments as well as further mature navigation and pointing technologies\/compensation components; validate improved conventional munition accuracy and communication techniques for in-flight interface\/control with smart munitions."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.044"
                                            },
                                            "Text": {
                                                "val": "Mature extended range tracking, in flight communications and miniaturization of components for use in Global Positioning System (GPS)-denied environments as well as navigation and pointing technologies\/compensation components; validate improved conventional munition accuracy and develop common graphical user interfaces for fire control systems to allow for cross platform use and enable multi-role functionality."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High Powered Radio Frequency"
                                    },
                                    "Description": {
                                        "val": "This effort in High Power RF technology focuses on addressing the SWaP-C of High Power RF systems and their components so as to allow tactically useful systems."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.925"
                                            },
                                            "Text": {
                                                "val": "Validate antenna array at high power and prove SWaP reduction; investigate scalability of nano-dielectric technology to alternate frequency ranges for various potential applications such as vehicle stopping, counter electronics, counter UAS, etc.; continue design and development of innovative technologies for compact solid state high power radio frequency sources, leveraging advances in gallium nitride switches, nano-dielectrics, and\/or efficient transistors."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Terrain Shaping Munition Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops an improved munition capability, remote delivery, and man-in-the-loop control technologies that will allow the warfighter to maintain dominance in the battlefield by denying adversaries access to an area of operations."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "1.923"
                                            },
                                            "Text": {
                                                "val": "Investigate and develop new methods for generation of very high voltages via chemical, capacitive and explosive means, production of pulse\/waveform against targets, and delivery of energies into targets by direct injection or remotely."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2"
                                            },
                                            "Text": {
                                                "val": "Validate munition architectures across delivery ranges against safety, reliability, and performance requirements; conduct experiments of large area coverage anti-personnel effects; investigate and confirm design with use of new dielectric and de-poling materials and conduct experimentations to validate different configurations and field layouts capable of handling high voltages in very compact form factor; collect validation data for effects study to identify output requirement and design tuning; conduct study on delivery mechanisms; and provide data for improving performances."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Small Arms Fire Control"
                                    },
                                    "Description": {
                                        "val": "This effort focuses on providing the soldier a set of small arms capabilities to increase the accuracy at extended ranges, probability of hit, improve time of engagement, and enhance situational awareness. By achieving these objectives, the soldier will be able to improve their operational effectiveness in reduced time."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "4.039"
                                            },
                                            "Text": {
                                                "val": "Investigate technologies to increase probability of hit, including ballistic corrections for advanced sensor data including down-range wind sensing, target tracking and handoff at the individual-weapon platform, and moving target aim correction."
                                            }
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Indirect Fire Aiming Techniques"
                                    },
                                    "Description": {
                                        "val": "This effort supports future integrated aiming technologies for indirect fires with enhanced capabilities and a simplified user interface while reducing size, weight and power."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "0.865"
                                            },
                                            "Text": {
                                                "val": "Investigate various innovative technologies to provide high fidelity location and orientation coordinates for use in indirect-fire applications; analyze technologies that can both provide these capabilities and reduce size, weight and power consumption for the next generation of fire control systems."
                                            }
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H1A"
                    },
                    "ProjectTitle": {
                        "val": "WEAPONS & MUNITIONS TECH PROGRAM INITIATIVE"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "66.5"
                        },
                        "CurrentYear": {
                            "val": "0"
                        },
                        "BudgetYearOne": {
                            "val": "0"
                        },
                        "BudgetYearOneBase": {
                            "val": "0"
                        },
                        "BudgetYearTwo": {
                            "val": "0"
                        },
                        "BudgetYearThree": {
                            "val": "0"
                        },
                        "BudgetYearFour": {
                            "val": "0"
                        },
                        "BudgetYearFive": {
                            "val": "0"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "66.500"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectNote": {
                            "val": "Congressional increases for Program increase ($18M); High-speed vehicle mounted fire detection technology ($5M); Railgun weapon technology ($20M); Medium caliber lightweight composite barrel technology ($5M); Guided tank fired round development for high mobility targets ($8.5M); Armament systems concepts ($5M); Hybrid projectile technology ($5M)"
                        },
                        "ProjectMissionDescription": {
                            "val": "Congressional Interest Item funding for Weapons and Munitions Technology applied research."
                        },
                        "CongressionalAddDetailList": {
                            "CongressionalAddDetail": [
                                {
                                    "Title": {
                                        "val": "Program Increase"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "18"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "High-speed vehicle mounted fire detection technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Railgun weapon technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "20"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Medium caliber lightweight composite barrel technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Guided tank fired round development for high mobility targets"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "8.5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Armament systems concepts"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "hybrid projectile technology"
                                    },
                                    "PriorYear": {
                                        "Funding": {
                                            "val": "5"
                                        },
                                        "Text": {
                                            "val": "N\/A"
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                },
                {
                    "ProjectNumber": {
                        "val": "H28"
                    },
                    "ProjectTitle": {
                        "val": "Warheads\/ Energetics Technologies"
                    },
                    "ProjectFunding": {
                        "PriorYear": {
                            "val": "16.282"
                        },
                        "CurrentYear": {
                            "val": "14.647"
                        },
                        "BudgetYearOne": {
                            "val": "22.201"
                        },
                        "BudgetYearOneBase": {
                            "val": "22.201"
                        },
                        "BudgetYearTwo": {
                            "val": "25.873"
                        },
                        "BudgetYearThree": {
                            "val": "28.383"
                        },
                        "BudgetYearFour": {
                            "val": "33.287"
                        },
                        "BudgetYearFive": {
                            "val": "33.952"
                        },
                        "CostToComplete": {
                            "val": "0.000"
                        },
                        "TotalCost": {
                            "val": "174.625"
                        }
                    },
                    "R2aExhibit": {
                        "ProjectMissionDescription": {
                            "val": "This Project investigates and designs enabling warhead and energetic technologies such as novel warhead architectures, new propellant techniques, and high-density explosives to produce smaller, lighter, more effective, multi-role warheads, flare and pyrotechnic countermeasures, and novel approaches for ammunition demilitarization and combat in complex environments.\n\nEfforts in this Project support the Army Science and Technology Lethality Portfolio.\n\nThe cited work is consistent with the Assistant Secretary of Defense for Research and Engineering Science and Technology priority focus areas and the Army Modernization Strategy."
                        },
                        "AccomplishmentPlannedProgramList": {
                            "AccomplishmentPlannedProgram": [
                                {
                                    "Title": {
                                        "val": "Scalable Warhead Technology"
                                    },
                                    "Description": {
                                        "val": "This effort designs scalable and adaptive explosives and reactive materials technology for either gun or missile-launched weapons and munitions that can deliver a broad spectrum of effects with reduced collateral damage. In addition, this effort will facilitate the design and development of improved area clearance technologies."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "5.771"
                                            },
                                            "Text": {
                                                "val": "Design and test brass board designs for shaped charge, EFP and blast fragmentation with targeted lethality; determine tunable\/tailorable effects for adaptable warheads through modeling and simulation. After successful testing at the component level, apply designs to warhead subsystem for validation. In addition, investigate novel concepts of area clearance capabilities with focus on the advancement of new warheads, line charge materials and fills while reducing collateral damage and maintaining or increasing effectiveness on target."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "5.25"
                                            },
                                            "Text": {
                                                "val": "Mature warheads to higher levels of technology readiness through the iterative design and development process and validate previous work in modeling and simulation. Among these are novel designs that can enable multi-role munitions (e.g. Counter Rocket, Artillery, and Mortar, Counter Unmanned Aircraft System) such as shaped charge (SC) and multi explosively formed penetrators (MEFP?s) developed to address emerging threats.  In addition, further designs in controlled and scalable blast fragmentation are pursued to concentrate lethality while reducing collateral damage. Continue the design process to provide lethality solutions to cluster munition replacements as well as continue maturing novel area clearance concepts; validate component technologies in a relevant environment."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "6.001"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "6.001"
                                            },
                                            "Text": {
                                                "val": "Will mature and down select various warhead components (mini SC liners, mini EFPs and multi-EFPs) for insertion into follow-on 6.3 efforts; validate effectiveness of selected concepts against simulated and actual threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to maturation of technologies for mini shaped charge liners, mini-explosively formed penetrators, and multi-explosively formed penetrators."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Energetics (formerly named Explosives Research)"
                                    },
                                    "Description": {
                                        "val": "This effort develops advanced energetic materials and novel processing techniques for future explosives and propulsion applications that enable an increase in range, lethality, and utility of ammunitions."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "7.526"
                                            },
                                            "Text": {
                                                "val": "Investigate synthesis and formulation of advanced energetic materials for low sensitivity and higher performance applications; advance and develop the use of meso-scale reactive flow models to further understand energetics performance as well as energetics sensitivity as it relates to initiation behavior to unplanned stimuli; research materials and processes to enable energetic inks and energetic powder deposition for application to additive three-dimensional (3D) printed energetic parts and devices; investigate the advancement of developing novel nano-energetic formulations to provide substantially less shock sensitivity than current formulations; research synthesis and processing of new materials using novel techniques such as Advanced Flow Reactors (AFR) technology for processing energetic materials in a timely, safe and efficient manner; further research and validate tailored energy release technology for demonstration of electrical on\/off energetic capabilities and chemistry-based variable warhead fragmentation; investigate unique disruptive and scalable technologies in collaboration with ARL."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "6.349"
                                            },
                                            "Text": {
                                                "val": "Conduct research to investigate a new class of energetic materials, amorphous energetics, capable of on-demand activation for improved sensitivity and performance; investigate the synthesis of energetic materials tailored to additive manufacturing applications; design explosives charges with integrated electronics; model next-generation gun-propulsion charge design concepts achievable as a result of additive manufacturing capabilities; conduct research with advanced processing methods to synthesize energetic materials in safer, more efficient and environmentally-conscious manners."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "8.338"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "8.338"
                                            },
                                            "Text": {
                                                "val": "Will mature technologies focused in nano-energetics designs for use in melt-cast formulations; will mature the polymer kinetics for amorphous energetics; will investigate next-generation melt-cast and cast-cure ingredients for higher energy formulations; will investigate reaction kinetics for ingredient synthesis applicable to advanced flow reactors; will design and develop processing parameters necessary to produce energetic materials for additive manufacturing; will develop novel modeling and simulation tools required to accurately predict energetic materials performance in novel and unique geometries."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to research into advanced nano energetics and mature new formulations for the next generation energetics."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Tunable Pyrotechnics"
                                    },
                                    "Description": {
                                        "val": "This effort develops smoke and flare countermeasure for passive protection for ground and air combat platforms, and hand held signals for illumination and signaling. These capabilities will increase warfighter and aircraft survivability."
                                    },
                                    "Accomplishment": {
                                        "PriorYear": {
                                            "Funding": {
                                                "val": "2.985"
                                            },
                                            "Text": {
                                                "val": "Finalize formulation and prototype design for dazzler CM for night time solution; perform M & S studies to evaluate if requirements can be met; produce scaled-up quantities for cloud countermeasure for two different flare formulations; conduct flight tests and evaluate effectiveness; transition cloud CM to Engineering Manufacturing Development (EMD) phase; down select from initial formulations of advanced seeker counter-measures (ASCM) and design prototypes for further maturation and demonstration."
                                            }
                                        }
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "2.048"
                                            },
                                            "Text": {
                                                "val": "Integrate and test designs for dazzler Counter Measure (CM) for both night time and day time solutions; refine M&S for reliability to evaluate if requirements can be met; produce scaled-up quantities for cloud countermeasure for down selected flare formulations; investigate and verify effectiveness of formulations; mature formulations of ASCM to obtain effectiveness data; validate cloud CM to Technology Readiness Level 5 (TRL-5)."
                                            }
                                        },
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "3.721"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "3.721"
                                            },
                                            "Text": {
                                                "val": "Will develop an integrated solution for the Dazzler Counter Measure to include new pyrotechnic formulations; will develop and modify ASCM formulations based on static and functional tests to assess viability of technology candidates; will investigate new countermeasure designs in the electromagnetic (EM) spectrum to address emerging threats."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Increase due to maturation of complex pyrotechnic formulations to address future threat."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Novel Demilitarization Technologies"
                                    },
                                    "Description": {
                                        "val": "This effort develops smoke and flare countermeasure for passive protection for ground and air combat platforms, and hand held signals for illumination and signaling. These capabilities will increase warfighter and aircraft survivability"
                                    },
                                    "PlannedProgram": {
                                        "CurrentYear": {
                                            "Funding": {
                                                "val": "1"
                                            },
                                            "Text": {
                                                "val": "Investigate contained release agents for weapons demilitarization; design demilitarization-ready ammunition using embedded agents that modify explosives on-demand and render munitions safe and unusable for military purposes."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort completed in FY18."
                                        }
                                    }
                                },
                                {
                                    "Title": {
                                        "val": "Advanced Warheads"
                                    },
                                    "Description": {
                                        "val": "This effort explores multiple pathways to enhance lethal efforts for future warheads against emerging peer\/near peer target sets. Investigates synergistic effects of novel micro warheads using advance materials."
                                    },
                                    "PlannedProgram": {
                                        "BudgetYearOne": {
                                            "Funding": {
                                                "val": "4.141"
                                            }
                                        },
                                        "BudgetYearOneBase": {
                                            "Funding": {
                                                "val": "4.141"
                                            },
                                            "Text": {
                                                "val": "Will characterize new family of materials for designs of novel micro warheads to achieve fragmentation, explosively formed penetrators (EFP) and shaped charge effects; will conduct parametric study to establish the performance and lethal effects of novel warhead designs."
                                            }
                                        },
                                        "AppChangeSummary": {
                                            "val": "Effort begins in FY19."
                                        }
                                    }
                                }
                            ]
                        },
                        "PerformanceMetrics": {
                            "val": "N\/A"
                        }
                    }
                }
            ]
        }
    }
}